<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Configurar um ambiente de desenvolvimento integrado para Python (Mac)</title>
  <slug>instalacao-mac</slug>
  <layout>lesson</layout>
  <date>2012-07-17</date>
  <translation_date>2021-05-13</translation_date>
  <authors>William J. Turkel,Adam Crymble</authors>
  <reviewers>Jim Clifford,Amanda Morton</reviewers>
  <editors>Miriam Posner</editors>
  <translator>Josir C. Gomes</translator>
  <translation-editor>Danielle Sanches</translation-editor>
  <translation-reviewer>Bruno Martins,Renato Rocha Souza</translation-reviewer>
  <difficulty>1</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/323</review-ticket>
  <activity>transforming</activity>
  <topics>get-ready,python</topics>
  <abstract>Esta li&#231;&#227;o ir&#225; auxiliar na configura&#231;&#227;o de um ambiente de desenvolvimento integrado para o Python num computador com o Sistema Operacional Mac.</abstract>
  <python_warning>False</python_warning>
  <original>mac-installation</original>
  <avatar_alt>Uma banda com tr&#234;s m&#250;sicos</avatar_alt>
  <doi>10.46430/phpt0005</doi>
</metadata>
  <text>
    <body>
      <div n="1"><head>Fa&#231;a um backup do seu computador</head>
<p>&#201; sempre importante garantir que voc&#234; tenha backups regulares e recentes do seu computador. Este &#233; um bom conselho que serve para a vida toda e n&#227;o se limita &#224; pratica espec&#237;fica de programa&#231;&#227;o. Usu&#225;rios do Mac podem recorrer ao <link target="http://support.apple.com/kb/ht1427">Time Machine</link> para isso.</p>
</div>
      <div n="1"><head>Instale o Python 3</head>
<p>Voc&#234; ainda pode ter o Python 2 na sua m&#225;quina. Como essa vers&#227;o do Python foi descontinuada no fim de 2019, &#233; importante que voc&#234; instale o Python 3. Fa&#231;a o download da vers&#227;o mais est&#225;vel da linguagem de programa&#231;&#227;o Python (Version 3.8 de Novembro de 2019) e instale o software a partir do <link target="https://www.python.org/downloads/mac-osx/">site do Python</link>.</p>
</div>
      <div n="1"><head>Crie um diret&#243;rio</head>
<p>Para que voc&#234; se organize, o ideal &#233; que voc&#234; tenha um diret&#243;rio (i.e., pasta) no seu computador onde voc&#234; ir&#225; armazenar os seus programas em Python (por exemplo, <code type="inline">programming-historian</code>). Crie esse diret&#243;rio em qualquer outra pasta do seu computador.</p>
</div>
      <div n="1"><head>Instale um editor de texto</head>
<p>Existem v&#225;rios editores de texto que voc&#234; pode utilizar para escrever, armazenar e executar comandos em Python. O Komodo Edit &#233; o utilizado nesta li&#231;&#227;o, correspondendo a um editor gratuito e de c&#243;digo aberto. Mas existem <link target="https://wiki.python.org/moin/PythonEditors/">outros editores</link> se voc&#234; preferir. Por exemplo, alguns dos nossos colaboradores preferem o programa <link target="https://www.barebones.com/products/bbedit/">BBEdit</link>. Voc&#234; pode escolher qual editor mas, para manter a consist&#234;ncia entre as li&#231;&#245;es, n&#243;s iremos utilizar o Komodo Edit. Voc&#234; pode fazer o download diretamente do <link target="https://www.activestate.com/products/komodo-ide/downloads/edit/">site do Komodo Edit</link>. Fa&#231;a a instala&#231;&#227;o a partir do ficheiro <code type="inline">.DMG</code></p>
<h3>Fa&#231;a um comando &#8220;Run Python&#8221; no Komodo Edit</h3>
<p>Deve agora configurar o editor para que seja poss&#237;vel executar programas em Python.</p>
<p>Se voc&#234; n&#227;o visualizar a barra de ferramentas (Toolbox) do lado direito, selecione a op&#231;&#227;o do menu <code type="inline">View -&gt; Tabs -&gt; Toolbox</code>. Na janela Toolbox, clique no &#237;cone da engrenagem e selecione &#8220;<code type="inline">New Command&#8230;</code>&#8221;. Uma nova janela de di&#225;logo ir&#225; abrir e voc&#234; deve renomear o seu comando para &#8220;<code type="inline">Run Python</code>&#8221;. Fique a vontade para alterar tamb&#233;m o &#237;cone. Na caixa &#8220;<code type="inline">Command</code>&#8221;, digite:</p>
<pre><code class="language-python" xml:id="code_instalacao-mac_0" type="block" corresp="code_instalacao-mac_0.txt"></code></pre>
<p>e na aba de op&#231;&#245;es avan&#231;adas, sob o texto "Start in," digite:</p>
<pre><code class="language-python" xml:id="code_instalacao-mac_1" type="block" corresp="code_instalacao-mac_1.txt"></code></pre>
<p>Cique no bot&#227;o OK e o seu novo comando "Run Python" deve aparecer no painel de ferramentas.</p>
</div>
      <div n="1"><head>Passo 2 &#8211; &#8220;Ol&#225; Mundo&#8221; em Python</head>
<p>&#201; uma tradi&#231;&#227;o para quem est&#225; come&#231;ando a programar em uma nova linguagem que o primeiro programa a ser constru&#237;do emita a frase "Ol&#225; Mundo". </p>
<p>O Python &#233; uma boa linguagem de programa&#231;&#227;o para iniciantes porque ela &#233; de alto-n&#237;vel.
Isto quer dizer que &#233; poss&#237;vel escrever pequenos programas que realizam muitas funcionalidades.
Quanto menor o programa, mais prov&#225;vel que ele caiba em apenas um ecr&#227;, e mais f&#225;cil ser&#225; manter o controle dele em sua mente.</p>
<p>O Python &#233; uma lingugagem 'interpretada'. Isto significa que existe um programa especial (conhecido como Interpretador) que sabe como seguir as instru&#231;&#245;es da linguagem. Uma forma de utilizar o interpretador &#233; guardar todas as instru&#231;&#245;es a executar em um ficheiro para, em seguida, solicitar ao interpretador que ele interprete o conte&#250;do desse ficheiro.  </p>
<p>Um ficheiro que cont&#233;m instru&#231;&#245;es de linguagem de programa&#231;&#227;o &#233; conhecido como um programa. O interpretador ir&#225; executar cada uma das instru&#231;&#245;es que voc&#234; incluiu no seu programa e no final ir&#225; parar. Vamos experimentar como isto funciona.</p>
<p>No seu editor de texto, crie um novo ficheiro, entre o seguinte programa de duas linhas, e salve-o na pasta <code type="inline">programming-historian</code>:</p>
<p><code type="inline">ola-mundo.py</code></p>
<pre><code class="language-python" xml:id="code_instalacao-mac_2" type="block" corresp="code_instalacao-mac_2.txt"></code></pre>
<p>O comando &#8220;<emph>Run Python</emph>&#8221; permite que voc&#234; execute o seu programa. Se voc&#234; escolheu um outro editor, este deve ter uma funcionalidade semelhante. Se est&#225; a usar o BBEdit, clique em &#8220;#!&#8221; e no bot&#227;o <emph>Run</emph>. Se tudo correu bem, o ecr&#227; dever&#225; mostrar algo como apresentado de seguida:</p>
<figure><desc>Ol&#225; Mundo em Python no Mac</desc><graphic url="BBEdit-ola-mundo.png"/></figure>
</div>
      <div n="1"><head>Interagindo com a linha de comandos do Python</head>
<p>Uma outra forma de interagir com o interpretador &#233; utilizar o que &#233; denominado por linha de comandos. Voc&#234; pode digitar um comando na linha de comandos e pressionar a tecla Enter, sendo-lhe apresentada a resposta ao seu comando. Usar a linha de comandos &#233; um &#243;timo m&#233;todo para testar os comandos, por forma a certificar que eles realmente fazem o que voc&#234; est&#225; imaginando.</p>
<p>Abra o <emph>Finder</emph>, fa&#231;a duplo-clique em <code type="inline">Applications -&gt; Utilities -&gt; Terminal</code> e, em seguida, digite &#8220;<code type="inline">python3</code>&#8221; </p>
<p>Este comando ir&#225; abrir a linha de comandos do Python, indicando assim que voc&#234; j&#225; pode executar comandos Python. De seguida, digite:</p>
<pre><code class="language-python" xml:id="code_instalacao-mac_3" type="block" corresp="code_instalacao-mac_3.txt"></code></pre>
<p>e pressione Enter. O computador ir&#225; responder com:</p>
<pre><code class="language-python" xml:id="code_instalacao-mac_4" type="block" corresp="code_instalacao-mac_4.txt"></code></pre>
<p>Quando quisermos representar uma intera&#231;&#227;o na linha de comandos, utilizaremos o s&#237;mbolo <code type="inline">-&gt;</code> para indicar a resposta para o nosso comando, tal como no exemplo abaixo:</p>
<pre><code class="language-python" xml:id="code_instalacao-mac_5" type="block" corresp="code_instalacao-mac_5.txt"></code></pre>
<p>No seu ecr&#227;, voc&#234; ver&#225; algo como:</p>
<figure><desc>Ol&#225; Mundo em Python no Terminal do Mac</desc><graphic url="ola-mundo-terminal.png"/></figure>
<p>Agora que voc&#234; e o seu computador est&#227;o preparados, podemos seguir para tarefas mais interessantes. Se voc&#234; est&#225; seguindo as li&#231;&#245;es do Python, a nossa sugest&#227;o &#233; que tente a pr&#243;xima li&#231;&#227;o &#8216;<link target="nocoes-basicas-paginas-web-html">No&#231;&#245;es b&#225;sicas de p&#225;ginas web e HTML</link>&#8216;</p>
</div>
    </body>
  </text>
</TEI>
