<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>An&#225;lise de sentimento para explora&#231;&#227;o de dados</title>
  <layout>lesson</layout>
  <slug>analise-sentimento-exploracao-dados</slug>
  <date>2018-01-15</date>
  <translation_date>2021-06-14</translation_date>
  <authors>Zo&amp;#235; Wilkinson Salda&amp;#241;a</authors>
  <reviewers>Anandi Silva Knuppel,Puteri Zarina Megat Khalid</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Caio Mello</translator>
  <translation-editor>Josir Cardoso Gomes</translation-editor>
  <translation-reviewer>Bruno Ponne,Ian Araujo</translation-reviewer>
  <original>sentiment-analysis</original>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/375</review-ticket>
  <difficulty>2</difficulty>
  <activity>analyzing</activity>
  <topics>distant-reading</topics>
  <abstract>Nesta li&#231;&#227;o, voc&#234; aprender&#225; a conduzir uma 'an&#225;lise de sentimento' em textos e a interpretar os resultados. Esta &#233; uma forma de an&#225;lise explorat&#243;ria de dados baseada no processamento de linguagem natural (PLN). Voc&#234; aprender&#225; a instalar todos os softwares apropriados e a construir um programa reutiliz&#225;vel que pode ser aplicado aos seus pr&#243;prios textos.</abstract>
  <avatar_alt>Um homem sorridente e um homem rabugento</avatar_alt>
  <doi>10.46430/phpt0017</doi>
</metadata>
  <text>
    <body>
      <div n="1"><head>Objetivos da li&#231;&#227;o</head>
<p>Esta li&#231;&#227;o usa a an&#225;lise de sentimento como base para uma an&#225;lise explorat&#243;ria de dados de um grande corpus textual. Portanto, &#233; indicada para leitores com alguma experi&#234;ncia pr&#233;via em programa&#231;&#227;o utilizando Python. Caso n&#227;o tenha experi&#234;ncia com Python ou programa&#231;&#227;o, a autora recomenda trabalhar nas primeiras li&#231;&#245;es da s&#233;rie &#8220;Introdu&#231;&#227;o ao Python&#8221;. Ao final desta li&#231;&#227;o, voc&#234; ter&#225; o conhecimento necess&#225;rio para:</p>
<ul>
<li>Elaborar quest&#245;es de pesquisa que usem Processamento de Linguagem Natural (PLN) em um corpus textual.</li>
<li>Utilizar Python e o Natural Language Processing Toolkit (NLTK) para gerar medidas de sentimento para um texto.</li>
<li>Avaliar criticamente os resultados da an&#225;lise de sentimento e ajustar os par&#226;metros e a metodologia conforme necess&#225;rio.</li>
<li>Identificar as pr&#243;ximas etapas para continuar o aprendizado sobre an&#225;lise explorat&#243;ria de dados e abordagens program&#225;ticas para dados qualitativos.</li>
</ul>
<p>Nota do tradutor: Devido &#224; falta de uma biblioteca de c&#243;digo que funcione bem com os textos em portugu&#234;s, optamos por manter os textos dos exerc&#237;cios na l&#237;ngua original.</p>
<div n="2"><head>O que &#233; an&#225;lise explorat&#243;ria de dados?</head>
<p>A an&#225;lise explorat&#243;ria de dados &#233; um conjunto de estrat&#233;gias que trazem &#224; tona caracter&#237;sticas importantes num conjunto de dados que normalmente n&#227;o s&#227;o facilmente identificadas por meio da leitura tradicional. Com os insights da an&#225;lise explorat&#243;ria de dados em m&#227;os, os pesquisadores podem tomar decis&#245;es mais adequadas ao selecionar um m&#233;todo ou abordagem para sua quest&#227;o de pesquisa, ou at&#233; mesmo, identificar novas quest&#245;es.</p>
<p>Em 1977, o matem&#225;tico John Tukey descreveu a an&#225;lise explorat&#243;ria de dados como uma forma de trabalho de detetive, sem a qual, os estudiosos muitas vezes perderiam descobertas interessantes, por&#233;m menos &#243;bvias:</p>
<blockquote>
<p>&#8220;A menos que o detetive encontre pistas, o juiz ou j&#250;ri n&#227;o ter&#225; como julgar. Caso a an&#225;lise explorat&#243;ria de dados n&#227;o revele ind&#237;cios, geralmente quantitativos, &#233; prov&#225;vel que se considere n&#227;o haver nada a ser comprovado. &#8221; (Tukey 1977: 3, tradu&#231;&#227;o livre)</p>
</blockquote>
</div><div n="2"><head>Explorando Texto com An&#225;lise de Sentimento</head>
<p>Quando confrontado com um corpus promissor, por&#233;m muito grande, como o pesquisador pode encontrar aquilo de mais importante, que pode levar &#224;s descobertas de pesquisa mais interessantes?</p>
<p>O Processamento de Linguagem Natural (PLN) abrange uma ampla gama de t&#233;cnicas que se baseiam na aplica&#231;&#227;o de m&#233;todos anal&#237;ticos computacionais ao conte&#250;do textual, fornecendo meios de categorizar e quantificar o texto. Essas abordagens de PLN, que incluem an&#225;lise de sentimento, podem ajudar os pesquisadores a explorar seus textos. Nas palavras de Tukey, podem ajudar o pesquisador a encontrar &#8220;pistas&#8221; sobre seus textos e &#8220;ind&#237;cios&#8221; de que pode valer a pena investigar algo mais a fundo.</p>
<p>Nesta li&#231;&#227;o, vamos nos concentrar numa ferramenta do kit de ferramentas do PLN: a an&#225;lise de sentimento. A an&#225;lise de sentimento busca quantificar a intensidade emocional de palavras e frases num texto. Algumas ferramentas de an&#225;lise de sentimento levam em considera&#231;&#227;o, inclusive, o peso emocional de sinais lingu&#237;sticos como a pontua&#231;&#227;o ou mesmo os emojis. As ferramentas de an&#225;lise de sentimento geralmente processam uma unidade de texto (uma frase, um par&#225;grafo, um livro, etc.) e produzem pontua&#231;&#245;es (&#8220;scores&#8221;, em ingl&#234;s) ou classifica&#231;&#245;es quantitativas para indicar se o algoritmo considera que aquele texto transmite emo&#231;&#245;es positivas ou negativas. Algumas ferramentas tamb&#233;m podem quantificar o <emph>grau de positividade</emph> ou o <emph>grau de negatividade</emph> num texto. Combinada com outros m&#233;todos de PLN, como modelagem de t&#243;picos (&#8220;topic modelling&#8221;, em ingl&#234;s), a an&#225;lise de sentimento fornece meios de caracterizar as emo&#231;&#245;es expressas sobre diferentes t&#243;picos de uma conversa. Quando usada em conjunto com a an&#225;lise de rede, pode lan&#231;ar luz sobre as maneiras como os indiv&#237;duos interagem uns com os outros. Um pesquisador interessado em intera&#231;&#245;es sobre um evento pol&#237;tico pode usar a an&#225;lise de sentimento para estudar como os indiv&#237;duos descrevem aquele evento nas redes sociais. Com os dados certos para inserir na ferramenta, pode ser poss&#237;vel fazer compara&#231;&#245;es regionais ou entender como diferentes grupos demogr&#225;ficos v&#234;em o evento de forma diferente. Como a ferramenta pode processar muitos dados sequencialmente, &#233; at&#233; poss&#237;vel analisar o sentimento em centenas de milhares ou at&#233; milh&#245;es de eventos discursivos.</p>
<p>Para come&#231;ar, esta li&#231;&#227;o fornece uma introdu&#231;&#227;o &#224; an&#225;lise de sentimento tanto pr&#225;tica quanto cr&#237;tica. Como qualquer ferramenta computacional, a an&#225;lise de sentimento tem uma s&#233;rie de limita&#231;&#245;es e vieses que os pesquisadores devem levar em considera&#231;&#227;o. Os pesquisadores devem ser especialmente cautelosos ao fazer afirma&#231;&#245;es emp&#237;ricas com base nos resultados da an&#225;lise de sentimento. Voc&#234; poder&#225; ser melhor atendido usando a an&#225;lise de sentimento em situa&#231;&#245;es provis&#243;rias e explorat&#243;rias, como meio de orientar o processo de pesquisa. Ao manejar essas ferramentas com ceticismo e efic&#225;cia, &#233; poss&#237;vel realizar um trabalho de detetive bastante not&#225;vel.</p>
</div><div n="2"><head>An&#225;lise de grandes cole&#231;&#245;es de correspond&#234;ncia textual</head>
<p>Correspond&#234;ncias escritas como cartas, e-mails, registros de bate-papo, tweets e hist&#243;ricos de mensagens de texto podem fornecer aos pesquisadores uma vis&#227;o inestim&#225;vel de seus autores. Os textos geralmente s&#227;o ricos em emo&#231;&#245;es e informa&#231;&#245;es que n&#227;o est&#227;o disponibilizadas em nenhum outro lugar. Um pesquisador pode aprender sobre as opini&#245;es que as pessoas, objetos de seu estudo, tiveram sobre v&#225;rios t&#243;picos ou sobre determinados eventos. Tamb&#233;m poderia ser poss&#237;vel aprender sobre os relacionamentos que os indiv&#237;duos desenvolveram e mantiveram em organiza&#231;&#245;es ou redes complexas.</p>
<p>Embora metodologias como etnografia, leitura &#8220;manual&#8221; e an&#225;lise do discurso ajudem os pesquisadores a analisar a correspond&#234;ncia hist&#243;rica, esses m&#233;todos trazem desafios significativos quando o n&#250;mero de textos cresce de dezenas ou centenas para milhares ou milh&#245;es. A an&#225;lise textual computacional fornece um conjunto de m&#233;todos para tornar vis&#237;veis as tend&#234;ncias, din&#226;micas e relacionamentos que podem estar ocultos para o leitor humano por problemas de escala. Al&#233;m disso, muitos m&#233;todos de computa&#231;&#227;o produzem descobertas que podem ser expressas quantitativamente e que podem subsequentemente permitir que o pesquisador realize modelagem estat&#237;stica, visualiza&#231;&#227;o de informa&#231;&#245;es e aprendizado de m&#225;quina (Machine Learning) para fazer outras an&#225;lises.</p>
</div><div n="2"><head>Estudo de caso: corpus de e-mails da Enron</head>
<p>Este tutorial usa a correspond&#234;ncia de e-mail da falida empresa americana de energia Enron. A Enron ocultou uma ampla variedade de pr&#225;ticas cont&#225;beis ilegais at&#233; que uma investiga&#231;&#227;o federal em 2001 a levou &#224; fal&#234;ncia. Na &#233;poca, o Esc&#226;ndalo Enron foi o maior colapso de uma empresa de capital aberto da hist&#243;ria. Em 2001, a empresa come&#231;ou a mostrar sinais de problemas financeiros que n&#227;o se alinhavam com as divulga&#231;&#245;es financeiras da empresa at&#233; aquele momento. As a&#231;&#245;es da Enron negociadas em bolsa ca&#237;ram de US$ 90,75 em meados de 2000 para menos de um d&#243;lar em novembro de 2001, o que levou os acionistas a processar a empresa. Uma investiga&#231;&#227;o subsequente da Comiss&#227;o de Valores Mobili&#225;rios dos Estados Unidos (SEC) revelou que os executivos da Enron cometeram fraude e neglig&#234;ncia cont&#225;bil em grande escala. A Enron declarou fal&#234;ncia em dezembro daquele ano. Nos anos que se seguiram, v&#225;rios executivos enfrentaram condena&#231;&#245;es criminais por sua participa&#231;&#227;o no esc&#226;ndalo. Para os pesquisadores, o Esc&#226;ndalo Enron resultou na cria&#231;&#227;o de um dos maiores (e mais infames) corpus de texto por correspond&#234;ncia j&#225; coletado:</p>
<blockquote>
<p>&#8220;Um dos esc&#226;ndalos corporativos mais infames das &#250;ltimas d&#233;cadas deixou curiosamente em seu rastro um dos conjuntos de dados mais valiosos dispon&#237;veis publicamente. No final de 2001, o encobrimento de fraude cont&#225;bil da Enron Corporation levou &#224; fal&#234;ncia da gigante da energia. A Federal Energy Regulatory Commission requereu todos os registros de e-mail da Enron como parte da investiga&#231;&#227;o que se seguiu. Nos dois anos seguintes, a comiss&#227;o divulgou, escondeu e depois divulgou novamente o corpus de e-mail para o p&#250;blico ap&#243;s excluir e-mails que continham informa&#231;&#245;es pessoais, como n&#250;meros de previd&#234;ncia social. O corpus da Enron cont&#233;m e-mails cujos assuntos variam de planejamento de f&#233;rias de fim de semana a t&#243;picos de discuss&#227;o de estrat&#233;gia pol&#237;tica, e continua sendo o &#250;nico grande exemplo de conjuntos de dados de e-mail do mundo real dispon&#237;veis para pesquisa &#8221;. (Hardin, Sarkis e Urc, 2015)</p>
</blockquote>
<p>Quando o conjunto de dados de e-mail da Enron - organizado e editado - foi lan&#231;ado em 2004, os pesquisadores descobriram uma oportunidade sem precedentes: acesso direto &#224; maneira espont&#226;nea e sem censura como os funcion&#225;rios de uma empresa condenada se comunicavam. De repente, os pesquisadores tiveram acesso a como as pessoas se comunicam no trabalho em uma escala sem precedentes. Isso era importante para pesquisadores interessados &#8203;&#8203;no caso especial do esc&#226;ndalo e colapso da Enron, mas tamb&#233;m para pesquisadores interessados &#8203;&#8203;em um amplo espectro de quest&#245;es sobre a comunica&#231;&#227;o cotidiana no trabalho.</p>
<p>Na d&#233;cada seguinte, centenas de novos estudos surgiram a partir desses e-mails, realizados em diversos campos como teoria das redes sociais, comunidade e detec&#231;&#227;o de anomalias, g&#234;nero e comunica&#231;&#227;o dentro das organiza&#231;&#245;es, mudan&#231;a de comportamento durante uma crise organizacional, insularidade e forma&#231;&#227;o de comunidade. O uso da teoria das redes sociais nas humanidades oferece algumas possibilidades fascinantes, mas n&#227;o &#233; t&#227;o simples.</p>
<p>Al&#233;m da grande quantidade de mensagens inclu&#237;das (o corpus cont&#233;m mais de 600.000 mensagens), o corpus de e-mails da Enron tamb&#233;m inclui os metadados necess&#225;rios para que os pesquisadores realizem uma s&#233;rie de quest&#245;es de pesquisa. Assim como a presen&#231;a de envelopes com endere&#231;os leg&#237;veis do remetente e do destinat&#225;rio seria um excelente trunfo para pesquisadores de correspond&#234;ncias de cartas hist&#243;ricas, a presen&#231;a de endere&#231;os de e-mail do remetente e do destinat&#225;rio permite que os pesquisadores associem os e-mails a determinados indiv&#237;duos conhecidos dentro da corpora&#231;&#227;o. Como alguns indiv&#237;duos tinham v&#225;rios endere&#231;os de e-mail, ou mais de um indiv&#237;duo pode ter compartilhado o mesmo endere&#231;o, os metadados n&#227;o s&#227;o de uso muito &#243;bvio, mas s&#227;o potencialmente elucidativos. O restante do tutorial explicar&#225; como aplicar e interpretar a an&#225;lise de sentimento de e-mails neste corpus.</p>
</div></div>
      <div n="1"><head>Usando Python com o Natural Language Toolkit (NLTK)</head>
<div class="alert alert-warning">
Programando pela primeira vez? Esta li&#231;&#227;o &#233; destinada a iniciantes, mas pode ser conveniente revisar outras li&#231;&#245;es de Python no Programming Historian. No entanto, observe que, embora muitas li&#231;&#245;es usem o Python vers&#227;o 2, esta li&#231;&#227;o requer o Python vers&#227;o 3. As instru&#231;&#245;es de instala&#231;&#227;o do Python 3 ser&#227;o apresentadas a seguir.
</div>
<p>Neste tutorial, Python ser&#225; usado junto com algumas ferramentas do Natural Language Toolkit (NLTK) para gerar indicadores de sentimento a partir de transcri&#231;&#245;es de e-mail. Para fazer isso, voc&#234; primeiro aprender&#225; como carregar os dados textuais no Python, selecionar as ferramentas de PLN apropriadas para an&#225;lise de sentimento e escrever um algoritmo que calcula pontua&#231;&#245;es de sentimento para um determinado texto. Tamb&#233;m exploraremos como ajustar seu algoritmo para melhor atender a seu objetivo de pesquisa. Ao final, voc&#234; ir&#225; arquivar seu algoritmo de solu&#231;&#227;o de problemas como um pacote de c&#243;digo conhecido como <emph>fun&#231;&#227;o</emph>, que poder&#225; ser reutilizado e reaproveitado (inclusive na parte 2 deste tutorial)</p>
<div n="2"><head>Instala&#231;&#227;o</head>
<p>Para continuar, as seguintes instala&#231;&#245;es ser&#227;o necess&#225;rias:</p>
<ul>
<li>Python 3 (preferivelmente 3.5 ou superior) - <link target="https://wiki.python.org/moin/BeginnersGuide/Download">Instru&#231;&#245;es para baixar e instalar Python</link></li>
<li>NLTK (3.2.5 or superior) - <link target="http://www.nltk.org/install.html">Instru&#231;&#245;es para baixar e instalar NLTK</link></li>
</ul>
</div><div n="2"><head>Primeiros passos com NLTK</head>
<p>O Natural Language Toolkit (NLTK) &#233; uma cole&#231;&#227;o de ferramentas Python reutiliz&#225;veis (tamb&#233;m conhecido como uma biblioteca Python) que ajuda os pesquisadores a aplicar um conjunto de m&#233;todos computacionais a textos. As ferramentas variam desde m&#233;todos que ajudam a quebrar o texto em peda&#231;os menores, alguns que identificam se uma palavra pertence a um determinado idioma, at&#233; aqueles textos de amostra que os pesquisadores podem usar para fins de treinamento e desenvolvimento (como o texto completo de <emph>Moby Dick</emph>).</p>
<p>Se voc&#234; precisar de ajuda para baixar e instalar o m&#243;dulo para <link target="https://www.python.org/download/releases/3.0/">Python 3</link>, d&#234; uma olhada na li&#231;&#227;o Instalando M&#243;dulos Python com pip de <link target="/en/lessons/installing-python-modules-pip">Fred Gibbs</link> (em ingl&#234;s).</p>
<p>Em nosso caso, usaremos duas ferramentas NLTK em particular:</p>
<ul>
<li>A ferramenta <link target="http://www.nltk.org/_modules/nltk/sentiment/vader.html">"An&#225;lise de sentimento VADER"</link> (que gera pontua&#231;&#245;es de sentimento positivas, negativas e neutras para uma determinada entrada)</li>
<li>A ferramenta de toqueniza&#231;&#227;o &#8216;word_tokenize&#8217; (divide um texto grande em uma sequ&#234;ncia de unidades menores, como frases ou palavras)</li>
</ul>
<p>Para usar VADER e word_tokenize, primeiro precisamos baixar e instalar alguns dados extras para NLTK. O NLTK &#233; um kit de ferramentas muito grande e v&#225;rias de suas ferramentas requerem uma segunda etapa de download para reunir a cole&#231;&#227;o de dados necess&#225;ria (geralmente l&#233;xicos codificados) para funcionar corretamente.</p>
<p>Para instalar a an&#225;lise de sentimento e o tokenizador de palavras que usaremos neste tutorial, escreva um novo script em Python com as tr&#234;s linhas a seguir:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_0" type="block" corresp="code_analise-sentimento-exploracao-dados_0.txt"></code></pre>
<p>Voc&#234; pode salvar este arquivo como <code type="inline">&#8220;installation.py&#8221;</code>. Se voc&#234; n&#227;o tiver certeza de como salvar e executar scripts em Python, reveja o tutorial sobre como configurar um 'Ambiente de Desenvolvimento Integrado' usando Python, substituindo o comando '% (python)% f' por '% (python3)% f' quando voc&#234; chegar a esse parte no tutorial.</p>
<ul>
<li>Configurando um ambiente de desenvolvimento integrado para Python no <link target="/pt/licoes/instalacao-windows">Windows</link>.</li>
<li>Configurando um ambiente de desenvolvimento integrado para Python no <link target="/pt/licoes/instalacao-mac">Mac</link>.</li>
<li>Configurando um ambiente de desenvolvimento integrado para Python no <link target="/pt/licoes/instalacao-linux">Linux</link>.</li>
</ul>
<p>Se voc&#234; sabe como executar scripts Python, execute o arquivo usando Python 3.</p>
<p><link target="http://www.nltk.org/_modules/nltk/sentiment/vader.html">VADER</link> (Valence Aware Dictionary and sEntiment Reasoner) &#233; uma ferramenta de atribui&#231;&#227;o de intensidade de sentimento acrescentada ao NLTK em 2014. Ao contr&#225;rio de outras t&#233;cnicas que exigem treinamento em textos parecidos antes do uso, o VADER est&#225; pronto para ser usado sem qualquer configura&#231;&#227;o especial. O VADER &#233; o &#250;nico que faz distin&#231;&#245;es refinadas entre v&#225;rios graus de positividade e negatividade. Por exemplo, VADER pontua &#8220;conforto&#8221; como moderadamente positivo e &#8220;euforia&#8221; como extremamente positivo. Ele tamb&#233;m tenta capturar e pontuar caracter&#237;sticas textuais comuns em texto online informal, como letras mai&#250;sculas, pontos de exclama&#231;&#227;o e emoticons, conforme mostrado na tabela abaixo:</p>
 <figure><desc>Vader captura pequenas grada&#231;&#245;es de entusiasmo. (Hutto e Gilbert, 2014). **Vers&#227;o do tradutor**. Acesse a original [aqui](/en/lessons/sentiment-analysis)</desc><graphic url="analise-sentimento1.png"/></figure>
<p>Como qualquer ferramenta de an&#225;lise de texto, o VADER deve ser avaliado com criticidade e de forma contextualizada. O VADER foi desenvolvido em meados da d&#233;cada de 2010 principalmente para analisar microblogs em ingl&#234;s e sites de rede social (especialmente o Twitter). Esse tipo de texto tende a ser muito mais informal do que o e-mail profissional, e cont&#233;m padr&#245;es de linguagem e de uso de recursos que diferem dos padr&#245;es de 1999-2002 quando os e-mails da Enron foram escritos. No entanto, VADER tamb&#233;m foi desenvolvido como uma ferramenta de an&#225;lise de sentimento de prop&#243;sito geral, e o estudo inicial dos autores mostra que ele se compara favoravelmente com ferramentas que foram treinadas para dom&#237;nios espec&#237;ficos, usam l&#233;xicos especializados ou t&#233;cnicas de aprendizado de m&#225;quina com muitos recursos (Hutto e Gilbert, 2014 ). A sensibilidade da ferramenta em rela&#231;&#227;o aos graus de afeto se mostrou &#250;til para descrever as sutilezas das emo&#231;&#245;es expressas nos e-mails profissionais - como pesquisadores, podemos estar especialmente interessados &#8203;&#8203;em capturar os momentos em que a emo&#231;&#227;o surge em um texto formal. No entanto, a an&#225;lise de sentimento continua se dedicando a encontrar solu&#231;&#245;es para capturar sentimentos complexos como ironia, sarcasmo e zombaria, quando o leitor m&#233;dio seria capaz de fazer a distin&#231;&#227;o entre o texto literal e seu significado pretendido.</p>
<p>Embora o VADER seja uma boa ferramenta de uso geral para textos contempor&#226;neos e hist&#243;ricos em ingl&#234;s, a ferramenta fornece apenas suporte nativo parcial para textos em outras l&#237;nguas (detecta emojis / mai&#250;sculas / etc., mas n&#227;o a escolha de palavras). No entanto, os desenvolvedores incentivam os usu&#225;rios a usar a tradu&#231;&#227;o autom&#225;tica para pr&#233;-processar textos que n&#227;o sejam em ingl&#234;s e, em seguida, inserir os resultados no VADER. O "VADER demo" inclui um c&#243;digo para enviar o texto de entrada automaticamente para o servi&#231;o web &#8216;My Memory Translation Service&#8217;, (leitores avan&#231;ados podem encontrar no <link target="https://github.com/cjhutto/vaderSentiment/blob/master/vaderSentiment/vaderSentiment.py">Github</link> a partir da linha 554 - no momento da escrita deste artigo). A implementa&#231;&#227;o deste m&#233;todo de tradu&#231;&#227;o &#233; mais indicada para usu&#225;rios intermedi&#225;rios de Python. Voc&#234; pode aprender mais sobre o estado da arte da an&#225;lise de sentimento multil&#237;ngue (que infelizmente quase sempre requer uma etapa de tradu&#231;&#227;o) em <link target="https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4981629/">"An&#225;lise de sentimento multil&#237;ngue: o estado da arte e compara&#231;&#227;o independente de t&#233;cnicas"</link>, de Kia Dashtipour, et al (2016).</p>
</div><div n="2"><head>Calculando Sentimento para um Par&#225;grafo</head>
<p>Leia o seguinte trecho:</p>
<blockquote>
<p>&#8220;Like you, I am getting very frustrated with this process. I am genuinely trying to be as reasonable as possible. I am not trying to &#8220;hold up&#8221; the deal at the last minute. I&#8217;m afraid that I am being asked to take a fairly large leap of faith after this company (I don&#8217;t mean the two of you &#8211; I mean Enron) has screwed me and the people who work for me.&#8221;</p>
</blockquote>
<p>Este &#233; o primeiro par&#225;grafo do e-mail de janeiro de 2012 de Timothy Belden para Louise Kitchen e John Lavorato sobre o &#8220;Acordo de Contratos de Trabalho&#8221;. Belden dirigiu os Servi&#231;os de Energia da Enron e mais tarde seria condenado por conspira&#231;&#227;o a fim de aumentar os custos de energia na Calif&#243;rnia, o que levou a uma crise energ&#233;tica em todo o estado.</p>
<p>Apesar do sentimento de frustra&#231;&#227;o e ansiedade que voc&#234; pode deduzir do par&#225;grafo como um todo, observe a ambival&#234;ncia das frases espec&#237;ficas dentro do par&#225;grafo. Alguns parecem expressar esfor&#231;os de boa f&#233;, por exemplo: &#8220;N&#227;o estou tentando &#8216;atrasar&#8217; o neg&#243;cio&#8221; e &#8220;genuinamente tentando&#8221;. E, no entanto, h&#225; declara&#231;&#245;es negativas ainda mais fortes sobre "ficar frustrado", "Receio" e "esta empresa [...] ferrou comigo e com as pessoas que trabalham para mim".</p>
<p>Vamos calcular as pontua&#231;&#245;es de sentimento para este e-mail usando o VADER para ter uma ideia do que a ferramenta pode fazer. Para come&#231;ar, crie um novo diret&#243;rio de trabalho (pasta) em seu computador chamado <code type="inline">&#8220;sentimento&#8221;</code> em algum lugar onde voc&#234; possa encontr&#225;-lo. Dentro dessa pasta, crie um novo arquivo de texto e salve-o como <code type="inline">&#8220;sentimento.py&#8221;</code>. &#201; aqui que escreveremos o c&#243;digo para esta tarefa.</p>
<p>Primeiro, temos que dizer ao Python onde o c&#243;digo NLTK para a an&#225;lise de sentimento VADER est&#225; localizado. No in&#237;cio do nosso arquivo, importaremos o c&#243;digo do VADER:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_1" type="block" corresp="code_analise-sentimento-exploracao-dados_1.txt"></code></pre>
<p>Tamb&#233;m devemos habilitar o Python para usar este c&#243;digo com nosso conjunto particular de c&#243;digo. Embora tenhamos todas as instru&#231;&#245;es de que precisamos na biblioteca NLTK, o Python gosta de agrupar essas instru&#231;&#245;es em um &#250;nico <code type="inline">objeto</code> (nossa ferramenta de An&#225;lise de Sentimentos) que nosso programa pode acessar. <emph>SentimentIntensityAnalyzer</emph> &#233; uma <code type="inline">classe</code>, que &#233; um &#8220;modelo&#8221; que instrui o Python a construir um <code type="inline">objeto</code> com um conjunto especial de <code type="inline">fun&#231;&#245;es</code> e <code type="inline">vari&#225;veis</code>. No nosso caso, queremos construir um &#250;nico <code type="inline">objeto</code>: nosso analisador de sentimento, que segue este &#8220;modelo&#8221;. Para fazer isso, executamos <emph>SentimentIntensityAnalyzer( )</emph> e atribu&#237;mos a sa&#237;da - nosso novo analisador de sentimento - a uma vari&#225;vel, que chamaremos de <emph>&#8216;sid&#8217;</emph>.</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_2" type="block" corresp="code_analise-sentimento-exploracao-dados_2.txt"></code></pre>
<p>Fazendo isso, fornecemos &#224; nossa nova vari&#225;vel <emph>sid</emph> todos os recursos do c&#243;digo de an&#225;lise de sentimento VADER. Assim, <emph>sid</emph> se tornou nossa ferramenta de an&#225;lise de sentimento, mas com um nome mais curto.</p>
<p>Em seguida, precisamos armazenar o texto que queremos analisar em um lugar que o <emph>sid</emph> possa acessar. Em Python, podemos armazenar uma &#250;nica sequ&#234;ncia de texto como uma vari&#225;vel de <code type="inline">string</code> (Nota do tradutor: Optamos por manter a palavra 'string' como no original em ingl&#234;s para facilitar o entendimento de seu uso mais comum em c&#243;digos ['str']).</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_3" type="block" corresp="code_analise-sentimento-exploracao-dados_3.txt"></code></pre>
<p>Como este texto inclui aspas e ap&#243;strofos, &#233; necess&#225;rio circundar todo o texto com tr&#234;s aspas (&#8220;&#8221;&#8221; ou &#8217;&#8217;&#8217;). Isso significa que quaisquer aspas e ap&#243;strofos no texto ser&#227;o reconhecidos como tal. Essa abordagem tamb&#233;m mant&#233;m qualquer espa&#231;amento que nosso texto j&#225; inclua.</p>
<p>Agora voc&#234; est&#225; pronto para processar o texto.</p>
<p>Para fazer isso, o texto <emph>(message_text)</emph> deve ser inserido na ferramenta <emph>(sid)</emph> e o programa deve ser executado. Estamos interessados na "pontua&#231;&#227;o de polaridade" do analisador de sentimento, que nos d&#225; uma pontua&#231;&#227;o positiva ou negativa. Este recurso &#233; integrado ao VADER e pode ser solicitado sob demanda.</p>
<p>Queremos ter certeza de capturar a sa&#237;da de sid.polarity_scores () atribuindo-a a uma vari&#225;vel que chamaremos de <emph>scores</emph>:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_4" type="block" corresp="code_analise-sentimento-exploracao-dados_4.txt"></code></pre>
<p>Quando voc&#234; executa este c&#243;digo, os resultados da an&#225;lise de sentimento agora s&#227;o armazenados no <code type="inline">dicion&#225;rio</code> de <emph>pontua&#231;&#227;o</emph> (scores). Um dicion&#225;rio, muito parecido com o tipo que voc&#234; usa para pesquisar a defini&#231;&#227;o de palavras, &#233; uma vari&#225;vel que armazena informa&#231;&#245;es conhecidas como 'valores' que s&#227;o acess&#237;veis dando ao programa a 'chave' para a entrada que voc&#234; deseja ler. Isso significa que um dicion&#225;rio como <emph>scores</emph> pode armazenar muitos <code type="inline">pares de valores-chave</code>. Para solicitar os dados, voc&#234; s&#243; precisa conhecer as <code type="inline">chaves</code>. Mas n&#227;o sabemos as <code type="inline">chaves</code>. Felizmente, Python nos dar&#225; uma lista de todas as <code type="inline">chaves</code>, classificadas em ordem alfab&#233;tica, se usarmos a fun&#231;&#227;o <code type="inline">sorted(scores)</code>.</p>
<p>Para imprimir cada <code type="inline">chave</code> e <code type="inline">valor</code> armazenado no dicion&#225;rio, precisamos de um <code type="inline">for loop</code>, que aplica o mesmo c&#243;digo sequencialmente a todas as <code type="inline">chaves</code> do dicion&#225;rio.</p>
<p>Aqui est&#225; o c&#243;digo para imprimir cada par de <code type="inline">valores-chave</code> dentro da vari&#225;vel de pontua&#231;&#227;o (score):</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_5" type="block" corresp="code_analise-sentimento-exploracao-dados_5.txt"></code></pre>
<p>Aqui est&#225; todo o c&#243;digo em um &#250;nico programa:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_6" type="block" corresp="code_analise-sentimento-exploracao-dados_6.txt"></code></pre>
<p>Salve seu arquivo Python. Agora estamos prontos para executar o c&#243;digo. Usando seu m&#233;todo preferido (ou seu Ambiente de Desenvolvimento Integrado ou a linha de comando), execute seu arquivo Python, <code type="inline">sentimento.py</code>.</p>
<p>O resultado deve ser semelhante a este:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_7" type="block" corresp="code_analise-sentimento-exploracao-dados_7.txt"></code></pre>
<div class="alert alert-warning">
Lembre-se de usar tr&#234;s aspas simples para envolver a string *message_text* acima. Se voc&#234; usar aspas duplas, a string terminar&#225; mais cedo devido &#224;s aspas dentro do texto.
</div>
<p>O VADER coleta e pontua palavras e caracter&#237;sticas negativas, neutras e positivas (e &#233; respons&#225;vel por fatores como nega&#231;&#227;o ao longo do caminho). Os valores &#8220;neg&#8221;, &#8220;neu&#8221; e &#8220;pos&#8221; descrevem a fra&#231;&#227;o das pontua&#231;&#245;es ponderadas que se enquadram em cada categoria. VADER tamb&#233;m soma todas as pontua&#231;&#245;es ponderadas para calcular um valor &#8220;composto&#8221; normalizado entre -1 e 1; este valor tenta descrever o efeito geral de todo o texto de fortemente negativo (-1) a fortemente positivo (1). Neste caso, a an&#225;lise com VADER descreve a passagem como ligeiramente a moderadamente negativa (-0,3804). Podemos pensar nesse valor como uma estimativa da impress&#227;o geral de um leitor m&#233;dio ao considerar o e-mail como um todo, apesar de alguma ambiguidade e ambival&#234;ncia ao longo do caminho.</p>
<p>Ao ler o texto, estaria inclinado a concordar com essa avalia&#231;&#227;o geral. O valor de sa&#237;da de -0,3804 &#233; negativo, mas n&#227;o fortemente negativo. Os pesquisadores podem desejar definir um limite m&#237;nimo para positividade ou negatividade antes de declarar um texto definitivamente positivo ou negativo - por exemplo, a documenta&#231;&#227;o oficial do VADER sugere um limite de -0,5 e 0,5, que este trecho espec&#237;fico n&#227;o alcan&#231;aria (em outras palavras , este texto &#233; negativo, mas n&#227;o extremamente negativo).</p>
<p>O que isso implica, para voc&#234;, sobre a maneira como esse sentimento pode ser expresso em um contexto de e-mail profissional? Como voc&#234; definiria seus valores limite quando o texto expressa emo&#231;&#245;es de maneira mais sutil ou cort&#234;s? Voc&#234; acha que a an&#225;lise de sentimento &#233; uma ferramenta apropriada para nossa an&#225;lise explorat&#243;ria de dados?</p>
<p>Desafio: tente substituir o conte&#250;do de <emph>message_text</emph> pelas seguintes cadeias de caracteres e execute novamente o programa. N&#227;o se esque&#231;a de cercar cada texto com tr&#234;s aspas simples ao atribu&#237;-lo &#224; vari&#225;vel <emph>message_text</emph> (como em: <emph>message_text</emph> = ''' algumas palavras '''). Antes de executar o programa, tente adivinhar o resultado da an&#225;lise de sentimento: positivo ou negativo? Qu&#227;o positivo ou negativo?</p>
<p>Texto 1:</p>
<pre><code xml:id="code_analise-sentimento-exploracao-dados_8" type="block" corresp="code_analise-sentimento-exploracao-dados_8.txt"></code></pre>
<p>Texto 2:</p>
<pre><code xml:id="code_analise-sentimento-exploracao-dados_9" type="block" corresp="code_analise-sentimento-exploracao-dados_9.txt"></code></pre>
<p>Experimente uma terceira vez com algum texto de uma de suas pr&#243;prias fontes de pesquisa. Que resultados voc&#234; obteve para cada um? Voc&#234; concorda com os resultados?</p>
</div></div>
      <div n="1"><head>Determine o escopo apropriado para e-mail</head>
<p>Quando analisado por meio da ferramenta de an&#225;lise de sentimento VADER, o texto produz um conjunto de pontua&#231;&#245;es positivas, neutras e negativas, que s&#227;o ent&#227;o agregadas e dimensionadas como uma "pontua&#231;&#227;o composta". Embora seja &#250;til saber em teoria, como esse m&#233;todo pode ser aplicado aos dados no exemplo da Enron - isto &#233;, uma cole&#231;&#227;o de dados de e-mail e metadados? E o que isso pode nos dizer sobre as emo&#231;&#245;es, relacionamentos e mudan&#231;as ao longo do tempo dos funcion&#225;rios da Enron?</p>
<p>Nesta se&#231;&#227;o, apresentaremos a voc&#234; o processo de sele&#231;&#227;o do escopo de an&#225;lise para nossa ferramenta de an&#225;lise de sentimento. Considere os seguintes dados brutos pertencentes a um e-mail de 3 de outubro de 2000 escrito por Jeffrey Shankman, ent&#227;o presidente de mercados globais da Enron (Quinn, 2006):</p>
<pre><code xml:id="code_analise-sentimento-exploracao-dados_10" type="block" corresp="code_analise-sentimento-exploracao-dados_10.txt"></code></pre>
<p>No texto da mensagem do e-mail, Shankman tra&#231;a uma estrat&#233;gia corporativa para avan&#231;ar no que ele percebe como um contexto geopol&#237;tico amb&#237;guo. A mensagem descreve uma s&#233;rie de situa&#231;&#245;es dif&#237;ceis, bem como exaspera&#231;&#227;o ("As reuni&#245;es matinais n&#227;o s&#227;o inspiradoras") e incerteza ("N&#227;o tenho um sentimento real de paix&#227;o de todos"). Ao mesmo tempo, Shankman descreve um conjunto de etapas de a&#231;&#227;o junto com pedidos educados ("Eu gostaria de pedir ...") e express&#245;es de gratid&#227;o ("Obrigado").</p>
<p>Antes de prosseguirmos, pare um minuto para refletir sobre a mensagem. Como voc&#234; acha que um leitor t&#237;pico descreveria a intensidade emocional deste e-mail? Considerando o que voc&#234; sabe agora sobre VADER, que propor&#231;&#227;o de positividade, negatividade e neutralidade voc&#234; espera que a ferramenta de an&#225;lise de sentimento encontre na mensagem? Finalmente, o que voc&#234; acha que a pontua&#231;&#227;o composta ir&#225; sugerir sobre o efeito geral na mensagem?</p>
<p>Como discutimos acima, a an&#225;lise de sentimento n&#227;o fornece uma sa&#237;da objetiva, mas sim indicadores de orienta&#231;&#227;o que refletem nossa escolha e calibra&#231;&#227;o de ferramentas anal&#237;ticas. Talvez o elemento mais importante da calibra&#231;&#227;o seja selecionar o escopo do texto que est&#225; sendo analisado, ou seja, quanto de uma mensagem colocamos na ferramenta de uma vez. Em nosso caso, podemos determinar o escopo da an&#225;lise decidindo entre analisar a mensagem inteira como uma &#250;nica unidade ou, em vez disso, dividir a mensagem em unidades menores como frases e analisar cada uma separadamente.</p>
<p>Primeiro, vamos considerar uma abordagem no n&#237;vel da mensagem, na qual analisamos a mensagem como um &#250;nico bloco:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_11" type="block" corresp="code_analise-sentimento-exploracao-dados_11.txt"></code></pre>
<p>Substitua <code type="inline">sentimento.py</code> pelo c&#243;digo acima, salve-o e execute-o. A sa&#237;da deve ser semelhante a esta:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_12" type="block" corresp="code_analise-sentimento-exploracao-dados_12.txt"></code></pre>
<p>Aqui voc&#234; pode ver que, ao analisar o e-mail como um todo, VADER retorna valores que sugerem que a mensagem &#233; principalmente neutra (neu: 0,765), mas que mais recursos parecem ser positivos (pos: 0,14) em vez de negativos (0,096). VADER calcula uma pontua&#231;&#227;o geral de sentimento de 0,889 para a mensagem (em uma escala de -1 a 1), o que sugere um efeito fortemente positivo para a mensagem como um todo.</p>
<p>Isso atendeu &#224;s suas expectativas? Se n&#227;o, por que voc&#234; acha que o VADER encontrou mais caracter&#237;sticas positivas do que negativas?</p>
<p>No n&#237;vel da entidade da mensagem, n&#227;o h&#225; como destacar sentimentos particularmente positivos ou negativos na mensagem. Essa perda de detalhes pode ser irrelevante ou pode ser vital ao conduzir uma an&#225;lise explorat&#243;ria. Isso depende das necessidades de pesquisa de seu estudo. Por exemplo, identificar frases negativas em e-mails de outra forma adequados pode ser especialmente importante ao procurar explos&#245;es emocionais ou trocas abusivas que podem ocorrer muito raramente, mas revelam algo essencial sobre a natureza de um relacionamento. Se quisermos capturar esse n&#237;vel de nuance, precisamos de um m&#233;todo para passar da an&#225;lise do n&#237;vel da mensagem para a an&#225;lise do sentimento.</p>
<p>Felizmente, o NLTK oferece uma cole&#231;&#227;o de ferramentas para dividir o texto em componentes menores. Os tokenizadores dividem as sequ&#234;ncias de texto em peda&#231;os menores, como frases. Alguns podem ainda dividir uma frase em partes espec&#237;ficas do discurso, como o substantivo, adjetivo e assim por diante. No nosso caso, usaremos o tokenizer english.pickle do NLTK para dividir os par&#225;grafos em senten&#231;as.</p>
<p>Agora podemos reescrever o script de an&#225;lise de sentimento para analisar cada frase separadamente:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_13" type="block" corresp="code_analise-sentimento-exploracao-dados_13.txt"></code></pre>
<p>O resultado deve ser semelhante a este:</p>
<pre><code class="language-python" xml:id="code_analise-sentimento-exploracao-dados_14" type="block" corresp="code_analise-sentimento-exploracao-dados_14.txt"></code></pre>
<p>Aqui, voc&#234; notar&#225; uma visaliza&#231;&#227;o muito mais detalhada do sentimento neste e-mail. O VADER identifica com sucesso senten&#231;as moderadas a fortemente negativas no e-mail, especialmente as principais descri&#231;&#245;es de crises. A an&#225;lise no n&#237;vel da frase permite que voc&#234; identifique frases e t&#243;picos espec&#237;ficos nos extremos do sentimento, o que pode ser &#250;til mais tarde.</p>
<p>Mas, mesmo nesse n&#237;vel, o VADER tamb&#233;m comete v&#225;rios erros. A frase que come&#231;a com &#8220;As reuni&#245;es matinais n&#227;o s&#227;o inspiradoras&#8221; resulta em uma pontua&#231;&#227;o surpreendentemente positiva - talvez por causa de uma leitura incorreta dos termos &#8220;paix&#227;o&#8221; e &#8220;respeito&#8221;.</p>
<p>Observe tamb&#233;m que o ponto de interroga&#231;&#227;o no in&#237;cio do e-mail e o ponto de abrevia&#231;&#227;o ap&#243;s <emph>Mon</emph> (Segunda-feira: <emph>seg.</emph>) pr&#243;ximo ao final fazem com que o tokenizador english.pickle quebre as frases por engano. Este &#233; um risco constante de pontua&#231;&#227;o informal e complexa no texto.</p>
<p>O que voc&#234; nota sobre a distribui&#231;&#227;o dos scores de sentimento? Como voc&#234; poderia colet&#225;-los de uma maneira que o ajude a entender melhor seus dados e as quest&#245;es de pesquisa de seu interesse? (Sinta-se &#224; vontade para experimentar diferentes tipos de texto na vari&#225;vel <emph>message_text</emph> para ver como a ferramenta responde a diferentes tipos de constru&#231;&#245;es de linguagem). O c&#243;digo que voc&#234; acabou de escrever pode ser reaproveitado para qualquer texto.</p>
</div>
      <div n="1"><head>Agradecimentos</head>
<p>Meus sinceros agradecimentos a Justin Joque, Bibliotec&#225;rio de Visualiza&#231;&#227;o da Biblioteca da Universidade de Michigan e do Digital Projects Studio, pelo apoio na formula&#231;&#227;o das ideias e abordagem por tr&#225;s desta li&#231;&#227;o. Muito obrigado tamb&#233;m a Adam Crymble, que forneceu diversas ideias e apoio durante todo o processo editorial. E obrigado a Anandi Silva Knuppel e Puteri Zarina Megat Khalid por seus coment&#225;rios atenciosos.</p>
</div>
      <div n="1"><head>Refer&#234;ncias</head>
<p>Barton, D., &amp; Hall, N. (Eds.). (2000). Letter writing as a social practice (Vol. 9). John Benjamins Publishing.</p>
<p>Hardin, J., Sarkis, G., &amp; Urc, P. C. (2015). Network Analysis with the Enron Email Corpus. Journal of Statistics Education, 23:2. <link target="https://doi.org/10.1080/10691898.2015.11889734">https://doi.org/10.1080/10691898.2015.11889734</link></p>
<p>Hutto, C.J. &amp; Gilbert, E.E. (2014). VADER: A Parsimonious Rule-based Model for Sentiment Analysis of Social Media Text. Eighth International Conference on Weblogs and Social Media (ICWSM-14). Ann Arbor, MI, June 2014. <link target="https://www.aaai.org/ocs/index.php/ICWSM/ICWSM14/paper/viewPaper/8109">https://www.aaai.org/ocs/index.php/ICWSM/ICWSM14/paper/viewPaper/8109</link></p>
<p>Klimt, B., &amp; Yang, Y. (2004, July). Introducing the Enron Corpus. In CEAS. <link target="https://bklimt.com/papers/2004_klimt_ceas.pdf">https://bklimt.com/papers/2004_klimt_ceas.pdf</link></p>
<p>Klimt, B., &amp; Yang, Y. (2004). The Enron corpus: A new dataset for email classification research. Machine learning: ECML 2004, 217-226. <link target="https://bklimt.com/papers/2004_klimt_ecml.pdf">https://bklimt.com/papers/2004_klimt_ecml.pdf</link></p>
<p>Tukey, J.W. (1977). Exploratory Data Analysis. Addison-Wesley Publishing Company</p>
<p>Quinn, J. (2006, November 14). Ex-Enron man goes back into energy. Retrieved January 10, 2018, from <link target="http://www.telegraph.co.uk/finance/2950645/Ex-Enron-man-goes-back-into-energy.html">http://www.telegraph.co.uk/finance/2950645/Ex-Enron-man-goes-back-into-energy.html</link></p>
</div>
    </body>
  </text>
</TEI>
