<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="instalacao-linux">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Configurar um ambiente de desenvolvimento integrado para Python (Linux)</title>
  <author type="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor type="reviewers"><persName>Jim Clifford</persName><persName>Amanda Morton</persName></editor><author type="translators">Josir C. Gomes</author><editor type="translation-reviewers"><persName>Bruno Martins</persName><persName>Renato Rocha Souza</persName></editor><editor type="editors">Miriam Posner</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0007</idno><date type="published">07/17/2012</date><date type="translated">05/13/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#linux-installation"/>.</p><p>There are other translations: <ref target="#installer-ide-python-linux #instalacion-linux"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Esta li&#231;&#227;o ir&#225; auxiliar na configura&#231;&#227;o de um ambiente de desenvolvimento integrado para o Python num computador com o Sistema Operacional Linux.</p></abstract><textClass><keyword xml:lang="en">get-ready</keyword><keyword xml:lang="en">python</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body><p>Deixamos em primeiro lugar um obrigado a John Fink por fornecer as bases para esta se&#231;&#227;o. Damos instru&#231;&#245;es para o Ubuntu 18.04 LTS, mas as mesmas devem funcionar com qualquer vers&#227;o do Linux baseada em apt, tal como o Debian ou Linux-Mint. Voc&#234; tamb&#233;m deve ter acesso ao comando sudo.</p>
<div type="2"><head>Fa&#231;a um backup do seu computador</head>
<p>&#201; sempre importante garantir que voc&#234; tenha backups regulares e recentes do seu computador. Este &#233; um bom conselho que serve para a vida toda e n&#227;o se limita &#224; pratica espec&#237;fica de programa&#231;&#227;o.</p>
</div><div type="2"><head>Instale o Python 3</head>
<ol>
<li>Abra um Terminal (V&#225; para Applica&#231;&#245;es, digite <code type="inline">Terminal</code> e clique no &#237;cone Terminal).</li>
<li>De seguida, digite: <code type="inline">sudo apt-get install python3</code></li>
<li>Entre a sua senha e em seguida tecle <code type="inline">S</code> para finalizar a instala&#231;&#227;o.
Note que voc&#234; provavelmente j&#225; deve ter o Python 3 instalado. Assim, n&#227;o estranhe se o Ubuntu informar que o Python j&#225; est&#225; instalado.</li>
</ol>
</div><div type="2"><head>Crie um diret&#243;rio</head>
<p>Voc&#234; ir&#225; armazenar os seus programas Python num diret&#243;rio (i.e., uma pasta). Este diret&#243;rio pode estar em qualquer pasta que voc&#234; quiser,
mas &#233; melhor que voc&#234; crie o mesmo na sua pasta <emph>Home</emph>. Para criar o diret&#243;rio de forma r&#225;pida, abra a janela do terminal e digite: </p>
<pre><code xml:id="code_instalacao-linux_0" type="block" corresp="code_instalacao-linux_0.txt"/></pre>
</div><div type="2"><head>Instale o Komodo Edit</head>
<p>O Komodo Edit &#233; um editor livre e de c&#243;digo aberto, mas pode utilizar <link target="https://wiki.python.org/moin/PythonEditors/">outros editores</link> se voc&#234; preferir. Pode fazer o download directamente do <link target="https://www.activestate.com/products/komodo-ide/downloads/edit/">site do Komodo Edit</link>. Uma vez que voc&#234; tenha feito o download, fa&#231;a a extra&#231;&#227;o do ficheiro para a sua pasta pessoal e siga as instru&#231;&#245;es de instala&#231;&#227;o. Se voc&#234; tiver seguido corretamente as instru&#231;&#245;es, abra a sua pasta pessoal, acesse a pasta <code type="inline">Komodo-Edit-12/bin</code> e finalmente clique no arquivo <code type="inline">komodo</code>.</p>
<div type="3"><head>Fa&#231;a um comando &#8220;Run Python&#8221; no Komodo Edit</head>
<ol>
<li>J&#225; no editor, certifique que a barra lateral &#8220;Toolbox&#8221; est&#225; vis&#237;vel.</li>
<li>Clique no &#237;cone da engrenagem na barra de ferramentas e selecione <code type="inline">New Command</code>.</li>
<li>No campo Type, digite &#8220;<code type="inline">Run Python</code>&#8221;.</li>
<li>No campo Command, digite: <code type="inline">%(python3) %F</code>. </li>
</ol>
<p>Se o ecr&#227; estiver mostrando algo como descrito na janela abaixo, clique no bot&#227;o OK.</p>
<p>{% include figure.html caption="Adicione um novo comando no Komodo Edit" filename="komodo-edit-tools-linux.png" %}</p>
</div></div><div type="2"><head>Passo 2 &#8211; &#8220;Ol&#225; Mundo&#8221; em Python</head>
<p>&#201; uma tradi&#231;&#227;o para quem est&#225; come&#231;ando a programar em uma nova linguagem que o primeiro programa a ser constru&#237;do emita a frase "Ol&#225; Mundo". </p>
<p>O Python &#233; uma boa linguagem de programa&#231;&#227;o para iniciantes porque ela &#233; de alto-n&#237;vel.
Isto quer dizer que &#233; poss&#237;vel escrever pequenos programas que realizam muitas funcionalidades.
Quanto menor o programa, mais prov&#225;vel que ele caiba em apenas um ecr&#227; e mais f&#225;cil ser&#225; de manter o controle dele em sua mente.</p>
<p>O Python &#233; uma lingugagem 'interpretada'. Isto significa que existe um programa especial (conhecido como Interpretador) que sabe como seguir as instru&#231;&#245;es da linguagem. Uma forma de utilizar o interpretador passa por guardar todas as instru&#231;&#245;es a serem executadas em um ficheiro para, em seguida, solicitar ao interpretador que ele interprete o conte&#250;do desse ficheiro.  </p>
<p>Um ficheiro que cont&#233;m instru&#231;&#245;es de uma linguagem de programa&#231;&#227;o &#233; conhecido como um programa. O interpretador ir&#225; executar cada uma das instru&#231;&#245;es que voc&#234; incluiu no seu programa e, no final, ir&#225; parar. Vamos experimentar como isto funciona.</p>
<p>No seu editor de texto, crie um novo ficheiro, entre o seguinte programa de duas linhas e salve-o na pasta <code type="inline">programming-historian</code>:</p>
<p><code type="inline">ola-mundo.py</code></p>
<pre><code class="language-python" xml:id="code_instalacao-linux_1" type="block" corresp="code_instalacao-linux_1.txt"/></pre>
<p>O comando &#8220;<emph>Run Python</emph>&#8221; permite que voc&#234; execute o seu programa. Se voc&#234; escolheu um outro editor, este deve ter uma funcionalidade semelhante. Se tudo correu bem, o ecr&#227; dever&#225; mostrar algo como o apresentado de seguida:</p>
<p>{% include figure.html caption="Ol&#225; mundo no Komodo Edit no Linux" filename="komodo-edit-output-linux.png" %}</p>
</div><div type="2"><head>Interagindo com a linha de comandos do Python</head>
<p>Outra forma de interagir com o interpretador &#233; utilizar o que &#233; denominado por linha de comandos.
Voc&#234; pode digitar um comando, pressionar a tecla Enter e a linha de comandos ir&#225; responder ao seu comando.
Usar a linha de comandos &#233; um &#243;timo m&#233;todo para testar os comandos e para se certificar que eles realmente fazem o que voc&#234; est&#225; imaginando.</p>
<p>Voc&#234; pode executar a linha de comandos do Python iniciando a aplica&#231;&#227;o "Terminal" e, de seguida, digitando &#8220;<code type="inline">python3</code>&#8221; na janela que se abriu na sua tela. </p>
<p>Esse comando ir&#225; abrir a linha de comandos do Python, indicando assim que voc&#234; j&#225; pode executar comandos Python. De seguida, digite:</p>
<pre><code class="language-python" xml:id="code_instalacao-linux_2" type="block" corresp="code_instalacao-linux_2.txt"/></pre>
<p>e pressione Enter. O computador ir&#225; responder com:</p>
<pre><code class="language-python" xml:id="code_instalacao-linux_3" type="block" corresp="code_instalacao-linux_3.txt"/></pre>
<p>Quando quisermos representar uma intera&#231;&#227;o na linha de comandos, n&#243;s utilizaremos o s&#237;mbolo <code type="inline">-&gt;</code> para indicar a resposta para o nosso comando, tal como no exemplo abaixo:</p>
<pre><code class="language-python" xml:id="code_instalacao-linux_4" type="block" corresp="code_instalacao-linux_4.txt"/></pre>
<p>No seu ecr&#227;, voc&#234; ver&#225; algo como:</p>
<p>{% include figure.html caption="Ol&#225; Mundo no Terminal do Linux" filename="terminal-output-linux.png" %}</p>
<p>Agora que voc&#234; e o seu computador est&#227;o preparados, podemos seguir para tarefas mais interessantes. Se voc&#234; est&#225; seguindo as li&#231;&#245;es do Python,
nossa sugest&#227;o &#233; que voc&#234; tente a pr&#243;xima li&#231;&#227;o &#8216;<link target="nocoes-basicas-paginas-web-html">No&#231;&#245;es b&#225;sicas de p&#225;ginas web e HTML</link>&#8216;</p>
</div></body>
  </text>
</TEI>
