<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introdu&#231;&#227;o e instala&#231;&#227;o do Python</title>
  <slug>introducao-instalacao-python</slug>
  <layout>lesson</layout>
  <date>2012-07-17</date>
  <translation_date>2021-05-13</translation_date>
  <authors>William J. Turkel,Adam Crymble</authors>
  <reviewers>Jim Clifford,Amanda Morton</reviewers>
  <editors>Miriam Posner</editors>
  <translator>Josir C. Gomes</translator>
  <translation-editor>Danielle Sanches</translation-editor>
  <translation-reviewer>Bruno Martins,Renato Rocha Souza</translation-reviewer>
  <difficulty>1</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/323</review-ticket>
  <activity>transforming</activity>
  <topics>python,get-ready</topics>
  <abstract>Essa primeira li&#231;&#227;o em nossa se&#231;&#227;o para tratar de Fontes Online &#233; preparada para que voc&#234; e o seu computador estejam prontos para se iniciarem na programa&#231;&#227;o. N&#243;s iremos nos concentrar em instalar os softwares necess&#225;rios &#8211; todos livres e de boa reputa&#231;&#227;o &#8211; e finalmente n&#243;s iremos te auxiliar a experimentar os primeiros passos na programa&#231;&#227;o para que voc&#234; tenha resultados imediatos.</abstract>
  <next>nocoes-basicas-paginas-web-html</next>
  <python_warning>False</python_warning>
  <original>introduction-and-installation</original>
  <avatar_alt>Uma cobra enrolada</avatar_alt>
  <doi>10.46430/phpt0004</doi>
</metadata>
  <text xml:lang="pt">
    <body>
      <div type="2"><head>Objetivos da Li&#231;&#227;o</head>
<p>Essa primeira li&#231;&#227;o na nossa se&#231;&#227;o sobre Fontes Online &#233; preparada para que voc&#234; e o seu computador estejam preparados para se iniciarem na programa&#231;&#227;o.
Iremos focar na instala&#231;&#227;o do software necess&#225;rio, livre e de boa reputa&#231;&#227;o. Posteriormente, iremos auxiliar na experimenta&#231;&#227;o com os primeiros passos na programa&#231;&#227;o, para que voc&#234; tenha resultados r&#225;pidos.</p>
<p>Neste m&#243;dulo de abertura, voc&#234; ir&#225; instalar a <link target="http://www.python.org/">Linguagem de Programa&#231;&#227;o Python</link>, o <link target="http://www.crummy.com/software/BeautifulSoup/">analisador de HTML/XML Beautiful Soup</link>, e um editor de texto. </p>
<p>Os ecr&#227;ns de exemplo mostrados aqui correspondem ao <link target="http://www.activestate.com/komodo-edit">Komodo Edit</link>, mas voc&#234; pode utilizar qualquer editor de texto apto a trabalhar com o Python. Aqui est&#225; uma lista de outras op&#231;&#245;es: <link target="http://wiki.python.org/moin/PythonEditors/">Editores Python</link>. Uma vez que tudo esteja instalado, voc&#234; ir&#225; escrever os seus primeiros programas, "Ol&#225; Mundo" em Python e HTML.</p>
</div>
      <div type="2"><head>A linguagem de programa&#231;&#227;o Python</head>
<p>A linguagem de programa&#231;&#227;o que usaremos nesta s&#233;rie de li&#231;&#245;es &#233; Python, uma linguagem livre e de c&#243;digo aberto.<br/>
A menos que seja observado o contr&#225;rio, usaremos a vers&#227;o <hi rend="bold">Python 3</hi> daqui em diante.
A vers&#227;o 2 n&#227;o &#233; mais suportada, mas ainda pode estar sendo usada em projetos ou li&#231;&#245;es mais antigas.</p>
<p><link target="http://sebastianraschka.com/Articles/2014_python_2_3_key_diff.html">Python 3 tem algumas poucas diferen&#231;as na formata&#231;&#227;o</link> (pense em regras gramaticais). Assim, fique atento se voc&#234; encontrar exemplos online que ainda utilizam o Python 2. Esses exemplos podem n&#227;o funcionar nas vers&#245;es atuais do Python.</p>
</div>
      <div type="2"><head>Fa&#231;a backups do seu trabalho!</head>
<p>Antes de fazer o download ou instalar qualquer novo software, &#233; crucial que voc&#234; fa&#231;a backups do seu trabalho. Voc&#234; deve fazer backup de todo o seu computador pelo menos uma vez por semana, e de prefer&#234;ncia com uma frequ&#234;ncia ainda menor. &#201; tamb&#233;m uma boa ideia fazer backups fora do seu ambiente local pois, dessa forma, fica salvaguardado caso algo aconte&#231;a com o seu computador, com a sua casa ou o seu escrit&#243;rio. Sites como o <link target="https://www.jungledisk.com/">Jungle Disk</link> ou o <link target="https://www.dropbox.com/home">Dropbox</link> fornecem op&#231;&#245;es de backup f&#225;ceis de usar e relativamente baratas.</p>
<div type="3"><head>Escolha o seu Sistema Operativo</head>
</div></div>
      <div type="2"><head>Passo 1 &#8211; Instale e configure o Software</head>
<p>Para que voc&#234; consiga trabalhar nas t&#233;cnicas aqui apresentadas, voc&#234; precisar&#225; descarregar e instalar software dispon&#237;vel gratuitamente.
N&#243;s fornecemos instru&#231;&#245;es para o Mac, Windows e Linux. Uma vez que voc&#234; tenha instalado o software no seu Sistema Operativo, siga para a li&#231;&#227;o '<link target="nocoes-basicas-paginas-web-html">No&#231;&#245;es b&#225;sicas de p&#225;ginas web e HTML</link>'. Se voc&#234; encontrar dificuldades com as nossas instru&#231;&#245;es ou achar que algo n&#227;o funciona na sua plataforma, por favor nos informe.</p>
<ul>
<li><link target="instalacao-mac">Instala&#231;&#227;o do Python para Mac</link></li>
<li><link target="instalacao-windows">Instala&#231;&#227;o do Python para Windows</link></li>
<li><link target="instalacao-linux">Instala&#231;&#227;o do Python para Linux</link></li>
</ul>
</div>
    </body>
  </text>
</TEI>
