<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introducao-mysql-r">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introdu&#231;&#227;o ao MySQL com R</title>
  <author type="original_author">Jeff Blackadar</author><editor type="reviewers"><persName>Jesse Sadler</persName><persName>Simon Appleford</persName></editor><author type="translators">J&#233;ssica Evelyn Santos</author><editor type="translation-reviewers"><persName>D&#225;lia Guerreiro</persName><persName>Leonardo F. Nascimento</persName></editor><editor type="editors">Amanda Visconti</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0025</idno><date type="published">05/03/2018</date><date type="translated">12/18/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#getting-started-with-mysql-using-r"/>.</p><p>There are other translations: <ref target=""/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Esta li&#231;&#227;o ajudar&#225; a armazenar grandes quantidades de dados hist&#243;ricos de maneira estruturada, pesquisar e filtrar esses dados e visualizar alguns dos dados como um gr&#225;fico.</p></abstract><textClass><keyword xml:lang="en">data-manipulation</keyword><keyword xml:lang="en">distant-reading</keyword><keyword xml:lang="en">r</keyword><keyword xml:lang="en">data-visualization</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body><p>Esta li&#231;&#227;o &#233; direcionada aos que desejam armazenar grandes quantidades de dados de projetos de hist&#243;ria digital de uma forma estruturada. Usaremos um sistema de gerenciamento de dados chamado MySQL para armazenar os dados.</p>
<p>A linguagem R permite realizar an&#225;lises e armazenar dados sem que um banco de dados relacional seja utilizado. No entanto, h&#225; situa&#231;&#245;es nas quais a inclus&#227;o de bancos de dados &#233; muito &#250;til, dentre elas:</p>
<ul>
<li>Publicar os resultados de um script em R num <emph>web site</emph> com dados interativos </li>
<li>Manipular mais dados do que o R pode armazenar em sua pr&#243;pria mem&#243;ria</li>
<li>Quando os dados j&#225; est&#227;o armazenados num banco de dados relacional</li>
<li>Trabalhar com dados de entidades diferentes que s&#227;o relacionados uns com os outros. Um exemplo seria um banco de dados de soldados de dois ex&#233;rcitos distintos que lutaram numa batalha, onde gostar&#237;amos de saber qual esquadr&#227;o, pelot&#227;o, companhia e brigada cada soldado fazia parte.</li>
</ul>
<p>Uma breve discuss&#227;o do tema pode ser encontrada no <link target="hhttps://perma.cc/5VYV-L5PG"><emph>blog</emph> de Jason A. French's</link><ref type="footnotemark" target="#1"/>.</p>
<p>Ao final desta li&#231;&#227;o, ser&#225; poss&#237;vel instalar um sistema de gerenciamento de banco de dados em seu computador, criar uma tabela de banco de dados, armazenar informa&#231;&#245;es na tabela e realizar consultas dos dados. Na conclus&#227;o da li&#231;&#227;o, utilizaremos uma consulta do banco de dados para construir um gr&#225;fico. </p>
<p>Usaremos a linguagem de programa&#231;&#227;o R para os exemplos, mas as t&#233;cnicas podem ser utilizadas com outras linguagens, como Python. </p>
<p>Para fazer essa li&#231;&#227;o ser&#225; necess&#225;rio um computador com permiss&#227;o para instalar os programas R e RStudio, entre outros, se j&#225; n&#227;o estiverem instalados. Al&#233;m da programa&#231;&#227;o em R, tamb&#233;m instalaremos alguns componentes de um sistema de gerenciamento de banco de dados chamado MySQL, que funciona nos sistemas operacionais Windows, Mac e Linux.</p>
<p>Possuir algum conhecimento de instala&#231;&#227;o de programas e organiza&#231;&#227;o de dados em campos &#233; &#250;til para essa li&#231;&#227;o, cujo n&#237;vel de dificuldade &#233; mediano. </p>
<div type="2"><head>Introdu&#231;&#227;o</head>
<p>O MySQL &#233; um banco de dados relacional usado para armazenar e consultar informa&#231;&#245;es. Esta li&#231;&#227;o utilizar&#225; a linguagem R para fornecer um tutorial e exemplos para:</p>
<ul>
<li>Configurar e realizar uma conex&#227;o a uma tabela no MySQL</li>
<li>Armazenar registros em tabelas</li>
<li>Consultar informa&#231;&#245;es de tabelas</li>
</ul>
<p>Neste tutorial, construiremos um banco de dados de artigos de peri&#243;dicos que cont&#233;m palavras de uma busca numa hemeroteca digital. O script armazenar&#225; o t&#237;tulo, a data publicada e a URL de cada artigo num banco de dados. Utilizaremos outro script para realizar consultas no banco de dados e procurar por padr&#245;es historicamente relevantes. Os dados de amostra ser&#227;o fornecidos pelo arquivo de peri&#243;dicos <link target="https://perma.cc/9EHD-EVEX">Welsh Newspapers Online</link>. Estamos trabalhando com o objetivo de produzir uma lista de artigos &#224; qual possamos consultar informa&#231;&#245;es. Ao final da li&#231;&#227;o, vamos executar uma consulta para gerar um gr&#225;fico do n&#250;mero de artigos de peri&#243;dicos no banco de dados, para verificar se h&#225; um padr&#227;o relevante. </p>
</div><div type="2"><head>Programas necess&#225;rios</head>
<p>R, R Studio, MySQL Server e MySQL Workbench s&#227;o os programas necess&#225;rios para esta li&#231;&#227;o. Algumas notas sobre a instala&#231;&#227;o desses pacotes de programas podem ser encontradas abaixo. </p>
<div type="3"><head>R</head>
<p>Na li&#231;&#227;o <link target="/pt/licoes/processamento-basico-texto-r">Processamento B&#225;sico de Texto em R</link><ref type="footnotemark" target="#2"/>, Taylor Arnold e Lauren Tilton fornecem um resumo excelente do conhecimento da linguagem R necess&#225;ria para esta li&#231;&#227;o. Apenas um conhecimento b&#225;sico de R &#233; esperado. A li&#231;&#227;o <link target="/pt/licoes/nocoes-basicas-R-dados-tabulares">No&#231;&#245;es b&#225;sicas de R com dados tabulares</link>, de Taryn Dewar,<ref type="footnotemark" target="#3"/> aborda como instalar o R e se familiarizar com a linguagem.</p>
<div type="4"><head>Download do R</head>
<p>Voc&#234; pode realizar o download do R no <link target="https://cran.r-project.org/">Comprehensive R Archive Network</link>. Clique no link que corresponde ao sistema operacional do seu computador. Selecione <emph>base</emph> para instalar o R pela primeira vez. Uma vez que o ficheiro foi baixado, clique no ficheiro para executar o instalador. </p>
</div></div><div type="3"><head>RStudio</head>
<p>Os exemplos desta li&#231;&#227;o utilizam o RStudio, que &#233; uma interface de desenvolvimento para escrever e executar scripts em R. Esta li&#231;&#227;o usou a vers&#227;o 1.4.1717 do RStudio.</p>
<div type="4"><head>Download do RStudio</head>
<p>Fa&#231;a o download do RStudio atrav&#233;s do <link target="https://www.rstudio.com/products/rstudio/#Desktop">rstudio.com</link> e instale-o. J&#225; que o RStudio &#233; de c&#243;digo aberto, voc&#234; pode selecionar a vers&#227;o gratuita do RStudio Desktop, rolar a p&#225;gina para baixo e clicar num dos instaladores que corresponda ao sistema operacional de seu computador. Uma vez que o download foi realizado, clique no ficheiro para executar o instalador. </p>
</div></div><div type="3"><head>MySQL</head>
<p>SQL significa <emph>Structured Query Language</emph> (Linguagem estruturada de consulta), que &#233; um conjunto de comandos para armazenar e recuperar informa&#231;&#245;es a partir de um banco de dados relacional. MySQL &#233; um tipo de sistema de gerenciamento de banco de dados relacionais. H&#225; muitos outros, como Microsoft SQL Server, IBM DB2 e Microsoft Access. Esta li&#231;&#227;o utiliza o MySQL porque &#233; um programa de c&#243;digo aberto, utilizado por uma grande comunidade, tem uma longa trajet&#243;ria e possui uma vers&#227;o gratuita que pode ser utilizada. </p>
<div type="4"><head>Realizando o download e instalando o MySQL</head>
<p>Nesta se&#231;&#227;o, iremos instalar o MySQL, que &#233; o sistema que mant&#233;m o banco de dados, assim como o MySQL Workbench, que &#233; onde se trabalha para configurar a estrutura do banco de dados. Para usar o MySQL,o MySQL Workbench n&#227;o &#233; necess&#225;rio, podem ser utilizados apenas comandos digitados. Esta li&#231;&#227;o utiliza o MySQL Workbench porque &#233; uma <emph>GUI</emph> (Interface gr&#225;fica do usu&#225;rio) que facilita o aprendizado de MySQL. </p>
<p>Conclua essas instru&#231;&#245;es para instalar o MySQL Community Server e o MySQL Workbench em seu computador.</p>
</div><div type="4"><head>MySQL Community Server</head>
<p>Este &#233; o servidor onde o banco de dados &#233; armazenado. Sua instala&#231;&#227;o &#233; necess&#225;ria para que seja poss&#237;vel conectar e armazenar os dados. Abaixo, faremos o download dos ficheiros, a instala&#231;&#227;o e iniciaremos o servidor. Esta li&#231;&#227;o utilizou a vers&#227;o 8.0.21 do MySQL e 8.0.26 do MySQL Workbench.</p>
<div type="5"><head>Fazendo o download do ficheiro de instala&#231;&#227;o do MySQL Community Server</head>
<p>Clique neste link: <link target="https://dev.mysql.com/downloads/mysql/">https://dev.mysql.com/downloads/mysql/</link>. Role a p&#225;gina para baixo e selecione o sistema operacional que corresponde ao seu computador. Se necess&#225;rio, clique em <hi rend="bold">Select Operating System</hi> para selecionar o sistema operacional. Uma vez feita essa opera&#231;&#227;o, clique no bot&#227;o azul <hi rend="bold">Go to Download Page</hi>. Depois clique no bot&#227;o azul <hi rend="bold">Download</hi>. Na p&#225;gina de download, role para baixo e ter&#225; a op&#231;&#227;o de come&#231;ar o download clicando em <hi rend="bold">No thanks, just start my download</hi> (N&#227;o, obrigado, apenas inicie o download).</p>
</div><div type="5"><head>Instala&#231;&#227;o do MySQL Community Server</head>
<p>Abaixo se encontram as dicas de instala&#231;&#227;o para PC e Mac:</p>
<div type="6"><head>Dicas de instala&#231;&#227;o para PC</head>
<p>A maneira recomendada de instalar os componentes do MySQL &#233; atrav&#233;s do instalador do MySQL para Windows. Com o ficheiro j&#225; baixado, clique duas vezes no ficheiro para instal&#225;-lo. Siga as instru&#231;&#245;es para aceitar a licen&#231;a (nota de tradu&#231;&#227;o: com o instalador MySQL para Windows pode optar por fazer de uma vez s&#243; a instala&#231;&#227;o do MySQL Server e do MySQL Workbench; para isso, escolha os respectivos componentes e siga as instru&#231;&#245;es abaixo).
Depois que os componentes forem instalados, ser&#227;o solicitadas as seguintes op&#231;&#245;es:</p>
<h7>1. Escolhendo um tipo de configura&#231;&#227;o</h7>
<p>Selecione: <hi rend="bold">Developer Default</hi> (Padr&#227;o do desenvolvedor). Esta op&#231;&#227;o <emph>instala o MySQL Server e as ferramentas necess&#225;rias para o desenvolvimento da aplica&#231;&#227;o. Isto &#233; &#250;til se pretendes desenvolver aplica&#231;&#245;es para um servidor existente.</emph>
(Ver abaixo)</p>
<figure><desc>Configure o tipo de padr&#227;o do desenvolvedor</desc><graphic url="introducao-ao-mysql-e-r-1.PNG"/></figure>
<h7>2. Verificar Requisitos</h7>
<p>Clique no bot&#227;o <hi rend="bold">Execute</hi> caso haja requisitos pendentes (<emph>failing requirements</emph>) listados na checagem de requisitos. A lista de requisitos pode ser diferente da mostrada aqui. Uma vez que o processo de executar instalar os requisitos pendentes, clique no bot&#227;o <emph>Next</emph> .
(Ver abaixo)</p>
<figure><desc>Clique no bot&#227;o *Execute* se necess&#225;rio</desc><graphic url="introducao-ao-mysql-e-r-2.PNG"/></figure>
<h7>3. Tipo e Rede (1)</h7>
<p>Selecione: <hi rend="bold">Standalone MySQL Server</hi>
(Ver abaixo)</p>
<figure><desc>Select Standalone MySQL Server</desc><graphic url="getting-started-with-mysql-7.png"/></figure>
<h7>4. Tipo e Rede (2)</h7>
<p><emph>Config type</emph>: Selecione: <hi rend="bold">Development Computer</hi>
Checar: TCP/IP.  Port number (N&#250;mero da porta): 3306.
(Ver abaixo)</p>
<figure><desc>Development Computer TCPIP Port 3306</desc><graphic url="introducao-ao-mysql-e-r-4.png"/></figure>
<h7>5. Contas e Fun&#231;&#245;es</h7>
<figure><desc>Digite a senha *root* e depois guarde-a em local seguro</desc><graphic url="introducao-ao-mysql-e-r-5.png"/></figure>
<h7>6. Servi&#231;o do Windows</h7>
<p>As configura&#231;&#245;es aqui s&#227;o opcionais, mas achamos mais f&#225;cil configurar o MySQL como um servi&#231;o do Windows e inclui-lo na inicializa&#231;&#227;o autom&#225;tica. Um servi&#231;o do Windows &#233; um processo que &#233; executado no computador enquanto se est&#225; trabalhando. &#201; poss&#237;vel mudar as configura&#231;&#245;es do servi&#231;o do Windows posteriormente, para iniciar o MySQL manualmente, para impedir que o programa inicialize quando n&#227;o for necess&#225;rio. </p>
<figure><desc>MySQL como um servi&#231;o do Windows</desc><graphic url="introducao-ao-mysql-e-r-6.png"/></figure>
<p>Clique nos bot&#245;es <emph>Execute</emph> e <emph>Next</emph> para finalizar a instala&#231;&#227;o e inicializar o servidor.</p>
<h7>7. MySQL Workbench e Senha Root</h7>
<p>Procure por MySQL Workbench no menu de inicializa&#231;&#227;o do Windows, sob o item MySQL. Se est&#225; l&#225;, clique para iniciar. Caso n&#227;o esteja, clique no instalador do MySQL - Community para executar novamente a instala&#231;&#227;o e adicionar o MySQL Workbench aos componentes instalados.
Depois de aberto o MySQL Workbench, clique na inst&#226;ncia local do seu MySQL Server.
Quando a senha <emph>root</emph> for solicitada, digite a senha criada na etapa <emph>5. Accounts and Roles</emph>.
(Ver abaixo)</p>
<figure><desc>Senha Root</desc><graphic url="introducao-ao-mysql-e-r-7.png"/></figure>
</div><div type="6"><head>Dicas de instala&#231;&#227;o para um Mac</head>
<h7>1. Instala&#231;&#227;o do MySQL Community Server</h7>
<p>Com o ficheiro de instala&#231;&#227;o do MySQL Community Server baixado, clique duas vezes no ficheiro para instal&#225;-lo.  (Ver abaixo)</p>
<figure><desc>Ficheiro de instala&#231;&#227;o</desc><graphic url="introducao-ao-mysql-e-r-8.png"/></figure>
<h7>2. Guarde a senha tempor&#225;ria</h7>
<p>Siga as instru&#231;&#245;es para aceitar a licen&#231;a e o local de instala&#231;&#227;o. <hi rend="bold">Importante: Uma senha tempor&#225;ria ser&#225; solicitada. Guarde-a cuidadosamente.</hi>  (Veja o exemplo abaixo.  Sua senha tempor&#225;ria ser&#225; diferente da mostrada abaixo.) Se um erro for cometido, &#233; poss&#237;vel remover o servidor instalado e reinstal&#225;-lo, mas essa &#233; uma pequena complica&#231;&#227;o. Um dos revisores dessa li&#231;&#227;o achou que <link target="https://perma.cc/J4Q5-SLK5">essa resposta do StackOverflow</link> pode auxiliar nesta etapa.</p>
<figure><desc>Senha tempor&#225;ria</desc><graphic url="getting-started-with-mysql-18.png"/></figure>
<p>Conclu&#237;da a instala&#231;&#227;o, iremos alterar a senha <emph>root</emph> para o servidor do MySQL.</p>
<h7>3. Modifique a senha do servidor do MySQL</h7>
<p><hi rend="bold">Esta se&#231;&#227;o da li&#231;&#227;o causou dificuldade para algumas pessoas. Leve o tempo que for necess&#225;rio e note, por favor, que os comandos do MySQL terminam com um ponto e v&#237;rgula. Observe-os em alguns dos comandos abaixo.</hi></p>
<p>3.1. Abra uma janela do terminal </p>
<p>3.2. Adicione /usr/local/mysql/bin ao PATH atrav&#233;s do comando abaixo. O PATH &#233; uma lista de diret&#243;rios que o computador considera quando um comando &#233; digitado para executar um programa. No pr&#243;ximo passo abaixo, ao executar o <emph>mysql</emph>, o PATH busca pelos diret&#243;rios que cont&#233;m o programa <emph>mysql</emph>.  O PATH procura pelo <emph>mysql</emph> no diret&#243;rio <emph>/usr/local/mysql/bin</emph> e o executa. O PATH apenas salva o caminho completo que for digitado, nesse caso, <emph>/usr/local/mysql/bin/mysql</emph>, para um programa quando se quer execut&#225;-lo.</p>
<pre><code xml:id="code_introducao-mysql-r_0" type="block" corresp="code_introducao-mysql-r_0.txt"/></pre>
<p>3.3. Inicie o servidor do MySQL.</p>
<p>V&#225; at&#233; System Preferences &gt; imagem do MySQL &gt; clique em "Start MySQL server".</p>
<p>3.4. Inicie uma sess&#227;o no MySQL. No comando abaixo, depois de <emph>--password</emph>, digite a senha guardada no passo <emph>2. Guarde a senha tempor&#225;ria</emph>.</p>
<pre><code xml:id="code_introducao-mysql-r_1" type="block" corresp="code_introducao-mysql-r_1.txt"/></pre>
<p>3.5. Configure a senha <emph>root</emph> para uma <hi rend="bold">nova</hi> senha. Escolha e guarde a nova senha cuidadosamente. No <emph>prompt</emph> mysql&gt; , digite o seguinte comando, substituindo a nova senha entre aspas simples no comando SET PASSWORD=PASSWORD('password') com a nova senha criada.</p>
<pre><code xml:id="code_introducao-mysql-r_2" type="block" corresp="code_introducao-mysql-r_2.txt"/></pre>
<p>3.6. Reinicie o computador. Depois de reiniciar, &#233; poss&#237;vel que seja necess&#225;rio repetir a etapa <emph>3.3 Inicie o servidor do MySQL</emph> acima.</p>
<h7>4. Download do MySQL Workbench</h7>
<p>Clique nesse link: <link target="http://dev.mysql.com/downloads/workbench/">http://dev.mysql.com/downloads/workbench/</link>. Role a p&#225;gina para baixo e clique em <hi rend="bold">Select Operating System</hi> para selecionar o sistema operacional que corresponde ao seu computador. Se necess&#225;rio, clique em <hi rend="bold">Select OS Version</hi> para selecionar a vers&#227;o do sistema operacional. Feito isso, clique no bot&#227;o azul de <hi rend="bold">Download</hi>. Na p&#225;gina de download, role para baixo e ter&#225; a op&#231;&#227;o de iniciar o download ao clicar em <hi rend="bold">No thanks, just start my download.</hi> (N&#227;o, obrigado, apenas inicie o download.)</p>
<p>Com o ficheiro baixado, clique duas vezes para instal&#225;-lo. Feita a instala&#231;&#227;o do MySQL Workbench de acordo com as instru&#231;&#245;es na tela, arraste o &#237;cone para a pasta de aplica&#231;&#245;es da esquerda. (Ver abaixo)</p>
<figure><desc>MySQL Workbench</desc><graphic url="introducao-ao-mysql-e-r-10.png"/></figure>
</div></div></div></div></div><div type="2"><head>Crie um banco de dados</head>
<p>Aqui iremos criar um banco de dados que serve como um contentor para as tabelas nas quais armazenaremos informa&#231;&#245;es. Uma tabela &#233; a estrutura que mant&#233;m os dados que queremos armazenar. Tabelas cont&#233;m muitas linhas de registros. Um exemplo de informa&#231;&#245;es b&#225;sicas de contato conteria campos para nome, n&#250;mero de telefone e endere&#231;o de e-mail. Numa tabela, os campos s&#227;o organizados por <emph>colunas</emph>.</p>
<p>Aqui est&#225; uma tabela de amostra com uma linha de dados que representa um registro:</p>
<table>
<thead>
<tr>
<th>nome</th>
<th>n&#250;mero de telefone</th>
<th>endere&#231;o de e-mail</th>
</tr>
</thead>
<tbody>
<tr>
<td>Pat Abraham</td>
<td>613-555-1212</td>
<td><link target="mailto:pat@zmail.ca">pat@zmail.ca</link></td>
</tr>
</tbody></table><div type="3"><head>Abra o MySQL Workbench</head>
<p>Abra o MySQL Workbench. Clique duas vezes em <emph>Local Instance MySQL80</emph> (num Mac isto pode aparecer como <emph>Local Instance 3306</emph>). &#201; poss&#237;vel que a senha <emph>root</emph> criada nas etapas acima seja solicitada. Em alguns Macs, uma aba de <emph>Query</emph> ser&#225; aberta; se n&#227;o for, abra uma aba de <emph>Query</emph> utilizando: <emph>File &gt; New Query Tab</emph>.</p>
</div><div type="3"><head>Crie um banco de dados</head>
<p>Agora iremos criar um novo banco de dados. Utilizando o MySQL Workbench, realize os seguintes passos: </p>
<ol>
<li>
<p>Na  janela de <hi rend="bold">Query</hi>, digite:</p>
<pre><code xml:id="code_introducao-mysql-r_3" type="block" corresp="code_introducao-mysql-r_3.txt"/></pre>
</li>
<li>
<p>Execute o comando CREATE DATABASE.  Clique no <hi rend="bold">rel&#226;mpago/raio</hi> ou, utilizando o menu, clique em <emph>Query</emph> e ent&#227;o em <emph>Execute Current Statement</emph>.</p>
</li>
<li>
<p>O novo banco de dados <hi rend="bold">periodicos_resultados_pesquisa</hi> deve estar vis&#237;vel na aba <hi rend="bold">SCHEMAS</hi>, no canto superior esquerdo da tela. Se n&#227;o conseguir visualizar um item chamado periodicos_resultados_pesquisa, clique no bot&#227;o de atualizar.</p>
</li>
</ol>
<p>(Ver abaixo:)</p>
<figure><desc>Crie um banco de dados no MySQL Workbench</desc><graphic url="introducao-ao-mysql-e-r-11.png"/></figure>
</div><div type="3"><head>USE o banco de dados</head>
<p>Em seguida, iremos inserir uma declara&#231;&#227;o USE para informar ao MySQL qual banco de dados ser&#225; usado. Isto se torna mais importante quando se tem mais de um banco de dados no computador. </p>
<p>Na janela de <hi rend="bold">Query</hi>, apague todo o comando CREATE DATABASE e digite:</p>
<pre><code xml:id="code_introducao-mysql-r_4" type="block" corresp="code_introducao-mysql-r_4.txt"/></pre>
<p>Novamente, clique no <hi rend="bold">rel&#226;mpago/raio</hi> ou, usando o menu, clique em <emph>Query</emph> e ent&#227;o em <emph>Execute Current Statement</emph>. &#201; poss&#237;vel usar a tecla de teclado para isso. Num Mac, use <emph>Command+Return</emph>. Num PC, use <emph>Ctrl+Shift+Enter</emph>. A partir desse ponto da li&#231;&#227;o, todas as vezes que um comando for digitado na janela de <emph>Query</emph> ser&#225; executado desta maneira.</p>
<p>(Ver abaixo:)</p>
<figure><desc>USE um banco de dados no MySQL Workbench</desc><graphic url="introducao-ao-mysql-e-r-12.png"/></figure>
</div></div><div type="2"><head>Adicione uma tabela</head>
<ol>
<li>No MySQL Workbench, procure no lado esquerdo no painel <hi rend="bold">Navigator</hi>, na aba <hi rend="bold">SCHEMAS</hi>, por <hi rend="bold">periodicos_resultados_pesquisa</hi>.</li>
<li>Clique em <hi rend="bold">Tables</hi> com o lado direito do mouse e depois clique em <hi rend="bold">Create Table</hi>.</li>
<li>Para <hi rend="bold">Table Name:</hi> digite <hi rend="bold">tbl_periodicos_resultados_pesquisa</hi></li>
</ol>
<div type="3"><head>Adicione colunas &#224; tabela</head>
<p>Adicione essas colunas:</p>
<ol>
<li><hi rend="bold">id</hi> Data type: <hi rend="bold">INT</hi>. Clique PK (Primary Key), NN (Not Null) e AI (Auto Increment).  Esta coluna de <emph>id</emph> ser&#225; usada para relacionar registros nesta tabela com registros em outras tabelas. </li>
<li><hi rend="bold">titulo_artigo</hi> Data type: <hi rend="bold">VARCHAR(99)</hi>. Esta coluna armazenar&#225; o t&#237;tulo de cada resultado de artigo que coletarmos da busca.</li>
<li><hi rend="bold">data_publicacao_artigo</hi> Data type: <hi rend="bold">DATETIME</hi>. Esta coluna armazenar&#225; a data em que o peri&#243;dico foi publicado.</li>
<li><hi rend="bold">url_artigo</hi> Data type: <hi rend="bold">VARCHAR(99)</hi>. Esta coluna armazenar&#225; a url de cada resultado que coletarmos da pesquisa.</li>
<li><hi rend="bold">termo_busca_usado</hi> Data type: <hi rend="bold">VARCHAR(45)</hi>. Esta coluna ir&#225; armazenar a palavra que usamos para buscar os peri&#243;dicos.
Clique no bot&#227;o <hi rend="bold">Apply</hi>.</li>
</ol>
<p>Se preferir, todas as etapas acima podem ser realizadas com um comando. Este comando pode ser executado na janela de <emph>Query</emph> para criar a tabela com as colunas indicadas acima. </p>
<pre><code xml:id="code_introducao-mysql-r_5" type="block" corresp="code_introducao-mysql-r_5.txt"/></pre>
<p><emph>Dica: Leve o tempo que for necess&#225;rio para pensar sobre a elabora&#231;&#227;o da tabela e sua nomea&#231;&#227;o, uma vez que um banco de dados bem elaborado ser&#225; mais f&#225;cil de trabalhar e entender.</emph></p>
</div><div type="3"><head>Adicione um usu&#225;rio para se conectar ao banco de dados</head>
<p>Um usu&#225;rio &#233; uma conta que tem permiss&#227;o para se conectar a um banco de dados. Abaixo, adicionaremos um novo usu&#225;rio para que essa conta apenas se conecte a esse novo banco de dados. Usar essa conta de usu&#225;rio para uma conex&#227;o com esse banco de dados limita a exposi&#231;&#227;o a outros bancos de dados, caso a senha para este usu&#225;rio seja comprometida. Dar ao usu&#225;rio os privil&#233;gios m&#237;nimos requeridos para realizar o necess&#225;rio reduz o risco, caso outra pessoa tiver acesso &#224; senha de usu&#225;rio. Por exemplo, se um usu&#225;rio pode apenas ler um banco de dados, &#233; um risco menor se a senha for descoberta do que um usu&#225;rio que tamb&#233;m pode alterar ou apagar o banco de dados. </p>
<p>No menu do MySQL Workbench, clique em <hi rend="bold">Server</hi> e depois em <hi rend="bold">Users and Privileges</hi></p>
<p><hi rend="bold">Usu&#225;rios de Mac</hi> - Em alguns computadores Mac, como meu laptop de teste, o painel de <hi rend="bold">Schema Privileges</hi> n&#227;o &#233; exibido corretamente.  Veja a nota abaixo da captura de tela se isso ocorrer.</p>
<p>Clique no bot&#227;o <hi rend="bold">Add Account</hi> e complete os detalhes para a nova conta de usu&#225;rio na caixa de di&#225;logo:</p>
<ol>
<li>Login Name: <hi rend="bold">periodicos_pesquisa_usuario</hi></li>
<li>Authentication Type: selecione <hi rend="bold">Standard</hi></li>
<li>Limit to Hosts Matching: <hi rend="bold">localhost</hi></li>
<li>Tecle <emph>Enter</emph> e confirme uma senha <emph>AlgoDificil</emph></li>
<li>Clique na aba <hi rend="bold">Administrative Roles</hi>.  Certifique-se de que nada est&#225; marcado. Esta conta &#233; apenas para acessar o banco de dados. </li>
<li>Clique na aba <hi rend="bold">Schema Privileges</hi> e clique <hi rend="bold">Add Entry</hi>.</li>
<li>Na caixa de di&#225;logo <hi rend="bold">New Schema Privilege Definition</hi>, clique na caixa de sele&#231;&#227;o <hi rend="bold">Selected schema:</hi> e selecione <hi rend="bold">periodicos_resultados_pesquisa</hi>. Clique OK.</li>
<li>Clique em todas as op&#231;&#245;es de <emph>Object Rights</emph>: SELECT, INSERT, UPDATE, DELETE, EXECUTE, SHOW VIEW, como mostrado na imagem abaixo. (Este usu&#225;rio precisar&#225; fazer muitas coisas posteriormente na li&#231;&#227;o, por isso, estamos lhe concendendo v&#225;rias permiss&#245;es.)</li>
<li>Clique em <hi rend="bold">Apply</hi>.</li>
</ol>
<figure><desc>Configurando permiss&#245;es para a nova conta</desc><graphic url="introducao-ao-mysql-e-r-13.PNG"/></figure>
<div type="4"><head>Schema Privileges n&#227;o exibidos corretamente</head>
<p>Alguns computadores Mac, como meu laptop de teste, n&#227;o exibem corretamente o painel de <hi rend="bold">Schema Privileges</hi>. Nesse caso, &#233; poss&#237;vel realizar a tarefa acima atrav&#233;s de um <emph>script</emph> usando uma janela de Query. </p>
<p>Se o usu&#225;rio j&#225; foi criado acima, execute o seguinte comando para lhe conceder privil&#233;gios de usu&#225;rio:</p>
<pre><code xml:id="code_introducao-mysql-r_6" type="block" corresp="code_introducao-mysql-r_6.txt"/></pre>
<p>Se o usu&#225;rio n&#227;o foi criado ainda, execute estes dois comandos para criar um usu&#225;rio e depois lhe conceder privil&#233;gios de usu&#225;rio:</p>
<pre><code xml:id="code_introducao-mysql-r_7" type="block" corresp="code_introducao-mysql-r_7.txt"/></pre>
</div><div type="4"><head>MySQL vers&#227;o 8 e tipo de autentica&#231;&#227;o de usu&#225;rio.</head>
<p>Quando um usu&#225;rio &#233; criado no MySQL 8 Workbench o <hi rend="bold">Authentication Type</hi> (tipo de autentica&#231;&#227;o) &#233; configurado para o padr&#227;o <hi rend="bold">caching_sha2_password</hi>. Esse tipo de autentica&#231;&#227;o causa um erro para o pacote R que usaremos para conectar o banco de dados mais tarde nesta li&#231;&#227;o. O erro &#233; <emph>Authentication plugin 'caching_sha2_password' cannot be loaded</emph> e &#233; descrito no <link target="https://perma.cc/7NVR-TSYT">Stack Overflow</link>.</p>
<p>Para evitar esse erro, podemos modificar o tipo de autentica&#231;&#227;o do usu&#225;rio para padr&#227;o (Standard). Para fazer isso, execute o seguinte comando na janela de <emph>Query</emph>:</p>
<pre><code xml:id="code_introducao-mysql-r_8" type="block" corresp="code_introducao-mysql-r_8.txt"/></pre>
</div></div></div><div type="2"><head>Crie um R Script que se conecte ao banco de dados</head>
<p>Abra o RStudio, que foi instalado anteriormente na li&#231;&#227;o. Veja a se&#231;&#227;o <link target="#rstudio">RStudio</link>. </p>
<p>Agora usaremos o RStudio para escrever um novo R Script e salv&#225;-lo com o nome periodicos_resultados_pesquisa.R. </p>
<p>V&#225; em File &gt; New File &gt; R Script e depois salve o novo ficheiro com o nome periodicos_resultados_pesquisa.R.</p>
<p>Usaremos o pacote RMariaDB para realizar a conex&#227;o com o MySQL. (Se tiver curiosidade, a documenta&#231;&#227;o para o pacote RMariaDB pode ser encontrada <link target="https://perma.cc/FX5P-DAW7">aqui</link>.)</p>
<p>Se n&#227;o possui o pacote RMariaDB instalado (o que &#233; prov&#225;vel, caso seja a primeira vez que usa o RStudio), instale-o utilizando o <emph>console</emph> do RStudio. Ap&#243;s abrir o RStudio, copie e cole o seguinte para a janela da esquerda no &gt;, e depois d&#234; enter:</p>
<pre><code xml:id="code_introducao-mysql-r_9" type="block" corresp="code_introducao-mysql-r_9.txt"/></pre>
<p>Adicione o seguinte comando ao script periodicos_resultados_pesquisa.R (janela de cima, &#224; esquerda) </p>
<pre><code xml:id="code_introducao-mysql-r_10" type="block" corresp="code_introducao-mysql-r_10.txt"/></pre>
<div type="3"><head>Conectando a um banco de dados com uma senha</head>
<p>Primeiro, nos conectaremos ao banco de dados usando uma senha. (Depois utilizaremos um meio de conex&#227;o melhor). Por hora, usaremos uma vari&#225;vel para armazenar a senha. Cada vez que iniciar o R, ser&#225; necess&#225;rio apagar esta vari&#225;vel, mas isso &#233; melhor do que publicar uma senha <emph>hardcoded</emph> caso compartilhe seus scripts, como pode fazer usando o GitHub.</p>
<p>No console do RStudio, digite o comando abaixo, substituindo <emph>AlgoDificil</emph> com a senha criada para periodicos_pesquisa_usuario nos passos realizados acima para adicionar um usu&#225;rio ao banco de dados.</p>
<pre><code xml:id="code_introducao-mysql-r_11" type="block" corresp="code_introducao-mysql-r_11.txt"/></pre>
<p>Adicione as seguintes declara&#231;&#245;es em R ao ficheiro periodicos_resultados_pesquisa.R file e salve-o.</p>
<p>Para executar este script, selecione todo o texto e clique no bot&#227;o <emph>Run</emph> (Executar). (H&#225; outras maneiras de executar apenas uma parte do script ou o script inteiro. Se tiver curiosidade, procure no menu abaixo de Code &gt; Run Region. O comando CTRL+ALT+R executa todo o c&#243;digo em R no script.)</p>
<pre><code xml:id="code_introducao-mysql-r_12" type="block" corresp="code_introducao-mysql-r_12.txt"/></pre>
<p>No console, dever&#225; visualizar:</p>
<pre><code xml:id="code_introducao-mysql-r_13" type="block" corresp="code_introducao-mysql-r_13.txt"/></pre>
<p>Sucesso! O que conseguiu:</p>
<ol>
<li>Conectar ao banco de dados com dbConnect.</li>
<li>Listar a tabela no banco de dados com dbListTables.</li>
<li>Desconectar do banco de dados usando dbDisconnect.</li>
</ol>
<div type="4"><head>Conectar-se ao banco de dados com uma senha armazenada num ficheiro de configura&#231;&#227;o</head>
<p>O exemplo acima de conex&#227;o &#233; uma das maneiras de conectar-se. O m&#233;todo de conex&#227;o descrito abaixo armazena a informa&#231;&#227;o da conex&#227;o do banco de dados num ficheiro de configura&#231;&#227;o, para que n&#227;o seja necess&#225;rio digitar uma senha numa vari&#225;vel todas as vezes que uma sess&#227;o no R for iniciada. Acredito que esse &#233; um processo minucioso, mas &#233; uma maneira mais padronizada e segura de proteger as credenciais usadas para acessar seu banco de dados. Esse m&#233;todo de conex&#227;o ser&#225; usado no c&#243;digo para o restante desse tutorial, mas pode ser substitu&#237;do pelo m&#233;todo de conex&#227;o mais simples mostrado acima se preferir. </p>
<div type="5"><head>Crie o ficheiro .cnf para armazenar a informa&#231;&#227;o de conex&#227;o com o banco de dados MySQL</head>
<ol>
<li>Abra um editor de texto, como o notepad, nano ou TextEdit e cole os itens abaixo, modificando a senha para a criada para periodicos_pesquisa_usuario nas etapas acima para adicionar um usu&#225;rio e conect&#225;-lo ao banco de dados. </li>
</ol>
<pre><code xml:id="code_introducao-mysql-r_14" type="block" corresp="code_introducao-mysql-r_14.txt"/></pre>
<ol start="2">
<li>
<p>Salve este ficheiro em algum local fora do diret&#243;rio de trabalho do R. Salvei o meu no mesmo diret&#243;rio de outros ficheiros de configura&#231;&#227;o do MySQL. No PC, o caminho foi o seguinte: C:\Program Files\MySQL\MySQL Server 8.0. Dependendo de seu sistema operacional e da vers&#227;o do MySQL, esse local pode estar em outro lugar. No Mac, usei /Users/blackadar/Documents/ como a pasta de destino. Testei colocar este ficheiro em lugares diferentes, apenas &#233; necess&#225;rio que o R possa localiz&#225;-lo quando o script for executado. Nomeie o ficheiro como <hi rend="bold">periodicos_resultados_pesquisa.cnf</hi>.</p>
</li>
<li>
<p>Atualize o script periodicos_resultados_pesquisa.R acima para conectar-se ao banco de dados usando o ficheiro de configura&#231;&#227;o. </p>
</li>
</ol>
<pre><code xml:id="code_introducao-mysql-r_15" type="block" corresp="code_introducao-mysql-r_15.txt"/></pre>
<ol start="4">
<li>Execute seu script.</li>
</ol>
<p>No console, entre outras linhas, dever&#225; ver novamente:</p>
<pre><code xml:id="code_introducao-mysql-r_16" type="block" corresp="code_introducao-mysql-r_16.txt"/></pre>
<p>De maneira bem sucedida, a conex&#227;o com o banco de dados foi realizada utilizando um ficheiro de configura&#231;&#227;o. </p>
</div></div></div></div><div type="2"><head>Armazenando dados numa tabela com o SQL</head>
<p>Nesta se&#231;&#227;o da li&#231;&#227;o, criaremos uma declara&#231;&#227;o no SQL para inserir uma linha de dados no banco de dados sobre esse <link target="https://perma.cc/C8MR-WYV2">artigo de peri&#243;dico</link>. Iremos inserir primeiro o registro no MySQL Workbench e depois faremos isso no R.</p>
<ol>
<li>
<p>No MySQL Workbench, clique na imagem categorizada como SQL+ para criar uma nova aba para o SQL executar consultas (ou v&#225; ao menu "File" e escolha a op&#231;&#227;o "New Query Tab"). </p>
</li>
<li>
<p>Cole a declara&#231;&#227;o abaixo na janela de Query. Esta a&#231;&#227;o ir&#225; inserir um registro na tabela.</p>
<pre><code xml:id="code_introducao-mysql-r_17" type="block" corresp="code_introducao-mysql-r_17.txt"/></pre>
</li>
<li>
<p>Clique na imagem de rel&#226;mpago/raio na aba do SQL para executar a declara&#231;&#227;o SQL. </p>
</li>
</ol>
<figure><desc>Inserindo um registro numa tabela usando MySQL Workbench</desc><graphic url="introducao-ao-mysql-e-r-14.png"/></figure>
<div type="3"><head>Explica&#231;&#227;o da declara&#231;&#227;o INSERT</head>
<table>
<thead>
<tr>
<th>SQL</th>
<th>Significado</th>
</tr>
</thead>
<tbody>
<tr>
<td>INSERT INTO tbl_periodicos_resultados_pesquisa (</td>
<td>Insere um registro na tabela nomeada tbl_periodicos_resultados_pesquisa</td>
</tr>
<tr>
<td>titulo_artigo,</td>
<td>nome do campo a ser preenchido por um valor</td>
</tr>
<tr>
<td>data_publicacao_artigo,</td>
<td>"</td>
</tr>
<tr>
<td>url_artigo,</td>
<td>"</td>
</tr>
<tr>
<td>termo_busca_usado)</td>
<td>"</td>
</tr>
<tr>
<td>VALUES('THE LOST LUSITANIA.',</td>
<td>O valor a ser inserido no campo titulo_artigo</td>
</tr>
<tr>
<td>'1915-05-21',</td>
<td>campo data_publicacao_artigo</td>
</tr>
<tr>
<td>LEFT(RTRIM('http://newspapers.library.wales/view/4121281/4121288/94/'),99),</td>
<td>campo url_artigo. Este campo &#233; um VARCHAR(99), portanto tem um m&#225;ximo de 99 caracteres. Inserir uma URL mais longa que 99 caracteres causaria um erro, portanto, duas fun&#231;&#245;es s&#227;o utilizadas para controlar isso. RTRIM() reduz espa&#231;os residuais &#224; direita da URL. LEFT(value,99) retorna apenas os 99 caracteres mais &#224; esquerda da URL reduzida. Esta URL &#233; mais curta que isso, ent&#227;o essas fun&#231;&#245;es est&#227;o aqui apenas como exemplo.</td>
</tr>
<tr>
<td>'German+Submarine');</td>
<td>campo termo_busca_usado</td>
</tr>
</tbody></table><p>Opcional: Modifique a declara&#231;&#227;o INSERT acima e execute-a algumas vezes. Por exemplo:</p>
<pre><code xml:id="code_introducao-mysql-r_18" type="block" corresp="code_introducao-mysql-r_18.txt"/></pre>
</div><div type="3"><head>Consultando dados numa tabela com o SQL</head>
<p>Nesta se&#231;&#227;o da li&#231;&#227;o, criaremos uma declara&#231;&#227;o no SQL para selecionar uma linha de dados do banco de dados que inserimos. Selecionaremos o primeiro registro no MySQL Workbench e depois faremos isso no R.</p>
<ol>
<li>
<p>Cole a declara&#231;&#227;o abaixo numa janela de query no MySQL Workbench. Isto ir&#225; selecionar registros da tabela. </p>
<pre><code xml:id="code_introducao-mysql-r_19" type="block" corresp="code_introducao-mysql-r_19.txt"/></pre>
</li>
<li>
<p>Clique na imagem de rel&#226;mpago/raio na aba do SQL para execut&#225;-la. Dever&#225; visualizar o t&#237;tulo do artigo "THE LOST LUSITANIA." na grade de resultados. Ver abaixo. </p>
</li>
</ol>
<figure><desc>Selecionando registros de uma tabela usando MySQL Workbench</desc><graphic url="introducao-ao-mysql-e-r-15.png"/></figure>
<p>Opcional: Modifique a declara&#231;&#227;o SELECT acima alterando os campos selecionados e execute novamente. Adicione mais de um campo para a declara&#231;&#227;o SELECT e execute:</p>
<pre><code xml:id="code_introducao-mysql-r_20" type="block" corresp="code_introducao-mysql-r_20.txt"/></pre>
</div><div type="3"><head>Armazenando dados numa tabela com SQL usando R</head>
<p>Vamos fazer isso usando R! Abaixo se encontra uma vers&#227;o expandida do R Script que usamos para nos conectar ao banco de dados. Para sermos concisos, os tr&#234;s primeiros coment&#225;rios que t&#237;nhamos no R Script mostrado acima foram removidos. N&#227;o s&#227;o mais necess&#225;rios.</p>
<p>Na linha 4 do script abaixo, lembre-se de modificar o caminho do rmariadb.settingsfile que corresponde &#224; localiza&#231;&#227;o desse ficheiro em seu computador.</p>
<pre><code xml:id="code_introducao-mysql-r_21" type="block" corresp="code_introducao-mysql-r_21.txt"/></pre>
<p>No script acima, realizamos duas etapas para inserir um registro:</p>
<ol>
<li>Defina a declara&#231;&#227;o INSERT na linha com: query &lt;- "INSERT INTO tbl_periodicos_resultados_pesquisa (</li>
<li>Execute a declara&#231;&#227;o INSERT armazenada na vari&#225;vel da consulta com: rsInsert &lt;- dbSendQuery(artigosDb, query)</li>
</ol>
<p>Execute o script acima no R Studio e depois execute uma declara&#231;&#227;o SELECT no MySQL Workbench. Consegue visualizar o novo registro adicionado?</p>
<div type="4"><head>Realize uma limpeza nos dados de teste</head>
<p>Neste ponto &#233; prov&#225;vel que haja mais de um registro com o t&#237;tulo de artigo "THE LOST LUSITANIA.", o que &#233; razo&#225;vel para a testagem, mas n&#227;o queremos dados duplicados. Iremos remover os dados de teste e come&#231;ar novamente. Usando a janela de query no MySQL Workbench, execute a declara&#231;&#227;o SQL:</p>
<pre><code xml:id="code_introducao-mysql-r_22" type="block" corresp="code_introducao-mysql-r_22.txt"/></pre>
<p>No painel Action Output do MySQL Workbench dever&#225; visualizar:</p>
<pre><code xml:id="code_introducao-mysql-r_23" type="block" corresp="code_introducao-mysql-r_23.txt"/></pre>
<p>Para praticar o que acabamos de fazer:</p>
<ol>
<li>Execute uma declara&#231;&#227;o SELECT novamente. N&#227;o dever&#225; receber linhas de retorno.</li>
<li>Execute novamente o script em R acima para inserir um registro. </li>
<li>Realize uma declara&#231;&#227;o SELECT. Dever&#225;s visualizar uma linha de dados.</li>
</ol>
</div><div type="4"><head>Modifique a declara&#231;&#227;o INSERT para usar vari&#225;veis</head>
<p>Iremos inserir muitos dados na tabela usando o R, ent&#227;o mudaremos a declara&#231;&#227;o INSERT para usar vari&#225;veis. Veja no c&#243;digo abaixo o destaque <emph># Compila o query.</emph></p>
<pre><code xml:id="code_introducao-mysql-r_24" type="block" corresp="code_introducao-mysql-r_24.txt"/></pre>
<p>Vamos testar esse script:</p>
<ol>
<li>Execute uma declara&#231;&#227;o SELECT e observe as linhas que possui.</li>
<li>Execute o script em R acima para inserir outro registro. </li>
<li>Realize a declara&#231;&#227;o SELECT. Dever&#225; visualizar uma linha adicional de dados. </li>
</ol>
</div><div type="4"><head>Erros do SQL</head>
<p>Vamos criar um simples erro no SQL para visualizar o que acontece.</p>
<p>No R, modifique:</p>
<pre><code xml:id="code_introducao-mysql-r_25" type="block" corresp="code_introducao-mysql-r_25.txt"/></pre>
<p>para</p>
<pre><code xml:id="code_introducao-mysql-r_26" type="block" corresp="code_introducao-mysql-r_26.txt"/></pre>
<p>e execute novamente o script. </p>
<p>No console R, h&#225; um erro:</p>
<pre><code xml:id="code_introducao-mysql-r_27" type="block" corresp="code_introducao-mysql-r_27.txt"/></pre>
<p>&#201; poss&#237;vel verificar, com uma declara&#231;&#227;o SELECT, se n&#227;o h&#225; registro na tabela com um t&#237;tulo de artigo denominado <emph>THE LOST LUSITANIA'S RUDDER</emph>.</p>
<p>As aspas simples fazem parte da sintaxe do SQL e indicam uma entrada textual. Se estiverem no lugar errado, provocam um erro. Temos que lidar com casos nos quais h&#225; dados com aspas. O SQL aceita duas aspas numa declara&#231;&#227;o de inser&#231;&#227;o para representar aspas em dados('').</p>
<p>Lidaremos com as aspas utilizando uma fun&#231;&#227;o <code type="inline">gsub</code> para substituir aspas simples por aspas duplas, como mostrado abaixo. </p>
<pre><code xml:id="code_introducao-mysql-r_28" type="block" corresp="code_introducao-mysql-r_28.txt"/></pre>
<p>Agora que a quest&#227;o das aspas no t&#237;tulo do artigo est&#225; resolvida, execute novamente o script e depois confira com uma declara&#231;&#227;o SELECT no MySQL Workbench.</p>
<pre><code xml:id="code_introducao-mysql-r_29" type="block" corresp="code_introducao-mysql-r_29.txt"/></pre>
<p>Uma vez que o registro teste foi visualizado, digite TRUNCATE tbl_periodicos_resultados_pesquisa para remover esses dados de teste.</p>
</div></div></div><div type="2"><head>Armazenando um ficheiro de valores separados por v&#237;rgulas (.csv) no banco de dados MySQL</head>
<p>Na pr&#243;xima parte da li&#231;&#227;o, vamos realizar consultas na tabela do banco de dados. Nosso objetivo &#233; obter dados suficientes na tabela para construir um gr&#225;fico. Para nos prepararmos para isso, carregaremos alguns dados de amostra de um ficheiro de valores separados por v&#237;rgulas (.csv).</p>
<p>Fa&#231;a o download dos ficheiros .csv para o seu diret&#243;rio de trabalho do R. Esses ficheiros est&#227;o armazenados no GitHub, ent&#227;o fa&#231;a o download da vers&#227;o <emph>Raw</emph> dos ficheiros.</p>
<ol>
<li><link target="/assets/getting-started-with-mysql-using-r/dados-amostra-jardim.csv">dados-amostra-jardim.csv</link> Esta &#233; uma lista de artigos de peri&#243;dicos galeses publicados durante a Primeira Guerra Mundial que correspondem aos termos de busca "<emph>allotment</emph>"(loteamento) e "<emph>garden</emph>"(jardim).</li>
<li><link target="/assets/getting-started-with-mysql-using-r/dados-amostra-submarino.csv">dados-amostra-submarino.csv</link> Esta &#233; uma lista de artigos de peri&#243;dicos galeses publicados durante a Primeira Guerra Mundial que correspondem aos termos de busca "<emph>German</emph>"(alem&#227;o) e "<emph>submarine</emph>"(submarino).</li>
</ol>
<p>No R, execute a fun&#231;&#227;o read.csv() e depois visualize o data frame com os dados amostrais.</p>
<pre><code xml:id="code_introducao-mysql-r_30" type="block" corresp="code_introducao-mysql-r_30.txt"/></pre>
<p>Muitos dados ser&#227;o visualizados, incluindo os que se encontram abaixo. Cheque a aba "Environment" (ambiente) na parte direita do RStudio. O Data Frame dadosAmostraJardim deve conter "1242 obs. of 4 variables".</p>
<pre><code xml:id="code_introducao-mysql-r_31" type="block" corresp="code_introducao-mysql-r_31.txt"/></pre>
<p>Observe que nesses dados de amostra, os nomes dos campos est&#227;o inclu&#237;dos no cabe&#231;alho por conveni&#234;ncia:  titulo_artigo, data_publicacao_artigo, url_artigo e termo_busca_usado.</p>
<p>Como observado acima, nosso objetivo aqui &#233; inserir os dados de amostra que est&#227;o armazenados no data frame dadosAmostraJardim na tabela MySQL periodicos_resultados_pesquisa.  Podemos fazer isso de diferentes maneiras. Uma delas &#233; repetir para cada linha de dado do data frame e executar um comando INSERT, como fizemos acima. Aqui, no entanto, usaremos um comando para inserir todas as linhas em dadosAmostraJardim de uma vez: <emph>dbWriteTable</emph>. N&#227;o execute essa declara&#231;&#227;o ainda, apenas a leia.</p>
<pre><code xml:id="code_introducao-mysql-r_32" type="block" corresp="code_introducao-mysql-r_32.txt"/></pre>
<table>
<thead>
<tr>
<th>Fun&#231;&#227;o</th>
<th>Significado</th>
</tr>
</thead>
<tbody>
<tr>
<td>dbWriteTable(artigosDb,</td>
<td>Use  a conex&#227;o do banco de dados MySQL artigosDb.</td>
</tr>
<tr>
<td>value = dadosAmostraJardim,</td>
<td>Insere os valores do data frame dadosAmostraJardim para a tabela.</td>
</tr>
<tr>
<td>row.names = FALSE,</td>
<td>Nenhum nome de linha foi especificado.</td>
</tr>
<tr>
<td>name = "tbl_periodicos_resultados_pesquisa",</td>
<td>Insere os valores de dadosAmostraJardim para a tabela tbl_periodicos_resultados_pesquisa</td>
</tr>
<tr>
<td>append = TRUE )</td>
<td>Adiciona os valores ao que j&#225; existe na tabela. Se esse script rodar novamente, todas as linhas em dadosAmostraJardim ser&#227;o adicionadas &#224; mesma tabela novamente.</td>
</tr>
</tbody></table><p>Ainda n&#227;o estamos preparados para executar o comando dbWriteTable(). Primeiro precisamos nos conectar ao banco de dados. Aqui est&#225; o script para fazer isso, assim como para carregar o data frame dados-amostra-submarino.csv. Leia-o e execute-o.</p>
<pre><code xml:id="code_introducao-mysql-r_33" type="block" corresp="code_introducao-mysql-r_33.txt"/></pre>
<p>Se o script for executado mais de uma vez, ser&#227;o gerados registros duplicados. Se isso acontecer, apenas execute o comando TRUNCATE na tabela e execute o script novamente, mas apenas uma vez. &#201; poss&#237;vel verificar se o n&#250;mero de registros &#233; o correto. No MySQL Workbench, execute o seguinte na janela de Query:</p>
<pre><code xml:id="code_introducao-mysql-r_34" type="block" corresp="code_introducao-mysql-r_34.txt"/></pre>
<p>A contagem deve retornar 2880 registros. 1242 de dadosAmostraJardim e 1638 de dadosAmostraSubmarino.</p>
</div><div type="2"><head>Selecionado dados de uma tabela com SQL usando R</head>
<p>Nosso objetivo aqui &#233; usar a tabela de artigos que importamos e criar um gr&#225;fico do n&#250;mero de artigos publicados nos <emph>Welsh Newspapers</emph> (jornais galeses) ao longo de cada m&#234;s da Primeira Guerra Mundial que corresponda aos termos de busca <emph>allotment</emph>(loteamento) e <emph>garden</emph> (jardim), e <emph>German</emph> (alem&#227;o) e <emph>submarine</emph>(submarino).</p>
<p>O script abaixo consulta o banco de dados e produz o gr&#225;fico de linha abaixo. Leia o script e observe o que est&#225; acontecendo. Segue uma explica&#231;&#227;o do script. </p>
<pre><code xml:id="code_introducao-mysql-r_35" type="block" corresp="code_introducao-mysql-r_35.txt"/></pre>
<div type="3"><head>Explica&#231;&#227;o do script de sele&#231;&#227;o de dados e cria&#231;&#227;o do gr&#225;fico.</head>
<p>O m&#233;todo que conecta o banco de dados &#233; explicado <link target="#Conectando-a-um-banco-de-dados-com-uma-senha">acima</link>.</p>
<p>Este script seleciona dois resultados de um conjunto de dados e cria um gr&#225;fico com esses dados. Um dos resultados &#233; a combina&#231;&#227;o dos artigos de peri&#243;dicos com a busca pelos termos "German+Submarine". Eles s&#227;o consultados atrav&#233;s da declara&#231;&#227;o SELECT:</p>
<pre><code xml:id="code_introducao-mysql-r_36" type="block" corresp="code_introducao-mysql-r_36.txt"/></pre>
<table>
<thead>
<tr>
<th>SQL</th>
<th>Significado</th>
</tr>
</thead>
<tbody>
<tr>
<td>SELECT (</td>
<td>SELECT - Seleciona os dados que correspondem &#224; condi&#231;&#227;o na cl&#225;usula WHERE na tabela do banco de dados nomeado .</td>
</tr>
<tr>
<td>COUNT(CONCAT(MONTH(data_publicacao_artigo),' ',YEAR(data_publicacao_artigo)))) as 'count'</td>
<td>Fornece uma contagem do n&#250;mero de artigos publicados que compartilham o mesmo m&#234;s e ano de publica&#231;&#227;o. CONCAT representa a a&#231;&#227;o concatenar,  que cria um &#250;nico valor textual de dois ou mais valores textuais, nesse caso, o m&#234;s e o ano.</td>
</tr>
<tr>
<td>FROM tbl_periodicos_resultados_pesquisa</td>
<td>Este &#233; o banco de dados a partir do qual estamos selecionando os dados.</td>
</tr>
<tr>
<td>GROUP BY YEAR(data_publicacao_artigo),MONTH(data_publicacao_artigo)</td>
<td>Esta declara&#231;&#227;o GROUP BY &#233; importante para a contagem (COUNT) acima. Aqui os dados est&#227;o agrupados por m&#234;s e ano, para que seja poss&#237;vel contar todos os registros no grupo.</td>
</tr>
<tr>
<td>ORDER BY YEAR(data_publicacao_artigo),MONTH(data_publicacao_artigo);</td>
<td>Coloca os resultados ordenados por data, o que &#233; &#250;til j&#225; que queremos construir um gr&#225;fico por data.</td>
</tr>
</tbody></table><p>As declara&#231;&#245;es abaixo executam a consulta e colocam o resultado <emph>rs</emph> num data frame <emph>dbRows</emph>:</p>
<pre><code xml:id="code_introducao-mysql-r_37" type="block" corresp="code_introducao-mysql-r_37.txt"/></pre>
<p>Abaixo, o data frame <emph>dbRows</emph> &#233; colocado numa s&#233;rie temporal com a fun&#231;&#227;o <emph>ts()</emph>, para que seja poss&#237;vel plotar para cada m&#234;s, iniciando de agosto de 1914.</p>
<pre><code xml:id="code_introducao-mysql-r_38" type="block" corresp="code_introducao-mysql-r_38.txt"/></pre>
<p>Abaixo, os dados na s&#233;rie temporal <emph>qts1</emph> s&#227;o plotados num gr&#225;fico:</p>
<pre><code xml:id="code_introducao-mysql-r_39" type="block" corresp="code_introducao-mysql-r_39.txt"/></pre>
<p>O que isso difere da parte do script que gera o gr&#225;fico dos artigos correspondentes &#224; busca dos termos "Allotment And Garden"? N&#227;o muito, definitivamente. Apenas usamos a fun&#231;&#227;o <emph>lines()</emph> para plotar os resultados no mesmo gr&#225;fico que constru&#237;mos acima.</p>
<pre><code xml:id="code_introducao-mysql-r_40" type="block" corresp="code_introducao-mysql-r_40.txt"/></pre>
<div type="4"><head>Resultados da sele&#231;&#227;o de dados e da cria&#231;&#227;o do gr&#225;fico</head>
<p>Aqui abaixo est&#225; o gr&#225;fico que deveria aparecer:</p>
<figure><desc>Plotagem do n&#250;mero de artigos de peri&#243;dicos publicados cada m&#234;s que correspondem aos termos de busca</desc><graphic url="introducao-ao-mysql-e-r-16.png"/></figure>
</div></div></div><div type="2"><head>Indo mais longe com o MySQL</head>
<p>Se deseja colocar um banco de dados num website, uma maneira de faz&#234;-lo &#233; usando MySQL e a linguagem PHP para construir as p&#225;ginas do site. Um exemplo deste tipo de website &#233; o que constru&#237; para <link target="https://perma.cc/237N-DD9E">buscar edi&#231;&#245;es do "the Equity newspaper"</link>. O livro de Larry Ullman's, <emph>PHP and MySQL for Dynamic Web Sites</emph>, aborda como configurar e conectar um banco de dados usando MySQL e PHP de uma maneira resistente &#224; hackers.</p>
<p>Para exemplos do uso de SQL para ordenar e agrupar dados, assim com tamb&#233;m realizar c&#225;lculos, veja: <link target="http://web.archive.org/web/20171228130133/https://www.ntu.edu.sg/home/ehchua/programming/sql/MySQL_Beginner.html">MySQL by Examples for Beginners</link> ou MySQL <link target="https://perma.cc/84HN-9DBL">Examples of Common Queries</link>.</p>
</div><div type="2"><head>Conclus&#227;o</head>
<p>Espero que tenha obtido o conhecimento para configurar uma tabela de banco de dados, conect&#225;-lo e armazenar registros. Embora tenhamos abordado apenas uma pequena parte das diferentes maneiras de realizar consultas nos dados, espero tamb&#233;m que saiba a t&#233;cnica de uso das declara&#231;&#245;es SELECT para que possa utiliz&#225;-las em seus futuros projetos de hist&#243;ria digital.</p>
</div><div type="2"><head>Cr&#233;ditos</head>
<p>Finalizei esta li&#231;&#227;o gra&#231;as ao suporte do <link target="https://perma.cc/S7PP-FY5U">George Garth Graham Undergraduate Digital History Research Fellowship</link>.</p>
<p>Agrade&#231;o &#224; Dr&#170;. Amanda Visconti pelo suporte e orienta&#231;&#227;o ao longo da prepara&#231;&#227;o desta li&#231;&#227;o.</p>
</div><div type="2"><head>Refer&#234;ncias</head>
<p>Ullman, L. 2005. <emph>PHP and MySQL for Dynamic Web Sites, 2nd ed.</emph> Berkeley, Calif: Peachpit.</p>
</div><div type="2"><head>Notas</head>
<p><note id="1"> Jason A. French, "Using R With MySQL Databases," blog (3 July 2014), <link target="https://perma.cc/5VYV-L5PG">http://www.jason-french.com/blog/2014/07/03/using-r-with-mysql-databases/</link>.</note></p>
<p><note id="2"> Taylor Arnold and Lauren Tilton, "Basic Text Processing in R," Programming Historian (27 March 2017), <link target="/pt/licoes/processamento-basico-texto-r">tradu&#231;&#227;o para portugu&#234;s</link>.</note></p>
<p><note id="3"> Taryn Dewar, "R Basics with Tabular Data," Programming Historian (05 September 2016), <link target="/pt/licoes/nocoes-basicas-R-dados-tabulares">tradu&#231;&#227;o para portugu&#234;s</link>.</note></p>
<p>O script em R usado para recolher dados de amostra se encontra <link target="https://perma.cc/87AE-LJRG">aqui</link>.</p>
</div></body>
  </text>
</TEI>
