<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Crear una exposici&#243;n con Omeka</title>
  <authors>Miriam Posner,Megan R. Brett</authors>
  <date>2016-02-24</date>
  <translation_date>2018-04-23</translation_date>
  <editors>Adam Crymble</editors>
  <reviewers>Sheila Brennan</reviewers>
  <translator>Mar&#237;a Jos&#233; Cabra Montes</translator>
  <translation-editor>Jennifer Isasi</translation-editor>
  <translation-reviewer>Joseba Moreno,Jennifer Isasi</translation-reviewer>
  <layout>lesson</layout>
  <original>creating-an-omeka-exhibit</original>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/156</review-ticket>
  <difficulty>1</difficulty>
  <activity>presenting</activity>
  <topics>website</topics>
  <abstract>Ahora que has agregado los art&#237;culos a tu sitio Omeka y los agrupaste por colecciones, est&#225;s listo para el paso siguiente: llevar a tus usuarios a un tour guiado por los art&#237;culos coleccionados.</abstract>
  <avatar_alt>Fotograf&#237;a en blanco y negro de un sal&#243;n con m&#250;ltiples retratos en las paredes</avatar_alt>
  <doi>10.46430/phes0033</doi>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Antes de empezar: mapea tu exposici&#243;n</head>
<p>Es necesario pensar la exposici&#243;n antes de empezar a crearla. Crear&#225;s secciones y p&#225;ginas y, para esto, necesitar&#225;s pensar qu&#233; argumento plasmar y c&#243;mo piensas hacerlo. En la siguiente lecci&#243;n uso el simple ejemplo de mis perros. Pero &#191;qu&#233; pasar&#237;a si trabajara, digamos, el cine mudo? Mis secciones podr&#237;an ser tem&#225;ticas (comedias, romances, dramas), cronol&#243;gicas (primeras pel&#237;culas de cine mudo, periodo de transici&#243;n, era cl&#225;sica) o de estilo (moderno, impresionista, narrativo.) Todo depende del mensaje que quiera transmitir a los visitantes del sitio. Podr&#237;as dibujar un mapa de la exposici&#243;n, mostrando d&#243;nde quieres ubicar cada recurso digital.</p>
</div>
      <div type="2"><head>Agrega tu exposici&#243;n</head>
<figure><desc>Crea una p&#225;gina de exposici&#243;n</desc><graphic url="createoexhibit1.png"/></figure>
<p>Una colecci&#243;n es una simple lista de objetos. Una exposici&#243;n es un recorrido guiado por tus art&#237;culos, complementado con textos descriptivos y dise&#241;os personalizados. Para crear una exposici&#243;n, presiona el bot&#243;n que dice <hi rend="bold">Exhibit</hi> (exposici&#243;n) y <hi rend="bold">Add an exhibit</hi>(a&#241;adir exposici&#243;n). Llena los campos de la parte superior de la p&#225;gina. Un <hi rend="bold">slug</hi> es un nombre de tu exposici&#243;n legible para una m&#225;quina y se convertir&#225; en parte de tu URL.</p>
</div>
      <div type="2"><head>Agrega una p&#225;gina</head>
<p>Las p&#225;ginas son donde vas a pegar los art&#237;culos de tu exposici&#243;n. Una exposici&#243;n puede tener m&#250;ltiples p&#225;ginas y puedes arrastrarlas y soltarlas para reorganizar su orden e incluso hacer que ciertas p&#225;ginas sean subsecciones de otras p&#225;ginas.</p>
<p>Presiona el bot&#243;n verde <hi rend="bold">Add Page</hi> (a&#241;adir p&#225;gina). En la siguiente p&#225;gina ingresar&#225;s cierta informaci&#243;n y escoger&#225;s un dise&#241;o para la exposici&#243;n de tu p&#225;gina.</p>
</div>
      <div type="2"><head>Agrega un bloque de contenido a tu p&#225;gina</head>
<figure><desc>Campos en 'a&#241;adir una p&#225;gina'</desc><graphic url="createoexhibit2.png"/></figure>
<p>En la p&#225;gina siguiente ver&#225;s la opci&#243;n <hi rend="bold">Page Title</hi> (t&#237;tulo de p&#225;gina) y <hi rend="bold">Slug</hi>. Llena dichos campos.</p>
<p>Ver&#225;s la opci&#243;n <hi rend="bold">New Block</hi> (nuevo bloque). Las p&#225;ginas est&#225;n compuestas de bloques, los cuales pueden ser archivos y texto, s&#243;lo archivos o s&#243;lo texto.</p>
<p>Haz click en la opci&#243;n <hi rend="bold">File with Text</hi> (archivo con texto) y despu&#233;s en <hi rend="bold">Add new content block</hi> (a&#241;adir un contenido de bloque nuevo).</p>
</div>
      <div type="2"><head>Agrega contenido a tu bloque de contenido</head>
<figure><desc>A&#241;ade un objeto y un archivo a tu bloque de contenido</desc><graphic url="createoexhibit3.png"/></figure>
<p>En <hi rend="bold">Block 1 (File with Text)</hi> (Bloque 1 (Archivo con texto)) presiona el bot&#243;n <hi rend="bold">Add Item</hi> (a&#241;adir objeto).</p>
<p>En la ventana que se va a abrir, haz click en tu art&#237;culo y luego presiona <hi rend="bold">Select Item</hi> (seleccionar objeto). Puedes agregar un pie de foto si quieres. Presiona el bot&#243;n verde <hi rend="bold">Apply</hi> (aplicar). Tambi&#233;n he agregado un texto de relleno en el campo <hi rend="bold">Text</hi> (texto).</p>
<p>Cuando hayas acabado presiona el bot&#243;n <hi rend="bold">View Public Page</hi> para ver c&#243;mo qued&#243; tu sitio en Omeka.</p>
</div>
      <div type="2"><head>&#161;Tienes una p&#225;gina en Omeka!</head>
<figure><desc>El perro Bertie es un objeto en la exposici&#243;n</desc><graphic url="createoexhibit4.png"/></figure>
<p>Ahora tu sitio tiene art&#237;culos, colecciones y una exposici&#243;n &#8211; &#161;todos los elementos b&#225;sicos de un sitio Omeka!</p>
</div>
    </body>
  </text>
</TEI>
