<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="intro-aux-bots-twitter">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Une introduction aux Bots Twitter avec Tracery</title>
  <author type="original_author">Shawn Graham</author><editor type="reviewers"><persName>Lee Skallerup Bessette</persName><persName>Adam Crymble</persName><persName>Nick Ruest</persName></editor><author type="translators">G&#233;raldine Castel</author><editor type="translation-reviewers"><persName>Antoine Courtin</persName><persName>Sylvain Machefert</persName><persName>Alix Chagu&#233;</persName></editor><editor type="editors">Jessica Parr</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phfr0010</idno><date type="published">08/29/2017</date><date type="translated">05/09/2020</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#intro-to-twitterbots"/>.</p><p>There are other translations: <ref target=""/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Cette le&#231;on explique comment cr&#233;er de simples bots Twitter &#224; l'aide de la grammaire Tracery et du service Cheap Bots Done Quick. Tracery est interop&#233;rable avec plusieurs langages de programmation et peut &#234;tre int&#233;gr&#233;e dans des sites web, des jeux ou des bots.</p></abstract><textClass><keyword xml:lang="en">api</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="fr">
    <body><p class="alert alert-warning" style="alert alert-warning">
L'acc&#232;s &#224; l'API de Twitter a r&#233;cemment chang&#233;. Le niveau gratuit ne permet plus de rechercher et de t&#233;l&#233;charger les donn&#233;es de Twitter. Malheureusement, cela signifie que certains &#233;l&#233;ments de cette le&#231;on ne fonctionneront que pour les personnes qui disposent d&#8217;un acc&#232;s payant &#224; l&#8217;API. Pour l'instant, il n'existe pas de plan d'acc&#232;s sp&#233;cial pour les chercheur&#183;es ou les universitaires. [2023]
</p>
<div type="2"><head>Une introduction aux bots Twitter avec Tracery</head>
<p>Cette le&#231;on explique comment cr&#233;er des bots basiques sur Twitter &#224; l&#8217;aide de la <link target="http://tracery.io">grammaire g&#233;n&#233;rative Tracery</link> et du service <link target="http://cheapbotsdonequick.com/">Cheap Bots Done Quick</link>. Tracery est interop&#233;rable avec plusieurs langages de programmation et peut &#234;tre int&#233;gr&#233;e dans des sites web, des jeux ou des bots. Vous pouvez en faire une copie (fork) sur github <link target="https://github.com/galaxykate/tracery/tree/tracery2">ici</link>.</p>
<div type="3"><head>Pourquoi des bots?</head>
<p>Pour &#234;tre exact, un bot Twitter est un logiciel permettant de contr&#244;ler automatiquement un compte Twitter. Lorsque des centaines de bots sont cr&#233;&#233;s et tweetent plus ou moins le m&#234;me message, ils peuvent fa&#231;onner le discours sur Twitter, ce qui influence ensuite le discours d&#8217;autres m&#233;dias. Des bots de ce type <link target="http://www.sciencedirect.com/science/article/pii/S0747563213003129">peuvent m&#234;me &#234;tre per&#231;us comme des sources cr&#233;dibles d&#8217;information</link>. Des projets tels que <link target="http://www.docnow.io/">Documenting the Now</link> mettent au point des outils qui permettent aux chercheur(e)s de cr&#233;er et d&#8217;interroger des archives de r&#233;seaux sociaux en ligne &#224; propos d&#8217;&#233;v&#233;nements r&#233;cents qui comprennent tr&#232;s probablement un bon nombre de messages g&#233;n&#233;r&#233;s par des bots. Dans ce tutoriel, je veux montrer comment construire un bot Twitter basique afin que des historiens et des historiennes, ayant connaissance de leur fonctionnement, puissent plus facilement les rep&#233;rer dans des archives et, peut-&#234;tre, m&#234;me les neutraliser gr&#226;ce &#224; leurs propres bots.</p>
<p>Mais je crois aussi qu&#8217;il y a de la place en histoire et dans les humanit&#233;s num&#233;riques de fa&#231;on plus large pour un travail cr&#233;atif, expressif, voire artistique. Les historiens et les historiennes qui connaissent la programmation peuvent profiter des possibilit&#233;s offertes par les m&#233;dias num&#233;riques pour monter des cr&#233;ations, autrement impossibles &#224; r&#233;aliser pour nous &#233;mouvoir, nous inspirer, nous interpeller. Il y a de la place pour de la satire, il y a de la place pour commenter. Comme Mark Sample, je crois qu&#8217;il y a besoin de &#171; <link target="https://medium.com/@samplereality/a-protest-bot-is-a-bot-so-specific-you-cant-mistake-it-for-bullshit-90fe10b7fbaa">bots de conviction</link>&#187;.
Ce sont des bots de contestation, des bots si pointus et pertinents, qu&#8217;il devient impossible de les prendre pour autre chose par erreur. Selon Sample, il faudrait que de tels bots soient:</p>
<ul>
<li>
<p><hi rend="bold">d&#8217;actualit&#233;</hi>: &#171; Ils traitent les informations du matin et les horreurs qui ne font pas la une des journaux &#187;.</p>
</li>
<li>
<p><hi rend="bold">factuels</hi>: &#171; Ils s&#8217;appuient sur de la recherche, des statistiques, des tableurs, des bases de donn&#233;es. Les bots n&#8217;ont pas de subconscient. S&#8217;ils utilisent des images, elles sont &#224; prendre au pied de la lettre &#187;.</p>
</li>
<li>
<p><hi rend="bold">cumulatifs</hi>: &#171; La r&#233;p&#233;tition s&#8217;auto-alimente, le bot reprend le m&#234;me air encore et encore, imperturbable et in&#233;branlable, empilant les d&#233;bris sur nos &#233;crans &#187;.</p>
</li>
<li>
<p><hi rend="bold">partisans</hi>: &#171; Les bots de contestation sont engag&#233;s. La soci&#233;t&#233; &#233;tant ce qu&#8217;elle est, ce parti pris sera probablement mal vu, peut-&#234;tre m&#234;me d&#233;stabilisant &#187;.</p>
</li>
<li>
<p><hi rend="bold">d&#233;routants</hi>:&#171; La r&#233;v&#233;lation de ce que nous voulions dissimuler &#187;.</p>
</li>
</ul>
<p>J'aimerais voir plus de bots de contestation, des bots nous pla&#231;ant face &#224; des v&#233;rit&#233;s implacables et qui, dans leur pers&#233;v&#233;rance d&#233;pourvue d'humanit&#233;, r&#233;clament justice. <link target="https://twitter.com/Every3Minutes"><emph>Every 3 minutes</emph></link> de Caleb McDaniel nous fait honte en nous rappelant sans cesse que toutes les trois minutes, un &#234;tre humain &#233;tait vendu en esclavage dans le Sud des &#201;tats-Unis avant la guerre civile.</p>
<figure><desc>Capture d'&#233;cran de la page Twitter du bot Every3Minutes</desc><graphic url="bot-lesson-every3minutes.png"/></figure>
<p><emph>&#192; lui tout seul, every3minutes justifie la cr&#233;ation d&#8217;un bot en histoire</emph>.</p>
<p>Pour entamer la r&#233;flexion, voici quelques suggestions de personnes qui m&#8217;ont r&#233;pondu sur Twitter lorsque j&#8217;ai demand&#233; &#224; quoi pourraient ressembler des bots de conviction en histoire et arch&#233;ologie:</p>
<blockquote>
<ul>
<li>un bot qui tweeterait des images en haute r&#233;solution issues du patrimoine culturel rendues inaccessibles par des visionneuses en mosa&#239;que et des appropriations de droits d&#8217;auteur frauduleuses de la part des institutions o&#249; elles se trouvent&#160;?
&#8212; Ryan Baumann (@ryanfb) 22 avril 2017</li>
</ul>
</blockquote>
<blockquote>
<ul>
<li>un bot qui tweeterait des images de lieux sacr&#233;s am&#233;rindiens profan&#233;s au nom de la cupidit&#233; des entreprises.
&#8212; Cory Taylor (@CoryTaylor_) 22 avril 2017</li>
</ul>
</blockquote>
<blockquote>
<ul>
<li>un bot qui r&#233;f&#233;rencerait les actifs historiques b&#233;n&#233;ficiant d&#8217;une exemption d&#8217;imp&#244;t sur la succession car suppos&#233;s &#234;tre &#171;&#160;accessibles&#160;&#187; au public
&#8212; Sarah Saunders (@Tick_Tax) 22 avril 2017</li>
</ul>
</blockquote>
<blockquote>
<ul>
<li>un bot qui tweeterait le nom d&#8217;esclaves ayant appartenu &#224; des universit&#233;s prestigieuses ou ayant particip&#233; &#224; la construction de b&#226;timents gouvernementaux tels que la Maison blanche.
&#8212; Cory Taylor (@CoryTaylor_) 22 avril 2017</li>
</ul>
</blockquote>
<blockquote>
<ul>
<li>&#224; chaque fois que quelqu&#8217;un dirait &#171;&#160;depuis la nuit des temps, les humains ont&#160;&#187;, un bot qui r&#233;pondrait automatiquement CONNERIES.
&#8212; Colleen Morgan (@clmorgan) 22 avril 2017</li>
</ul>
</blockquote>
<blockquote>
<ul>
<li>un bot qui imaginerait la r&#233;action d&#8217;Afghans, d&#8217;Irakiens, de Syriens, de Y&#233;m&#233;nites lorsque des membres de leur famille sont tu&#233;s dans des attaques de drones.
&#8212; Cory Taylor (@CoryTaylor_) 22 avril 2017</li>
</ul>
</blockquote>
<p>Dans la mesure o&#249; beaucoup de donn&#233;es historiques en ligne sont disponibles en format <link target="http://json.org/">JSON</link>, en cherchant un peu, vous devriez en trouver &#224; utiliser avec votre bot.</p>
<p>Ma m&#233;thode est celle du bricoleur qui adapte et assemble des morceaux de code trouv&#233;s ici et l&#224;. En v&#233;rit&#233;, la programmation fonctionne en grande partie comme &#231;a. Il existe beaucoup de logiciels pour interagir avec l&#8217;API (<emph>Application Programming Interface</emph> soit l'interface de programmation d'application) de Twitter. Dans cette le&#231;on, il y aura peu de &#171; programmation &#187;: les bots ne seront pas &#233;crits en Python, par exemple. Dans cette le&#231;on d&#8217;introduction, je vais vous montrer comment construire un bot qui raconte des histoires, qui compose de la po&#233;sie, qui fait des choses merveilleuses &#224; l&#8217;aide de <link target="http://tracery.io/">Tracery.io</link> comme <emph>grammaire g&#233;n&#233;rative</emph> et du service Cheap Bots Done Quick comme h&#233;bergeur du bot. Pour davantage de tutoriels pour apprendre &#224; construire et h&#233;berger des bots Twitter sur d&#8217;autres services, voir <link target="https://botwiki.org/tutorials/twitterbots/">la liste de tutoriels de Botwiki</link> (en anglais).</p>
<p>Celui de mes bots qui a connu le plus de succ&#232;s est <link target="http://twitter.com/tinyarchae">@tinyarchae</link>, un bot qui tweete des sc&#232;nes de dysfonctionnements au sein d&#8217;un horrible projet d&#8217;excavation arch&#233;ologique. Tout projet arch&#233;ologique est confront&#233; &#224; des probl&#232;mes de sexisme, d&#8217;insultes, de mauvaise foi. Ainsi, @tinyarchae prend tout ce qui se murmure dans les colloques et le pousse &#224; l&#8217;extr&#234;me. C&#8217;est, en r&#233;alit&#233;, une caricature qui comporte une part de v&#233;rit&#233; embarrassante. D&#8217;autres bots que j&#8217;ai construits d&#233;tournent de la <link target="https://twitter.com/archaeoglitch">photographie arch&#233;ologique</link>; l&#8217;un est m&#234;me utile puisqu&#8217;il <link target="https://twitter.com/botarchaeo">annonce la sortie de nouveaux articles de revues en arch&#233;ologie</link> et fait donc office d&#8217;assistant de recherche. Pour plus de r&#233;flexions sur le r&#244;le jou&#233; par les bots en arch&#233;ologie publique, voir ce <link target="https://electricarchaeology.ca/2017/04/27/bots-of-archaeology-machines-writing-public-archaeology/">discours inaugural</link> tir&#233; du <link target="http://web.archive.org/web/20180131161516/https://publicarchaeologyconference.wordpress.com/">colloque Twitter sur l&#8217;arch&#233;ologie publique</link>).</p>
</div></div><div type="2"><head>Pr&#233;paration : que fera votre bot&#160;?</head>
<p>Commen&#231;ons avec un bloc-notes et du papier. &#192; l'&#233;cole primaire, une activit&#233; que nous faisions souvent pour apprendre les bases de la grammaire anglaise s'appelait &#171; mad-libs &#187; (des improvisations un peu folles). L'enseignant en charge de l&#8217;activit&#233; demandait par exemple &#224; la classe de donner un nom, puis un adverbe, puis un verbe, puis un autre adverbe. Puis, de l'autre c&#244;t&#233; de la feuille, il y avait une histoire avec des espaces vides du type :</p>
<p>"Susie la _nom_ &#233;tait _adverbe_ mais elle _verbe_ _adverbe_."</p>
<p>et les &#233;l&#232;ves remplissaient les blancs comme demand&#233;. C'&#233;tait un peu b&#234;te et, surtout, c'&#233;tait amusant. Les Twitterbots sont &#224; ce type d'improvisation ce que les voitures de sport sont aux attelages de chevaux. Les blancs &#224; remplir pourraient, par exemple, &#234;tre des valeurs dans des graphiques vectoriels svg. Il pourrait s'agir de nombres dans des noms de fichiers num&#233;riques (et donc de liens al&#233;atoires vers une base de donn&#233;es ouverte, par exemple). Cela pourrait m&#234;me &#234;tre des noms et des adverbes. Comme les bots Twitter vivent sur le web, les blocs de construction &#224; assembler peuvent &#234;tre autre chose que du texte, m&#234;me si, pour l'instant, le texte est le plus facile &#224; utiliser.</p>
<p>Nous allons commencer par esquisser une <emph>grammaire de remplacement</emph>. Cette grammaire s&#8217;appelle <link target="http://tracery.io">Tracery.io</link> et ses conventions ont &#233;t&#233; d&#233;velopp&#233;es par Kate Compton (<link target="https://twitter.com/galaxykate">@galaxykate</link> sur Twitter). Elle s&#8217;utilise comme une biblioth&#232;que <link target="https://fr.wikipedia.org/wiki/JavaScript">javascript</link> dans des pages web, des jeux, et des bots. Une grammaire de remplacement fonctionne en grande partie comme les improvisations ci-dessus.</p>
<p>Afin de clarifier d'abord ce que fait la <emph>grammaire</emph>, nous n'allons <emph>pas</emph> cr&#233;er un bot en histoire pour l'instant. &#925;ous allons plut&#244;t construire quelque chose de surr&#233;aliste pour montrer comment cette grammaire fonctionne.
Imaginons que vous souhaitiez cr&#233;er un bot qui parle avec la voix d'une plante en pot. Que pourrait-il bien dire ce bot que nous appelerons tout simplement <emph>PlanteEnPot</emph>? Notez quelques id&#233;es.</p>
<ul>
<li>Je suis une plante en pot. C&#8217;est vraiment ennuyeux !</li>
<li>S'il vous pla&#238;t, arrosez-moi. Je vous en supplie.</li>
<li>Ce pot. Il est si petit. Mes racines sont tellement &#224; l'&#233;troit !</li>
<li>Je me suis tourn&#233;e vers le soleil. Mais ce n'&#233;tait qu'une ampoule.</li>
<li>Je suis si seule. O&#249; sont toutes les abeilles ?</li>
</ul>
<p>Voyons maintenant comment ces phrases ont &#233;t&#233; construites. Nous allons remplacer les mots et les phrases par des variables, que nous appelerons des <emph>symboles</emph>, afin de pouvoir reg&#233;nerer les phrases d&#8217;origine. Plusieurs phrases commencent par &#171; je &#187;, cr&#233;ons donc un <emph>symbole</emph> "&#234;tre" pour pr&#233;ciser un &#233;tat ou une action pour le sujet:</p>
<pre><code xml:id="code_intro-aux-bots-twitter_0" type="block" corresp="code_intro-aux-bots-twitter_0.txt"/></pre>
<p>Cette configuration nous dit que le symbole "&#234;tre" peut correspondre aux expressions "suis une plante", "vous en supplie" et ainsi de suite.</p>
<p>Nous pouvons m&#233;langer les symboles et du texte dans notre bot. Si nous configurons le bot de mani&#232;re que les phrases commencent par le mot &#171; je &#187;  nous pouvons ins&#233;rer le <emph>symbole</emph> "&#234;tre" apr&#232;s celui-ci et compl&#233;ter ainsi la phrase par "suis une plante" ou "me suis tourn&#233;e". La phrase reste ainsi <emph>grammaticalement</emph> correcte. Construisons un autre symbole et appelons le, pourquoi pas, "endroit" :</p>
<pre><code xml:id="code_intro-aux-bots-twitter_1" type="block" corresp="code_intro-aux-bots-twitter_1.txt"/></pre>
<p>("endroit" est le <emph>symbole</emph> (notre variable) et "dans un pot" etc&#8230; sont les <emph>r&#232;gles</emph> (les valeurs de la variable) qui le remplacent)</p>
<p>Dans les phrases de notre brainstorming, nous n'avons jamais utilis&#233; l'expression "sur le bord de la fen&#234;tre", mais une fois que nous avons identifi&#233; "dans un pot", d'autres &#233;quivalences possibles surgissent. Notre bot va par la suite utiliser ces <emph>symboles</emph> pour faire des phrases. Les symboles - dans notre cas: "&#234;tre" et "endroit" - sont comme nos improvisations de type madlib o&#249; il fallait une liste de noms, d'adverbes et ainsi de suite. Imaginons alors transmettre &#224; notre bot l&#8217;expression suivante&#160;:</p>
<pre><code xml:id="code_intro-aux-bots-twitter_2" type="block" corresp="code_intro-aux-bots-twitter_2.txt"/></pre>
<p>Les r&#233;sultats possibles seront :</p>
<ul>
<li>Je me sens si seule sur le bord de la fen&#234;tre.</li>
<li>Je me sens si seule dans un pot.</li>
<li>Je me suis tourn&#233;e vers le soleil.</li>
</ul>
<p>En bricolant, et en d&#233;composant les unit&#233;s d'expression en symboles plus petits et pr&#233;cis, on peut corriger toute maladresse d'expression - ou alors d&#233;cider de les laisser pour rendre la voix du bot plus &#171; authentique &#187;.</p>
<div type="3"><head>Prototypage &#224; l&#8217;aide d&#8217;un &#233;diteur Tracery</head>
<p>Pour rectifier les imperfections du bot <emph>PlanteEnPot</emph>, nous avons utilis&#233; l'&#233;diteur Tracery de Brightspiral, qui n'existe malheureusement plus. Vous pouvez pourtant essayer un &#233;diteur alternatif, tel que <link target="https://tracery.io/editor/">https://tracery.io/editor/</link>. L'&#233;diteur visualise la fa&#231;on dont les symboles et les r&#232;gles de la grammaire interagissent, &#224; savoir la mani&#232;re dont ils sont imbriqu&#233;s et le type de r&#233;sultats que votre grammaire va g&#233;n&#233;rer. Si vous ouvrez l'&#233;diteur dans une nouvelle fen&#234;tre, vous devriez voir &#231;a :</p>
<figure><desc>L'&#233;diteur Tracery sur Brightspiral.com</desc><graphic url="bot-lesson-editor.png"/></figure>
<p>Le menu d&#233;roulant en haut &#224; gauche, marqu&#233; <code type="inline">tinygrammar</code>, contient d'autres exemples de grammaires que l'on peut explorer ; ils montrent &#224; quel point Tracery peut devenir complexe. Pour l'instant, conservez <code type="inline">tinygrammar</code>. L'un des avantages de cet &#233;diteur est que vous pouvez appuyer sur le bouton <code type="inline">show colors</code> (<emph>Afficher les couleurs</emph>), qui va attribuer une couleur &#224; chaque symbole et ses r&#232;gles, en codant par couleur le texte g&#233;n&#233;r&#233; afin que vous puissiez voir quel &#233;l&#233;ment appartient &#224; quel symbole.</p>
<p>Si vous double-cliquez sur un symbole dans la grammaire par d&#233;faut, par exemple <code type="inline">name</code> (<emph>nom</emph>) ou <code type="inline">occupation</code> (<emph>profession</emph>), et que vous appuyez sur la touche <hi rend="bold">Supprimer</hi> de votre clavier, vous enl&#232;verez ce symbole de la grammaire. Faites-le pour <code type="inline">name</code> (<emph>nom</emph>) et <code type="inline">occupation</code> (<emph>profession</emph>), en ne laissant que <code type="inline">origin</code>(<emph>origine</emph>). Maintenant, ajoutez un nouveau symbole en cliquant sur le bouton <code type="inline">new symbol</code>(<emph>nouveau symbole</emph>). Cliquez sur le titre (<code type="inline">symbol1</code>) et renommez-le <code type="inline">&#234;tre</code>. Ensuite, cliquez sur le signe <code type="inline">+</code>et ajoutez certaines de nos r&#232;gles ci-dessus. R&#233;p&#233;tez l'op&#233;ration pour un nouveau symbole appel&#233; <code type="inline">endroit</code>.</p>
<figure><desc>Construction de la grammaire pour le bot PlanteEnPot</desc><graphic url="bot-lesson-plantbot-fr.png"/></figure>
<p>&#192; ce moment-l&#224;, l'&#233;diteur affichera un message d'erreur en haut &#224; droite, <code type="inline">ERROR: symbol 'name' not found in tinygrammar</code>(<emph>ERREUR : le symbole <code type="inline">name</code> n'a pas &#233;t&#233; trouv&#233; dans tinygrammar</emph>). C'est parce que nous avons d&#233;j&#224; supprim&#233; <code type="inline">name</code>, mais que ce symbole-l&#224; est aussi pr&#233;sent comme l'une une des r&#232;gles du symbole <code type="inline">origin</code>! C'est int&#233;ressant, car cela nous montre que nous pouvons <emph>imbriquer</emph> des symboles dans des r&#232;gles. Nous pourrions par exemple avoir un symbole appel&#233; <code type="inline">character</code>(<emph>personnage</emph>), combinant des sous-symboles nomm&#233;s <code type="inline">first name</code> (<emph>pr&#233;nom</emph>), <code type="inline">last name</code> (<emph>nom de famille</emph>) et <code type="inline">occupation</code> (<emph>profession</emph>), et chacun de ces sous-symboles contiendrait comme <emph>r&#232;gles</emph> une liste de pr&#233;noms, noms et professions. Chaque fois que la grammaire serait ex&#233;cut&#233;e, vous obtiendriez par exemple &#171; Shawn Graham arch&#233;ologue &#187; stock&#233; dans le symbole <code type="inline">character</code> (<emph>personnage</emph>).</p>
<p>Une autre chose int&#233;ressante ici, c'est que le symbole <code type="inline">origin</code> joue un r&#244;le sp&#233;cial, puisqu'il g&#233;n&#232;re au final le texte (la grammaire est ici <emph>aplatie</emph>). Changeons donc les r&#232;gles &#224; l'int&#233;rieur de ce symbole pour que notre bot <emph>PlanteEnPot</emph> puisse enfin parler. (Attention, lorsque vous utilisez d'autres symboles comme r&#233;gles &#224; l'int&#233;rieur d'un symbole donn&#233;, vous devez les entourer de croisillons <code type="inline">#</code>; ici donc vous obtiendrez: <code type="inline">#&#234;tre# #endroit#</code>).</p>
<p>Toutefois, il manque encore quelque chose: le mot &#171; je &#187;. Vous savez qu'il est posible de combiner du texte ordinaire avec les r&#232;gles, faites-le donc maintenant: appuyez sur le <code type="inline">+</code> &#224; c&#244;t&#233; des r&#232;gles &#224; l'int&#233;rieur du symbole <code type="inline">origin</code> et ins&#233;rez le mot <emph>je</emph>. Ainsi, le symbole <code type="inline">origin</code> affiche maintenant <code type="inline">Je #&#234;tre# #endroit#</code>. Peut-&#234;tre que votre bot parlerait m&#234;me avec une diction plus po&#233;tique en utilisant la combinaison inverse <code type="inline">#endroit# #&#234;tre#</code>.</p>
<p>Si vous appuyez sur <code type="inline">save</code>(<emph>Enregistrer</emph>) dans l'&#233;diteur, votre grammaire sera horodat&#233;e et appara&#238;tra dans la liste d&#233;roulante des grammaires. Elle sera sauvegard&#233;e dans le cache de votre navigateur, sachant que, si vous videz le cache, vous la perdrez.</p>
<p>Avant de poursuivre, il y a une derni&#232;re chose &#224; examiner. En cliquant sur le bouton <code type="inline">JSON</code>de l'&#233;diteur, vous devriez voir quelque chose comme &#231;a :</p>
<pre><code class="language-JSON" xml:id="code_intro-aux-bots-twitter_3" type="block" corresp="code_intro-aux-bots-twitter_3.txt"/></pre>
<p>Chaque grammaire Tracery est en r&#233;alit&#233; un objet <link target="https://fr.wikipedia.org/wiki/JavaScript_Object_Notation">JSON</link> compos&#233; de paires cl&#233;/valeur, ce que Tracery appelle de son c&#244;t&#233; symboles et r&#232;gles. JSON est le format que nous utiliserons lorsque nous configurerons notre bot pour commencer &#224; tweeter. Pour en savoir plus, vous pouvez consulter <link target="/en/lessons/json-and-jq">ce tutoriel de Matthew Lincoln</link> (en anglais). Sachez que le format JSON est tatillon, notez donc bien que les symboles sont entour&#233;s de <code type="inline">"</code>, tout comme les r&#232;gles, sauf que ces derni&#232;res sont en plus &#233;num&#233;r&#233;es par des crochets <code type="inline">[</code> et <code type="inline">]</code>. Gardez &#224; l'esprit ce sch&#233;ma:</p>
<pre><code class="language-JSON" xml:id="code_intro-aux-bots-twitter_4" type="block" corresp="code_intro-aux-bots-twitter_4.txt"/></pre>
<p>Bien s&#251;r, le nombre de symboles et de r&#232;gles est sans importance, mais veillez &#224; ce que les virgules soient plac&#233;es correctement !</p>
<p>C'est une bonne pratique de copier ce JSON dans un &#233;diteur de texte et d'enregistrer une copie dans un r&#233;pertoire p&#233;renne.</p>
</div><div type="3"><head>Mais &#224; quoi pourrait bien ressembler un bot historique ?</head>
<p>Maintenant, refaites l'exercice ci-dessus, mais r&#233;fl&#233;chissez bien &#224; ce &#224; quoi pourrait ressembler un bot en histoire &#233;tant donn&#233; les contraintes de Tracery. Construisez une grammaire simple pour exprimer cette id&#233;e et veillez &#224; bien la sauvegarder. Voici d'autres &#233;l&#233;ments &#224; prendre en compte lors de la conception de votre grammaire :</p>
<p>La s&#233;rendipit&#233; peut rendre les bots Twitter amusants, car les tweets se placent au hasard entre d&#8217;autres tweets sur un fil d&#8217;actualit&#233; (il vous faut suivre votre propre bot, pour garder un &#339;il sur ce qu&#8217;il fait):</p>
<figure><desc>Maniacallaughbot a encore gagn&#233;</desc><graphic url="bot-lesson-maniacallaughbot.jpg"/></figure>
<p>N'oubliez pas que votre bot appara&#238;tra sur le fil d'autres personnes. Le potentiel de juxtaposition du ou des messages de votre bot avec les tweets d'autres personnes influencera &#233;galement le succ&#232;s relatif du bot.</p>
<figure><desc>Une interaction avec Tinyarchae occasionne des r&#233;flexions m&#233;lancoliques</desc><graphic url="bot-lesson-interaction-with-tinyarchae.png"/></figure>
</div></div><div type="2"><head>Cr&#233;ez un compte Twitter pour votre bot et connectez-le &#224; Cheap Bots Done Quick</head>
<p>Vous pouvez certes associer un bot &#224; votre propre compte Twitter. Toutefois, si vous ne voulez pas qu'un bot tweete <emph>en votre_nom</emph> ou <emph>pour vous</emph>, cr&#233;ez un nouveau compte Twitter. Pour ce faire, Twitter vous demande une adresse e-mail. Vous pouvez utiliser une nouvelle adresse ou, si vous avez un compte Gmail, vous pouvez utiliser l'astuce <code type="inline">+tag</code>, c'est-&#224;-dire qu'au lieu de <code type="inline">nomdecompte</code> sur @gmail, vous utilisez <code type="inline">nomdecompte+twitterbot</code> sur @gmail. Twitter l&#8217;acceptera comme une adresse &#233;lectronique distincte de votre adresse habituelle.</p>
<p>Normalement, quand on construit un bot Twitter, il faut cr&#233;er <link target="https://developer.twitter.com/">une application sur Twitter en tant que d&#233;veloppeur ou d&#233;veloppeuse</link>), obtenir les cl&#233;s d'acc&#232;s d'utilisateur/utilisatrice de l'API (Application Programming Interface, il s'agit de l'interface de programmation applicative), ainsi que le <emph>token</emph> (jeton). Ensuite, il faudrait programmer l'authentification pour que Twitter sache que le programme essayant d'acc&#233;der &#224; la plate-forme est autoris&#233;.</p>
<p>Heureusement, nous n'avons pas &#224; faire tout cela, puisque George Buckenham a cr&#233;&#233; le site d'h&#233;bergement de bot <link target="http://cheapbotsdonequick.com/">Cheap Bots Done Quick</link> (ce site web montre &#233;galement la grammaire source en JSON pour un certain nombre de bots diff&#233;rents, ce qui peut vous donner des id&#233;es). Une fois que vous avez cr&#233;&#233; le compte Twitter de votre bot et que vous y &#234;tes connect&#233;, allez sur Cheap Bots Done Quick et cliquez sur le bouton <code type="inline">Sign in with Twitter</code>(<emph>Connexion avec Twitter</emph>). Le site vous redirigera vers Twitter pour approuver l'autorisation, puis vous ram&#232;nera &#224; Cheap Bots Done Quick.</p>
<p>Le JSON qui d&#233;crit votre bot peut &#234;tre r&#233;dig&#233; ou coll&#233; dans la case blanche principale qui se trouve en bas. Copiez le script que vous avez pr&#233;par&#233; dans Tracery depuis votre &#233;diteur de texte et collez-le dans la case blanche principale. S'il y a des erreurs dans votre JSON, la fen&#234;tre de r&#233;sultat en bas deviendra rouge et le site essaiera de vous indiquer ce qui pose probl&#232;me. Dans la plupart des cas, ce sera &#224; cause d'une virgule ou d'un guillemet erron&#233;s ou &#233;gar&#233;s. Si vous cliquez sur le bouton d'actualisation &#224; droite de la fen&#234;tre de r&#233;sultat (attention, il n'est PAS question ici du bouton d'actualisation de votre navigateur!), le site va g&#233;n&#233;rer un nouveau texte &#224; partir de votre grammaire.</p>
<figure><desc>L'interface du site Cheap Bots, Done Quick</desc><graphic url="bot-lesson-cbdq-fr.png"/></figure>
<p>Sous la fen&#234;tre blanche qui accueille notre JSON se trouvent quelques param&#232;tres qui d&#233;terminent la fr&#233;quence &#224; laquelle votre bot tweetera, s'il r&#233;pondra ou non aux messages ou mentions le cas &#233;ch&#233;ant, enfin si votre grammaire source sera visible pour les autres:</p>
<figure><desc>Les param&#232;tres de votre bot</desc><graphic url="bot-lesson-settings-fr.png"/></figure>
<p>Configurez ces param&#232;tres selon vos pr&#233;f&#233;rences. Ensuite, c'est le moment de v&#233;rit&#233;! Appuyez sur le bouton <code type="inline">Tweet</code>, puis allez v&#233;rifier le flux Twitter de votre bot. Si tout se pr&#233;sente bien, cliquez sur <code type="inline">Save</code> (<emph>Enregistrer</emph>).</p>
<p>F&#233;licitations, vous venez de configurer un bot Twitter!</p>
<div type="3"><head>Code de bonne conduite</head>
<p>Cheap Bots Done Quick est un service fourni par George Buckenham dans un esprit de bonne volont&#233;. N'utilisez donc pas ce service pour cr&#233;er des bots offensants ou injurieux ou qui pourraient g&#226;cher le service pour tout autre utilisateur. Comme le cr&#233;ateur du service l'&#233;crit,</p>
<blockquote>
<p>Si vous cr&#233;ez un bot que je juge spammeux, injurieux ou d&#233;sagr&#233;able d'une mani&#232;re ou d'une autre (par exemple, en @mentionnant des personnes qui n'ont pas donn&#233; leur consentement, en publiant des insultes ou en prof&#233;rant des calomnies), je le retirerai.</p>
</blockquote>
<p>Darius Kazemi, l'un des grands artistes du bot, fournit davantage de conseils en mati&#232;re de bonnes mani&#232;res concernant les bots <link target="http://tinysubversions.com/2013/03/basic-twitter-bot-etiquette/">ici</link>.</p>
</div></div><div type="2"><head>Aller plus loin avec Tracery</head>
<p>Ce que nous avons d&#233;crit ici est suffisant pour vous permettre de vous lancer. Toutefois, beaucoup de bots sont plus compliqu&#233;s que cela et il est possible d'en cr&#233;er qui sont &#233;tonnamment efficaces en utilisant Tracery.</p>
<div type="3"><head>Changer des symboles</head>
<p>Tracery peut &#234;tre configur&#233; pour mettre les mots au pluriel ou en majuscules. Cela signifie, en r&#233;alit&#233;, que vous pouvez fournir le mot de base dans une r&#232;gle, puis ajouter des modificateurs le cas &#233;ch&#233;ant. Prenez par exemple:</p>
<pre><code xml:id="code_intro-aux-bots-twitter_5" type="block" corresp="code_intro-aux-bots-twitter_5.txt"/></pre>
<p>Les modificateurs <code type="inline">.capitalize</code> et <code type="inline">.s</code> sont ajout&#233;s &#224; l'int&#233;rieur du <code type="inline">#</code> du symbole qu'ils sont destin&#233;s &#224; modifier. D'autres modificateurs sont <code type="inline">.ed</code>pour le pass&#233;, et <code type="inline">.a</code> pour a/an. Il y en a peut-&#234;tre plus, car Tracery est en cours de d&#233;veloppement.</p>
<p><emph>N.D.L.R.: Cet exemple est adapt&#233; &#224; l'anglais, nous avons n&#233;anmoins opt&#233; pour le pr&#233;senter tel quel afin de d&#233;montrer les possibilit&#233;s de Tracery, dont les fonctionnalit&#233;s peuvent &#234;tre d&#233;velopp&#233;es selon les besoins d'une langue. Pour l'instant, les fonctionnalit&#233;s les plus subtiles sont d&#233;velopp&#233;es dans des contextes anglophones, elles sont donc plus adapt&#233;es aux r&#232;gles de grammaire et de syntaxe de l'anglais.</emph>  </p>
</div><div type="3"><head>Utiliser des emoji</head>
<p>Les emojis peuvent &#234;tre utilis&#233;s avec beaucoup d'efficacit&#233; dans des bots Twitter. Vous pouvez copier et coller des emojis directement dans l'&#233;diteur Cheap Bots Done Quick, en les pla&#231;ant chacun entre guillemets comme toute autre valeur qui vous sert de r&#232;gle. Utilisez <link target="http://unicode.org/emoji/charts/full-emoji-list.html">cette liste</link> pour rep&#233;rer les emojis que vous souhaitez utiliser, en veillant &#224; les copier/coller depuis la colonne Twitter pour vous assurer qu'ils vont bien s'afficher.</p>
</div><div type="3"><head>R&#233;utilisation de symboles g&#233;n&#233;r&#233;s avec la fonctionnalit&#233; action</head>
<p>Cette fonctionnalit&#233; ne serait probablement pas tr&#232;s utile dans le cas d'un bot Twitter, qui par d&#233;finition produit du texte court. Mais lorsqu'il s'agit de g&#233;n&#233;rer du texte plus long, par exemple une histoire ou un po&#232;me, cette fonctionnalit&#233; peut &#234;tre employ&#233;e pour que Tracery retienne la premi&#232;re fois qu'une r&#232;gle particuli&#232;re a &#233;t&#233; affect&#233;e &#224; un symbole. Ainsi, nous pourrions faire en sorte que la m&#234;me valeur soit toujours utilis&#233;e lors de chaque appel suivant de <code type="inline">creature</code>. C'est ce que Tracery appelle une &#171;&#160;action&#160;&#187;. La convention est #[uneAction]unSymbole#. Toutefois, cette fonctionnalit&#233; reste en cours de d&#233;veloppement et peut pr&#234;ter &#224; confusion. Vous pouvez n&#233;anmoins voir comment elle fonctionne, si vous copiez-collez le JSON ci-dessous dans cet &#233;diteur Tracery de Beau Gunderson : <link target="https://beaugunderson.com/tracery-writer/">https://beaugunderson.com/tracery-writer/</link> (veiller &#224; s&#233;lectionner et &#224; supprimer le texte qui s'affiche par d&#233;faut). L'&#233;diteur Tracery utilis&#233; pr&#233;c&#233;demment ne g&#232;re pas tr&#232;s bien la sauvegarde des donn&#233;es, donc cette alternative-ci constitue un meilleur outil pour nos besoins actuels.</p>
<pre><code class="language-JSON" xml:id="code_intro-aux-bots-twitter_6" type="block" corresp="code_intro-aux-bots-twitter_6.txt"/></pre>
<p>Un autre exemple un peu plus complexe est le num&#233;ro 5 sur le site du tutoriel de Kate Compton &#224; l'adresse <link target="http://www.crystalcodepalace.com/traceryTut.html">http://www.crystalcodepalace.com/traceryTut.html</link> :</p>
<pre><code class="language-JSON" xml:id="code_intro-aux-bots-twitter_7" type="block" corresp="code_intro-aux-bots-twitter_7.txt"/></pre>
<p>Tracery lit le symbole <code type="inline">origin</code> (<emph>N.D.L.R.: si vous travaillez sur un exemple en fran&#231;ais, ce qui est tout &#224; fait possible, veillez &#224; ne pas traduire ce symbole; vous gardez donc bien <code type="inline">origin</code>, car sinon il ne sera pas reconnu et le code ne fonctionnera pas</emph>), et avant d'arriver au symbole <code type="inline">story</code>, il voit une action appel&#233;e <code type="inline">hero</code> qu'il d&#233;finit &#224; partir du symbole <code type="inline">name</code>. Il fait la m&#234;me chose pour <code type="inline">heroPet</code> &#224; partir d'<code type="inline">animal</code>. Avec ces ensembles, il lit alors l&#8217;histoire d&#233;finie dans la variable <code type="inline">story</code>. Dans <code type="inline">story</code> le symbole <code type="inline">hero</code> lit ce qui vient d'&#234;tre d&#233;fini par l'action, et retourne la m&#234;me valeur &#224; chaque fois. Donc, si 'Yuuma' a &#233;t&#233; s&#233;lectionn&#233; par l'action, l'histoire dira <code type="inline">Yuuma traveled with her pet [nom d'animal] Yuuma was never [variable d'humeur]</code> (<emph><code type="inline">Yuuma a voyag&#233; avec son animal de compagnie.... Yuuma n'a jamais...</code></emph>). Si nous n'avions pas d&#233;fini le nom du h&#233;ros via l'action, alors l'histoire g&#233;n&#233;r&#233;e pourrait changer le nom du h&#233;ros au milieu de l'histoire !</p>
</div><div type="3"><head>R&#233;pondre &#224; des mentions dans Cheap Bots Done Quick</head>
<p><link target="http://cheapbotsdonequick.com/">Cheap Bots Done Quick</link> poss&#232;de une fonctionnalit&#233; b&#234;ta qui permet &#224; votre robot de r&#233;pondre aux mentions. Attention, si vous cr&#233;ez deux bots configur&#233;s pour que l'un mentionne l'autre, la &#171;&#160;conversation&#160;&#187; qui s'ensuit peut durer tr&#232;s longtemps. A noter qu'il y a 5% de chances dans tout &#233;change que le bot ne r&#233;ponde pas, interrompant ainsi la conversation.</p>
<p>Pour configurer un mod&#232;le de r&#233;ponse, cliquez au bas de la page pour param&#233;trer le bouton pour r&#233;pondre aux tweets (<code type="inline">Reply</code>). Dans la fen&#234;tre de modification JSON qui appara&#238;t, configurez le mod&#232;le pour les phrases auxquelles votre bot va r&#233;pondre. Par exemple, voici ci-dessous une partie de ce que mon bot @tinyarchae d&#233;tecte :</p>
<pre><code class="language-JSON" xml:id="code_intro-aux-bots-twitter_8" type="block" corresp="code_intro-aux-bots-twitter_8.txt"/></pre>
<p>Les symboles ici peuvent inclure des motifs d'expressions r&#233;guli&#232;res (Regex) (pour en savoir plus, voir <link target="/fr/lecons/comprendre-les-expressions-regulieres">cette le&#231;on</link> sur les expressions r&#233;guli&#232;res). Ainsi, dans l'exemple ci-dessus, le dernier symbole recherche <emph>Should</emph> " OU <emph>should</emph> OU  <emph>Maybe</emph> OU  <emph>maybe</emph> OU <emph>if</emph> OU <emph>If</emph>. Pour r&#233;pondre &#224; tout ce qui lui est adress&#233;, le symbole serait le point : <code type="inline">.</code>. Les r&#232;gles peuvent inclure du texte simple (comme dans la r&#233;ponse &#224; "hello") ou peuvent &#234;tre un autre symbole. Les r&#232;gles doivent &#234;tre incluses dans votre grammaire principale dans la premi&#232;re case d'&#233;dition JSON de la page. Ainsi, <code type="inline">#shouldanswer#</code> est dans la case principale de l'&#233;diteur de grammaire @tinyarchae sous la forme d'une ligne :</p>
<pre><code class="language-JSON" xml:id="code_intro-aux-bots-twitter_9" type="block" corresp="code_intro-aux-bots-twitter_9.txt"/></pre>
<p>Tout en bas de la page, vous pouvez tester vos mentions en &#233;crivant un exemple de tweet que votre bot va d&#233;tecter. Si vous avez bien configur&#233; les choses, vous devriez voir une r&#233;ponse. S'il y a une erreur, la case <code type="inline">Response</code> (<emph>R&#233;ponse</emph>) devient rouge et vous indique o&#249; se trouve l'erreur.</p>
<figure><desc>Tester la r&#233;ponse du bot</desc><graphic url="bot-lesson-response.png"/></figure>
</div><div type="3"><head>Graphiques SVG</head>
<p>Puisque le <link target="https://fr.wikipedia.org/wiki/Scalable_Vector_Graphics">SVG</link> est un format de donn&#233;es qui d&#233;crit la g&#233;om&#233;trie d'un graphique vectoriel, Tracery peut &#234;tre utilis&#233; pour r&#233;aliser un travail plut&#244;t artistique. Par exemple, il existe le bot <link target="https://twitter.com/TinyAdv">Tiny Space Adventure</link> qui dessine un champ d'&#233;toiles, un vaisseau spatial et un descriptif. Sa grammaire <link target="https://pastebin.com/YYtZnzZ0">peut &#234;tre consult&#233;e ici</link>. Pour que le format SVG soit g&#233;n&#233;r&#233; correctement, il est d'une importance capitale d'avoir param&#233;tr&#233; correctement Tracery. N'h&#233;sitez donc pas de prendre comme mod&#232;le le code source du <link target="http://cheapbotsdonequick.com/source/softlandscapes">bot softlandscapes</link> qui commence par d&#233;finir le texte critique qui d&#233;limite le SVG :</p>
<pre><code xml:id="code_intro-aux-bots-twitter_10" type="block" corresp="code_intro-aux-bots-twitter_10.txt"/></pre>
<p>et ensuite :</p>
<pre><code xml:id="code_intro-aux-bots-twitter_11" type="block" corresp="code_intro-aux-bots-twitter_11.txt"/></pre>
<p>Travailler avec SVG peut &#234;tre d&#233;licat, car des &#233;l&#233;ments comme les barres obliques inverses, les fins de ligne, les guillemets et ainsi de suite doivent &#234;tre &#171;&#160;&#233;chapp&#233;s&#160;&#187; pour que le script fonctionne correctement. Comme dit sur le site,</p>
<blockquote>
<p>La syntaxe ressemble &#224; ceci : {svg &lt;svg &lt;svg ...&gt; .... }. Les balises SVG devront sp&#233;cifier un attribut de largeur et de hauteur (<emph>width</emph>, <emph>height</emph>). Notez que, dans celles-ci, les guillemets (<code type="inline">"</code>) et les croisillons (<code type="inline">#</code>) doivent &#234;tre &#233;chapp&#233;s en se faisant pr&#233;c&#233;der par une double barre oblique invers&#233;e (antislash), comme ceci \" et cela \#. Par ailleurs, les accolades (<code type="inline">{</code> et <code type="inline">}</code>) doivent aussi &#234;tre &#233;chapp&#233;es en utilisant quatre barres obliques invers&#233;es, de la mani&#232;re qui suit: \\{ et \\}.
Note : cette fonctionnalit&#233; est encore en d&#233;veloppement, le bouton tweet sur cette page ne fonctionnera donc pas. Et les informations de d&#233;bogage sont meilleures dans FF que dans d'autres navigateurs.</p>
</blockquote>
<p>Les bots qui g&#233;n&#232;rent du SVG d&#233;passent le cadre de cette le&#231;on, mais une &#233;tude minutieuse des bots existants devrait pouvoir vous aider, si vous souhaitez approfondir cette question.</p>
</div><div type="3"><head>Musique</head>
<p>&#192; proprement parler, il ne s'agit plus de bots, mais comme la musique peut &#234;tre &#233;crite en texte, on peut utiliser Tracery pour composer de la musique et utiliser d'autres biblioth&#232;ques pour convertir cette notation en fichiers Midi. Pour aller plus loin, vous pouvez consulter <link target="http://www.codingblocks.net/videos/generating-music-in-javascript/">cet article-ci</link> et mon <link target="https://electricarchaeology.ca/2017/04/07/tracery-continues-to-be-awesome/">propre retour d'exp&#233;rience</link>.</p>
</div></div><div type="2"><head>Autres tutoriels et ressources sur les bots</head>
<p><hi rend="bold">En anglais:</hi></p>
<ul>
<li>Zach Whalen, <link target="http://www.zachwhalen.net/posts/how-to-make-a-twitter-bot-with-google-spreadsheets-version-04/">How to make a Twitter Bot with Google Spreadsheets</link>, site web de Zach Whalen, <link target="http://www.zachwhalen.net/">http://www.zachwhalen.net/</link>, 7 mai 2015</li>
<li>Casey Bergman, <link target="https://caseybergman.wordpress.com/2014/02/24/keeping-up-with-the-scientific-literature-using-twitterbots-the-flypapers-experiment/">Keeping Up With the Scientific Literature using Twitterbots: The FlyPapers Experiment</link> (et aussi <link target="https://github.com/roblanf/phypapers">ce repository de Robert Lanfear sur Github</link>). Cette m&#233;thode consiste &#224; collecter les flux RSS des articles de revues, puis &#224; utiliser un service tel que <link target="https://dlvrit.com/">Dlvr.it</link> pour rediriger les liens vers un compte Twitter.</li>
<li>Abandonn&#233;e: Stefan Bohacek propose des mod&#232;les de code pour diff&#233;rents types de bots sur le site de remixage de code Glitch.com. Si vous vous rendez sur sa page, vous verrez une liste de diff&#233;rents types de bots. S&#233;l&#233;ctionnez-en un, cliquez sur le bouton <code type="inline">remix</code> puis &#233;tudiez attentivement la documentation <code type="inline">README.md</code> qui s'affiche sur la page. Glitch n&#233;cessite une identification (login) via un compte Github ou Facebook.</li>
<li>Enfin, je sugg&#232;re de rejoindre le groupe BotMakers Slack pour d&#233;couvrir d'autres tutoriels, des personnes partageant les m&#234;mes int&#233;r&#234;ts, et d'autres ressources : <link target="https://botmakers.org">Inscrivez-vous ici</link>.</li>
<li>Le wiki des Botmakers' propose &#233;galement une liste de <link target="https://botwiki.org/tutorials/twitterbots/">tutoriels sur des bots Twitter</link>.</li>
</ul>
<p>Enfin, voici une liste de bots fonctionnant avec Tracery tenue &#224; jour par Compton [ici]https://twitter.com/GalaxyKate/lists/tracery-bots). Amusez-vous bien ! Que vos bots d&#233;concertent, divertissent, inspirent et d&#233;routent.</p>
<p><hi rend="bold">En fran&#231;ais (N.D.L.R.: il s'agit de notes ajout&#233;es &#224; la version traduite):</hi></p>
<ul>
<li>Antoine Courtin, <link target="https://medium.com/@seeksanusername/botinfocom-1a89605c0953">#BotInfocom</link>, <emph>Medium.com/@seeksanusername/</emph>, 11 d&#233;cembre 2016.</li>
</ul>
</div><div type="2"><head>Exemples de bots en fran&#231;ais</head>
<p><hi rend="bold">Avec un compte Twitter d&#233;di&#233;</hi></p>
<ul>
<li><link target="https://www.cafedefaune.org/ougepro/bot-de-sept-lieues">Bot de sept lieues</link>: un bot voyageur qui raconte ses d&#233;couvertes faites dans des contr&#233;es imaginaires.</li>
<li><link target="https://twitter.com/envoisdeRomeBot">EnvoisdeRomeBot</link>: un bot de valorisation d'une base de donn&#233;es patrimoniales.</li>
<li><link target="https://twitter.com/lebotde7lieux">Le bot de 7 lieux</link>: un bot qui explore les donn&#233;es g&#233;olocalis&#233;es de Wikidata.</li>
<li><link target="https://twitter.com/memo_guerra_bot">M&#233;moire de la guerre d'Espagne - Bot</link>: un bot de m&#233;moire sur la Guerre d'Espagne qui liste les noms recens&#233;s de ses victimes.</li>
</ul>
<p><hi rend="bold">&#201;mis &#224; partir du compte d'utilisateur du cr&#233;ateur du bot</hi></p>
<ul>
<li>Le <link target="https://twitter.com/search?q=GallicaBot&amp;src=typed_query&amp;f=live">GallicaBot</link> d'Olivier Jacquot qui tweete les titres d'ouvrages en acc&#232;s libre disponibles sur la biblioth&#232;que <link target="https://gallica.bnf.fr/">Gallica</link>.</li>
<li>Le <link target="https://twitter.com/search?q=%23botInfocom&amp;src=typd&amp;f=live">#BotInfoCom </link> d'Antoine Courtin, un bot qui simule des titres d'articles (imaginaires) en sciences de l'information et de la communication.</li>
</ul>
</div><div type="2"><head>R&#233;f&#233;rences</head>
<p>Compton, K., Kybartas, B., Mateas, M.: Tracery: &#171;&#160;An author-focused generative text tool&#160;&#187; dans <emph>Proceedings of the 8th International Conference on Interactive Digital Storytelling</emph>, pp. 154&#8211;161 (2015).</p>
</div></body>
  </text>
</TEI>
