<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="instalacao-windows">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Configurar um ambiente de desenvolvimento integrado para Python (Windows)</title>
  <author role="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor role="reviewers"><persName>Jim Clifford</persName><persName>Amanda Morton</persName></editor><author role="translators">Josir C. Gomes</author><editor role="translation-reviewers"><persName>Bruno Martins</persName><persName>Renato Rocha Souza</persName></editor><editor role="editors">Miriam Posner</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0006</idno><date type="published">07/17/2012</date><date type="translated">05/13/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#windows-installation"/>.</p><p>There are other translations: <ref target="#instalacion-windows #installation-windows-py"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Esta li&#231;&#227;o ir&#225; auxiliar na configura&#231;&#227;o de um ambiente de desenvolvimento integrado para o Python num computador com o Sistema Operacional Windows.</p></abstract><textClass><keywords><term xml:lang="en">get-ready</term><term xml:lang="en">python</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body>
      <div type="2"><head>Fa&#231;a um backup do seu computador</head>
<p>&#201; sempre importante garantir que voc&#234; tenha backups regulares e recentes do seu computador. Este &#233; um bom conselho que serve para a vida toda e n&#227;o se limita &#224; pratica espec&#237;fica de programa&#231;&#227;o.</p>
</div>
      <div type="2"><head>Instale o Python 3</head>
<p>Voc&#234; ainda pode ter o Python 2 na sua m&#225;quina. Como essa vers&#227;o do Python foi descontinuada no fim de 2019, &#233; importante que voc&#234; instale o Python 3. Fa&#231;a o download da vers&#227;o mais est&#225;vel da linguagem de programa&#231;&#227;o Python (Version 3.8 de Novembro de 2019) e instale o software a partir do <ref target="https://www.python.org/downloads/windows/">site do Python</ref>.</p>
</div>
      <div type="2"><head>Crie um diret&#243;rio</head>
<p>Para que voc&#234; se organize, o ideal &#233; que voc&#234; tenha um diret&#243;rio (i.e., uma pasta) no seu computador onde voc&#234; ir&#225; armazenar os seus programas em Python (por exemplo, <code rend="inline">programming-historian</code>). Crie esse diret&#243;rio em qualquer outra pasta do seu computador.</p>
</div>
      <div type="2"><head>Instale o Komodo Edit</head>
<p>Existem v&#225;rios editores de texto que voc&#234; pode utilizar para escrever, armazenar e executar comandos em Python. O Komodo Edit &#233; o utilizado nesta li&#231;&#227;o, correspondendo a um editor gratuito e de c&#243;digo aberto. Mas existem <ref target="https://wiki.python.org/moin/PythonEditors/">outros editores</ref> se voc&#234; preferir. Voc&#234; pode escolher qual editor mas, para manter a consist&#234;ncia entre as li&#231;&#245;es, n&#243;s iremos utilizar o Komodo Edit. Voc&#234; pode fazer o download diretamente do <ref target="https://www.activestate.com/products/komodo-ide/downloads/edit/">site do Komodo Edit</ref>.</p>
</div>
      <div type="2"><head>Inicie o Komodo Edit</head>
<p>Ao iniciar o Komodo Edit, voc&#234; deve visualizar um ecr&#227; como o apresentado de seguida:</p>
<figure><desc>Komodo Edit no Windows</desc><graphic url="komodo-edit11-windows-main.png"/></figure>
<p>Se voc&#234; n&#227;o visualizar a barra de ferramentas (Toolbox) do lado direito, selecione a op&#231;&#227;o do menu <code rend="inline">View -&gt; Tabs -&gt; Toolbox</code>. N&#227;o importa se o painel do seu projeto est&#225; aberto ou n&#227;o. Invista algum tempo para se familiarizar com o layout do Komodo Edit. O ficheiro de ajuda &#233; bastante completo. </p>
<div type="3"><head>Configure o Komodo Edit</head>
<p>Agora voc&#234; precisa configurar o seu editor para que ele possa executar programas em Python.</p>
<p>Selecione o menu <code rend="inline">Edit -&gt; Preferences -&gt; Languages -&gt; Python 3</code> e de seguida selecione <code rend="inline">Browse</code>. Agora, selecione o ficheiro <code rend="inline">C:\Users\YourUserName\AppData\Local\Programs\Python\Python38-32</code>)</p>
<p>Se o ecr&#227; resultante for semelhante ao que se encontra abaixo, clique OK:</p>
<p>{% include figure.html caption="Configurar o Interpretador Python" filename="komodo-edit11-windows-interpreter.png" %}</p>
<p>O pr&#243;ximo passo &#233; entrar na se&#231;&#227;o <emph>Preferences</emph> e escolher a op&#231;&#227;o <emph>Internationalization</emph>. Selecione <emph>Python</emph> no menu entitulado <emph>Language-specific Default Encoding</emph> e verifique se <ref target="https://pt.wikipedia.org/wiki/UTF-8">UTF-8</ref> est&#225; selecionado como o m&#233;todo padr&#227;o de codifica&#231;&#227;o de caracteres.</p>
<p>{% include figure.html caption="Confugurar a Linguagem para UTF-8" filename="komodo-edit11-windows-utf-set.png" %}</p>
<p>De seguida, escolha <code rend="inline">Toolbox-&gt;Add-&gt;New Command</code>. Esta op&#231;&#227;o ir&#225; abrir uma nova janela de di&#225;logo. Renomeie o seu comando para <code rend="inline">&#8216;Run Python&#8217;</code> e no campo <code rend="inline">&#8216;Command&#8217;</code>, digite:</p>
<ab><code xml:id="code_instalacao-windows_0" corresp="code_instalacao-windows_0.txt" lang="language-python" rend="block"/></ab>
<p>Se voc&#234; esquecer este comando, o Python ir&#225; parar misteriosamente porque ele n&#227;o estar&#225; recebendo um programa como entrada.</p>
<p>J&#225; no campo <code rend="inline">&#8216;Start in&#8217;</code>, digite:</p>
<p><code rend="inline">%D</code></p>
<p>Se o ecr&#227; estiver mostrando algo como descrito na janela abaixo, clique no bot&#227;o OK.</p>
<figure><desc>'Run Python' Command</desc><graphic url="komodo-edit11-windows-python-command.png"/></figure>
<figure><desc>Configurando o comando 'Run Python Start'</desc><graphic url="komodo-edit11-windows-python-start.png"/></figure>
<p>O seu novo comando "Run Python" deve aparecer no painel de ferramentas. Talvez seja necess&#225;rio reiniciar a sua m&#225;quina para que o Python possa funcionar no Komodo Edit.</p>
</div></div>
      <div type="2"><head>Passo 2 &#8211; &#8220;Ol&#225; Mundo&#8221; em Python</head>
<p>&#201; uma tradi&#231;&#227;o para quem est&#225; come&#231;ando a programar em uma nova linguagem que o primeiro programa a ser constru&#237;do emita a frase "Ol&#225; Mundo". </p>
<p>O Python &#233; uma boa linguagem de programa&#231;&#227;o para iniciantes porque ela &#233; de alto-n&#237;vel.
Isto quer dizer que &#233; poss&#237;vel escrever pequenos programas que realizam muitas funcionalidades.
Quanto menor o programa, mais prov&#225;vel que ele caiba em apenas um ecr&#227; e mais f&#225;cil ser&#225; manter o controle dele na sua mente.</p>
<p>O Python &#233; uma lingugagem 'interpretada'. Isto significa que existe um programa especial (conhecido como Interpretador) que sabe como seguir as instru&#231;&#245;es da linguagem. Uma forma de utilizar o interpretador &#233; guardar todas as instru&#231;&#245;es a executar em um ficheiro para, em seguida, solicitar ao interpretador que ele interprete o conte&#250;do desse ficheiro.  </p>
<p>Um ficheiro que cont&#233;m instru&#231;&#245;es de linguagem de programa&#231;&#227;o &#233; conhecido como um programa. O interpretador ir&#225; executar cada uma das instru&#231;&#245;es que voc&#234; incluiu no seu programa e no final ir&#225; parar. Vamos experimentar como isto funciona.</p>
<p>No seu editor de texto, crie um novo ficheiro, entre o seguinte programa de duas linhas e salve-o na pasta <code rend="inline">programming-historian</code>:</p>
<p><code rend="inline">ola-mundo.py</code></p>
<ab><code xml:id="code_instalacao-windows_1" corresp="code_instalacao-windows_1.txt" lang="language-python" rend="block"/></ab>
<p>O comando &#8220;<emph>Run Python</emph>&#8221; permite que voc&#234; execute o seu programa.
Se voc&#234; escolheu um outro editor, este deve ter uma funcionalidade semelhante.
Se tudo correu bem, o ecr&#227; dever&#225; mostrar algo como indicado abaixo (Clique na imagem para ver uma imagem maior):</p>
<figure><desc>'Ol&#225; Mundo'</desc><graphic url="komodo-edit11-windows-hello.png"/></figure>
</div>
      <div type="2"><head>Interagindo com a linha de comandos do Python</head>
<p>Outra forma de interagir com o interpretador &#233; utilizar o que &#233; denominado por linha de comandos.
Voc&#234; pode digitar um comando na linha de comandos e pressionar a tecla Enter, tendo depois a resposta ao seu comando.
Usar a linha de comandos &#233; um &#243;timo m&#233;todo para testar os comandos e para se certificar que eles realmente fazem o que voc&#234; est&#225; imaginando.</p>
<p>Voc&#234; pode executar a linha de comandos do Python dando um duplo-click no ficheiro python.exe.
Se voc&#234; instalou a vers&#227;o 3.8 (a mais recente at&#233; Novembro de 2019), esse ficheiro provavelmente estar&#225; localizado no diret&#243;rio <code rend="inline">C:\Users\YourUserName\AppData\Local\Programs\Python\Python38-32</code>. Na janela da linha de comandos que ir&#225; abrir, digite:</p>
<ab><code xml:id="code_instalacao-windows_2" corresp="code_instalacao-windows_2.txt" lang="language-python" rend="block"/></ab>
<p>e pressione Enter. O computador ir&#225; responder com:</p>
<ab><code xml:id="code_instalacao-windows_3" corresp="code_instalacao-windows_3.txt" lang="language-python" rend="block"/></ab>
<p>Quando quisermos representar uma intera&#231;&#227;o na linha de comandos, utilizaremos o s&#237;mbolo <code rend="inline">-&gt;</code> para indicar a resposta para o nosso comando, tal como no exemplo abaixo:</p>
<ab><code xml:id="code_instalacao-windows_4" corresp="code_instalacao-windows_4.txt" lang="language-python" rend="block"/></ab>
<p>No seu ecr&#227;, voc&#234; ver&#225; algo como:</p>
<p>{% include figure.html caption="Shell do Python no Windows" filename="windows-python3-cmd.png" %}</p>
<p>Agora que voc&#234; e o seu computador est&#227;o preparados, podemos seguir para tarefas mais interessantes. Se voc&#234; est&#225; seguindo as li&#231;&#245;es do Python, a nossa sugest&#227;o &#233; que voc&#234; tente a pr&#243;xima li&#231;&#227;o &#8216;<ref target="nocoes-basicas-paginas-web-html">No&#231;&#245;es b&#225;sicas de p&#225;ginas web e HTML</ref>&#8216;</p>
</div>
    </body>
  </text>
</TEI>
