<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Analyse de corpus avec AntConc</title>
  <layout>lesson</layout>
  <slug>analyse-corpus-antconc</slug>
  <date>2015-06-19</date>
  <authors>Heather Froehlich</authors>
  <reviewers>Nabeel Siddiqui,Rob Sieczkiewicz</reviewers>
  <editors>Fred Gibbs</editors>
  <translator>Hugo Bonin</translator>
  <translation-editor>Sofia Papastamkou</translation-editor>
  <translation-reviewer>Antoine Champigny,Fran&#231;ois Dominic Laram&#233;e</translation-reviewer>
  <translation_date>2019-06-19</translation_date>
  <original>corpus-analysis-with-antconc</original>
  <difficulty>1</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/240</review-ticket>
  <activity>analyzing</activity>
  <topics>distant-reading</topics>
  <abstract>L'analyse de corpus est un type d'analyse textuelle qui permet de faire des comparaisons d'objets textuels &#224; grande &#233;chelle (la fameuse "lecture &#224; distance" (_distant reading_)).
</abstract>
  <avatar_alt>Trois grandes biblioth&#232;ques orn&#233;es</avatar_alt>
  <doi>10.46430/phfr0001</doi>
</metadata>
  <text>
    <body><div class="alert alert-info">
En 2022, Laurence Anthony a effectu&#233; une mise &#224; jour cons&#233;quente qui a d&#233;bouch&#233; sur la version 4.0 du logiciel Antconc. Si les caract&#233;ristiques principales du logiciel demeurent essentiellement les m&#234;mes, il peut n&#233;anmoins y avoir des diff&#233;rences dans certaines des manipulations d&#233;crites ci-dessous. Par cons&#233;quent, si vous utilisez une version plus r&#233;cente que celle mobilis&#233;e dans la le&#231;on, merci de vous r&#233;f&#233;rer aux consignes fournies dans <link target="https://www.laurenceanthony.net/software/antconc/releases/AntConc403/help.pdf">le guide</link> r&#233;dig&#233; par Laurence Anthony. Ceci peut &#234;tre particuli&#232;rement utile pour ouvrir des corpus gr&#226;ce &#224; la nouvelle fonctionnalit&#233; Corpus Manager (janvier 2022). 
</div>
<div n="2"><head>Introduction</head>
<p>L'analyse de corpus est un type d'analyse textuelle qui permet de faire des comparaisons d'objets textuels &#224; grande &#233;chelle &#8212; la fameuse "lecture &#224; distance" (<emph>distant reading</emph>). Cela nous permet de voir des choses que nous n'observons pas n&#233;cessairement lorsque nous lisons &#224; l'oeil nu. Si vous avez une collection de documents, vous voudrez peut-&#234;tre trouver des sch&#233;mas grammaticaux ou les phrases r&#233;curentes dans votre corpus. Vous voudrez peut-&#234;tre aussi identifier de mani&#232;re statistique les expressions probables ou improbables chez un(e) auteur(e) ou dans un genre particulier, trouver des exemples sp&#233;cifiques de structures grammaticales ou encore examiner beaucoup d'occurrences d'un concept particulier &#224; travers une s&#233;rie de documents. L'analyse de corpus est surtout utile pour v&#233;rifier des intuitions et/ou trianguler des r&#233;sultats issus d'autres m&#233;thodes digitales.</p>
<p>&#192; la fin de ce tutoriel, vous serez en mesure de :</p>
<ul>
<li>cr&#233;er et t&#233;l&#233;charger un corpus de texte</li>
<li>conduire une recherche de mot-cl&#233;-en-contexte (<emph>keyword-in-context</emph>)</li>
<li>identifier les sch&#233;mas r&#233;currents autour d'un mot particulier</li>
<li>utiliser des requ&#234;tes de recherche plus sp&#233;cifiques</li>
<li>examiner les diff&#233;rences statistiquement significatives entre les corpus</li>
<li>effectuer des comparaisons multimodales &#224; l'aide de m&#233;thodes de linguistique de corpus</li>
</ul>
<p>Vous avez d&#233;j&#224; fait ce genre de choses auparavant, si vous avez d&#233;j&#224;...</p>
<ul>
<li>recherch&#233; un terme sp&#233;cifique dans un document .pdf ou .doc</li>
<li>utilis&#233; <link target="http://voyant-tools.org/">Voyant Tools</link> pour analyser des sch&#233;mas dans un texte</li>
<li>suivi les tutoriels d'introduction &#224; Python du <link target="/en/lessons/automated-downloading-with-wget">Programming Historian</link></li>
</ul>
<p>En quelque sorte, <link target="http://voyant-tools.org/">Voyant Tools</link> est une passerelle vers la r&#233;alisation d'analyses plus sophistiqu&#233;es et reproductibles, car l'esth&#233;tique de bricolage des scripts Python ou R peut ne pas convenir &#224; tout le monde. <link target="http://www.laurenceanthony.net/software/antconc/">AntConc</link> comble ce vide en &#233;tant un logiciel autonome d'analyse linguistique de textes, disponible gratuitement pour Windows, Mac OS et Linux. Par ailleurs, il est r&#233;guli&#232;rement mis &#224; jour par son cr&#233;ateur,  <link target="http://www.laurenceanthony.net/">Laurence Anthony</link>. Il existe d'autres logiciels de concordance, mais AntConc est librement disponible sur toutes les plateformes et tr&#232;s bien maintenu. Voir la <link target="http://hfroehli.ch/2014/05/11/intro-bibliography-corpus-linguistics/">bibliographie</link> pour d'autres ressources.</p>
<p>Ce tutoriel explore diff&#233;rentes fa&#231;ons d'aborder un corpus de textes. Il est important de noter que les approches issues de la linguistique de corpus sont rarement, voire jamais, l'unique possibilit&#233;. Ainsi, &#224; chaque &#233;tape, il vaut la peine de r&#233;fl&#233;chir &#224; ce que vous faites et comment cela peut vous aider &#224; r&#233;pondre &#224; une question sp&#233;cifique avec vos donn&#233;es. Bien que je pr&#233;sente dans ce tutoriel une approche modulaire qui explique 'comment faire ceci puis cela pour atteindre x', il n'est pas toujours n&#233;cessaire de suivre l'ordre exact d&#233;crit ici. Cette le&#231;on donne un aper&#231;u de certaines des m&#233;thodes disponibles, plut&#244;t qu'une recette du succ&#232;s.</p>
<div n="3"><head>T&#233;l&#233;chargements n&#233;cessaires</head>
<ol>
<li>
<p>Logiciel&#160;: <link target="http://www.laurenceanthony.net/software/antconc/">AntConc</link>.
D&#233;zippez le fichier si n&#233;cessaire, et lancez l'application. Les captures d'&#233;cran ci-dessous peuvent varier l&#233;g&#232;rement par rapport &#224; la version que vous avez (et selon le syst&#232;me d'exploitation, bien s&#251;r), mais les proc&#233;dures sont plus ou moins les m&#234;mes sur les plateformes et les versions r&#233;centes d'AntConc. Ce tutoriel a recours &#224; une version plus ancienne d'AntConc, car je la trouve plus facile &#224; utiliser dans un contexte d'introduction. Vous pouvez utiliser la version la plus r&#233;cente, mais si vous souhaitez suivre avec les captures d'&#233;cran fournies, vous pouvez t&#233;l&#233;charger la version utilis&#233;e ici, <link target="http://www.laurenceanthony.net/software/antconc/releases/AntConc324/">version 3.2.4</link>.</p>
</li>
<li>
<p>Corpus test&#160;: T&#233;l&#233;chargez un <link target="/assets/corpus-analysis-with-antconc/antconc_corpus_files.zip">fichier zip de critiques de films</link>.</p>
</li>
</ol>
</div><div n="3"><head>Les grandes lignes de ce tutoriel :</head>
<ol>
<li>Travailler avec des fichiers texte brut</li>
<li>L'interface utilisateur d'AntConc, importer un corpus</li>
<li>Recherche de mot-cl&#233;-en-contexte (<emph>keyword-in-context</emph>)</li>
<li>Fonctions avanc&#233;es de mot-cl&#233;-en-contexte (<emph>keyword-in-context</emph>)</li>
<li>Cooccurrences et listes de mots</li>
<li>Comparer des corpus</li>
<li>Discussion&#160;: Faire des comparaisons significatives</li>
<li>Ressources suppl&#233;mentaires</li>
</ol>
</div><div n="3"><head>Travailler avec des fichiers texte brut</head>
<ul>
<li>AntConc fonctionne avec des fichiers texte brut avec l'extension .txt (ex.&#160;: Hamlet.txt).</li>
<li>AntConc <hi rend="bold">ne lira pas</hi> les fichiers en .doc, .docx, .pdf. Vous allez devoir convertir ces fichiers en .txt.</li>
<li>Il lira les fichiers XML qui sont enregistr&#233;s en tant que fichiers .txt (ce n'est pas grave si vous ne savez pas ce qu'est un fichier XML).</li>
</ul>
<p>Visitez votre site Web d'actualit&#233;s pr&#233;f&#233;r&#233;, et cliquez sur un article (peu importe lequel, pourvu qu'il s'agisse principalement de texte). S&#233;lectionnez tout le texte de l'article (en-t&#234;te, signature, etc.), et faites un clic droit sur "copier".</p>
<p>Ouvrez un &#233;diteur de texte tel que Notepad (sous Windows) ou TextEdit (sous Mac) et collez votre texte.</p>
<p>D'autres options gratuites pour les &#233;diteurs de texte, telles que <link target="http://notepad-plus-plus.org/">Notepad++</link> (Windows) ou <link target="http://www.barebones.com/products/textwrangler/">TextWrangler</link> (Mac), offrent des fonctionnalit&#233;s plus avanc&#233;es, et sont particuli&#232;rement utiles pour le nettoyage de texte. Par nettoyage de texte, j'entends la suppression des informations extratextuelles qui apparaissent r&#233;guli&#232;rement tout au long du texte. Si vous conservez cette information, elle va influencer vos donn&#233;es. Ainsi, les logiciels d'analyse de texte traiteront ces mots dans le compte de mots, les analyses statistiques et les relations lexicales. Par exemple, vous pouvez supprimer les en-t&#234;tes et pieds de page standards qui appara&#238;tront sur chaque page. Voir le tutoriel <link target="/fr/lecons/nettoyer-ses-donnees-avec-openrefine">"Nettoyer ses donn&#233;es avec OpenRefine"</link> pour plus d'informations sur la fa&#231;on d'automatiser cette t&#226;che. Sur des corpus plus petits, il peut &#234;tre plus facile de le faire vous-m&#234;me, et vous aurez une bien meilleure id&#233;e de l'allure de votre corpus de cette fa&#231;on.</p>
<p>Enregistrez l'article en tant que fichier .txt sur le bureau. Vous pouvez faire un petit nettoyage de texte pour enlever d'autres informations, telles que le titre ou l'auteur(e) (supprimez-les, puis enregistrez de nouveau le fichier). Rappelez-vous que tout ce que vous laissez dans le fichier peut et sera trait&#233; comme du texte par un logiciel d'analyse de texte.</p>
<p>Allez sur votre bureau et v&#233;rifiez que vous pouvez trouver votre fichier texte.</p>
<p>R&#233;p&#233;tez la proc&#233;dure plusieurs fois et c'est ainsi que vous construirez un corpus de fichiers texte brut. Ce processus s'appelle la construction de corpus, ce qui implique tr&#232;s souvent d'aborder des questions d'&#233;chantillonnage, de repr&#233;sentativit&#233; et d'organisation. Rappelez-vous, <emph>chaque fichier que vous voulez utiliser dans votre corpus <hi rend="bold">doit</hi> &#234;tre un fichier texte brut pour qu'AntConc puisse l'utiliser.</emph> Il est d'usage de nommer les fichiers avec le suffixe .txt pour que vous sachiez de quel type de fichier il s'agit.</p>
<p>Comme vous pouvez l'imaginer, il peut &#234;tre assez fastidieux de constituer un corpus substantiel un fichier &#224; la fois, surtout si vous avez l'intention de traiter un ensemble important de documents. Il est donc tr&#232;s courant d'utiliser l'extraction de contenus (<emph>webscraping</emph>) (en utilisant un petit programme pour t&#233;l&#233;charger automatiquement les fichiers sur le web pour vous) pour construire votre corpus. Pour en savoir plus sur les concepts et les techniques d'extraction, consultez les tutoriels du <emph>Programming Historian</emph> sur l'<link target="/en/lessons/intro-to-beautiful-soup">extraction avec Beautiful Soup</link> et le <link target="/en/lessons/automated-downloading-with-wget">t&#233;l&#233;chargement automatique avec wget</link> (en anglais).
Plut&#244;t que de construire un corpus un document &#224; la fois, nous allons utiliser un corpus pr&#233;par&#233; de critiques de films positives et n&#233;gatives, emprunt&#233; au <link target="http://www.nltk.org/"><emph>Natural Language Processing Toolkit</emph></link>. Le corpus des critiques de films de la NLTK compte 2000 critiques, organis&#233;es par r&#233;sultats positifs et n&#233;gatifs ; aujourd'hui, nous allons aborder un petit sous-ensemble d'entre eux (200 positifs, 200 n&#233;gatifs).</p>
<p>La construction de corpus est un sous-domaine &#224; part enti&#232;re. Voir "<link target="https://academic.oup.com/dsh/article-abstract/8/4/243/928942"><emph>Representativeness in Corpus Design</emph></link>", <emph>Literary and Linguistic Computing</emph>, 8 (4) : 243-257 et <link target="http://www.amazon.com/Developing-Linguistic-Corpora-Practice-Guides/dp/1842172050/ref=sr_1_1_1"><emph>Developing Linguistic Corpora : a Guide to Good Practice</emph></link> pour plus d'informations.</p>
</div><div n="3"><head>Premiers pas avec AntConc :  importer un corpus, l'interface utilisateur d'AntConc</head>
<p>Quand AntConc sera lanc&#233;, il ressemblera &#224; ceci.</p>
<figure><desc>&#201;cran d'ouverture d'AntConc.</desc><graphic url="antconc1.png"/></figure>
<p>Sur le c&#244;t&#233; gauche, il y a une colonne (<emph>Corpus Files</emph>) qui affiche les diff&#233;rents fichiers charg&#233;s (que nous allons utiliser dans un instant).</p>
<p>Il y a 7 onglets en haut:
<hi rend="bold">Concordance</hi> <emph>(Concordance)</emph>: Cela vous montrera ce que l'on appelle la vue mot-cl&#233; en contexte (<emph>KeyWord-In-Context</emph>, abr&#233;viation KWIC, plus d'informations &#224; ce sujet dans une minute), en utilisant la barre de recherche en dessous.
<hi rend="bold">Concordance Plot</hi> <emph>(Graphe des concordances)</emph>: Ceci vous montrera une visualisation tr&#232;s simple de votre recherche KWIC, o&#249; chaque occurence du mot recherch&#233; sera repr&#233;sent&#233;e par une petite ligne noire du d&#233;but &#224; la fin de chaque fichier contenant le terme.
<hi rend="bold">File View</hi> <emph>(Vue de fichier)</emph>: Cela vous montrera une vue compl&#232;te du fichier, pratique pour voir le contexte plus large d'un r&#233;sultat.
<hi rend="bold">Clusters</hi> <emph>(Grappes)</emph>: Cette vue vous montre les mots qui apparaissent souvent ensemble.
<hi rend="bold">Collocates</hi> <emph>(Cooccurrences)</emph>: Les clusters nous montrent des mots qui apparaissent <emph>d&#233;finitivement</emph> ensemble dans un corpus ; les cooccurrences (<emph>collocates</emph>) montrent des mots qui sont statistiquement susceptibles d'appara&#238;tre ensemble.
<hi rend="bold">Word List</hi> <emph>(Liste des mots)</emph>: Tous les mots de votre corpus.
<hi rend="bold">Keyword List</hi> <emph>(Liste des mots-cl&#233;s)</emph>: Ceci permet des comparaisons entre deux corpus.</p>
<p>En guise d'introduction, ce tutoriel ne fait qu'effleurer la surface de ce que vous pouvez faire avec AntConc. Nous nous concentrerons sur les fonctions <emph>Concordance</emph>, <emph>Collocates</emph>, <emph>Keywords</emph> et <emph>Word List</emph>.</p>
<div n="4"><head>Chargement des corpus</head>
<p>Comme pour ouvrir un fichier ailleurs, nous allons commencer par File &gt; Open (Ouvrir &gt; Fichier), mais au lieu d'ouvrir UN seul fichier, nous voulons ouvrir le r&#233;pertoire de tous nos fichiers.  AntConc vous permet d'ouvrir des r&#233;pertoires entiers, donc si vous &#234;tes &#224; l'aise avec ce concept, vous pouvez simplement ouvrir le dossier "<emph>All review</emph>" et passer &#224; l'explication de l'interface, ci-dessous. Sinon, suivez les &#233;tapes suivantes.</p>
<figure><desc>Ouvrir un r&#233;pertoire de fichiers.</desc><graphic url="open-file-21.png"/></figure>
<p>Rappelez-vous que nous avons mis nos fichiers sur le Bureau, alors naviguez dans le menu d&#233;roulant.</p>
<figure><desc>Ouvrir un r&#233;pertoire de fichiers sur votre Bureau.</desc><graphic url="files-on-desktop-open.png"/></figure>
<p>Depuis le Bureau, vous voulez aller vers notre dossier "movie reviews from nltk" :</p>
<figure><desc>Trouvez les critiques de films.</desc><graphic url="browse-for-directory-inside-folder.png"/></figure>
<p>S&#233;lectionnez d'abord "<emph>Negative Review</emph>" et cliquez sur OK. 200 textes devraient &#234;tre charg&#233;s dans la colonne de gauche nomm&#233;e <emph>Corpus Files</emph> &#8212; regardez la case Total No. !</p>
<figure><desc>Importer les critiques n&#233;gatives.</desc><graphic url="open-negative-reviews.png"/></figure>
<p>Ensuite, vous allez r&#233;p&#233;ter le processus pour charger le dossier "<emph>Positive Reviews</emph>". Vous devriez maintenant avoir 400 textes dans la colonne <emph>Corpus Files</emph>.</p>
<figure><desc>Importer les critiques positives.</desc><graphic url="positive-reviews.png"/></figure>
<figure><desc>Toutes les critiques import&#233;es.</desc><graphic url="all-reviews-loaded.png"/></figure>
</div></div></div><div n="2"><head>Recherche de mots-cl&#233;s en contexte</head>
<div n="3"><head>Commencez par une recherche de base</head>
<p>L'une des forces des outils de corpus comme AntConc, c'est de trouver des sch&#233;mas de langage que nous avons du mal &#224; identifier par une simple lecture. Les petits mots r&#233;p&#233;titifs comme <emph>le, la, les, je, il, elle, un, une, avoir, &#234;tre, faire</emph> (<emph>the, I, he, he, she, a, a, an, is, have, will</emph>) sont particuli&#232;rement difficiles &#224; suivre, parce qu'ils sont tr&#232;s communs, mais les ordinateurs sont tr&#232;s dou&#233;s pour accomplir la t&#226;che. Ces mots sont commun&#233;ment connus sous le nom de "mots vides" (<emph>stopwords</emph>) en humanit&#233;s num&#233;riques ; ce sont souvent des marques caract&#233;ristiques d'un(e) auteur(e) ou d'un genre. Par cons&#233;quent, ils peuvent &#234;tre des termes de recherche tr&#232;s puissants en eux-m&#234;mes ou combin&#233;s &#224; des termes plus ax&#233;s sur le contenu, ce qui aide les chercheurs et chercheuses &#224; identifier des tendances qui n'avaient peut-&#234;tre pas &#233;t&#233; r&#233;p&#233;r&#233;es.</p>
<p>Dans le champ de recherche en bas, tapez "<emph>the</emph>" et cliquez sur "start" (d&#233;marrer). La vue Concordance vous montrera chaque fois que le mot appara&#238;t dans notre corpus de critiques de films, et un certain contexte pour cela. C'est ce qu'on appelle une visionneuse "mots-cl&#233;s en contexte" (<emph>Key Words in Context</emph>).</p>
<figure><desc>'_The_' est un mot commun.</desc><graphic url="the-thinking.png"/></figure>
<p>(14618 fois, selon la case "<emph>Concordance Hits</emph>" en bas au centre qui indique le nombre d'occurrences.)</p>
<p>Comme ci-dessus, la liste KWIC est un bon moyen de commencer &#224; chercher des sch&#233;mas r&#233;currents. M&#234;me s'il y a encore beaucoup d'informations, quels sont les mots qui apparaissent &#224; proximit&#233; de "<emph>the</emph>" ?</p>
<p>Essayez une recherche similaire pour "<emph>a</emph>". Les deux "<emph>a</emph>" et "<emph>the</emph>" sont des articles, mais l'un est un article d&#233;fini et l'autre un article ind&#233;fini - et les r&#233;sultats que vous obtiendrez vous en donneront une id&#233;e.</p>
<p>Maintenant que vous &#234;tes &#224; l'aise avec une ligne KWIC, recommencez avec le mot "<emph>shot</emph>" : vous obtiendrez des exemples &#224; la fois du nom ("<emph>line up the <hi rend="bold">shot</hi></emph>") et du verbe ("<emph>this scene was <hi rend="bold">shot</hi> carefully</emph>").</p>
<p>Que voyez-vous ? Je comprends que cela peut &#234;tre difficille d'identifier des sch&#233;mas. Essayez d'appuyer sur le bouton jaune "<emph>sort</emph>" (trier). Que se passe-t-il maintenant ?</p>
<figure><desc>Les mots qui apparaissent pr&#232;s de '_shot_'.</desc><graphic url="sorting-shot-1l1r.png"/></figure>
<p>(Ceci est peut-&#234;tre plus facile &#224; lire !)
Vous pouvez ajuster la fa&#231;on dont AntConc trie les informations en modifiant les param&#232;tres dans le cercle rouge : L correspond &#224; 'gauche' (pour <emph>left</emph>) et R &#224; 'droite' (pour <emph>right</emph>) ; vous pouvez les &#233;tendre jusqu'&#224; &#177;5 dans les deux sens. La valeur par d&#233;faut est 1 gauche, 2 droite, 3 droite, mais vous pouvez changer cela pour rechercher 3 gauche, 2 gauche, 1 droite (pour obtenir des phrases et/ou des trigrammes qui se terminent avec le terme qui vous int&#233;resse, par exemple) en cliquant sur les boutons fl&#232;ches haut ou bas. Si vous ne voulez pas inclure une option de tri, vous pouvez l'ignorer (comme par d&#233;faut : 1L, 2R, 3R) ou l'inclure comme un 0. Des options de tri moins lin&#233;aire sont disponibles, telles que 4 gauche, 3 droite, 5 droite, qui comprend beaucoup d'autres informations contextuelles. Ces param&#232;tres peuvent &#234;tre lents &#224; r&#233;agir, mais soyez patients. Si vous n'&#234;tes pas s&#251;r(e) du r&#233;sultat de la recherche, appuyez simplement sur "<emph>sort</emph>" (trier) pour voir ce qui s'est pass&#233; et ajuster en cons&#233;quence.</p>
</div><div n="3"><head>Op&#233;rateurs de recherche</head>
<div n="4"><head>L'op&#233;rateur * (m&#233;tacaract&#232;re)</head>
<p>L'op&#233;rateur * (qui trouve z&#233;ro ou plus de caract&#232;res) peut aider, par exemple, &#224; trouver les formes singuli&#232;re et plurielle des noms.</p>
<p><hi rend="bold">Exercice :</hi>
Recherchez "qualit*", puis triez cette recherche. Qu'est-ce qui tend &#224; pr&#233;c&#233;der et &#224; suivre la <emph>quality</emph> (qualit&#233;) et les <emph>qualities</emph> (qualit&#233;s) ? (Indice : en anglais, ce sont des mots diff&#233;rents, et ils ont des contextes diff&#233;rents. Encore une fois, recherchez les mod&#232;les d'utilisation &#224; l'aide du KWIC !)</p>
<p>Pour obtenir la liste compl&#232;te des op&#233;rateurs de replacement disponibles et ce qu'ils signifient, allez &#224; <emph>Global Settings</emph> &gt; <emph>Wildcard Settings</emph>  (Param&#232;tres globaux &gt; Param&#232;tres des m&#233;tacaract&#232;res)</p>
<figure><desc>R&#233;glage des param&#232;tres des m&#233;tacaract&#232;res.</desc><graphic url="wildcard-settings.png"/></figure>
<p>Pour conna&#238;tre la diff&#233;rence entre * et ?, recherchez "<emph>th*n</emph>" et "<emph>th?n</emph>". Ces deux requ&#234;tes de recherche se ressemblent beaucoup, mais donnent des r&#233;sultats tr&#232;s diff&#233;rents.</p>
<p>L'op&#233;rateur ? est plus sp&#233;cifique que l'op&#233;rateur * :
"<emph>wom?n+</emph>" - &#224; la fois "<emph>woman</emph>" (femme) et "<emph>women</emph>" (femmes)
"<emph>m?n</emph>" - "<emph>man</emph>" (homme) et "<emph>men</emph>" (hommes), mais aussi "<emph>min</emph>"
comparativement "<emph>m*n</emph>" n'est pas utile, parce que vous allez avoir "<emph>mean</emph>", "<emph>melon</emph>", etc.</p>
<p><hi rend="bold">Exercice :</hi>
Comparez ces deux recherches : "<emph>wom?n</emph>" et "<emph>m?n</emph>"</p>
<ol>
<li>Triez chaque recherche de fa&#231;on significative (par exemple par terme de recherche puis 1L puis 2L)</li>
<li>Puis, cliquez sur <emph>File</emph> &gt; <emph>Save output to text file</emph> (Enregistrer les r&#233;sultats dans un fichier texte)</li>
</ol>
<blockquote>
<p>ASTUCE : Au cours de vos recherches, vous pouvez g&#233;n&#233;rer de nombreux fichiers de ce type pour r&#233;f&#233;rence ; il est utile d'utiliser des noms de fichiers clairs qui d&#233;crivent ce qu'ils contiennent (tels que "wom?n-results.text", et non "antconc_results.txt").</p>
</blockquote>
<figure><desc>Enregistrer les r&#233;sultats dans un fichier texte</desc><graphic url="save-output-as-text-file.png"/></figure>
<figure><desc>Fen&#234;tre Enregistrer sous.</desc><graphic url="save-as.png"/></figure>
<p>Et maintenant vous pouvez ouvrir le fichier texte dans votre &#233;diteur de texte ; vous devrez peut-&#234;tre &#233;largir la fen&#234;tre de l'application pour la rendre lisible :</p>
<figure><desc>Le fichier texte brut affich&#233; dans un &#233;diteur de texte.</desc><graphic url="results.png"/></figure>
<p>Effectuez cette op&#233;ration pour chacune des deux recherches, puis examinez les deux fichiers texte c&#244;te &#224; c&#244;te. Qu'est-ce que vous remarquez ?</p>
</div><div n="4"><head>L'op&#233;rateur | ("ou")</head>
<p><hi rend="bold">Exercice:</hi>
Recherchez  "<emph>she|he</emph>".</p>
<p>Maintenant, recherchez-les s&#233;par&#233;ment : combien d'occurences "<emph>she</emph>" compar&#233; &#224; "<emph>he</emph>" ?</p>
<p>Il y a beaucoup moins de cas de "<emph>she</emph>"- pourquoi ? C'est une question de recherche ! Une bonne question de suivi pourrait &#234;tre de trier la recherche "<emph>she|he</emph>" et de voir si des verbes particuliers suivent chacun d'eux.</p>
<p><hi rend="bold">Exercice :</hi>
Entra&#238;nez-vous &#224; rechercher un mot de votre choix, &#224; le trier de diff&#233;rentes fa&#231;ons, &#224; utiliser des m&#233;tacaract&#232;res et enfin &#224; exporter les r&#233;sultats. La question centrale &#224; se poser ici : quels types de mod&#232;les voyez-vous ? Pouvez-vous les expliquer ?</p>
</div></div><div n="3"><head>Cooccurrences (<emph>collocates</emph>) et listes des mots (<emph>word lists</emph>)</head>
<p>Apr&#232;s avoir regard&#233; les lignes KWIC &#224; la recherche de sch&#233;mas, n'aimeriez-vous pas que l'ordinateur puisse vous donner une liste des mots qui apparaissent le plus souvent en compagnie de votre mot-cl&#233; ?</p>
<p>Bonne nouvelle, il y a un moyen d'obtenir cette information, et elle est disponible dans l'onglet <emph>Collocates</emph> (Cooccurrences). Cliquez dessus, et AntConc vous dira qu'il doit cr&#233;er une liste de mots. Appuyez sur OK ; il le fera automatiquement.</p>
<blockquote>
<p>REMARQUE : Vous n'obtiendrez cet avis que si vous n'avez pas encore cr&#233;&#233; de liste de mots.</p>
</blockquote>
<figure><desc>Avertissement liste de mots.</desc><graphic url="wordlistwarning.png"/></figure>
<p>Essayez de g&#233;n&#233;rer des coooccurrences pour "<emph>she</emph>"</p>
<p>Les r&#233;sultats non tri&#233;s sembleront commencer par des mots vides (mots qui construisent des phrases) puis descendre jusqu'aux mots de contenu (mots qui construisent du sens). Les mots vides sont ces petits mots ennuyeux, <link target="http://www.wordfrequency.info/free.asp">les mots les plus fr&#233;quents en anglais</link>, qui sont pour la plupart des cr&#233;ateurs de phrases. Les versions ult&#233;rieures d'AntConc incluent souvent le terme de recherche comme premier r&#233;sultat, probablement parce que le terme de recherche que vous recherchez appara&#238;t dans le texte et nous recherchons des mots qui sont susceptibles d'appara&#238;tre avec ce mot.</p>
<p>Certaines personnes voudront peut-&#234;tre supprimer ces petits mots &#224; l'aide d'une liste de mots vides (<emph>stopword list</emph>) ; c'est une &#233;tape courante dans la mod&#233;lisation th&#233;matique (<emph>topic modelling</emph>).  Personnellement, je n'encourage pas cette pratique parce qu'examiner les mots tr&#232;s fr&#233;quents est justement la force des ordinateurs ! La lecture humaine a  tendance &#224; ne pas les remarquer beaucoup. Mais les ordinateurs, en particulier les logiciels comme AntConc, peuvent nous montrer o&#249; ces mots apparaissent et o&#249; ils n'apparaissent pas, ce qui peut &#234;tre tr&#232;s int&#233;ressant, surtout dans de tr&#232;s grandes collections de textes - comme nous l'avons vu pr&#233;c&#233;demment dans le tutoriel, avec <emph>the</emph>, <emph>a</emph>, <emph>she</emph> et <emph>he</emph>.</p>
<p>De plus, dans les corpus en anglais, il se peut qu'une seule lettre <emph>s</emph> apparaisse, plac&#233;e assez haute &#233;galement - qui repr&#233;sente les <emph>'s</emph> possessifs (l'apostrophe ne sera pas compt&#233;e), mais AntConc consid&#232;re qu'il s'agit d'un autre mot. Un autre exemple de ceci est <emph>'t</emph> apparaissant avec <emph>do</emph>, car ils se contractent comme <emph>don't</emph>. Comme ils apparaissent si souvent ensemble, il est fort probable qu'ils soient colocalis&#233;s.</p>
<p><hi rend="bold">Exercice :</hi>
G&#233;n&#233;rez des cooccurrences pour "<emph>m?n</emph>" et "<emph>wom?n</emph>". Maintenant, triez-les par fr&#233;quence jusqu'&#224; 1L.
Cela nous renseigne sur ce qui rend un homme ou une femme digne d'&#234;tre vu(e) au cin&#233;ma " :</p>
<ul>
<li>les femmes doivent &#234;tre "belles" ou "enceintes" ou "sophistiqu&#233;es".</li>
<li>les hommes doivent &#234;tre en quelque sorte hors norme - "saints" ou "noirs" ou "vieux ".</li>
</ul>
<p>Ceci ne nous dit pas grand-chose sur les films en eux-m&#234;mes, mais plut&#244;t sur la fa&#231;on dont ces films sont d&#233;crits dans les critiques, et cela peut nous amener &#224; poser des questions plus nuanc&#233;es, comme "Comment les femmes dans les com&#233;dies romantiques sont-elles d&#233;crites dans les critiques &#233;crites par des hommes comparativement &#224; celles &#233;crites par des femmes ?"</p>
</div><div n="3"><head>Comparer des corpus</head>
<p>L'un des types d'analyse les plus int&#233;ressant consiste &#224; comparer votre corpus &#224; un corpus de r&#233;f&#233;rence plus volumineux.</p>
<p>J'ai s&#233;lectionn&#233; des critiques de films auxquels Steven Spielberg est associ&#233; (en tant que r&#233;alisateur ou producteur). On peut les comparer &#224; un corpus de r&#233;f&#233;rence de films de diff&#233;rents r&#233;alisateurs.</p>
<p>R&#233;fl&#233;chissez bien &#224; ce &#224; quoi pourrait ressembler un corpus de r&#233;f&#233;rence pour votre propre recherche (par exemple, une &#233;tude des &#233;crits d'Agatha Christie dans ses derni&#232;res ann&#233;es serait tr&#232;s utile comme corpus d'analyse pour la comparaison avec un corpus de r&#233;f&#233;rence constitu&#233; de tous ses romans). Rappelez-vous, encore une fois, que la construction de corpus est un sous-domaine &#224; part enti&#232;re.</p>
<p>Allez dans <emph>Settings</emph> &gt; <emph>Tool preferences</emph> &gt; <emph>Keyword List</emph> (Param&#232;tres &gt; Options des outils &gt; Liste des mots-cl&#233;s).
Sous "<emph>Reference Corpus</emph>" (Corpus de r&#233;f&#233;rence) assurez vous que "<emph>Use raw files</emph>" (Utiliser des fichiers bruts) est coch&#233;.
Puis, cliquez sur <emph>Add Directory</emph> &gt; <emph>Open</emph> (Ajouter r&#233;pertoire &gt; Ouvrir) pour ouvrir le r&#233;pertoire contenant les fichiers qui composent le corpus de r&#233;f&#233;rence.
Assurez-vous d'avoir une liste compl&#232;te de fichiers !</p>
<figure><desc>Ajouter un corpus de r&#233;f&#233;rence.</desc><graphic url="adding-a-reference-corpus.png"/></figure>
<p>Cliquez sur "<emph>Load</emph>" (Charger), attendez et une fois que la boite "<emph>Loaded</emph>" (Charg&#233;) est coch&#233;e, appuyez sur "<emph>Apply</emph>" (Appliquer).
Vous pouvez &#233;galement opter pour l'&#233;change de corpus de r&#233;f&#233;rence et de fichiers principaux (<emph>Swap Ref/Main files</emph>). Il vaut la peine de regarder ce que les deux r&#233;sultats montrent.</p>
<blockquote>
<p>Si vous utilisez une version plus r&#233;cente d'AntConc, l'option Swap Ref/Main files peut &#234;tre marqu&#233;e comme "swap with target files", et vous devrez vous assurer que les corpus cible et de r&#233;f&#233;rence ont &#233;t&#233; charg&#233;s (appuyez sur le bouton "Load" &#224; chaque fois que vous t&#233;l&#233;chargez, ou &#233;changez, un corpus).</p>
</blockquote>
<p>Dans <emph>Keyword List</emph> (Liste des mots-cl&#233;s), appuyez simplement sur "<emph>Start</emph>" (D&#233;marrer) (sans rien taper dans le champ de recherche). Si vous venez de changer le corpus de r&#233;f&#233;rence et les fichiers cibles, il se peut qu'on vous demande de cr&#233;er une nouvelle liste de mots avant qu'AntConc ne calcule les mots-cl&#233;s. Nous voyons une liste de mots-cl&#233;s qui ont des mots qui sont beaucoup plus "inhabituels" - plus statistiquement inattendus - dans le corpus que nous regardons en comparaison avec le corpus de r&#233;f&#233;rence.</p>
<blockquote>
<p>Keyness (sp&#233;cificit&#233;) : c'est la fr&#233;quence d'un mot dans le texte par rapport &#224; sa fr&#233;quence dans un corpus de r&#233;f&#233;rence, "telle que la probabilit&#233; statistique calcul&#233;e par une proc&#233;dure appropri&#233;e soit inf&#233;rieure ou &#233;gale &#224; une valeur p indiqu&#233;e par l'utilisateur" (tir&#233; d'<link target="http://www.lexically.net/downloads/version6/HTML/index.html?keyness_definition.htm">ici</link>). Pour ceux et celles qui s'int&#233;ressent aux d&#233;tails statistiques, voir la section sur la sp&#233;cificit&#233; (Keyness) &#224; la page 7 du <link target="http://www.laurenceanthony.net/software/antconc/releases/AntConc335/help.pdf">fichier read me</link> de Laurence Anthony.</p>
</blockquote>
<p>Quels sont nos mots-cl&#233;s ?</p>
<figure><desc>Spielberg vs critiques de films.</desc><graphic url="spielberg-vs-movie-reviews.png"/></figure>
</div></div><div n="2"><head>Discussion : Faire des comparaisons significatives</head>
<p>Gardez &#224; l'esprit que la fa&#231;on dont vous organisez vos fichiers textes fait une diff&#233;rence entre les types de questions que vous pouvez poser et les types de r&#233;sultats que vous obtiendrez.  N'oubliez pas que nous comparons ici les critiques "n&#233;gatives" et "positives" de mani&#232;re assez simpliste. Vous pourriez, par exemple, faire d'autres comparaisons avec diff&#233;rents sous-ensembles, qui donnent lieu &#224; des questions de nature tr&#232;s diff&#233;rente.</p>
<p>Bien s&#251;r, les fichiers que vous mettez dans votre corpus fa&#231;onneront vos r&#233;sultats. L&#224; encore, la question de la repr&#233;sentativit&#233; et de l'&#233;chantillonnage est tr&#232;s pertinente - il n'est pas toujours n&#233;cessaire ou m&#234;me id&#233;al d'utiliser <emph>tous</emph> les ensembles de donn&#233;es en m&#234;me temps, m&#234;me si vous les avez. &#192; ce stade, il vaut vraiment la peine de s'interroger sur la fa&#231;on dont ces m&#233;thodes aident &#224; produire des questions de recherche.</p>
<p>Lorsque vous r&#233;fl&#233;chissez &#224; la fa&#231;on dont les critiques de films fonctionnent en tant que genre, vous pourriez envisager, par exemple....</p>
<ul>
<li>Critiques de films vs critiques de musique</li>
<li>Critiques de films vs critiques de livres</li>
<li>Critiques de films vs actualit&#233;s sur le sport</li>
<li>Critiques de films vs actualit&#233;s en g&#233;n&#233;ral</li>
</ul>
<p>Chacune de ces comparaisons vous dira quelque chose de diff&#233;rent, et peut produire diff&#233;rentes questions de recherche, telles que :</p>
<ul>
<li>En quoi les critiques de films sont-elles diff&#233;rentes des autres types de critiques de m&#233;dias ?</li>
<li>En quoi les critiques de films sont-elles diff&#233;rentes des autres types d'&#233;crits publi&#233;s ?</li>
<li>Comment les critiques de films se comparent-elles &#224; d'autres types sp&#233;cifiques d'&#233;criture, comme l'&#233;criture sportive ?</li>
<li>Quel est le point commun entre les critiques de films et les critiques de musique ?</li>
</ul>
<p>Et bien s&#251;r, vous pouvez retourner ces questions pour faire d'autres questions de recherche :</p>
<ul>
<li>En quoi les critiques de livres sont-elles diff&#233;rentes des critiques de films ?</li>
<li>En quoi les critiques musicales sont-elles diff&#233;rentes des critiques de films ?</li>
<li>Qu'est-ce que les articles de journaux publi&#233;s ont en commun ?</li>
<li>Comment les critiques de films sont-elles similaires &#224; d'autres types d'&#233;crits publi&#233;s ?</li>
</ul>
<p>En r&#233;sum&#233;, il vaut la peine de r&#233;fl&#233;chir :</p>
<ul>
<li>Pourquoi vous voudrez comparer deux corpus ?</li>
<li>Quels sont les types de requ&#234;tes qui rendent les questions de recherche pertinentes ?</li>
<li>Aux principes de construction de corpus : &#233;chantillonnage et s'assurer que vous pouvez obtenir quelque chose de repr&#233;sentatif</li>
</ul>
</div><div n="2"><head>Ressources suppl&#233;mentaires pour ce tutoriel</head>
<h4>En anglais</h4>
<p><link target="http://hfroehlich.wordpress.com/2014/05/11/intro-bibliography-corpus-linguistics/">Une courte bibliographie sur la linguistique des corpus</link>.<br/>
<link target="http://hfroehli.ch/workshops/getting-started-with-antconc/">Une version plus d&#233;taill&#233;e de ce tutoriel, en supposant que vous n'avez aucune connaissance en informatique.</link>  </p>
<h4>En fran&#231;ais (notes de la version traduite)</h4>
<p><link target="http://edutechwiki.unige.ch/fr/AntConc#">Page AntConc de EduTech Wiki de l'UNIGE</link><br/>
<link target="http://explorationdecorpus.corpusecrits.huma-num.fr/antconc/">Page AntConc sur le site Exploration de corpus : outils et pratiques</link><br/>
<link target="http://cid.ens-lyon.fr/ac_article.asp?fic=antconc.asp">Tutoriel AntConc du CID-ENS Lyon</link>    </p>
<p>En France, des outils similaires &#224; AntConc ont &#233;t&#233; d&#233;v&#233;lopp&#233;s dans le cadre de la textom&#233;trie, de la lexicom&#233;trie, et de la logom&#233;trie, souvent par des historien(ne)s. On peut nommer notamment <link target="http://ancilla.unice.fr/">Hyperbase</link>, <link target="http://iramuteq.org/">Iramuteq</link>, <link target="http://www.lexi-co.com/">Lexico</link> ou <link target="http://textometrie.ens-lyon.fr/?lang=fr">TXM</link>. Merci de consulter &#233;galement: B&#233;n&#233;dicte Pincemin, <link target="https://halshs.archives-ouvertes.fr/halshs-01843695/document">"Sept logiciels de textom&#233;trie"</link>, 2018.  </p>
<h4>Bibliographie non-exhaustive</h4>
<p>Ludovic Lebart et Andr&#233; Salem, <link target="http://lexicometrica.univ-paris3.fr/livre/st94/st94-tdm.html"><emph>Statistique textuelle</emph></link>, 1994.<br/>
Damon Mayaffre, <link target="https://hal.archives-ouvertes.fr/hal-00553808">"L&#8217;entrelacement lexical des textes. Cooccurrences et lexicom&#233;trie"</link>, <emph>Journ&#233;es de linguistique de corpus</emph>, 2008, p. 91-102.<br/>
<link target="https://journals.openedition.org/corpus/2183">La cooccurrence, du fait statistique au fait textuel</link>, <emph>Corpus</emph>, 11, 2012, num&#233;ro coordonn&#233; par Damon Mayaffre et Jean-Marie Viprey.  </p>
</div></body>
  </text>
</TEI>
