<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introducci&#243;n a Map Warper
</title>
  <authors>Anthony Pic&#243;n Rodr&#237;guez,Miguel Cuadros</authors>
  <date>2020-07-11</date>
  <tested_date>2021-11-02</tested_date>
  <reviewers>Jos&#233; Luis Losada,Riva Quiroga</reviewers>
  <editors>Antonio Rojas Castro</editors>
  <layout>lesson</layout>
  <difficulty>2</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/212</review-ticket>
  <activity>transforming</activity>
  <topics>mapping,data-visualization</topics>
  <abstract>En esta lecci&#243;n aprender&#225;s a georreferenciar im&#225;genes digitales con la herramienta Map Warper y a vincularlas a sistemas de informaci&#243;n geogr&#225;ficos.</abstract>
  <avatar_alt>imagen de un mapa Cafetero de la Rep&#250;blica de Colombia</avatar_alt>
  <doi>10.46430/phes0048</doi>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="2"><head>La herramienta de Map Warper</head>
<p><link target="https://mapwarper.net/">Map Warper</link> es una herramienta de c&#243;digo abierto, acceso libre, desarrollada y soportada, desde 2008, por <link target="https://thinkwhere.wordpress.com/">Tim Waters</link>, para georreferenciar y visualizar im&#225;genes de &#225;reas geogr&#225;ficas sin necesidad de instalar un programa inform&#225;tico. La herramienta es implementada en distintos proyectos digitales, de distintas instituciones del mundo y utilizada por diversos profesionales no especializados en el campo de la cartograf&#237;a.</p>
<p>Map Warper fue dise&#241;ada para georreferenciar mapas antiguos -mapamundis, portulanos, cartas n&#225;uticas, planos topogr&#225;ficos, planos arquitect&#243;nicos, cartas geogr&#225;ficas-, fotograf&#237;as a&#233;reas y dem&#225;s materiales cartogr&#225;ficos contenidos en las colecciones de caracter patrimonial. En tal sentido, la herramienta nos posibilita la generaci&#243;n de material georreferenciado para trabajo en escritorio -r&#225;steres- o en linea -Map Server-, &#250;tiles para vincular a sistemas de informaci&#243;n geogr&#225;fico (QGIS, JOSM, ArcGIS, Google Earth, World Map, otros). Asimismo, la herramienta ayuda a descentralizar y agilizar los procesos de georreferenciaci&#243;n, catalogaci&#243;n y visualizaci&#243;n, ya que su plataforma crea un entorno de colaboraci&#243;n abierta.</p>
<p>Gracias a sus caracter&#237;sticas, la herramienta es &#250;til a investigadores, profesores y estudiantes, como a instituciones que est&#225;n desarrollando procesos de digitalizaci&#243;n, visualizaci&#243;n y experimentaci&#243;n del material cartogr&#225;fico de sus colecciones, o para el desarrollo de proyectos en humanidades espaciales, como son los caso de la <link target="http://bibliotecanacional.gov.co/es-co/colecciones/biblioteca-digital/mapoteca">Mapoteca Digital</link> de la Biblioteca Nacional de Colombia, <link target="http://cartografia.bogotaendocumentos.com/">Cartograf&#237;a de Bogot&#225;</link> de la Universidad Nacional de Colombia, <link target="https://paisajescoloniales.com/">Paisajes coloniales: redibujando los territorios andinos en el siglo XVII</link> de la Universidad de los Andes (Colombia).</p>
<div type="3"><head>Lo que aprender&#225;s en este tutorial</head>
<p>El ambiente global que vivimos ha estado marcado por un profundo desarrrollo t&#233;cnico y un cambio epistemol&#243;gico que ha dado mayor atenci&#243;n al espacio y a la espacialidad. Esto ha permitido a las tecnolog&#237;as influir y modificar las formas en que reflexionamos y comprendemos las Ciencias Sociales y Humanas. Gracias a las posibilidades que genera dichas tecnolog&#237;as para potenciar la investigaci&#243;n y visualizaci&#243;n de resultados, en ese sentido, tambi&#233;n evidenciamos una renovaci&#243;n en las formas en que pensamos e interpretamos el pasado. Por tanto, la herramienta abordada en esta lecci&#243;n es producto y productora de estas relaciones tecnol&#243;gicas que han permitido generar y expandir nuevas interpretaciones, desde esta nueva narrativa espacial.</p>
<p>La lecci&#243;n se concibe como el primer componente de un m&#243;dulo m&#225;s amplio, orientado al manejo de herramientas digitales para georreferenciar, vectorizar, extraer, organizar y experimentar con informaci&#243;n geogr&#225;fica, presente en la documentaci&#243;n bibliogr&#225;fica y cartogr&#225;fica antigua que los distintos centros de documentaci&#243;n (archivos, bibliotecas, museos) est&#225;n digitalizando.</p>
<p>En este tutorial se georreferencia el Mapa Cafetero de la Rep&#250;blica de Colombia, elaborado en 1933 por la Federaci&#243;n Nacional de Cafeteros de este pa&#237;s. Este mapa se reconoce como uno de los referentes del desarrollo de la cartograf&#237;a tem&#225;tica moderna en Colombia. La georreferenciaci&#243;n de esta y otras cartograf&#237;as antiguas resulta relevante debido al inter&#233;s que presta su informaci&#243;n localizada a los estudiosos de la historia.</p>
<p>Al finalizar este tutorial se tendr&#225; la capacidad de georreferenciar materiales cartogr&#225;ficos (mapas, planos, fotograf&#237;as a&#233;reas y otros) mediante la herramienta de Map Warper. A su vez, la lecci&#243;n es un complemento a otras lecciones de <emph>Programming Historian</emph>, referentes a la utilizaci&#243;n de Sistemas de Informaci&#243;n Geogr&#225;fica para el an&#225;lisis espacial: <link target="/es/lecciones/georreferenciar-qgis">Georreferenciar con QGIS 2.0</link> e <link target="/es/lecciones/intro-a-google-maps-y-google-earth">Introducci&#243;n a Google Maps y Google Earth</link>. Adem&#225;s de conocer las pautas t&#233;cnicas esenciales para la georreferenciaci&#243;n de mapas antiguos, esta lecci&#243;n sirve como introducci&#243;n para el estudio del patrimonio cartogr&#225;fico y su potencialidad en la investigaci&#243;n hist&#243;rica.</p>
</div></div>
      <div type="2"><head>Registro</head>
<div type="3"><head>Iniciar sesi&#243;n</head>
<p>Desde tu navegador favorito ingresa en <link target="https://mapwarper.net/">www.mapwarper.net</link> y ve a la pesta&#241;a &#8220;Create Account&#8221; (Crear Cuenta), ubicada en la esquina superior derecha del portal. En Create Account introduce la informaci&#243;n correspondiente seg&#250;n los campos solicitados. Recuerda que puedes utilizar tu cuenta de Facebook, OpenstreetMap y GitHub para agilizar el proceso de registro.</p>
<p><img src="https://i.imgur.com/MXAKDDx.gif" alt="Registrarse en Map Warper"/></p>
</div><div type="3"><head>Cargar mapa</head>
<p>Para cargar un material cartogr&#225;fico en Map Warper selecciona la pesta&#241;a &#8220;Upload Map&#8221;. Ah&#237; podr&#225;s vincular el mapa directamente desde un archivo local o anclarla desde un repositorio web por medio de la URL correspondiente. En este paso tambi&#233;n puedes ir agregando los metadatos del material a georreferenciar. Para concluir debes hacer clic en la opci&#243;n &#8220;Create&#8221;.</p>
<p>En caso de no tener un mapa para cargar a la herramienta puedes realizar el tutorial seleccionando uno del siguiente <link target="/assets/map-warper.csv">listado</link>. As&#237;, adem&#225;s de aprender, tambi&#233;n ayudar&#225;s a georreferenciar un mapa del proyecto colaborativo de la Mapoteca Digital de la Biblioteca Nacional de Colombia.</p>
<blockquote>
<p>Si se selecciona un mapa del listado para georreferenciar, es posible saltar a la secci&#243;n <emph>Georreferenciaci&#243;n</emph></p>
</blockquote>
</div><div type="3"><head>Editar</head>
<p>En este paso se a&#241;aden los metadatos a la imagen cargada. Si bien esto es opcional, vale la pena insistir en su importancia para los procesos de catalogaci&#243;n y organizaci&#243;n de los materiales cartogr&#225;ficos. Debido a la naturaleza colaborativa y colectiva de Map Warper, recomendamos incluir la informaci&#243;n de los siguientes metadatos solicitados.</p>
<ul>
<li>Title: N&#250;mero de registro y criterio de titulaci&#243;n que permita organizar la informaci&#243;n para ubicarla en su repositorio de origen.</li>
<li>Description: Referencia de la imagen cartogr&#225;fica.</li>
<li>Issue Year: A&#241;o de elaboraci&#243;n o publicaci&#243;n del mapa.</li>
<li>Tags: Tres a cinco etiquetas que describan el material.</li>
<li>Subject Area: Tipolog&#237;a del material cartogr&#225;fico.</li>
<li>Source: URL de la visualizaci&#243;n del documento.</li>
<li>Place of publication: Lugar de publicaci&#243;n o de elaboraci&#243;n del documento.</li>
<li>Scale: Escala num&#233;rica.</li>
<li>Metadata Projection: Proyecci&#243;n cartogr&#225;fica.</li>
</ul>
</div><div type="3"><head>Metadatos</head>
<p>La pesta&#241;a &#8220;Metadata&#8221; visualiza la informaci&#243;n cumplimentada en la etapa de Upload Map y Edit. Se recomienda vincular la mayor cantidad de informaci&#243;n del recurso compartido, para que otros usuarios de la herramienta cuenten con datos sobre el contenido.</p>
</div></div>
      <div type="2"><head>Georreferenciaci&#243;n</head>
<p class="alert alert-warning" role="alert" style="alert alert-warning">
  En la versi&#243;n de Map Warper que se encuentra actualmente disponible ya no es posible a&#241;adir un mapa base.
</p>
<p>En este tutorial explicaremos el proceso de georreferenciaci&#243;n con el <link target="http://catalogoenlinea.bibliotecanacional.gov.co/custom/web/content/mapoteca/fmapoteca_984_figac_16/fmapoteca_984_figac_16.html">Mapa Cafetero de la Rep&#250;blica de Colombia</link> de la Mapoteca Digital de la Biblioteca Nacional de Colombia. El documento cartogr&#225;fico lo public&#243; la Federaci&#243;n Nacional de Cafeteros de Colombia en 1933, en una &#233;poca en donde el caf&#233; era la industria agr&#237;cola rectora de la econom&#237;a colombiana, como resultado del primer censo cafetero del pa&#237;s realizado en 1932.</p>
<p>Recordamos que en caso de no tener cargada cartograf&#237;a alguna, se podr&#225; utilizar los mapas del siguiente listado, y en caso de recurrir al <link target="/assets/map-warper.csv">listado</link> resaltar el mapa seleccionado en el interior del listado.</p>
<div type="3"><head>Visualizaci&#243;n del mapa</head>
<p>Esta pesta&#241;a nos presenta la visualizaci&#243;n del documento cartogr&#225;fico vinculado. Entre las herramientas de navegaci&#243;n contamos con la opci&#243;n de acercar y mover. En este segmento es importante explorar el documento cartogr&#225;fico y formularse las siguientes preguntas: &#191;qu&#233; lugar est&#225; representando en el material cartogr&#225;fico? &#191;Cu&#225;les fueron los cambios a lo largo del tiempo del espacio representado? &#191;Reconoces alg&#250;n punto de referencia geogr&#225;fica vigente? Tambi&#233;n es importante preguntarse sobre cu&#225;l es el sentido de la georreferenciaci&#243;n del mapa antiguo a realizar.  </p>
<p>Por su parte, en t&#233;rminos del an&#225;lisis hist&#243;rico es importante identificar los componentes tem&#225;ticos del material cartogr&#225;fico a georreferenciar (componentes urbanos y naturales, jurisdicciones, distribuci&#243;n de recursos, entre otros) y los diferentes referentes documentales con los cuales se podr&#237;a cruzar y complementar la informaci&#243;n brindada (estad&#237;sticas, reportes gubernamentales, documentos personales o incluso otros materiales cartogr&#225;ficos elaborados posterior o anteriormente al utilizado). Estas consideraciones son de bastante utilidad para el desarrollado del siguiente, debido a que el aspecto t&#233;cnico, deber&#225; estar en funci&#243;n del uso interpretativo que se har&#225; del material.</p>
</div><div type="3"><head>Georrectificaci&#243;n</head>
<p>En este segmento realizaremos la georreferenciaci&#243;n del documento cartogr&#225;fico seleccionado. En la ventana de "Rectify" se encontrar&#225;n dos recuadros: el recuadro de la izquierda contiene al mapa vinculado o seleccionado del listado; el recuadro de la derecha contiene el mapa base -OpenStreetMap-, es decir, la capa de referencia sobre la cual georreferenciaremos el mapa. Tambi&#233;n en el costado inferior de la ventana, se encontrar&#225; una caja de herramientas llamada "Control Panel", las opciones de la caja permiten complejizar y expandir las posibilidades de georreferenciaci&#243;n.</p>
<p>En este aspecto, para comprender mejor el desarrollo de esta acci&#243;n t&#233;cnica, detallamos cada una de las funciones y opciones disponibles a tener en cuenta en el segmento de "Rectify":</p>
<p><img src="https://mapwarper.net/assets/openlayers/theme/dark/layer_switcher_maximize.png" alt="Layer"/>: El bot&#243;n <emph>Layer</emph> (capa) nos permite seleccionar la capa base de OpenStreetMap o la de Mapbox Satellite. Adem&#225;s, incluye la funci&#243;n <emph>Overlays</emph> (superponer) que permite sobreponer el mapa de trabajo -el Mapa Cafetero de la Rep&#250;blica de Colombia o el que usted seleccion&#243;- despu&#233;s de confirmada la georreferenciaci&#243;n.</p>
<p><img src="/images/introduccion-map-warper/add%20custom%20base%20map.png" alt="Add Custom Basemap"/>: El bot&#243;n <emph>Add Custom Basemap</emph> (agregar mapa base), ubicado en el recuadro del lado derecho, nos permite a&#241;adir otra capa base de servidor, tipo XYZ Tiles, tal es el caso de las capas disponibles de: OpenStreetMap, Google Maps, Bing, CARTO, ESRI, Stamen, entre otras. Tambi&#233;n las cartograf&#237;as georreferenciadas contenidas en la aplicaci&#243;n de Map Warper.</p>
<pre><code xml:id="code_introduccion-map-warper_0" type="block" corresp="code_introduccion-map-warper_0.txt"></code></pre>
<p><img src="/images/introduccion-map-warper/add%20control%20point.gif" alt="Add control point"/>: El bot&#243;n <emph>Add control point</emph> (agregar punto de control), ubicado en ambos recuadros, sirve para posicionar los puntos de control que relacionan el mapa vinculado o seleccionado con la capa base predeterminada o establecida.</p>
<p>Al hacer clic en el bot&#243;n, debemos ubicar un punto de control en ambos recuadros, buscando la debida correspondencia entre el mapa vinculado con el mapa base y, luego de tener certeza de las respectivas ubicaciones, se da clic en el bot&#243;n inferior <emph>Add Control Point</emph> para confirmar el punto. Luego la acci&#243;n se replica hasta alcanzar el n&#250;mero de puntos de control deseados (&gt;3) y la confirmaci&#243;n de los resultados se ver&#225; reflejada al hacer clic en <emph>WARP IMAGEN!</emph>.</p>
<blockquote>
<p>Recomendamos acercarse en ambas ventanas de visualizaci&#243;n al agregar el punto, para verificar la correspondencia del punto asignado, ya que la acci&#243;n ayudar&#225; a confirmar y precisar la ubicaci&#243;n de cada uno de los puntos de control asignados. La precisi&#243;n entre las geometr&#237;as del mapa georreferenciado ser&#225; proporcional al n&#250;mero de puntos de control asignados.</p>
</blockquote>
<p><img src="/images/introduccion-map-warper/move%20control%20point.gif" alt="Move control point"/>: El bot&#243;n <emph>Move Control Point</emph> (mover punto de control) permite desplazar o reubicar los puntos de control ya a&#241;adidos en ambas ventanas de visualizaci&#243;n.</p>
<p><img src="https://i.imgur.com/qltUq7S.gif" alt="Move around map"/>: El bot&#243;n <emph>Move Around Map</emph> (moverse por el mapa) permite explorar los mapas en ambas ventanas de visualizaci&#243;n, sin la necesidad de asignar o mover punto de control alguno, apropiada  para la verificaci&#243;n de puntos asignados.</p>
<p>El candado que se encuentra ubicado en medio de los dos recuadros de visualizaci&#243;n, ayuda a guiar la asignaci&#243;n y el movimiento de puntos de control. La opci&#243;n <img src="/images/introduccion-map-warper/Candado_cerrado.png" alt="Zoom lock"/> <emph>Zoom lock</emph> (candado bloqueado) permite una sincronizaci&#243;n entre el zoom de las dos ventanas de visualizaci&#243;n, &#250;til para facilitar la ubicaci&#243;n y verificaci&#243;n de puntos de control. Asimismo, el bot&#243;n integra la opci&#243;n <img src="/images/introduccion-map-warper/lock_open.png" alt="Pan"/> <emph>Pan</emph> (candado abierto), contraria a <emph>Zoom lock</emph>, debido a que permite ejecutar un acercamiento independiente y no sincronizado en cada recuadro de visualizaci&#243;n.</p>
<p><img src="/images/introduccion-map-warper/Rectify.gif" alt="Georectificaci&#243;n"/></p>
<p><img src="https://mapwarper.net/assets/icons/keyboard-6e91cf12c7ef90c54f1c1038b5166a34.png" alt="Keyboard shortcuts"/>: El bot&#243;n <emph>Keyboard shortcuts</emph> (atajos de teclado) referencia las letras de acceso r&#225;pido de nuestro teclado que proporcionan una forma alternativa y sencilla de acciones que podr&#237;an tardar m&#225;s tiempos hacerlas con el mouse.</p>
<ul>
<li>
<p><emph>p</emph>: La tecla activa el modo <emph>Move Control Point</emph> <img src="/images/introduccion-map-warper/add%20control%20point.gif" alt="Add control point"/></p>
</li>
<li>
<p><emph>d</emph>: La tecla activa el modo <emph>Move Control Point</emph> <img src="/images/introduccion-map-warper/move%20control%20point.gif" alt="Move control point"/></p>
</li>
<li>
<p><emph>m</emph>: La tecla activa el modo <emph>Move Around Map</emph> <img src="https://i.imgur.com/qltUq7S.gif" alt="Move around map"/></p>
</li>
<li>
<p><emph>q</emph>: La tecla agrega la marca de punto de control sobre la posici&#243;n del mouse.</p>
</li>
<li>
<p><emph>a</emph>: La tecla agrega las marcas de punto de control sobre la posici&#243;n del mouse, sincronizando la posici&#243;n en ambas ventanas de visualizaci&#243;n.</p>
</li>
<li>
<p><emph>Enter</emph>: La tecla remplaza el clic en <emph>Add Control Point</emph> al confirmar el punto.</p>
</li>
</ul>
<p><emph><hi rend="bold">Control Points</hi></emph> (Puntos de control): La opci&#243;n nos muestra la tabla que contiene los valores de los puntos de control que se han asignado en el proceso de georreferenciaci&#243;n y su posibilidad de eliminaci&#243;n.</p>
<p>Tambi&#233;n incluye un campo que define el valor del error geom&#233;trico, producto de las alteraciones que provoc&#243; la georreferenciaci&#243;nen en la geometr&#237;a del mapa antiguo. En donde se discrimina el valor de error de cada punto y la media ponderada de los mismo. De igual modo, propone una clasificaci&#243;n crom&#225;tica que va desde color azul hasta el color rojo, en sentido ascendente del valor de error.</p>
<p>El archivo <img src="https://mapwarper.net/assets/csv-20x25-6bb4f7d2df14b1f8031eac9c98523bdf.png" alt="csv"/> disponible al final de la tabla permite exportar la compilaci&#243;n de datos obtenidos. El archivo es conveniente para importa dichos datos a distintas aplicaciones que leen este tipo de informaci&#243;n. La compilaci&#243;n tambi&#233;n se podr&#237;a pensar como archivo de preservaci&#243;n digital del proceso de georreferenciaci&#243;n del mapa antiguo.</p>
<p><img src="/images/introduccion-map-warper/Rectify_II.gif" alt="Georrectificaci&#243;n"/></p>
<p><emph><hi rend="bold">Add Control Point Manually</hi></emph> (Agregar punto de control manualmente): Al dar clic en <emph>Add Control Point Manually</emph>, se agrega un punto de control vac&#237;o con valores al cero en coordenadas de origen (Image X &#8211; Imagen Y) y de destino (Lon - Lat). La opci&#243;n da la posibilidad de agregar los valores manualmente en la tabla de control. Asimismo, en caso de conocer las coordenadas geogr&#225;ficas a referenciar, facilita una alineaci&#243;n m&#225;s precisa entre los puntos de control de origen y de destino en la georreferenciaci&#243;n del mapa trabajado.</p>
<p><emph><hi rend="bold">Add Control Points from CSV</hi></emph> (Agregar puntos de control desde CSV): Esta opci&#243;n permite cargar un archivo <code type="inline">.csv</code> (Comma Separated Values) para automatizar la georreferenciaci&#243;n del mapa. La primera l&#237;nea del archivo <code type="inline">.csv</code> deber&#225; contener las etiquetas de la tabla de <emph>Control Points</emph>, y cada una de las l&#237;neas siguientes, deber&#225; contener los valores de los puntos de control de las coordenadas de origen (Image X &#8211; Imagen Y) y de destino (Lon - Lat), separados por comas.</p>
<p>El siguiente ejemplo de <code type="inline">.csv</code> tiene cuatro columnas, etiquetas con: 'x', 'y', 'lon' y 'lat', adem&#225;s tiene once filas incluida la fila del encabezado, mismo archivo que se descarg&#243; en el bot&#243;n de <img src="https://mapwarper.net/assets/csv-20x25-6bb4f7d2df14b1f8031eac9c98523bdf.png" alt="csv"/> de la imagen anterior.</p>
<pre><code xml:id="code_introduccion-map-warper_1" type="block" corresp="code_introduccion-map-warper_1.txt"></code></pre>
</div><div type="3"><head>Recorte</head>
<p>La pesta&#241;a <emph>Crop</emph> permite recortar el &#225;rea de inter&#233;s del mapa trabajado, por lo que resulta &#250;til para dividir mapas compuestos. El recuadro de visualizaci&#243;n integra las siguientes acciones: <img src="https://i.imgur.com/qltUq7S.gif" alt="enter image description here"/> <emph>Move around Map</emph> -mover mapa-, <img src="https://i.imgur.com/AcjK6gG.gif" alt="enter image description here"/> <emph>draw new polygon to mask</emph> -dibujar pol&#237;gono- y <img src="https://i.imgur.com/gcXUDga.gif" alt="enter image description here"/> <emph>delete a polygon</emph> -eliminar pol&#237;gono-. Una vez que hayamos demarcado el &#225;rea a mantener, hacemos clic en &#8220;Mask Map&#8221; para finalizar el recorte de la imagen.</p>
<p><img src="https://i.imgur.com/hYGuouI.gif" alt="enter image description here"/></p>
</div><div type="3"><head>Alinear</head>
<p>La pesta&#241;a <emph>Align</emph> permite organizar como mosaico un conjunto de cartograf&#237;as. Es una herramienta adecuada para conectar mapas fragmentados, fotograf&#237;as a&#233;rea y dem&#225;s documentos cartogr&#225;ficos que se encuentran fragmentados. No olvides hacer clic en &#8220;align map&#8221; para realizar la alineaci&#243;n de las im&#225;genes.</p>
<p><img src="https://i.imgur.com/qd3j7pw.gif" alt="enter image description here"/></p>
</div><div type="3"><head>Previsualizaci&#243;n</head>
<p>Esta pesta&#241;a permite visualizar los resultados ejecutados del paso <emph>Rectify</emph>. Es &#250;til para hacer seguimiento al proceso de georreferenciaci&#243;n llevado en curso. Al mismo tiempo, el recuadro de visualizaci&#243;n integra las herramientas de mover, zoom -ampliar o diminuir- , transparencia y <emph>layer</emph> <img src="https://mapwarper.net/assets/openlayers/theme/dark/layer_switcher_maximize.png" alt="layer"/>.</p>
</div></div>
      <div type="2"><head>Visualizaci&#243;n</head>
<div type="3"><head>Exportar</head>
<p class="alert alert-warning" role="alert" style="alert alert-warning">
  En la versi&#243;n de Map Warper que se encuentra actualmente disponible los siguientes formatos de exportaci&#243;n ya no est&#225;n disponibles: Tiles, Bibliographic Links, Bibliographic.
</p>
<p>La pesta&#241;a <emph>Export</emph> permite descargar el mapa georreferenciado en diferentes formatos est&#225;ndar para su visualizaci&#243;n en Sistemas de Informaci&#243;n Geogr&#225;fica (SIG). Los formatos que permite exportar la herramienta se agrupan en tres categor&#237;as:</p>
<ul>
<li>
<p>Images: GeoTiff, PNG rectificado. Estos formatos agregan coordenadas geogr&#225;ficas y un sistema de proyecci&#243;n al documento cartogr&#225;fico, permitiendo enlazar el documento georreferenciado a un SIG. Se recomienda utilizar estos formatos para trabajar en computadoras sin conectividad o baja conectividad a Internet.</p>
</li>
<li>
<p>Map Services: KML, WMS, Tiles. Los formatos geogr&#225;ficos de esta categor&#237;a cumplen una funci&#243;n hom&#243;loga a los enunciado en <emph>Images</emph>; sin embargo, solo se pueden utilizar en computadoras que cuentan con conectividad a Internet.</p>
</li>
<li>
<p>Ground Control Points: CSV. Esta categor&#237;a permite descargar la tabla Control Points confeccionada en el paso &#8220;Rectify&#8221;. La tabla agrupa los puntos de control entre la imagen r&#225;ster (mapa antiguo) con el mapa vectorial de OpenStreetMap, es decir, que asocia x,y a la longitud y la latitud, respectivamente.</p>
</li>
</ul>
<blockquote>
<p>La imagen georreferenciada puede tener diferentes comportamientos debido a la proyecci&#243;n, el sistema de coordenadas, el elipsoide y el datum que utilice en el Sistema de Informaci&#243;n Geogr&#225;fica correspondiente.</p>
</blockquote>
</div><div type="3"><head>Actividad</head>
<p>La pesta&#241;a &#8220;Activity&#8221; ayuda a monitorear el registro de intervenci&#243;n del documento cartogr&#225;fico. La actividad reconoce los campos: &#8220;Time&#8221; (fecha), &#8220;User&#8221; (usuario), &#8220;Map&#8221; (c&#243;digo de imagen), &#8220;Activity summary&#8221; (resumen de la actividad), &#8220;Version&#8221; (versi&#243;n de intervenci&#243;n) y &#8220;Further details&#8221; (detalles de la intervenci&#243;n). Por su parte, todos los usuarios de Map Warper pueden monitorear los cambios del material cartogr&#225;fico. A la par, en el segmento Activity, pueden hacer clic en <img src="https://mapwarper.net/assets/feed-icon-14x14-c61922c8668fd4f58ea3660692ba7854.png" alt="enter image description here"/> &#8220;RSS Feed&#8221; para descargar un informe general de las intervenciones ejecutadas, en formato <code type="inline">.rss</code>.</p>
</div><div type="3"><head>Comentar</head>
<p>La pesta&#241;a <emph>Comments</emph> permite agregar comentarios sobre el documento cartogr&#225;fico. Es un canal abierto que permite establecer comunicaci&#243;n con el usuario que comparti&#243; el material cartogr&#225;fico. En donde tambi&#233;n se podr&#237;a alimentar los procesos de descripci&#243;n y catalogaci&#243;n del mapa cargado, en la medida que usuarios sumen informaci&#243;n sobre el documento georreferenciado. Por &#250;ltimo, no olvides hacer clic en <emph>add comment</emph> para agregar el comentario.</p>
</div></div>
      <div type="2"><head>Consideraci&#243;n final</head>
<p>El procedimiento t&#233;cnico aprendido ser&#225; de gran utilidad no solo para la mera georreferenciaci&#243;n de un mapa antiguo, sino para expandir la reflexi&#243;n en torno a las distintas relaciones espaciales, entre el lugar, la historia y los sujetos. Tambi&#233;n para conectar al documento cartogr&#225;fico desde el escenario digital con los datos proveniente de otras fuentes primarias (documentaci&#243;n oficial, estad&#237;sticas, fotograf&#237;as, testimonios y otros). En ese sentido la lecci&#243;n es una introducci&#243;n m&#225;s a las posibilidades del uso de este tipo de material, en perspectiva hist&#243;rica de las dimensiones sociales que tambi&#233;n represent&#243; el objeto georreferenciado, y que se seguir&#225; estimulando la escena de las Humanidades Espaciales.</p>
</div>
    </body>
  </text>
</TEI>
