<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Limpar dados com o OpenRefine</title>
  <slug>limpar-dados-openrefine</slug>
  <original>cleaning-data-with-openrefine</original>
  <layout>lesson</layout>
  <collection>lessons</collection>
  <date>2013-08-05</date>
  <translation_date>2023-04-29</translation_date>
  <authors>Seth van Hooland,Ruben Verborgh,Max De Wilde</authors>
  <reviewers>Patrick Burns,Nora McGregor</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Francisco Nabais</translator>
  <translation-editor>Aracele Torres</translation-editor>
  <translation-reviewer>Eric Brasil,Joana Vieira Paulino</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/427</review-ticket>
  <difficulty>2</difficulty>
  <activity>transforming</activity>
  <topics>data-manipulation</topics>
  <abstract>Este tutorial foca-se na forma como o usu&#225;rio pode diagnosticar e agir perante a precis&#227;o dos dados</abstract>
  <avatar_alt>Dois homens a lavar a roupa ao ar livre</avatar_alt>
  <doi>10.46430/phpt0038</doi>
</metadata>
  <text>
    <body><div class="alert alert-info">
Nota de Tradu&#231;&#227;o: Alguns termos, por aparecerem constantemente e facilitarem a interpreta&#231;&#227;o das imagens, apenas foram propositadamente traduzidos uma vez e ser&#227;o colocados entre par&#234;nteses em portugu&#234;s na primeira vez que surgem.
</div>
<div n="1"><head>Objetivos da li&#231;&#227;o</head>
<p>N&#227;o aceite os dados tal como s&#227;o apresentados. Esta &#233; a principal mensagem deste tutorial que se foca na forma como os usu&#225;rios podem diagnosticar e agir perante a precis&#227;o dos dados. Nesta li&#231;&#227;o, o usu&#225;rio vai aprender os princ&#237;pios e a pr&#225;tica da limpeza de dados, ao mesmo tempo que aprende como &#233; que o <link target="http://openrefine.org"><emph>OpenRefine</emph></link> (em ingl&#234;s) pode ser utilizado para realizar quatro tarefas essenciais que v&#227;o ajudar na limpeza de dados:</p>
<ol>
<li>Remover registos duplicados</li>
<li>Separar m&#250;ltiplos valores contidos no mesmo campo </li>
<li>Analisar a distribui&#231;&#227;o de valores ao longo do Dataset</li>
<li>Agrupar diferentes representa&#231;&#245;es da mesma realidade</li>
</ol>
<p>Estes passos s&#227;o explicitados com a ajuda de uma s&#233;rie de exercicios baseados na cole&#231;&#227;o de metadados do <emph><link target="https://powerhouse.com.au/">Powerhouse</link></emph> (em ingl&#234;s), demonstrando, assim, como m&#233;todos (semi)autom&#225;ticos podem ajudar na corre&#231;&#227;o de erros dos dados.</p>
</div><div n="1"><head>Porque &#233; que os historiadores devem se preocupar com a qualidade dos dados?</head>
<p>Registros duplicados, valores vazios e formatos incossistentes s&#227;o fen&#243;menos com os quais devemos estar preparados para lidar quando utilizamos data sets hist&#243;ricos. Esta li&#231;&#227;o vai ensinar o usu&#225;rio a descobrir inconsist&#234;ncias nos dados contidos em tabelas ou bases de dados. &#192; medida que, cada vez mais, partilhamos, agregamos e reutilizamos dados na web, os historiadores ter&#227;o uma maior necessidade de responder a problemas inevit&#225;veis associados &#224; qualidade dos dados. Utilizando um programa chamado <emph>OpenRefine</emph>, o usu&#225;rio ser&#225; capaz de identificar facilmente  erros sistem&#225;ticos, tais como c&#233;lulas em branco, duplica&#231;&#245;es, inconsist&#234;ncias ortogr&#225;ficas, etc. O <emph>OpenRefine</emph> n&#227;o s&#243; permite um diagn&#243;stico r&#225;pido da precis&#227;o dos dados, mas tamb&#233;m age perante certos erros de forma autom&#225;tica.</p>
</div><div n="1"><head>Descri&#231;&#227;o da ferramenta: <emph>OpenRefine</emph></head>
<p>No passado, os historiadores dependiam de especialistas em tecnologias da informa&#231;&#227;o para diagnosticar a qualidade dos dados e para executar tarefas de limpeza dos mesmos. Isto exigia programas computacionais personalizados quando se trabalhava com data sets consider&#225;veis. Felizmente, o surgimento de Ferramentas Interativas de Transforma&#231;&#227;o de Dados (Interactive Data Transformation tools, ou IDTs em ingl&#234;s), permite que at&#233; profissionais sem habilidades t&#233;cnicas aprofundadas possam realizar opera&#231;&#245;es r&#225;pidas e baratas em grandes data sets.</p>
<p>As Ferramentas Interativas de Transforma&#231;&#227;o de Dados assemelham-se &#224;s tabelas de dados do desktop com as quais estamos familiarizados, chegando a partilhar funcionalidades com as mesmas. O usu&#225;rio pode, por exemplo, usar aplica&#231;&#245;es como o Microsoft Excel para organizar os seus dados com base em v&#225;rios filtros, sejam eles num&#233;ricos, alfab&#233;ticos ou at&#233; personalizados, o que permite detetar erros mais facilmente. Configurar estes filtros em tabelas de dados pode ser complicado, j&#225; que estes s&#227;o uma fun&#231;&#227;o secund&#225;ria do software. Geralmente, podemos dizer que as tabelas de dados s&#227;o projetadas para funcionar em linhas ou c&#233;lulas individuais, enquanto as Ferramentas Interativas de Transforma&#231;&#227;o de Dados operam em grandes intervalos de dados ao mesmo tempo. Estas "Tabelas de dados em esteroides" fornecem uma interface integrada e amig&#225;vel atrav&#233;s da qual os usu&#225;rios finais podem detetar e corrigir erros. </p>
<p>Nos &#250;ltimos anos, t&#234;m sido desenvolvidas v&#225;rias ferramentas para a transforma&#231;&#227;o de dados interativos, tais como <link target="https://perma.cc/Q6QD-E64N"><emph>Potter&#8217;s Wheel ABC</emph></link> (em ingl&#234;s) e <link target="https://perma.cc/Y45B-6ZLU"><emph>Wrangler</emph></link> (em ingl&#234;s). Aqui queremos concentrar-nos, sobretudo, no <emph>OpenRefine</emph> (anteriormente <emph>Freebase Gridworks</emph> e <emph>Google Refine</emph>), j&#225; que, na opini&#227;o dos autores, esta &#233; a ferramenta mais amig&#225;vel para processar e limpar eficazmente grandes quantidades de dados numa interface baseada no navegador de internet.</p>
<p>Al&#233;m do <emph><link target="https://perma.cc/32Z8-8EMT">data profiling</link></emph> (perfil de dados) (em ingl&#234;s) e das opera&#231;&#245;es de limpeza, as extens&#245;es do <emph>OpenRefine</emph> permitem aos usu&#225;rios identificar conceitos num texto desestruturado atrav&#233;s de um processo denominado <emph><link target="https://perma.cc/FCB6-9DU2">Named-Entity Recognition</link></emph> (Reconhecimento de Entidade Nomeada) (em ingl&#234;s) (NER)  e reconciliar os seus pr&#243;prios dados com bases de conhecimento existentes. Ao faz&#234;-lo, o <emph>OpenRefine</emph> pode ser uma ferramenta pr&#225;tica de liga&#231;&#227;o dos dados com conceitos e autoridades que j&#225; foram declarados na web por entidades como a <emph><link target="https://perma.cc/24QD-NP6Y">Library of Congress</link></emph> (Biblioteca do Congresso dos Estados Unidos da Am&#233;rica) (em ingl&#234;s) ou o <link target="https://perma.cc/48KR-ZTAJ">OCLC</link> (Centro de Bibliotecas de Computadores Online) (em ingl&#234;s). A limpeza de dados &#233; um pr&#233;-requisito para estas etapas; A taxa de sucesso do NER e o &#234;xito do processo de correspond&#234;ncia entre os dados do usu&#225;rio e as entidades externas, dependem da habilidade do mesmo de tornar estes dados o mais concretos poss&#237;vel.</p>
</div><div n="1"><head>Descri&#231;&#227;o do exerc&#237;cio: <emph>Powerhouse</emph></head>
<p>O <emph>Powerhouse</emph>, em Sydney, permite-lhe exportar gratuitamente os metadados da sua cole&#231;&#227;o no seu <link target="https://powerhouse.com.au/">s&#237;tio Web</link>. Este museu &#233; um dos maiores do mundo na &#225;rea da ci&#234;ncia e tecnologia, fornecendo acesso a quase 90,000 objetos, que v&#227;o desde motores a vapor at&#233; vidros finos e de pe&#231;as de alta-costura a chips de computadores.</p>
<p>O museu divulgou ativamente a sua cole&#231;&#227;o em linha e disponibilizou gratuitamente a maior parte dos seus dados. No seu s&#237;tio Web, era poss&#237;vel descarregar um ficheiro de texto separado por separadores denominado <code type="inline">phm-collection.tsv</code> e abri-lo como uma tabela de dados. O ficheiro descomprimido (58MB) cont&#233;m metadados b&#225;sicos (17 campos) para 75,823 objetos, sob a licen&#231;a <emph><link target="https://perma.cc/M3QW-RLW6">Creative Commons Attribution Share Alike (CCASA)</link></emph> (em ingl&#234;s). Neste tutorial utilizaremos uma c&#243;pia dos dados que est&#225; arquivada para o usu&#225;rio fazer o download (mais &#224; frente). Isto garante que se o <emph>Powerhouse</emph> atualizar os seus dados, o usu&#225;rio ainda vai conseguir acompanhar esta li&#231;&#227;o.</p>
<p>Ao longo do processo de limpeza e de cria&#231;&#227;o do perfil dos dados, a li&#231;&#227;o vai focar o campo das <code type="inline">'Categorias'</code>, que &#233; preenchido com termos do <link target="https://perma.cc/PEP6-X2LD"><emph>Powerhouse Object Names Thesaurus</emph> (BARTOC)</link> (em ingl&#234;s). O BARTOC reconhece o uso e a ortografia australiana e reflete, de uma maneira muito direta, os pontos fortes da cole&#231;&#227;o. Nesta cole&#231;&#227;o, o usu&#225;rio vai encontrar, por exemplo, mais e melhores representa&#231;&#245;es da hist&#243;ria social e das artes decorativas e menos objetos com nomes associados &#224;s belas-artes e &#224; hist&#243;ria natural.</p>
<p>Os termos no campo das Categorias compreendem o que chamamos de <link target="https://perma.cc/FEW7-CFDB">Vocabul&#225;rio Controlado</link>. Um Vocabul&#225;rio Controlado consiste em palavras-chave que, ao utilizarem um n&#250;mero limitado de termos, descrevem o conte&#250;do de uma cole&#231;&#227;o, sendo, normalmente, um ponto de entrada importante para historiadores em data sets de bibliotecas, arquivos e museus. &#201;, por isso, que ser&#225; dada uma import&#226;ncia especial ao campo das 'Categorias'. Depois de ser feita a limpeza dos dados, dever&#225; ser poss&#237;vel reutilizar os termos do Vocabul&#225;rio Controlado para encontrar informa&#231;&#227;o adicional sobre esses termos num outro lugar online. Isto &#233; conhecido como a cria&#231;&#227;o de <emph><link target="https://perma.cc/5SRF-V3UR">Linked Data</link></emph> (Dados Vinculados).</p>
<div n="2"><head>Primeiros passos: instala&#231;&#227;o do <emph>OpenRefine</emph> e importa&#231;&#227;o de dados</head>
<p>Dever&#225; ser feito o <link target="http://openrefine.org/#download_openrefine">Download do <emph>OpenRefine</emph></link> (em ingl&#234;s) e seguidas as instru&#231;&#245;es. O <emph>OpenRefine</emph> funciona em todas as plataformas: Windows, Mac, e Linux. Este ser&#225; aberto no navegador de internet do usu&#225;rio, mas &#233; importante entender que a aplica&#231;&#227;o &#233; executada localmente e que os dados n&#227;o ser&#227;o guardados online. Com o <emph>OpenRefine</emph> aberto no seu navegador de internet, clique em '<hi rend="bold">Language Settings</hi>', presente no canto superior esquerdo, e altere a linguagem para '<hi rend="bold">Portugu&#234;s</hi>'. Os arquivos de dados est&#227;o dispon&#237;veis no site <emph><link target="http://data.freeyourmetadata.org/powerhouse-museum/">FreeYourMetadata</link></emph>, que ser&#227;o utilizados ao longo deste tutorial. Por favor, fa&#231;a o Download do ficheiro <emph>phm-collection.tsv</emph> antes de continuar (tamb&#233;m arquivado no <emph>Programming Historian</emph> como: <emph><link target="/assets/phm-collection.tsv">phm-collection</link></emph>).</p>
<p>Na p&#225;gina inicial do <emph>OpenRefine</emph> crie um novo projeto utilizando o ficheiro de dados que fez o download e clique '<hi rend="bold">Pr&#243;ximo</hi>' . A primeira linha ser&#225; processada como o nome da coluna por defeito, mas ser&#225; preciso desmarcar a caixa de sele&#231;&#227;o 'Usar caracter " encerrar c&#233;lulas contendo separadores de colunas', j&#225; que as aspas dentro do ficheiro n&#227;o t&#234;m qualquer significado para o <emph>OpenRefine</emph>.  Al&#233;m disto, dever&#225; selecionar a caixa de sele&#231;&#227;o 'Tentar analisar texto de c&#233;lulas como n&#250;meros' para que o <emph>OpenRefine</emph> detete automaticamente n&#250;meros. Agora dever&#225; clicar em '<hi rend="bold">Criar projeto</hi>'. Se tudo correr como planejado, dever&#225; ver no canto superior esquerdo 75,814 linhas. Como alternativa poder&#225; fazer o Download diretamente do <link target="/assets/phm-collection.tsv">Projeto inicial <emph>OpenRefine</emph></link>.</p>
<p>O data set do <emph>Powerhouse</emph> consiste em metadados detalhados sobre todos os objetos da cole&#231;&#227;o incluindo o t&#237;tulo, a descri&#231;&#227;o, as v&#225;rias categorias &#224;s quais o item pertence, informa&#231;&#227;o sobre a proveni&#234;ncia do mesmo e um link persistente para a p&#225;gina que hospeda o objeto dentro do site do museu. Para ter uma ideia do objeto a que corresponde os metadados, clique no link persistente e o site ser&#225; aberto.  </p>
<figure><desc>Figura 1: Captura de tela de um objeto de amostra no site *Powerhouse*</desc><graphic url="en-or-cleaning-data-with-openrefine-01.png" alt="Imagem de um objeto de amostra no site *Powerhouse* onde &#233; poss&#237;vel observar um carro de brincar com desenhos de palha&#231;os"/></figure>
</div><div n="2"><head>Conhe&#231;a os seus dados</head>
<p>A primeira coisa a fazer &#233; observar e conhecer os seus dados. Poder&#225; inspecionar os diferentes valores de dados exibindo-os em <code type="inline">facetas e filtros</code>. Poder&#225; considerar a <link target="https://perma.cc/HKN9-NYXZ">faceta</link> (em ingl&#234;s) uma lente atrav&#233;s da qual &#233; poss&#237;vel ver um subconjunto espec&#237;fico de dados baseados no crit&#233;rio da sua escolha. Clique no tri&#226;ngulo em frente ao nome da coluna, selecione Faceta e crie uma Faceta. Por exemplo, experimente o <code type="inline">Faceta de texto</code> ou o <code type="inline">Faceta num&#233;rica</code>, dependendo da natureza dos valores contidos nesses campos (os valores num&#233;ricos est&#227;o expostos a verde). No entanto, tenha em aten&#231;&#227;o que estas Facetas de texto t&#234;m uma maior efic&#225;cia em campos com valores redundantes (<emph>Categories</emph> (categorias), por exemplo); Se ocorrer o erro 'Muitas para mostrar' voc&#234; pode escolher aumentar o limite da contagem de op&#231;&#245;es a cima do padr&#227;o dos 2,000. Todavia, um limite muito alto pode tornar o aplicativo mais lento (por norma, 5,000 &#233; uma escolha segura). Facetas num&#233;ricas n&#227;o t&#234;m esta restri&#231;&#227;o. Para mais op&#231;&#245;es, selecione Facetas personalizadas : Faceta por valores em branco, por exemplo, torna-se &#250;til na procura de quantos valores foram preenchidos em cada campo. Vamos explorar mais detalhadamente estas funcionalidades nos exerc&#237;cios a seguir.</p>
</div><div n="2"><head>Remo&#231;&#227;o de linhas em branco</head>
<p>Uma coisa que ir&#225; reparar quando criar Facetas num&#233;ricas para a coluna do <emph>Record ID</emph> (Identificador do registo), &#233; que existem tr&#234;s linhas sem dados. Poder&#225; encontr&#225;-las ao  desmarcar a caixa de sele&#231;&#227;o num&#233;rica, deixando apenas valores n&#227;o-num&#233;ricos. Na verdade, estes valores n&#227;o est&#227;o realmente a branco, mas cont&#234;m apenas um caractere de espa&#231;o em branco, que pode ser vis&#237;vel se mover o seu cursor para onde deveria estar esse valor e clicar no bot&#227;o '<hi rend="bold">edit</hi>' (Editar) que aparece. Para remover estas linhas, clique no tri&#226;ngulo em frente &#224; primeira coluna denominada por '<hi rend="bold">Todos</hi>' , selecione '<hi rend="bold">Editar linhas</hi>' e depois '<hi rend="bold">Remover as linhas que corresponderam</hi>'. Feche a faceta numerica para verificar que permanecem agora 75,811 linhas.</p>
</div><div n="2"><head>Remo&#231;&#227;o de duplica&#231;&#245;es</head>
<p>O segundo passo &#233; detetar e remover duplica&#231;&#245;es. Estas podem ser identificadas ao classificar colunas, como o <emph>Record ID</emph>, por um valor &#250;nico (neste caso vamos assumir que o <emph>Record ID</emph> &#233;, de facto, &#250;nico para cada entrada). Esta opera&#231;&#227;o pode ser realizada ao clicar no tri&#226;ngulo &#224; esquerda do <emph>Record ID</emph>, depois devemos selecionar a op&#231;&#227;o '<hi rend="bold">Ordenar</hi>&#8230;' e escolher o marcador '<hi rend="bold">n&#250;meros</hi>'. No <emph>OpenRefine</emph>, ordenar &#233; apenas uma ajuda visual, a n&#227;o ser que torne a reordena&#231;&#227;o permanente. Para o fazer, clique na op&#231;&#227;o Ordenar por cima do <emph>Marks</emph> (Marcas) e, em seguida, dever&#225; escolher a op&#231;&#227;o '<hi rend="bold">Reordenar linhas permanentemente</hi>'. Se se esquecer de fazer isto, posteriormente, ir&#225; ter resultados imprevis&#237;veis neste tutorial.</p>
<p>Linhas id&#234;nticas est&#227;o agora adjacentes umas &#224;s outras. Em seguida, deixe em branco as linhas do <emph>Record ID</emph> que t&#234;m o mesmo <emph>Record ID</emph> que as a cima delas, marcando-as como duplica&#231;&#245;es. Para o fazer, deve clicar no tri&#226;ngulo do <emph>Record ID</emph>, escolher <hi rend="bold">Editar c&#233;lulas</hi> &gt; <hi rend="bold">Transformar em vazias abaixo</hi>. A mensagem de <emph>status</emph> dir&#225; que 84 colunas foram afetadas (se se esqueceu de reordenar as linhas permanentemente, apenas v&#227;o ser afetadas 19 colunas; em caso afirmativo, desfa&#231;a a opera&#231;&#227;o Transformar em vazias abaixo no separador 'Desfazer/Refazer' e volte ao par&#225;grafo anterior refazendo-o de modo a ter a certeza que as linhas est&#227;o reordenadas e n&#227;o apenas classificadas). Elimine essas linhas ao criar uma faceta em '<hi rend="bold">Transformar em vazias abaixo</hi>' na coluna do <emph>Record ID</emph> ('<hi rend="bold">Faceta</hi>' &gt; '<hi rend="bold">Facetas personalizadas</hi>' &gt; '<hi rend="bold">Faceta por valores em branco</hi>') em seguida dever&#225; selecionar as 84 linhas a branco clicando em '<hi rend="bold">true</hi>' (Verdade) e remov&#234;-las usando o tri&#226;ngulo da coluna '<hi rend="bold">Todos</hi>' ('<hi rend="bold">Editar linhas</hi>' &gt; <hi rend="bold">Remover as linhas que corresponderam</hi>'). Quando fechar a faceta dever&#225; observar que existem agora 75,727 linhas &#250;nicas.</p>
<p>O usu&#225;rio dever&#225; ter uma aten&#231;&#227;o especial ao eliminar duplica&#231;&#245;es. Na etapa mencionada acima, assumimos que o data set possui um campo com valores &#250;nicos, indicando que uma linha inteira representa uma duplica&#231;&#227;o. Este n&#227;o &#233; necessariamente o caso e, por isso, devemos ter cuidado e verificar manualmente se a linha inteira representa uma duplica&#231;&#227;o ou n&#227;o.</p>
</div><div n="2"><head>Atomiza&#231;&#227;o</head>
<p>Depois de remover os registos duplicados, podemos focar-nos na coluna <emph>Categories</emph>. Em m&#233;dia, foram atribu&#237;das 2.25 categorias a cada objeto. Estas categorias est&#227;o contidas no mesmo campo, separadas por uma barra vertical '|'. O registo 9, por exemplo, cont&#233;m tr&#234;s: 'Mineral samples|Specimens|Mineral Samples-Geological' (Amostras minerais|Esp&#233;cimes|Amostras minerais-Geol&#243;gicas). Para analisar em detalhe o uso destas palavras-chave, os valores do campo das categorias devem ser separados em c&#233;lulas individuais com base na barra vertical, expandindo os 75,727 registos em 170,167 linhas. Escolha '<hi rend="bold">Editar c&#233;lulas</hi>', '<hi rend="bold">Dividir c&#233;lulas com m&#250;ltiplos valores</hi>', digitando '<hi rend="bold">|</hi>' como separador de valores. O <emph>OpenRefine</emph> ir&#225; inform&#225;-lo que tem agora 170,167 linhas.</p>
<p>&#201; importante compreender totalmente o paradigma das linhas/entradas. Torne a coluna <emph>Record ID</emph> vis&#237;vel para ver o que se passa. Pode mudar entre a op&#231;&#227;o de visualiza&#231;&#227;o 'linhas' e 'entradas' ao clicar nos links que d&#227;o pelos mesmos nomes, logo em cima do cabe&#231;alho das colunas. Na op&#231;&#227;o 'linhas', cada linha representa um par de <emph>Record IDs</emph> e uma &#250;nica categoria, permitindo a manipula&#231;&#227;o de cada uma individualmente. A op&#231;&#227;o 'entradas' tem uma entrada para cada <emph>Record ID</emph>, que pode ter categorias diferentes em linhas diferentes (agrupadas a cinzento ou branco), mas cada registo &#233; manipulado como um todo. Concretamente, existem agora 170,167 atribui&#231;&#245;es de categorias (Linhas), separadas em 75,736 itens de cole&#231;&#227;o (Entradas). Pode tamb&#233;m ter reparado que estamos com mais 9 registos do que os originais 75,727, mas n&#227;o se preocupe com isso agora, iremos voltar a esta pequena diferen&#231;a mais tarde.</p>
</div><div n="2"><head>Facetting e agrupamento</head>
<p>Um dos conte&#250;dos do campo foi devidamente atomizado, filtros, facetas e agrupamentos  podem ser aplicados para fornecer uma vis&#227;o r&#225;pida e geral dos problemas cl&#225;ssicos dos metadados. Ao aplicar a faceta customizada '<code type="inline">Faceta por valores em branco</code>' &#224; coluna <emph>Categories</emph>, &#233; poss&#237;vel identificar imediatamente os 461 registos que n&#227;o t&#234;m uma categoria, representando 0.6% da cole&#231;&#227;o. Ao aplicar uma faceta de texto ao campo das categorias podemos ter uma vis&#227;o geral das 4,935 diferentes categorias utilizadas na cole&#231;&#227;o (o limite padr&#227;o &#233; 2,000, mas poder&#225; clicar na op&#231;&#227;o '<hi rend="bold">Definir o limite da contagem da escolha</hi>' para aument&#225;-la para 5,000). Os t&#237;tulos podem ser ordenados alfabeticamente (nome') ou por frequ&#234;ncia ('quantidade'), fornecendo ao utilizador uma lista dos termos mais usados para indexar a cole&#231;&#227;o. Os tr&#234;s t&#237;tulos principais s&#227;o 'Numism&#225;tica' (<emph>Numismatics</emph>) (8,041), 'Cer&#226;mica' (<emph>Ceramics</emph>) (7,390) e  'Roupas e vestu&#225;rio' (<emph>Clothing and dress</emph>) (7,279).</p>
<p>Ap&#243;s aplicar a faceta, o <emph>OpenRefine</emph> prop&#245;e aglomerar as escolhas da faceta  com base em v&#225;rios m&#233;todos de similaridade. Tal como a Figura 2 demonstra, o agrupamento permite ao usu&#225;rio resolver problemas relacionados com inconsist&#234;ncias, o uso incoerente tanto da forma singular como plural e erros de ortografia simples. O <emph>OpenRefine</emph> apresenta os valores relacionados e prop&#245;e uma fus&#227;o resultante no valor mais recorrente. Dever&#225; selecionar a op&#231;&#227;o '<hi rend="bold">Agrupar</hi>' para abrir o comando de uniformiza&#231;&#227;o dos termos, em seguida, escolha os valores que deseja agrupar ao selecionar as caixas individualmente ou ao clicar '<hi rend="bold">Marcar todos</hi>' na parte inferior e, por fim, '<hi rend="bold">Unir selecionados e Re-agrupar</hi>'.</p>
<figure><desc>Figura 2: Vis&#227;o geral de alguns agrupamentos</desc><graphic url="tr-pt-cleaning-data-with-openrefine-2.png" alt="Interface do *OpenRefine* referente ao agrupamento e edi&#231;&#227;o da coluna 'Categories' em que &#233; poss&#237;vel observar os m&#233;todos de agrupamento e ainda as diferen&#231;as detetadas nesta coluna"/></figure>
<p>O m&#233;todo padr&#227;o de aglomeramento n&#227;o &#233; muito complexo, portanto ainda n&#227;o encontra todos os aglomerados. Experimente com diferentes m&#233;todos para ver quais s&#227;o os resultados que estes produzem. Dever&#225; ter cuidado: alguns m&#233;todos podem ser muito agressivos e alguns valores, que n&#227;o dever&#227;o estar juntos, podem acabar agrupados. Agora que os valores foram agrupados individualmente, podemos coloc&#225;-los de volta numa &#250;nica c&#233;lula. Clique no tri&#226;ngulo das <emph>categories</emph> e escolha  <hi rend="bold">Editar c&#233;lulas</hi>, <hi rend="bold">Unir c&#233;lulas com m&#250;ltiplos valores</hi>, escolha a barra vertical ('|') como separador, <hi rend="bold">OK</hi>. As linhas t&#234;m agora a mesma apar&#234;ncia que tinham antes, com um campo de categorias com v&#225;rios valores.</p>
</div><div n="2"><head>Aplica&#231;&#227;o de transforma&#231;&#245;es <emph>ad-hoc</emph> atrav&#233;s do uso de express&#245;es regulares</head>
<p>Relembre-se que existiu um aumento no n&#250;mero de registos depois do processo de divis&#227;o: nove registos apareceram do nada. Para encontrar a causa desta disparidade, precisamos de voltar atr&#225;s, antes da divis&#227;o das categorias em linhas separadas. Para fazer isso, altere o separador 'Desfazer / Refazer' &#224; direita do separador 'Faceta / Filtro' e vai obter um hist&#243;rico de todas as a&#231;&#245;es que executou desde que o projeto foi criado. Selecione o passo antes de '<emph>Split multi-valued cells in column Categories</emph>' (Dividir c&#233;lulas com v&#225;rios valores na coluna Categorias) (se seguiu o nosso exemplo dever&#225; ser '<emph>Remove 84 rows</emph>' (Remover 84 linhas)). Depois volte para o separador 'Faceta / Filtro'.</p>
<p>O problema surgiu durante a opera&#231;&#227;o de divis&#227;o no caractere de barra vertical, portanto h&#225; uma grande probabilidade do que correu mal estar relacionado com esse caractere. Vamos aplicar um filtro na coluna Categorias ao selecionar '<hi rend="bold">Filtro de texto</hi>' no menu. Primeiro, digite um &#250;nico <code type="inline">|</code> no campo da esquerda: o <emph>OpenRefine</emph> dever&#225; inform&#225;-lo que existem 71,064 registos correspondentes (i.e. registos que contenham uma barra vertical) num total de 75,727. C&#233;lulas que n&#227;o contenham a barra vertical podem ser c&#233;lulas em branco ou c&#233;lulas apenas com uma categoria, n&#227;o tendo assim um separador. Tal como o registo 29 que apenas tem '<emph>Scientific instruments</emph>' (Instrumentos cient&#237;ficos).</p>
<p>Agora insira um segundo '|' depois do primeiro para obter '||' (dupla barra vertical): poder&#225; observar que existem 9 registos que correspondem a este padr&#227;o. Estes s&#227;o, provavelmente, os 9 registos culpados pela nossa discrep&#226;ncia: quando o <emph>OpenRefine</emph> divide os registos, a dupla barra vertical &#233; interpretada como uma quebra entre dois registos em vez de um separador duplo sem sentido. Agora, como &#233; que corrigimos estes valores? V&#225; ao menu do campo das categorias e escolha '<hi rend="bold">Editar c&#233;lulas</hi>' &gt; '<hi rend="bold">Transformar</hi>&#8230;. Bem-vindo &#224; interface de transforma&#231;&#227;o de texto personalizada, uma funcionalidade poderosa do <emph>OpenRefine</emph> que usa a <emph>Google Refine Expression Language</emph> (GREL).</p>
<p>A palavra '<emph>value</emph>' (valor) no campo de texto representa o valor atual de cada c&#233;lula, valor esse vis&#237;vel em baixo. Podemos modificar este valor ao aplicar-lhe fun&#231;&#245;es (ver a <emph><link target="https://perma.cc/C3F3-RWHL">GREL documentation</link></emph> (documenta&#231;&#227;o da GREL, em ingl&#234;s) para uma lista completa). Neste caso, queremos substituir a dupla barra vertical por uma &#250;nica barra. Isto pode ser realizado ao inserir a seguinte <link target="https://perma.cc/35FM-5TGG">express&#227;o regular</link> (certifique-se que n&#227;o se esquece das aspas):</p>
<pre><code xml:id="code_limpar-dados-openrefine_0" type="block" corresp="code_limpar-dados-openrefine_0.txt"></code></pre>
<p>Em baixo do campo de texto 'Express&#227;o', ter&#225; uma pr&#233;-visualiza&#231;&#227;o dos valores modificados com as duplas barras verticais removidas. Clique em <hi rend="bold">OK</hi> e tente dividir as categorias de novo com a op&#231;&#227;o '<hi rend="bold">Editar c&#233;lulas</hi>' &gt; '<hi rend="bold">Dividir c&#233;lulas com m&#250;ltiplos valores...</hi>'. O n&#250;mero de registos ficar&#225; agora nos 75,727 (clique no link '<hi rend="bold">entradas</hi>' para verificar).</p>
<p>* * *<br/>
Outro problema que pode ser resolvido com a ajuda da GREL &#233; o dos registos para os quais a mesma categoria &#233; listada duas vezes. Observe o registo 41 por exemplo, cujas categorias s&#227;o '<emph>Models|Botanical specimens|Botanical Specimens|Didactic Displays|Models</emph>' (Modelos|Esp&#233;cimes bot&#226;nicos|Esp&#233;cimes Bot&#226;nicos|Expositores Did&#225;ticos|Modelos). A categoria '<emph>Models</emph>' aparece duas vezes sem nenhuma raz&#227;o aparente, pelo que vamos querer remover esta duplica&#231;&#227;o. Clique no tri&#226;ngulo da coluna das '<emph>Categories</emph>' e escolha 'Editar c&#233;lulas', 'Unir c&#233;lulas com m&#250;ltiplos valores', OK. Escolha a barra vertical como separador. Agora as categorias est&#227;o listadas como antes. Em seguida selecione '<hi rend="bold">Editar c&#233;lulas</hi>' &gt; '<hi rend="bold">Transformar</hi>', tamb&#233;m na coluna das categorias. Ao usar a GREL podemos dividir sucessivamente as categorias na barra vertical, procurar categorias &#250;nicas e junt&#225;-las de novo. Para isso, basta digitar a seguinte express&#227;o:</p>
<pre><code xml:id="code_limpar-dados-openrefine_1" type="block" corresp="code_limpar-dados-openrefine_1.txt"></code></pre>
<p>Ao faz&#234;-lo ir&#225; reparar que 33.006 c&#233;lulas foram afetadas, mais de metade da cole&#231;&#227;o.</p>
</div><div n="2"><head>Exporta&#231;&#227;o dos seus dados limpos</head>
<p>Desde que carregou os seus dados no <emph>OpenRefine</emph>, todas as opera&#231;&#245;es de limpeza foram executadas na mem&#243;ria do software, deixando os dados originais intocados. Se desejar salvar os dados que limpou, ter&#225; de os exportar ao clicar no menu '<hi rend="bold">Exportar</hi>' no canto superior direito do ecr&#227;. O <emph>OpenRefine</emph> suporta uma larga variedade de formatos, tais como <link target="https://perma.cc/SVC7-TH2C">CSV</link> (em ingl&#234;s), HTML ou Excel: selecione o que melhor se adapta a si e acrescente o seu pr&#243;prio modelo de exporta&#231;&#227;o ao clicar 'Criando modelo'. Poder&#225; tamb&#233;m exportar o seu projeto num formato interno do <emph>OpenRefine</emph> de modo a partilh&#225;-lo com os outros.</p>
</div><div n="2"><head>Constru&#231;&#227;o sob os dados limpos</head>
<p>Depois de limpar os seus dados, poder&#225; dar o pr&#243;ximo passo e explorar outros recursos interessantes do <emph>OpenRefine</emph>. A comunidade de utilizadores do <emph>OpenRefine</emph> desenvolveu duas interessantes extens&#245;es que permitem ligar os seus dados a dados que j&#225; foram publicados na web. A <emph><link target="http://web.archive.org/web/20180113121435/http://refine.deri.ie/docs">RDF Refine extension</link></emph> (em ingl&#234;s) transforma palavras-chave de texto simples em URLs. A <link target="https://perma.cc/W9PL-RUAH">NER extension</link> (em ingl&#234;s) permite ao usu&#225;rio aplicar a <emph>named-entity recognition</emph> (NER) que identifica palavras chave em texto corrido e atribui-lhes um URL.</p>
</div></div><div n="1"><head>Conclus&#245;es</head>
<p>Se apenas se lembrar de uma coisa desta li&#231;&#227;o, dever&#225; ser o seguinte: <emph>Todos os dados s&#227;o sujos, mas poder&#225; fazer algo quanto a isso</emph>. Tal como mostr&#225;mos aqui, j&#225; existe muito que pode ser feito para aumentar significativamente a qualidade dos dados. Em primeiro lugar, aprendemos como &#233; que podemos ter uma vis&#227;o geral e r&#225;pida de quantos valores vazios existem no nosso data set e com que frequ&#234;ncia &#233; que um valor particular (e.g. uma palavra-chave) &#233; usada ao longo da cole&#231;&#227;o. Esta li&#231;&#227;o tamb&#233;m demonstra como resolver problemas recorrentes, tais como duplica&#231;&#245;es e inconsist&#234;ncias ortogr&#225;ficas de maneira autom&#225;tica com a ajuda do <emph>OpenRefine</emph>. N&#227;o hesite em experimentar as ferramentas de limpeza enquanto executa estas etapas numa c&#243;pia dos seus data sets, j&#225; que o <emph>OpenRefine</emph> permite-lhe rastrear e refazer todos os passos caso tenha cometido um erro.</p>
</div></body>
  </text>
</TEI>
