<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Nettoyer ses donn&#233;es avec OpenRefine</title>
  <layout>lesson</layout>
  <slug>nettoyer-ses-donnees-avec-openrefine</slug>
  <date>2013-08-05</date>
  <translation_date>2019-04-10</translation_date>
  <authors>Seth van Hooland,Ruben Verborgh,Max De Wilde</authors>
  <reviewers>Patrick Burns,Nora McGregor</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Sybille Clochet</translator>
  <translation-editor>Sofia Papastamkou</translation-editor>
  <translation-reviewer>Fran&#231;ois Dominic Laram&#233;e,Marie Puren</translation-reviewer>
  <difficulty>2</difficulty>
  <activity>transforming</activity>
  <topics>data-manipulation</topics>
  <abstract>Ce tutoriel se concentre sur la fa&#231;on dont les chercheurs et chercheuses peuvent &#233;valuer et agir sur l'exactitude des donn&#233;es.</abstract>
  <original>cleaning-data-with-openrefine</original>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/223</review-ticket>
  <avatar_alt>Deux hommes faisant la lessive &#224; l'ext&#233;rieur</avatar_alt>
  <doi>10.46430/phfr0004</doi>
</metadata>
  <text>
    <body>
      <div n="2"><head>Objectifs du cours</head>
<p><emph>Ne faites pas confiance &#224; vos donn&#233;es</emph> : c'est le message-cl&#233; de ce tutoriel qui se concentre sur la fa&#231;on dont les chercheurs et chercheuses peuvent &#233;valuer et agir sur l'exactitude des donn&#233;es. Dans ce cours, vous apprendrez les principes et la pratique du nettoyage de donn&#233;es, ainsi que la fa&#231;on dont <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link> peut &#234;tre utilis&#233; pour effectuer quatre t&#226;ches essentielles qui vous aideront &#224; nettoyer ces donn&#233;es :</p>
<ul>
<li>supprimer les doublons ;</li>
<li>s&#233;parer plusieurs valeurs contenues dans un m&#234;me champ ;</li>
<li>analyser la distribution des valeurs dans un ensemble de donn&#233;es ;</li>
<li>regrouper diff&#233;rentes repr&#233;sentations de la m&#234;me r&#233;alit&#233;.</li>
</ul>
<p>Ces &#233;tapes sont illustr&#233;es &#224; l'aide d'une s&#233;rie d'exercices bas&#233;s sur une collection de m&#233;tadonn&#233;es du <link title="Powerhouse museum" target="https://powerhouse.com.au/">Powerhouse museum</link>, d&#233;montrant comment les m&#233;thodes (semi-) automatis&#233;es peuvent vous aider &#224; corriger les erreurs dans vos donn&#233;es.</p>
</div>
      <div n="2"><head>Pourquoi les historiens et les historiennes devraient-ils se pr&#233;occuper de la qualit&#233; de leurs donn&#233;es ?</head>
<p>Les doublons, les valeurs vides et les formats incoh&#233;rents sont des ph&#233;nom&#232;nes auxquels nous devrions &#234;tre pr&#234;t(e)s &#224; faire face lorsque nous utilisons des ensembles de donn&#233;es historiques. Ce cours vous apprendra &#224; d&#233;tecter les incoh&#233;rences dans les donn&#233;es contenues dans une feuille de calcul ou une base de donn&#233;es. L'accroissement des pratiques de partage, de regroupement et de r&#233;utilisation de donn&#233;es, par ailleurs de plus en plus nombreuses sur le Web, obligent les historiens et les historiennes &#224; agir face aux probl&#232;mes in&#233;vitables de qualit&#233; des donn&#233;es. Gr&#226;ce &#224; l'utilisation d'<emph>OpenRefine</emph>, vous pourrez facilement identifier les erreurs r&#233;currentes telles que des cellules vides, des doublons, des incoh&#233;rences orthographiques, etc. <emph>OpenRefine</emph> vous permet non seulement d'avoir un diagnostic rapide sur la qualit&#233; de vos donn&#233;es, mais aussi d'agir sur certaines erreurs de mani&#232;re automatis&#233;e.</p>
</div>
      <div n="2"><head>Description de l'outil OpenRefine</head>
<p>Dans le pass&#233;, les historiens et les historiennes devaient compter sur des sp&#233;cialistes des technologies de l'information pour avoir un diagnostic sur la qualit&#233; des donn&#233;es et ex&#233;cuter des t&#226;ches de nettoyage. Cela n&#233;cessitait la cr&#233;ation de programmes informatiques sur mesure lorsque vous travailliez avec des ensembles de donn&#233;es importants. Heureusement, l'av&#232;nement des outils de transformation interactive de donn&#233;es permet d&#233;sormais de r&#233;aliser des op&#233;rations rapides et peu co&#251;teuses sur de grandes quantit&#233;s de donn&#233;es, m&#234;me effectu&#233;es par des professionnel(le)s sans comp&#233;tences informatiques approfondies.</p>
<p>Les outils de transformation interactive de donn&#233;es ressemblent aux tableurs de bureau que nous connaissons tous, et partagent avec eux certaines fonctionnalit&#233;s. Vous pouvez par exemple utiliser une application telle que <emph>Microsoft Excel</emph> pour trier vos donn&#233;es en fonction de filtres num&#233;riques, alphab&#233;tiques ou personnalis&#233;s, ce qui vous permet de d&#233;tecter plus facilement les erreurs. La configuration de ces filtres dans une feuille de calcul peut &#234;tre fastidieuse, car il s'agit d'une fonctionnalit&#233; secondaire. Sur un plan plus g&#233;n&#233;ral, nous pourrions dire que les tableurs sont con&#231;us pour fonctionner sur des lignes et des cellules individuelles, alors que les outils de transformation interactive de donn&#233;es fonctionnent sur de grandes plages de donn&#233;es &#224; la fois. Ces &#171; tableurs surpuissants &#187; offrent une interface int&#233;gr&#233;e et conviviale &#224; travers laquelle les utilisateurs finaux peuvent d&#233;tecter et corriger les erreurs.</p>
<p>Plusieurs outils g&#233;n&#233;ralistes pour la transformation interactive des donn&#233;es ont &#233;t&#233; d&#233;velopp&#233;s ces derni&#232;res ann&#233;es, tels que <link title="Potter's Wheel ABC " target="http://control.cs.berkeley.edu/abc/"><emph>Potter&#8217;s Wheel ABC</emph></link> et <link title="Wrangler" target="http://vis.stanford.edu/papers/wrangler/"><emph>Wrangler</emph></link>. Ici, nous voulons nous concentrer sp&#233;cifiquement sur <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link> (anciennement <emph>Freebase Gridworks</emph> et <emph>Google Refine</emph>) car, de l'avis des auteurs, c'est l'outil le plus convivial pour traiter et nettoyer efficacement de grandes quantit&#233;s de donn&#233;es au travers d'une interface bas&#233;e sur un navigateur.</p>
<p>En plus des op&#233;rations de <link target="https://fr.wikipedia.org/wiki/Data_profiling">profilage</link> et de nettoyage des donn&#233;es, des extensions <emph>OpenRefine</emph> permettent aux utilisateurs et utilisatrices d'identifier des objets textuels dans du texte non structur&#233;, un processus appel&#233; <link target="https://fr.wikipedia.org/wiki/Reconnaissance_d%27entit%C3%A9s_nomm%C3%A9es">reconnaissance d'entit&#233;s nomm&#233;es</link>, et peuvent &#233;galement lier leurs propres donn&#233;es avec des bases de connaissances existantes. Ce faisant, <emph>OpenRefine</emph> peut &#234;tre un outil pratique pour lier des donn&#233;es avec des objets et des autorit&#233;s qui ont d&#233;j&#224; &#233;t&#233; d&#233;clar&#233;s sur le Web par des organisations telles que la <link title="Biblioth&#232;que du Congr&#232;s" target="http://www.loc.gov/index.html">Biblioth&#232;que du Congr&#232;s</link> ou l'<link title="OCLC" target="https://www.oclc.org/fr/home.html">OCLC</link>. Le nettoyage des donn&#233;es est une condition pr&#233;alable &#224; ces &#233;tapes ; le taux de r&#233;ussite de la reconnaissance d&#8217;entit&#233;s nomm&#233;es et un processus de croisement productif de vos donn&#233;es avec les autorit&#233;s externes d&#233;pendent de votre capacit&#233; &#224; rendre vos donn&#233;es aussi coh&#233;rentes que possible.</p>
</div>
      <div n="2"><head>Description de l'exercice : Powerhouse Museum</head>
<p>Le <emph>Powerhouse Museum</emph> de Sydney a mis &#224; disposition sur son <link title="site web" target="https://api.maas.museum/docs">site web</link> un ensemble de m&#233;tadonn&#233;es sur sa collection librement utilisable (<emph>NDLR: le jeu de donn&#233;es, t&#233;l&#233;charg&#233; &#224; l'origine en 2013, peut ne plus &#234;tre disponible &#224; l'adresse indiqu&#233;e, il est n&#233;anmoins fourni ci-dessous</emph>). Le mus&#233;e est l'un des plus grands mus&#233;es de science et de technologie au monde, offrant un acc&#232;s &#224; pr&#232;s de 90 000 objets, des machines &#224; vapeur &#224; la verrerie fine en passant par la haute couture et les puces informatiques.</p>
<p>Le <emph>Powerhouse Museum</emph> a rendu sa collection largement disponible en ligne et la plupart de ses donn&#233;es &#233;taient librement accessibles. Sur le site web du mus&#233;e, il &#233;tait possible de t&#233;l&#233;charger un fichier texte s&#233;par&#233; par des tabulations appel&#233; <code type="inline">phm-collection.tsv</code> sous la forme d'une feuille de calcul. Le fichier d&#233;compress&#233; (58 Mo) contient des m&#233;tadonn&#233;es de base (17 champs) pour 75 823 objets, publi&#233;es sous <link target="https://creativecommons.org/licenses/by-sa/4.0/deed.fr">licence Creative Commons Attribution - Partage dans les M&#234;mes Conditions</link>. Dans ce tutoriel, nous utiliserons une copie des donn&#233;es que nous avons archiv&#233;es pour vous permettre de les t&#233;l&#233;charger (dans la suite de la le&#231;on). Cela garantit que si le <emph>Powerhouse Museum</emph> met &#224; jour les donn&#233;es, vous serez toujours en mesure de suivre le cours.</p>
<p>Tout au long du processus de profilage et de nettoyage des donn&#233;es, l'&#233;tude de cas se concentrera sp&#233;cifiquement sur le champ <code type="inline">Categories</code> (Cat&#233;gories), qui contient les termes du th&#233;saurus des noms d'objets du <emph>Powerhouse Museum</emph>. Ce th&#233;saurus reconna&#238;t l'usage des mots et l'orthographe australiens et refl&#232;te de mani&#232;re tr&#232;s directe les points forts de la collection. Dans celle-ci, vous trouverez davantage de repr&#233;sentations de l'histoire sociale et des arts d&#233;coratifs que de noms d'objets relatifs aux beaux-arts et &#224; l'histoire naturelle.</p>
<p>Les termes du champ <hi rend="bold">Categories</hi> comprennent ce que nous appelons un <link target="https://fr.wikipedia.org/wiki/Vocabulaire_contr%C3%B4l%C3%A9">vocabulaire contr&#244;l&#233;</link>. Un vocabulaire contr&#244;l&#233; consiste en des mots-cl&#233;s d&#233;crivant le contenu d'une collection en utilisant un nombre limit&#233; de termes, et constitue souvent un point d'entr&#233;e crucial dans les ensembles de donn&#233;es utilis&#233;s par les historiens et les historiennes dans les biblioth&#232;ques, les archives et les mus&#233;es. C'est pourquoi nous accorderons une attention particuli&#232;re &#224; ce champ. Une fois les donn&#233;es nettoy&#233;es, il devrait &#234;tre possible de r&#233;utiliser les termes du vocabulaire contr&#244;l&#233; pour trouver des informations suppl&#233;mentaires sur les termes utilis&#233;s ailleurs en ligne, ce qui s'appelle &#171; cr&#233;er des <link target="https://fr.wikipedia.org/wiki/Web_des_donn%C3%A9es">donn&#233;es li&#233;es</link> &#187;.</p>
<div n="3"><head>Pour commencer : installer OpenRefine et importer des donn&#233;es</head>
<p><link target="http://openrefine.org/#download_openrefine">T&#233;l&#233;chargez OpenRefine</link> et suivez les instructions d'installation. <emph>OpenRefine</emph> fonctionne sur toutes les plateformes : Windows, Mac et Linux. <emph>OpenRefine</emph> s'ouvrira dans votre navigateur, mais il est important de r&#233;aliser que l'application s&#8217;ex&#233;cute localement et que vos donn&#233;es ne seront pas stock&#233;es en ligne. Les fichiers de donn&#233;es sont disponibles sur notre <link target="http://data.freeyourmetadata.org/powerhouse-museum/">site FreeYourMetadata</link>, lequel sera utilis&#233; tout au long de ce tutoriel. Veuillez t&#233;l&#233;charger le fichier <emph>phm-collection.tsv</emph> avant de continuer (&#233;galement archiv&#233; sur le site web du <emph>Programming Historian</emph> : comme <link target="/assets/phm-collection.tsv">phm-collection</link>).</p>
<p>Sur la page de d&#233;marrage d'<emph>OpenRefine</emph>, cr&#233;ez un nouveau projet en utilisant le fichier de donn&#233;es t&#233;l&#233;charg&#233; et cliquez sur <hi rend="bold">Suivant</hi>. Par d&#233;faut, la premi&#232;re ligne sera correctement analys&#233;e comme &#233;tant l&#8217;en-t&#234;te des colonnes, mais vous devez d&#233;cocher la case <hi rend="bold">Utiliser le caract&#232;re " pour fermer les cellules contenant les s&#233;parateurs de colonnes</hi>, car les citations dans le fichier n'ont aucune signification pour <emph>OpenRefine</emph>. En outre, cochez la case <hi rend="bold">Analyser le texte des cellules comme nombres, dates...</hi> pour permettre &#224; <emph>OpenRefine</emph> de d&#233;tecter automatiquement les nombres. Maintenant, cliquez sur <hi rend="bold">Cr&#233;er un projet</hi>. Si tout se passe bien, vous verrez 75 814 lignes. Vous pouvez &#233;galement t&#233;l&#233;charger directement le <link target="http://data.freeyourmetadata.org/powerhouse-museum/phm-collection.google-refine.tar.gz">projet OpenRefine initial</link>.</p>
<p>L'ensemble de donn&#233;es du <emph>Powerhouse Museum</emph> comprend des m&#233;tadonn&#233;es d&#233;taill&#233;es sur tous les objets de la collection, y compris le titre, la description, plusieurs cat&#233;gories auxquelles l'objet appartient, des informations sur la provenance et un lien p&#233;renne vers l'objet sur le site Web du mus&#233;e. Pour avoir une id&#233;e de l'objet correspondant aux m&#233;tadonn&#233;es, cliquez simplement sur le lien et le site Web s'ouvrira.</p>
<figure><desc>Figure 1: Capture d'&#233;cran d'un objet &#233;chantillon en provenance du site web du Powerhouse Museum</desc><graphic url="en-or-cleaning-data-with-openrefine-01.png"/></figure>
</div><div n="3"><head>Apprendre &#224; conna&#238;tre ses donn&#233;es</head>
<p>La premi&#232;re chose &#224; faire est de faire le tour de vos donn&#233;es et d'apprendre &#224; les conna&#238;tre. Vous pouvez inspecter les diff&#233;rentes valeurs de donn&#233;es en les affichant dans des <code type="inline">facettes</code>. Vous pouvez consid&#233;rer une <link target="https://fr.wikipedia.org/wiki/Recherche_%C3%A0_facettes">facette</link> comme une lentille &#224; travers laquelle vous visualisez un sous-ensemble sp&#233;cifique de donn&#233;es, en fonction d'un crit&#232;re de votre choix. Cliquez sur le triangle situ&#233; devant le nom de la colonne, s&#233;lectionnez <hi rend="bold">Facette</hi> et cr&#233;ez-en une. Par exemple, essayez une facette textuelle ou une facette num&#233;rique, selon la nature des valeurs contenues dans les champs (les valeurs num&#233;riques sont en vert). Sachez, cependant, que les facettes textuelles sont mieux utilis&#233;es sur des champs avec des valeurs r&#233;currentes (<hi rend="bold">Categories</hi> par exemple) ; si vous rencontrez une erreur &#171; trop nombreux &#224; afficher &#187;, vous pouvez choisir d'augmenter la limite du nombre de choix au-dessus des 2 000 par d&#233;faut, mais une limite trop &#233;lev&#233;e peut ralentir l'application (5 000 est g&#233;n&#233;ralement un choix s&#251;r). Les facettes num&#233;riques n'ont pas cette restriction. Pour plus d'options, s&#233;lectionnez <hi rend="bold">Facettes personnalis&#233;es</hi> : la facette <hi rend="bold">par valeur vide</hi>, par exemple, est pratique pour savoir combien de valeurs ont &#233;t&#233; remplies pour chaque champ. Nous les explorerons plus en d&#233;tail dans les exercices suivants.</p>
</div><div n="3"><head>Supprimer les lignes vides</head>
<p>Une chose que vous remarquez lors de la cr&#233;ation d'une facette num&#233;rique pour la colonne <hi rend="bold">Record ID</hi>, est que trois lignes sont vides. Vous pouvez les trouver en d&#233;s&#233;lectionnant la case <hi rend="bold">Num&#233;rique</hi>, en ne laissant que les valeurs non num&#233;riques. En fait, ces valeurs ne sont pas vraiment vides mais contiennent un seul caract&#232;re d'espace, ce qui peut &#234;tre constat&#233; en d&#233;pla&#231;ant votre curseur &#224; l'endroit o&#249; la valeur aurait d&#251; &#234;tre, et en cliquant sur le bouton <hi rend="bold">&#201;diter</hi> qui appara&#238;t. Pour supprimer ces lignes, cliquez sur le triangle situ&#233; devant la premi&#232;re colonne appel&#233;e <hi rend="bold">Toutes</hi>, s&#233;lectionnez <hi rend="bold">&#201;diter les lignes</hi>, puis <hi rend="bold">Supprimer toutes les lignes correspondantes</hi>. Fermez la facette num&#233;rique pour voir les 75 811 lignes restantes.</p>
</div><div n="3"><head>Supprimer les doublons</head>
<p>Une deuxi&#232;me &#233;tape consiste &#224; d&#233;tecter et supprimer les doublons. Ceux-ci peuvent &#234;tre rep&#233;r&#233;s en les triant par une valeur unique, telle que l'ID d'enregistrement (Record ID). Dans ce cas, nous supposons que l'ID d'enregistrement est unique pour chaque entr&#233;e. L'op&#233;ration peut &#234;tre effectu&#233;e en cliquant sur le triangle &#224; gauche de <hi rend="bold">Record ID</hi>, puis en choisissant <hi rend="bold">Trier...</hi> et en s&#233;lectionnant la puce <hi rend="bold">Nombres</hi>. Dans <emph>OpenRefine</emph>, le tri n'est qu'une aide visuelle, &#224; moins que vous ne rendiez le r&#233;ordonnancement permanent. Pour ce faire, cliquez sur le menu <hi rend="bold">Sort</hi> (attention, cet &#233;l&#233;ment de l'interface, qui signifie "trier", n'est pas traduit de l'anglais) qui vient d'appara&#238;tre en haut et choisissez <hi rend="bold">Retrier les lignes de fa&#231;on permanente</hi>. Si vous oubliez de le faire, vous obtiendrez des r&#233;sultats impr&#233;visibles plus tard dans ce tutoriel.</p>
<p>Les lignes identiques sont maintenant adjacentes les unes aux autres. Ensuite, effacez l'ID d'enregistrement des lignes ayant le m&#234;me ID d'enregistrement que la ligne situ&#233;e au-dessus d'elles, en les marquant en double. Pour ce faire, cliquez sur le triangle <hi rend="bold">Record ID</hi>, choisissez <hi rend="bold">&#201;diter les cellules</hi>&gt; <hi rend="bold">Vider</hi>. Le statut vous indique que 84 colonnes ont &#233;t&#233; affect&#233;es (si vous avez oubli&#233; de r&#233;ordonner les rang&#233;es de fa&#231;on permanente, vous n'en obtiendrez que 19, si c'est le cas, annulez l'op&#233;ration dans l'onglet <hi rend="bold">Annuler / R&#233;tablir</hi> et revenez au paragraphe pr&#233;c&#233;dent ; assurez-vous que les lignes sont r&#233;organis&#233;es et non simplement tri&#233;es). &#201;liminez ces lignes en cr&#233;ant une facette sur les <hi rend="bold">cellules vides</hi> dans la colonne <hi rend="bold">Record ID</hi> (<hi rend="bold">Facette</hi>&gt; <hi rend="bold">Facettes personnalis&#233;es</hi>&gt; <hi rend="bold">Facette par valeur vide (valeurs nulles ou cha&#238;ne vide)</hi>), puis s&#233;lectionnez les 84 lignes vides en cliquant sur <hi rend="bold">true</hi>, et supprimez-les en utilisant le triangle <hi rend="bold">Toutes</hi> (<hi rend="bold">&#201;diter les lignes</hi>&gt; <hi rend="bold">Supprimer toutes les lignes correspondantes</hi>). &#192; la fermeture de la facette, vous voyez 75 727 lignes uniques.</p>
<p>Une vigilance particuli&#232;re est n&#233;cessaire lors de l'&#233;limination des doublons. Dans l'&#233;tape mentionn&#233;e ci-dessus, nous supposons que le jeu de donn&#233;es comporte un champ avec des valeurs uniques, indiquant que la ligne enti&#232;re repr&#233;sente un doublon. Ce n'est pas n&#233;cessairement le cas, et il faut &#234;tre tr&#232;s prudent pour v&#233;rifier manuellement si la ligne enti&#232;re repr&#233;sente un doublon ou non.</p>
</div><div n="3"><head>Fractionner les donn&#233;es</head>
<p>Une fois les doublons supprim&#233;s, nous pouvons regarder de plus pr&#232;s le champ <hi rend="bold">Categories</hi>. En moyenne, chaque objet a re&#231;u 2,25 cat&#233;gories. Ces cat&#233;gories sont contenues dans le m&#234;me champ, s&#233;par&#233;es par le caract&#232;re <hi rend="bold">pipe</hi> <code type="inline">|</code>. Le dossier 9, par exemple, en contient trois : <hi rend="bold">Mineral Samples | Specimens | Mineral Samples-Geological</hi>. Afin d'analyser en d&#233;tail l'utilisation des mots-cl&#233;s, les valeurs du champ <hi rend="bold">Categories</hi> doivent &#234;tre fractionn&#233;es en cellules individuelles sur la base du caract&#232;re <hi rend="bold">pipe</hi>, en d&#233;veloppant les 75 727 entr&#233;es en 170 167 lignes. Choisissez <hi rend="bold">&#201;diter les cellules</hi>, <hi rend="bold">Diviser les cellules multivalu&#233;es</hi>, et en entrant <code type="inline">|</code> comme s&#233;parateur de valeurs. <emph>OpenRefine</emph> vous informe que vous avez maintenant 170 167 lignes.</p>
<p>Il est important de bien comprendre le concept des lignes / entr&#233;es. Rendez la colonne <hi rend="bold">Record ID</hi> visible pour voir ce qui se passe ( pour cela, il suffit de cliquer sur le triangle puis sur <hi rend="bold">Aper&#231;u</hi> et ensuite sur <hi rend="bold">Masquer les autres colonnes</hi>). Vous pouvez basculer entre les vues <hi rend="bold">lignes</hi> et <hi rend="bold">entr&#233;es</hi> en cliquant sur les liens ainsi &#233;tiquet&#233;s juste au-dessus des en-t&#234;tes de colonnes. Dans la vue des lignes, chaque ligne repr&#233;sente deux ID d'enregistrement (Record ID) et une seule cat&#233;gorie, ce qui permet de les manipuler individuellement. La vue des entr&#233;es a une entr&#233;e pour chaque ID d'enregistrement (Record ID), qui peut avoir diff&#233;rentes cat&#233;gories sur des lignes diff&#233;rentes (regroup&#233;es en gris ou en blanc), mais chaque enregistrement est manipul&#233; dans son ensemble. Concr&#232;tement, il y a maintenant 170 167 affectations de cat&#233;gories (lignes) r&#233;parties sur 75 736 &#233;l&#233;ments de collection (entr&#233;es). Vous avez peut-&#234;tre remarqu&#233; que nous avons 9 entr&#233;es de plus que les 75 727 d&#8217;origine, mais ne vous inqui&#233;tez pas pour le moment, nous reviendrons &#224; cette petite diff&#233;rence plus tard.</p>
</div><div n="3"><head>Appliquer une facette et regrouper des valeurs proches</head>
<p>Une fois que le contenu d'un champ a &#233;t&#233; correctement fractionn&#233;, les filtres, les facettes et les regroupements de valeurs proches peuvent &#234;tre appliqu&#233;s pour donner un aper&#231;u rapide et simple des probl&#232;mes de m&#233;tadonn&#233;es classiques. En appliquant la facette personnalis&#233;e <hi rend="bold">Facette par valeur vide</hi>, on peut imm&#233;diatement identifier les 461 entr&#233;es qui n'ont pas de cat&#233;gorie, et qui repr&#233;sentent 0,6% de la collection. L'application d'une facette textuelle au champ <hi rend="bold">Categories</hi> permet d'avoir un aper&#231;u des 4 934 cat&#233;gories diff&#233;rentes utilis&#233;es dans la collection (la limite par d&#233;faut &#233;tant de 2 000, vous pouvez cliquer sur <hi rend="bold">D&#233;finir la limite du nombre de choix</hi> pour la porter &#224; 5&#160;000). Les titres peuvent &#234;tre tri&#233;s par ordre alphab&#233;tique ou par fr&#233;quence (<hi rend="bold">compte</hi>), donnant une liste des termes les plus utilis&#233;s pour indexer la collection. Les trois principales rubriques sont <hi rend="bold">Numismatics</hi> (Numismatique) (8 041), <hi rend="bold">Ceramics</hi> (C&#233;ramique) (7 390) et <hi rend="bold">Clothing and dress</hi> (V&#234;tements et habillement) (7 279).</p>
<p>Apr&#232;s l'application d'une facette, <emph>OpenRefine</emph> propose de regrouper les choix de facettes en fonction de diverses m&#233;thodes de similarit&#233;. Comme l'illustre la figure 2, le regroupement des valeurs proches vous permet de r&#233;soudre des probl&#232;mes concernant les incoh&#233;rences d'occurrences, l'utilisation incoh&#233;rente de la forme singuli&#232;re ou plurielle et les fautes d'orthographe simples. <emph>OpenRefine</emph> pr&#233;sente les valeurs proches et propose une fusion dans la valeur la plus utilis&#233;e. S&#233;lectionnez les valeurs que vous souhaitez regrouper en s&#233;lectionnant leurs cases individuellement ou en cliquant sur <hi rend="bold">S&#233;lectionner tout</hi> en bas, puis choisissez <hi rend="bold">Fusionner la s&#233;lection et regrouper</hi>.</p>
<figure><desc>Figure 2 : Vue de valeurs regroup&#233;es</desc><graphic url="vueRegroupementValeurs.png"/></figure>
<p>La m&#233;thode de regroupement par d&#233;faut est assez basique, elle ne trouve donc pas encore tous les regroupements possibles. Exp&#233;rimentez diff&#233;rentes m&#233;thodes pour voir quels r&#233;sultats elles donnent. Soyez prudent cependant : certaines m&#233;thodes sont trop pouss&#233;es, vous pourriez donc finir par regrouper des valeurs qui ne sont pas &#233;quivalentes. Maintenant que les valeurs ont &#233;t&#233; regroup&#233;es individuellement, nous pouvons les regrouper dans une seule cellule. Cliquez sur le triangle <hi rend="bold">Categories</hi> et choisissez <hi rend="bold">&#201;diter les cellules</hi>&gt; <hi rend="bold">Joindre les cellules multivalu&#233;es</hi>&gt; <hi rend="bold">OK</hi>. Choisissez le caract&#232;re <hi rend="bold">pipe</hi> (<code type="inline">|</code>) comme s&#233;parateur. Les lignes ressemblent maintenant &#224; ce que nous avions avant, avec un champ <hi rend="bold">Categories</hi> &#224; plusieurs valeurs.</p>
</div><div n="3"><head>Appliquer des transformations ad hoc &#224; l'aide d'expressions r&#233;guli&#232;res</head>
<p>Vous vous souvenez peut-&#234;tre qu'il y a eu une augmentation du nombre d'entr&#233;es apr&#232;s le processus de fractionnement : neuf entr&#233;es sont soudainement apparues. Afin de trouver la cause de cette disparit&#233;, nous devons remonter dans le temps, avant l'op&#233;ration de fractionnement des cat&#233;gories en lignes s&#233;par&#233;es. Pour ce faire, activez l'onglet <hi rend="bold">D&#233;faire / Refaire</hi> &#224; droite de l'onglet <hi rend="bold">Facette / Filtre</hi>, et vous obtiendrez un historique de toutes les actions que vous avez effectu&#233;es depuis la cr&#233;ation du projet. S&#233;lectionnez l'&#233;tape juste avant <hi rend="bold">Split multi-valued cells in column Categories</hi> (Fractionner les cellules &#224; valeurs multiples dans la colonne Categories). Si vous avez suivi notre exemple, cela devrait &#234;tre <hi rend="bold">Remove 84 rows</hi> (Supprimer 84 lignes). Puis revenez &#224; l'onglet <hi rend="bold">Facette / Filtre</hi>.</p>
<p>Le probl&#232;me est survenu lors de l'op&#233;ration de s&#233;paration sur le caract&#232;re <hi rend="bold">pipe</hi>, il y a donc de fortes chances que tout ce qui s'est mal pass&#233; soit li&#233; &#224; ce caract&#232;re. Appliquons un filtre dans la colonne <hi rend="bold">Categories</hi> en s&#233;lectionnant <hi rend="bold">Filtrer le texte</hi> dans le menu. Entrez tout d'abord un seul <code type="inline">|</code> dans le champ de gauche : <emph>OpenRefine</emph> vous informe qu'il y a 71 064 entr&#233;es correspondantes (c'est-&#224;-dire des entr&#233;es contenant un <hi rend="bold">pipe</hi>) sur un total de 75 727. Les cellules qui ne contiennent pas de <hi rend="bold">pipe</hi> peuvent &#234;tre des cellules vides, mais aussi des cellules contenant une seule cat&#233;gorie sans s&#233;parateur, comme l'enregistrement 29 qui n'a que des "Scientific instruments" (&#171;&#160;instruments scientifiques&#187;).
Maintenant, entrez un second <code type="inline">|</code> apr&#232;s le premier de sorte &#224; obtenir <code type="inline">&#160;|| </code> (double <hi rend="bold">pipe</hi>) : vous pouvez voir que 9 entr&#233;es correspondent &#224; ce mod&#232;le. Ce sont probablement les 9 entr&#233;es responsables de notre discordance : lorsque <emph>OpenRefine</emph> les s&#233;pare, le double <hi rend="bold">pipe</hi> est interpr&#233;t&#233; comme une rupture entre deux entr&#233;es au lieu d'un double s&#233;parateur sans signification. Maintenant, comment pouvons-nous corriger ces valeurs ? Allez dans le menu du champ <hi rend="bold">Categories</hi> et choisissez <hi rend="bold">&#201;diter les cellules</hi>&gt; <hi rend="bold">Transformer...</hi>. Bienvenue dans l'interface de conversion de texte personnalis&#233;e, une fonctionnalit&#233; puissante d'<emph>OpenRefine</emph> utilisant le langage GREL (sp&#233;cifique d'<emph>OpenRefine</emph>).</p>
<p>Le mot &#171; valeur &#187; dans le champ texte repr&#233;sente la valeur actuelle de chaque cellule, que vous pouvez voir ci-dessous. Nous pouvons modifier cette valeur en lui appliquant des fonctions (voir la <link title="documentation GREL" target="https://github.com/OpenRefine/OpenRefine/wiki/GREL-Functions">documentation GREL</link> pour une liste compl&#232;te). Dans ce cas, nous voulons remplacer les doubles <hi rend="bold">pipes</hi> par un seul <hi rend="bold">pipe</hi>. Cela peut &#234;tre r&#233;alis&#233; en entrant l'<link title="Expressions r&#233;guli&#232;res" target="https://fr.wikipedia.org/wiki/Expression_r%C3%A9guli%C3%A8re">expression r&#233;guli&#232;re</link> suivante (assurez-vous de ne pas oublier les guillemets) :</p>
<p><code type="inline">value.replace('||', '|')</code></p>
<p>Sous le champ texte <hi rend="bold">Expression</hi>, vous obtenez un aper&#231;u des valeurs modifi&#233;es, avec les doubles <hi rend="bold">pipes</hi> supprim&#233;s. Cliquez sur <hi rend="bold">OK</hi> et r&#233;essayez de fractionner les cat&#233;gories avec <hi rend="bold">Modifier les cellules</hi>&gt; <hi rend="bold">Diviser les cellules multivalu&#233;es</hi> : le nombre d'entr&#233;es restera &#224; 75 727 (cliquez sur le lien <hi rend="bold">entr&#233;es</hi> pour v&#233;rifier une nouvelle fois).</p>
<p>Un autre probl&#232;me qui peut &#234;tre r&#233;solu avec l'aide de GREL est celui des entr&#233;es pour lesquelles la m&#234;me cat&#233;gorie est list&#233;e deux fois. Prenez par exemple le cas 41, dont les cat&#233;gories sont <hi rend="bold">Models | Botanical specimens | Botanical Specimens | Didactic Displays | Models</hi>. La cat&#233;gorie <hi rend="bold">Models</hi> appara&#238;t deux fois sans raison valable, nous voulons donc supprimer ce doublon. Cliquez sur le triangle <hi rend="bold">Categories</hi> et choisissez <hi rend="bold">&#201;diter les cellules</hi>&gt; <hi rend="bold">Joindre les cellules multivalu&#233;es</hi>&gt; <hi rend="bold">OK</hi>. Choisissez le caract&#232;re <hi rend="bold">pipe</hi> comme s&#233;parateur. Maintenant, les cat&#233;gories sont list&#233;es comme avant. S&#233;lectionnez ensuite <hi rend="bold">&#201;diter les cellules</hi>&gt; <hi rend="bold">Transformer</hi>, &#233;galement dans la colonne des cat&#233;gories. En utilisant GREL, nous pouvons diviser successivement les cat&#233;gories sur le caract&#232;re <hi rend="bold">pipe</hi>, rechercher des cat&#233;gories uniques et les joindre &#224; nouveau. Pour ce faire, tapez simplement l'expression suivante :</p>
<p><code type="inline">value.split('|').uniques().join('|')</code></p>
<p>Vous remarquerez que 33 008 cellules sont concern&#233;es, soit plus de la moiti&#233; de la collection.</p>
</div><div n="3"><head>Exporter vos donn&#233;es nettoy&#233;es</head>
<p>Depuis que vous avez charg&#233; vos donn&#233;es dans <emph>OpenRefine</emph>, toutes les op&#233;rations de nettoyage ont &#233;t&#233; effectu&#233;es dans la m&#233;moire du logiciel, laissant votre jeu de donn&#233;es d'origine intact. Si vous voulez enregistrer les donn&#233;es que vous avez nettoy&#233;es, vous devez les exporter en cliquant sur le menu <hi rend="bold">Exporter</hi> en haut &#224; droite de l'&#233;cran. <emph>OpenRefine</emph> prend en charge une grande vari&#233;t&#233; de formats, tels que <link target="https://fr.wikipedia.org/wiki/Comma-separated_values">CSV</link>, HTML ou Excel : s&#233;lectionnez ce qui vous convient le mieux ou ajoutez votre propre mod&#232;le d'exportation en cliquant sur <hi rend="bold">Templating</hi>. Vous pouvez &#233;galement exporter votre projet au format <emph>OpenRefine</emph> interne afin de le partager avec d'autres utilisateurs.</p>
</div><div n="3"><head>Pour aller plus loin avec vos donn&#233;es nettoy&#233;es</head>
<p>Une fois vos donn&#233;es nettoy&#233;es, vous pouvez passer &#224; l'&#233;tape suivante et explorer d'autres fonctionnalit&#233;s int&#233;ressantes d'<emph>OpenRefine</emph>. La communaut&#233; d'utilisateurs d'<emph>OpenRefine</emph> a d&#233;velopp&#233; deux extensions particuli&#232;rement utiles qui vous permettent de lier vos donn&#233;es &#224; des donn&#233;es d&#233;j&#224; publi&#233;es sur le Web. L'<link target="http://web.archive.org/web/20180113121435/http://refine.deri.ie/docs">extension RDF Refine</link> transforme les mots-cl&#233;s en texte brut en URL. L'<link target="https://github.com/RubenVerborgh/Refine-NER-Extension">extension NER</link> vous permet d'appliquer la reconnaissance des entit&#233;s nomm&#233;es, qui identifie les mots-cl&#233;s dans un texte et leur donne une URL.</p>
</div></div>
      <div n="2"><head>Conclusion</head>
<p>Si vous devez vous souvenir d'une seule chose de ce cours, ce doit &#234;tre celle-ci : <emph>toutes les donn&#233;es sont sales, mais vous pouvez y faire quelque chose</emph>. Comme nous l'avons montr&#233; ici, il y a d&#233;j&#224; beaucoup de choses que vous pouvez faire par vous-m&#234;mes pour am&#233;liorer la qualit&#233; de vos donn&#233;es.
Vous avez ainsi appris comment avoir un rapide aper&#231;u du nombre de valeurs vides que contient votre jeu de donn&#233;es et &#224; quelle fr&#233;quence une valeur particuli&#232;re (par exemple un mot-cl&#233;) est utilis&#233;e dans une collection. Ces cours vous ont &#233;galement montr&#233; comment r&#233;soudre des probl&#232;mes r&#233;currents tels que les doublons et les incoh&#233;rences orthographiques de mani&#232;re automatis&#233;e &#224; l'aide d'<emph>OpenRefine</emph>.</p>
</div>
    </body>
  </text>
</TEI>
