<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="debuter-avec-markdown">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>D&#233;buter avec Markdown</title>
  <author role="original_author">Sarah Simpkin</author><editor role="reviewers"><persName>John Fink</persName><persName>Nancy Lemay</persName></editor><author role="translators">Sofia Papastamkou</author><editor role="translation-reviewers"><persName>D&#233;borah Dubald</persName><persName>Catherine Paulin</persName></editor><editor role="editors">Ian Milligan</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phfr0007</idno><date type="published">11/13/2015</date><date type="translated">04/10/2020</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#getting-started-with-markdown"/>.</p><p>There are other translations: <ref target="#introduccion-a-markdown #introducao-ao-markdown"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Cette le&#231;on est une introduction &#224; Markdown, une syntaxe en texte brut pour le formatage de documents. Vous allez d&#233;couvrir pourquoi l'utiliser, comment formater des fichiers Markdown et comment pr&#233;visualiser de tels fichiers sur le web.</p></abstract><textClass><keywords><term xml:lang="en">data-management</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="fr">
    <body><h3>Objectifs de la le&#231;on</h3>
<p>Cette le&#231;on  sert d&#8217;initiation &#224; Markdown, qui est une syntaxe en texte brut pour le <ref target="https://fr.wikipedia.org/wiki/Langage_de_formatage_de_texte">formatage</ref> de documents. Vous allez d&#233;couvrir pourquoi l'utiliser, comment formater des fichiers Markdown et comment pr&#233;visualiser de tels fichiers sur le web.</p>
<p>Puisque les tutoriels de ce site sont soumis sous forme de fichiers Markdown, je mobilise des exemples maison chaque fois que cela est possible. J'esp&#232;re que ce guide vous sera particuli&#232;rement utile si vous envisagez de r&#233;diger un tutoriel en tant qu'auteur(e) pour le <emph>Programming Historian</emph>, m&#234;me s'il reste d'une port&#233;e plus g&#233;n&#233;rale.</p>
<div type="2"><head>Qu'est-ce que le Markdown?</head>
<p>D&#233;velopp&#233; en 2004 par <ref title="Markdown on Daring Fireball" target="http://daringfireball.net/projects/markdown/">John Gruber</ref>, Markdown est &#224; la fois un langage de balisage de fichiers textes et une fonctionnalit&#233; du langage <ref target="https://fr.wikipedia.org/wiki/Perl_(langage)">Perl</ref> permettant de convertir des fichiers Markdown en HTML. Notre le&#231;on traite davantage du premier aspect, puisque nous apprendrons &#224; utiliser la syntaxe Markdown pour pr&#233;parer des fichiers.</p>
<p>Les fichiers texte brut pr&#233;sentent plusieurs avantages compar&#233;s aux autres formats. Non seulement ils sont compatibles avec tout type d'appareil et de syst&#232;me d'exploitation, mais ils s'av&#232;rent aussi plus p&#233;rennes. Si jamais vous avez tent&#233; d'ouvrir un document sauvegard&#233; dans une version ant&#233;rieure d'un logiciel de traitement de texte, vous pouvez comprendre facilement les probl&#232;mes de compatibilit&#233; qui sont en jeu.</p>
<p>L'utilisation de la syntaxe Markdown vous permettra de produire des fichiers &#224; la fois lisibles en texte brut et pr&#234;ts &#224; recevoir davantage de traitement sur une autre plateforme. Plusieurs syst&#232;mes de gestion de blogs, des g&#233;n&#233;rateurs de sites web statiques ou encore des plateformes comme <ref title="GitHub" target="http://github.com">GitHub</ref> prennent en charge des fichiers Markdown pour les convertir en <ref target="https://fr.wikipedia.org/wiki/Hypertext_Markup_Language">HTML</ref> et les publier sur le web. De plus, des outils comme Pandoc peuvent convertir des fichiers depuis et vers Markdown. Pour apprendre plus sur Pandoc, vous pouvez faire un tour sur <ref target="/fr/lecons/redaction-durable-avec-pandoc-et-markdown">cette le&#231;on</ref> de Dennis Tenen et Grant Wythoff.</p>
</div><div type="2"><head>La syntaxe Markdown</head>
<p>Les fichiers Markdown portent l'extension <code rend="inline">.md</code>. Il est possible de les ouvrir avec un &#233;diteur de texte comme TextEdit, Notepad++, Sublime Text ou Vim. Plusieurs sites web et des plateformes de publication proposent des &#233;diteurs de texte en ligne et/ou des extensions pour ins&#233;rer du texte avec la syntaxe Markdown.</p>
<p>Dans ce tutoriel, nous allons pratiquer la syntaxe Markdown directement depuis notre navigateur pr&#233;f&#233;r&#233; en utilisant l'&#233;diteur en ligne <ref target="https://stackedit.io">StackEdit</ref>. Cet &#233;diteur de traitement vous permet d'ins&#233;rer du texte format&#233; en Markdown &#224; gauche et en avoir le rendu directement &#224; c&#244;t&#233;, &#224; droite.</p>
<p>Puisque toutes les le&#231;ons du Programming Historian sont &#233;crites en Markdown, nous pouvons aussi explorer ces fichiers avec StackEdit. Ainsi, l'URL suivante fait appara&#238;tre la le&#231;on "Pr&#233;server ses donn&#233;es de recherche" en Markdown:</p>
<ab><code xml:id="code_debuter-avec-markdown_0" corresp="code_debuter-avec-markdown_0.txt" rend="block"/></ab>
<p>Une fois sur la fen&#234;tre de <ref target="https://stackedit.io/app#">l'&#233;diteur StackEdit</ref>, &#224; partir de l'adresse indiqu&#233;e ci-dessus, copiez l'ensemble du texte puis collez-le dans le panneau de gauche de l'&#233;diteur. Si vous le pr&#233;f&#233;rez, apr&#232;s avoir copi&#233; le texte, vous pouvez aussi le coller dans un nouveau fichier en utilisant un &#233;diteur de texte de votre choix puis le sauvegarder en format .md sur votre poste de travail. Ensuite, rendez-vous sur l'&#233;diteur de StackEdit et cliquez sur <code rend="inline">#</code>, en haut <hi rend="bold">&#224; droite</hi>, pour acc&#233;der au menu puis choisissez <code rend="inline">Import Markdown</code> (<emph>Importer Markdown</emph>). Sp&#233;cifiez le chemin pour acc&#233;der au fichier que vous avez stock&#233; en local, puis ouvrez-le.*</p>
<p>Vous remarquez que, m&#234;me si la f&#233;n&#234;tre &#224; droite offre un rendu plus &#233;l&#233;gant du texte, le fichier initial en Markdown, &#224; gauche, reste bien lisible.</p>
<p>Maintenant, d&#233;marrons notre le&#231;on pour r&#233;diger notre propre syntaxe Markdown. Veuillez cr&#233;er un nouveau document dans StackEdit en cliquant sur l'ic&#244;ne en haut &#224; gauche et en choisissant <code rend="inline">New Document</code> (<emph>Nouveau document</emph>). Vous pouvez introduire un titre pour le document dans la bo&#238;te de texte en haut de la page.</p>
<div type="3"><head>En-t&#234;tes</head>
<p>Il y a quatre niveaux d'en-t&#234;tes disponibles en Markdown; ils sont indiqu&#233;s par le nombre de <code rend="inline">#</code> pr&#233;c&#233;dant le texte de l'en-t&#234;te. Merci de copier et coller les exemples suivants dans la bo&#238;te de texte &#224; gauche.</p>
<ab><code xml:id="code_debuter-avec-markdown_1" corresp="code_debuter-avec-markdown_1.txt" rend="block"/></ab>
<p>Les en-t&#234;tes de premier et de deuxi&#232;me niveau peuvent aussi &#234;tre signal&#233;s comme suit:</p>
<ab><code xml:id="code_debuter-avec-markdown_2" corresp="code_debuter-avec-markdown_2.txt" rend="block"/></ab>
<p><hi rend="bold">Le rendu aura l'aspect de ceci:</hi></p>
<div type="1"><head>En-t&#234;te de premier niveau</head>
<h2>En-t&#234;te de deuxi&#232;me niveau</h2>
<h3>En-t&#234;te de troisi&#232;me niveau</h3>
<div type="4"><head>En-t&#234;te de quatri&#232;me niveau</head>
<p>Vous remarquez que la syntaxe Markdown reste facile &#224; lire et &#224; comprendre m&#234;me dans sa version texte brut.</p>
<h3>Paragraphes et sauts de ligne</h3>
<p>Ins&#233;rez la phrase suivante dans la bo&#238;te de texte:</p>
<ab><code xml:id="code_debuter-avec-markdown_3" corresp="code_debuter-avec-markdown_3.txt" rend="block"/></ab>
<p><hi rend="bold">Cela s'affiche de la mani&#232;re suivante:</hi></p>
<p>Bienvenue au Programming Historian.</p>
<p>Aujourd'hui, nous allons travailler sur la syntaxe Markdown.
Cette phrase se s&#233;pare de la pr&#233;c&#233;dente par un saut de ligne.</p>
<p>Les paragraphes doivent &#234;tre s&#233;par&#233;s par une ligne vide. Tentez de votre c&#244;t&#233; de laisser une ligne vide entre <code rend="inline">syntaxe Markdown.</code> et <code rend="inline">Cette phrase</code> pour comprendre le fonctionnement. Dans certaines impl&#233;mentations de Markdown, il est possible d'indiquer les simples sauts de ligne en laissant deux espaces vides &#224; la fin de chaque ligne (qui pr&#233;c&#232;de). Ceci n'est toutefois pas le cas avec la version <ref target="https://help.github.com/articles/github-flavored-markdown/">GitHub Flavored Markdown</ref> que StackEdit utilise par d&#233;faut.</p>
<h3>Mise en forme</h3>
<p>Vous pouvez mettre du texte en italique en le pla&#231;ant entre ast&#233;risques <code rend="inline">*</code> ou tirets bas <code rend="inline">_</code>. De m&#234;me, pour le mettre en gras, placez le entre deux ast&#233;risques <code rend="inline">**</code> ou deux tirets bas <code rend="inline">__</code>.</p>
<p>Essayez de mettre en forme certaines parties du texte selon ces principes:</p>
<ab><code xml:id="code_debuter-avec-markdown_4" corresp="code_debuter-avec-markdown_4.txt" rend="block"/></ab>
<p><hi rend="bold">Ceci s'affiche comme suit:</hi></p>
<p>Je suis <hi rend="bold">vraiment</hi> ravie des tutoriels du <emph>Programming Historian</emph>.</p>
<h3>Listes</h3>
<p>Markdown permet de cr&#233;er des listes ordonn&#233;es et non ordonn&#233;es. Essayez de cr&#233;er la liste suivante dans la bo&#238;te de dialogue:</p>
<ab><code xml:id="code_debuter-avec-markdown_5" corresp="code_debuter-avec-markdown_5.txt" rend="block"/></ab>
<p>Indenter l'ast&#233;risque <code rend="inline">*</code> vous permet de cr&#233;er des objets imbriqu&#233;s.</p>
<p><hi rend="bold">Le rendu de ceci est comme suit:</hi></p>
<h2>Liste de courses</h2>
<list type="unordered">
<item>
Fruits<list type="unordered">
<item>Pommes</item>
<item>Oranges</item>
<item>Raisins</item>
</list>
</item>
<item>
Produits laitiers<list type="unordered">
<item>Lait</item>
<item>Fromage</item>
</list>
</item>
</list>
<p>Les listes ordonn&#233;es sont r&#233;dig&#233;es en num&#233;rotant chaque ligne. R&#233;p&#233;tons-le, l'objectif de Markdown est de produire des documents qui sont &#224; la fois lisibles en texte brut et transformables en d'autres formats.</p>
<ab><code xml:id="code_debuter-avec-markdown_6" corresp="code_debuter-avec-markdown_6.txt" rend="block"/></ab>
<p><hi rend="bold">Cela s'affiche comme suit:</hi></p>
<h2>Liste &#224; faire</h2>
<list type="ordered">
<item>Achever le tutoriel Markdown</item>
<item>Aller &#224; l'&#233;picerie</item>
<item>Pr&#233;parer le d&#233;jeuner</item>
</list>
<h3>Blocs de code</h3>
<p>Repr&#233;senter les blocs de code de mani&#232;re distincte du reste du texte est une bonne pratique qui offre davantage de lisibilit&#233;. Habituellement le code est affich&#233; en caract&#232;res &#224; chasse fixe. Puisque Markdown ne distingue pas les polices, nous pouvons placer les blocs de code entre des guillements inverses tels <code rend="inline">`</code>. Par exemple, &#233;crire <code rend="inline">`&lt;br /&gt;`</code>. Nous pouvons ins&#233;rer des ensembles de code entre trois guillements inverses au d&#233;but et trois &#224; la fin. Dans la fen&#234;tre de pr&#233;visualisation de StackEdit, cela donnera une bo&#238;te ombrag&#233;e avec du texte en chasse fixe.</p>
<p>Ins&#233;rez le code suivant dans la bo&#238;te de dialogue:</p>
<ab><code xml:id="code_debuter-avec-markdown_7" corresp="code_debuter-avec-markdown_7.txt" rend="block"/></ab>
<p><hi rend="bold">Cela donne:</hi></p>
<ab><code xml:id="code_debuter-avec-markdown_8" corresp="code_debuter-avec-markdown_8.txt" rend="block"/></ab>
<p>Remarquez comment le code s'affiche en police &#224; chasse fixe.</p>
<h3>Blocs de citation</h3>
<p>Ajouter une balise fermante <code rend="inline">&gt;</code> avant chaque paragraphe le fera appara&#238;tre comme &#233;l&#233;ment de citation.</p>
<p>Essayez de taper le texte suivant dans le panel:</p>
<ab><code xml:id="code_debuter-avec-markdown_9" corresp="code_debuter-avec-markdown_9.txt" rend="block"/></ab>
<p><hi rend="bold">Ceci s'affiche comme suit:</hi></p>
<quote>
<p>Bonjour, je suis un paragraphe de texte englob&#233; dans un bloc de citation. Regardez comment je suis d&#233;cal&#233; par rapport &#224; la marge gauche.</p>
</quote>
<h3>Liens</h3>
<p>Les liens peuvent &#234;tre signal&#233;s selon deux styles.</p>
<p>Pour ins&#233;rer des liens &#224; l'int&#233;rieur du texte, on place d'abord le texte d'accroche entre crochets puis l'URL (et &#233;ventuellement du texte suppl&#233;mentaire) entre parenth&#232;ses.</p>
<p><code rend="inline">Pour acc&#233;der &#224; davantage de tutoriels, merci de visiter la page d'accueil du [Programming Historian](/ "Programming Historian main page").</code></p>
<p><hi rend="bold">Ceci s'affiche comme suit:</hi></p>
<p>Pour acc&#233;der &#224; davantage de tutoriels, merci de visiter la page d'accueil du <ref title="Programming Historian main page" target="/">Programming Historian</ref>.</p>
<p>Les liens de r&#233;f&#233;rences sont tr&#232;s pratiques pour cr&#233;er des notes de bas de page et permettent de garder votre document en texte brut propre. Ces liens s'&#233;crivent entre une paire de crochets suppl&#233;mentaire pour leur cr&#233;er, essentiellement, un identifiant unique.</p>
<p><code rend="inline">Le site web du [Programming Historian][1] fournit un exemple.</code></p>
<p>Puis vous pouvez ajouter l'URL dans une autre partie du document:</p>
<p><code rend="inline">[1]: http://programminghistorian.org/ "The Programming Historian"</code></p>
<p><hi rend="bold">Ceci s'affiche comme suit:</hi></p>
<p>Le site web du <ref title="The Programming Historian" target="http://programminghistorian.org/">Programming Historian</ref> fournit un exemple.</p>
<h3>Images</h3>
<p>Les images peuvent &#234;tre r&#233;f&#233;renc&#233;es en utilisant un point d'exclamation <code rend="inline">!</code> suivi par du texte suppl&#233;mentaire entre crochets et, entre parenth&#232;ses, l'URL de l'image. Le titre de l'image, s'il y en a un, se met entre guillemets. Les images ne s'affichent pas dans votre document en texte brut, mais elles seront int&#233;gr&#233;es &#224; la page convertie en HTML.</p>
<p><code rend="inline">![Logo de Wikipedia](https://upload.wikimedia.org/wikipedia/en/8/80/Wikipedia-logo-v2.svg "Logo de Wikipedia")</code></p>
<p><hi rend="bold">Ceci s'affiche comme cela:</hi></p>
<p><img src="https://upload.wikimedia.org/wikipedia/en/8/80/Wikipedia-logo-v2.svg" alt="Logo de Wikipedia" title="Logo de Wikipedia"/></p>
</div><table>
<row>
<cell align="left" role="label">Left-aligned</cell>
<cell align="center" role="label">Centered</cell>
<cell align="right" role="label">Right-aligned</cell>
</row>
<row>
<cell align="left">Bananes</cell>
<cell align="center">Jaune</cell>
<cell align="right">75</cell>
</row>
<row>
<cell align="left">Pommes</cell>
<cell align="center">Rouge</cell>
<cell align="right">5000</cell>
</row>
</table><table>
<row>
<cell role="label">En-t&#234;te 1</cell>
<cell role="label">En-t&#234;te 2</cell>
<cell role="label">En-t&#234;te 3</cell>
</row>
<row>
<cell>Ligne 3, colonne 1</cell>
<cell>Ligne 3, colonne 2</cell>
<cell>Ligne 3, colonne 3</cell>
</row>
<row>
<cell>Ligne 2, colonne 1</cell>
<cell>Ligne 2, colonne 2</cell>
<cell>Ligne 2, colonne 3</cell>
</row>
<row>
<cell>Ligne 1, colonne 1</cell>
<cell>Ligne 1, colonne 2</cell>
<cell>Ligne 1, colonne 3</cell>
</row>
</table></div></div></div></body>
  </text>
</TEI>
