<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introdu&#231;&#227;o aos Dados Abertos Conectados</title>
  <layout>lesson</layout>
  <collection>lessons</collection>
  <slug>introducao-dados-abertos-conectados</slug>
  <original>intro-to-linked-data</original>
  <date>2013-08-05</date>
  <translation_date>2022-11-21</translation_date>
  <authors>Jonathan Blaney</authors>
  <reviewers>Terhi Nurmikko-Fuller,Matthew Lincoln</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Francisco Nabais</translator>
  <translation-editor>Joana Vieira Paulino</translation-editor>
  <translation-reviewer>Bruno Almeida,Daniel Bonatto Seco</translation-reviewer>
  <difficulty>1</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/428</review-ticket>
  <activity>acquiring</activity>
  <topics>lod</topics>
  <abstract>Este tutorial apresenta os principais conceitos de dados abertos conectados (*Linked Open Data*), incluindo URIs, ontologias, formatos RDF e uma breve introdu&#231;&#227;o &#224; linguagem de consulta de gr&#225;ficos SPARQL.</abstract>
  <avatar_alt>Um homem velho com uma mulher em cada bra&#231;o</avatar_alt>
  <doi>10.46430/phpt0033</doi>
</metadata>
  <text>
    <body><p>Nota de Tradu&#231;&#227;o: Alguns termos, por aparecerem constantemente e facilitarem a interpreta&#231;&#227;o das imagens, apenas foram propositadamente traduzidos uma vez e ser&#227;o colocados entre par&#234;nteses. Alertamos tamb&#233;m para a exist&#234;ncia de alguns exemplos que n&#227;o foram propositadamente traduzidos para facilitar a sua introdu&#231;&#227;o nos programas apresentados.</p>
<div n="1"><head>Introdu&#231;&#227;o e &#194;mbito da li&#231;&#227;o</head>
<p>Esta li&#231;&#227;o oferece uma breve e concisa introdu&#231;&#227;o aos <link target="https://pt.wikipedia.org/wiki/Linked_data#The_Linking_Open_Data_Project">dados abertos conectados</link> (<emph>Linked Open Data</emph> ou LOD). N&#227;o &#233; necess&#225;rio conhecimento pr&#233;vio para realizar este tutorial. Os leitores dever&#227;o obter uma compreens&#227;o clara dos conceitos por detr&#225;s dos dados abertos conectados, como s&#227;o utilizados e como s&#227;o criados. O tutorial est&#225; dividido em cinco partes, al&#233;m de leituras adicionais:</p>
<ol>
<li>Dados abertos conectados: o que s&#227;o?</li>
<li>O papel do <link target="https://pt.wikipedia.org/wiki/URI">Identificador Uniforme de Recurso</link> (<emph>Uniform Resource Identifier</emph> ou URI)</li>
<li>Como o LOD organiza o conhecimento: <link target="https://pt.wikipedia.org/wiki/Ontologia_(ci%C3%AAncia_da_computa%C3%A7%C3%A3o)">ontologias</link></li>
<li>A <link target="https://pt.wikipedia.org/wiki/Resource_Description_Framework">Estrutura de Descri&#231;&#227;o de Recursos</link> (<emph>Resource Description Framework</emph> ou RDF) e formatos de dados</li>
<li>Consulta de dados abertos conectados com <link target="https://pt.wikipedia.org/wiki/SPARQL">SPARQL</link></li>
<li>Outras leituras e recursos</li>
</ol>
<p>A conclus&#227;o deste tutorial poder&#225; levar algumas horas e poder&#225; ser &#250;til reler algumas sec&#231;&#245;es para solidificar a sua compreens&#227;o. Os termos t&#233;cnicos foram ligados &#224; sua p&#225;gina correspondente na Wikipedia e encoraja-se a que fa&#231;a uma pausa e leia sobre termos que considere desafiadores. Depois de ter aprendido alguns dos princ&#237;pios-chave do LOD, a melhor maneira de melhorar e solidificar esse conhecimento &#233; praticar. Este tutorial fornece oportunidades para faz&#234;-lo. No final da li&#231;&#227;o, dever&#225; compreender os princ&#237;pios b&#225;sicos de LOD, incluindo termos e conceitos-chave.</p>
<p>Se precisar aprender a como explorar LOD usando a linguagem de consulta <link target="https://pt.wikipedia.org/wiki/SPARQL">SPARQL</link>, recomenda-se a li&#231;&#227;o de Matthew Lincoln <link target="/en/lessons/retired/graph-databases-and-SPARQL">'<emph>Using SPARQL to access Linked Open Data</emph>'</link> (em ingl&#234;s) (Nota: a li&#231;&#227;o deste link encontra-se desatualizada e j&#225; n&#227;o &#233; mantida pelo <emph>Programming Historian</emph>. Por favor veja a nota inicial dessa p&#225;gina sobre a raz&#227;o dessa li&#231;&#227;o ter sido retirada), que segue praticamente a vis&#227;o geral fornecida nesta li&#231;&#227;o.</p>
<p>Para proporcionar aos leitores uma base s&#243;lida dos princ&#237;pios b&#225;sicos de LOD, este tutorial n&#227;o oferecer&#225; uma cobertura abrangente de todos os seus conceitos. Estes <hi rend="bold">n&#227;o</hi> ser&#227;o o foco desta li&#231;&#227;o:</p>
<ol>
<li><link target="https://pt.wikipedia.org/wiki/Web_sem%C3%A2ntica">Web Sem&#226;ntica</link> e <link target="https://en.wikipedia.org/wiki/Semantic_reasoner">racioc&#237;nio sem&#226;ntico</link> (em ingl&#234;s) de <link target="https://pt.wikipedia.org/wiki/Conjunto_de_dados">datasets</link>. Um raciocinador sem&#226;ntico deduziria que Jorge VI &#233; o irm&#227;o ou meio-irm&#227;o de Eduardo VIII, dado que: a) Eduardo VIII &#233; o filho de Jorge V e b) Jorge VI &#233; o filho de Jorge V. Este tutorial n&#227;o se foca neste tipo de tarefa.</li>
<li>Cria&#231;&#227;o e <emph>upload</emph> de conjuntos de dados abertos conectados ligados &#224; <link target="http://linkeddatacatalog.dws.informatik.uni-mannheim.de/state/">Nuvem de dados conectados</link> (em ingl&#234;s). Partilhar LOD &#233; um princ&#237;pio importante, que &#233; encorajado abaixo. Contudo, os aspetos pr&#225;ticos de contribuir com LOD para a nuvem de dados conectados est&#227;o al&#233;m do &#226;mbito desta li&#231;&#227;o. Alguns recursos que podem ajudar a come&#231;ar esta tarefa est&#227;o dispon&#237;veis no final deste tutorial.</li>
</ol>
</div><div n="1"><head>Dados abertos conectados: O que s&#227;o?</head>
<p>LOD &#233; informa&#231;&#227;o estruturada num formato destinado a m&#225;quinas e, por isso, n&#227;o &#233; necessariamente um conceito de f&#225;cil defini&#231;&#227;o. &#201; importante n&#227;o perder a motiva&#231;&#227;o com esta informa&#231;&#227;o j&#225; que, ao compreender os princ&#237;pios, pode colocar uma m&#225;quina a fazer uma leitura aut&#243;noma.</p>
<p>Se todos os datasets fossem publicados abertamente e utilizassem o mesmo formato para estruturar a informa&#231;&#227;o, seria poss&#237;vel interrog&#225;-los todos de uma s&#243; vez. A an&#225;lise de grandes volumes de dados &#233; potencialmente muito mais poderosa do que qualquer pessoa que utilize os seus pr&#243;prios datasets individuais espalhados pela web nos chamados <link target="https://en.wikipedia.org/wiki/Information_silo">silos de informa&#231;&#227;o</link> (em ingl&#234;s). Estes datasets interoper&#225;veis s&#227;o aquilo para que os profissionais de LOD est&#227;o a trabalhar.</p>
<p>Para atingir este objetivo, ao trabalhar com LOD, &#233; importante recordar tr&#234;s princ&#237;pios:</p>
<ol>
<li><hi rend="bold">Utilizar um formato padr&#227;o de LOD reconhecido</hi>. Para que o LOD funcione, os dados devem ser <link target="https://pt.wikipedia.org/wiki/Estrutura_de_dados">estruturados</link>, utilizando normas reconhecidas para que os computadores que interrogam os dados possam process&#225;-los de forma consistente. H&#225; v&#225;rios formatos de LOD, alguns dos quais s&#227;o discutidos abaixo.</li>
<li><hi rend="bold">Referir uma entidade da mesma forma que outras pessoas o fazem</hi>. Se existirem dados sobre a mesma pessoa/local/coisa em dois ou mais locais, certifique-se de que se refere &#224; pessoa/local/coisa da mesma forma em todos os casos.</li>
<li><hi rend="bold">Publicar os seus dados abertamente</hi>. Qualquer pessoa dever&#225; poder utilizar os seus dados sem pagar uma taxa e num formato que n&#227;o exija <link target="https://pt.wikipedia.org/wiki/Software_propriet%C3%A1rio">software propriet&#225;rio</link>.</li>
</ol>
<p>Comecemos com um exemplo de dados sobre uma pessoa, utilizando uma abordagem comum <link target="https://en.wikipedia.org/wiki/Attribute%E2%80%93value_pair">par atributo-valor</link> (em ingl&#234;s) t&#237;pica em computa&#231;&#227;o:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_0" type="block" corresp="code_introducao-dados-abertos-conectados_0.txt"></code></pre>
<p>Neste caso, o 'atributo' &#233; uma pessoa. E o valor - ou quem &#233; essa pessoa - &#233; representado por um n&#250;mero. O n&#250;mero pode ser atribu&#237;do aleatoriamente ou pode ser utilizado um n&#250;mero que j&#225; esteja associado a essa pessoa. Esta &#250;ltima abordagem tem grandes vantagens: se todos os que criarem um dataset que menciona essa pessoa utilizarem <emph>exatamente o mesmo n&#250;mero, exatamente no mesmo formato</emph>, ent&#227;o podemos encontrar esse indiv&#237;duo de forma fi&#225;vel em qualquer dataset aderindo a essas regras. Vamos criar um exemplo usando Jack Straw: tanto o nome de um rebelde ingl&#234;s do s&#233;culo XIV, como o de um ministro de gabinete brit&#226;nico proeminente na administra&#231;&#227;o de Tony Blair. &#201; &#250;til ser capaz de diferenciar as duas pessoas que partilham o mesmo nome.</p>
<p>Utilizando o modelo acima, no qual cada pessoa &#233; representada por um n&#250;mero &#250;nico, vamos atribuir ao ministro brit&#226;nico Jack Straw o n&#250;mero <code type="inline">64183282</code>. O seu par atributo-valor ficaria ent&#227;o com este aspeto:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_1" type="block" corresp="code_introducao-dados-abertos-conectados_1.txt"></code></pre>
<p>E vamos atribuir a Jack Straw, descrito no <emph><link target="http://www.oxforddnb.com">Oxford Dictionary of National Biography</link></emph> (em ingl&#234;s) como 'o enigm&#225;tico l&#237;der rebelde', o n&#250;mero <code type="inline">33059614</code>, fazendo com que o seu par atributo-valor se pare&#231;a com isto:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_2" type="block" corresp="code_introducao-dados-abertos-conectados_2.txt"></code></pre>
<p>Desde que todos os que fazem LOD utilizem estes dois n&#250;meros para se referirem aos respetivos Jack Straws, podemos agora procurar a pessoa <code type="inline">64183282</code> num conjunto de dados abertos conectados e podemos estar confiantes de que estamos a obter a pessoa certa - neste caso, o ministro.</p>
<p>Os pares atributo-valor tamb&#233;m podem armazenar informa&#231;&#245;es sobre outros tipos de entidades: lugares, por exemplo. Jack Straw, o pol&#237;tico moderno, era membro do Parlamento brit&#226;nico, representando o assento de Blackburn. H&#225; mais do que um lugar no Reino Unido chamado Blackburn, para n&#227;o mencionar outros Blackburn em todo o mundo. Usando os mesmos princ&#237;pios acima delineados, podemos desambiguar entre os v&#225;rios Blackburns, atribuindo um identificador &#250;nico ao lugar correto: Blackburn em Lancashire, Inglaterra.</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_3" type="block" corresp="code_introducao-dados-abertos-conectados_3.txt"></code></pre>
<p>Neste momento pode estar pensando, "isso &#233; o que um cat&#225;logo de biblioteca faz". &#201; verdade que a ideia-chave aqui &#233; a do <link target="https://pt.wikipedia.org/wiki/Controle_de_autoridade">ficheiro de autoridade</link>, central na biblioteconomia (um ficheiro de autoridade &#233; uma lista definitiva de termos que podem ser utilizados num contexto particular, por exemplo, quando se cataloga um livro). Nos dois exemplos acima descritos, utilizamos ficheiros de autoridade para atribuir n&#250;meros (os identificadores &#250;nicos) aos Jacks e ao Blackburn. Os n&#250;meros que utilizamos para os dois Jack Straws prov&#234;m do <link target="https://viaf.org">Virtual International Authority File</link> (em ingl&#234;s) (VIAF) (Arquivo Internacional de Autoridade Virtual), que &#233; mantido por um cons&#243;rcio de bibliotecas de todo o mundo, de modo a tentar resolver o problema da mir&#237;ade de maneiras pelas quais a mesma pessoa pode ser referida. O identificador &#250;nico que utilizamos para o distrito eleitoral de Blackburn prov&#233;m da <link target="http://www.geonames.org/">GeoNames</link> (em ingl&#234;s), uma base de dados geogr&#225;fica gratuita.</p>
<p>Vamos tentar ser mais precisos com o que, neste caso, queremos dizer com 'Blackburn'. Jack Straw representou o c&#237;rculo eleitoral (uma &#225;rea representada por um &#250;nico membro do parlamento) de Blackburn, que mudou os seus limites ao longo do tempo. O projeto "<link target="https://repository.jisc.ac.uk/6544/1/DiLiPaD_final_report_1.pdf"><emph>Digging Into Linked Parliamentary Data</emph></link>" (Dilipad) (em ingl&#234;s), no qual trabalhei, produziu identificadores &#250;nicos para as filia&#231;&#245;es partid&#225;rias e circunscri&#231;&#245;es eleitorais para cada membro do parlamento. Neste exemplo, Jack Straw representou o distrito eleitoral conhecido como 'Blackburn' na sua encarna&#231;&#227;o p&#243;s-1955:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_4" type="block" corresp="code_introducao-dados-abertos-conectados_4.txt"></code></pre>
<p>Como o VIAF &#233; um ficheiro de autoridade respeitado e bem mantido, fornece um conjunto &#243;bvio de identificadores a utilizar para Jack Straw. Como o distrito eleitoral representado por Straw estava perfeitamente coberto pelos ficheiros de autoridade criados pelo projeto Dilipad, tamb&#233;m era um ficheiro de autoridade l&#243;gico a utilizar. Infelizmente, nem sempre &#233; t&#227;o &#243;bvio qual das listas publicadas online &#233; a melhor para se usar. Uma pode ser mais utilizada do que outra, mas esta &#250;ltima pode ser mais abrangente para um determinado fim. O GeoNames funcionaria melhor do que os identificadores da Dilipad em alguns casos. Haver&#225; tamb&#233;m casos em que n&#227;o se consegue encontrar um dataset com essa informa&#231;&#227;o. Por exemplo, se quiser escrever pares atributo-valor sobre si pr&#243;prio e as suas rela&#231;&#245;es familiares imediatas ter&#225; de inventar os seus pr&#243;prios identificadores.</p>
<p>Esta falta de ficheiros de autoridade coerentes &#233; um dos maiores desafios que o LOD enfrenta neste momento. <link target="https://pt.wikipedia.org/wiki/Tim_Berners-Lee">Tim Berners-Lee</link>, que inventou uma forma de ligar documentos em rede e criou assim a World Wide Web, um dos principais proponentes de LOD, para encorajar uma maior utiliza&#231;&#227;o de dados conectados, sugeriu um "<link target="https://www.w3.org/DesignIssues/LinkedData.html">sistema de classifica&#231;&#227;o de cinco estrelas</link>" (em ingl&#234;s) para que todos avan&#231;assem o mais longe poss&#237;vel em dire&#231;&#227;o ao LOD. Essencialmente, Tim Berners-Lee apoia a publica&#231;&#227;o aberta de dados, especialmente ao utilizar formatos abertos e normas p&#250;blicas, mas o melhor &#233; que os dados se liguem tamb&#233;m aos dados de outras pessoas.</p>
<p>Com os identificadores &#250;nicos atribu&#237;dos a todos os elementos, o pr&#243;ximo passo fundamental na cria&#231;&#227;o de LOD &#233; ter uma forma de <emph>descri&#231;&#227;o</emph> da rela&#231;&#227;o entre Jack Straw (<code type="inline">64183282</code>) e Blackburn (<code type="inline">blackburn1955-presente</code>). Em LOD, as rela&#231;&#245;es s&#227;o expressas utilizando o que &#233; conhecido como '<link target="https://en.wikipedia.org/wiki/Semantic_triple">tripla sem&#226;ntica</link>' (em ingl&#234;s). Vamos fazer uma tripla sem&#226;ntica que represente a rela&#231;&#227;o entre Jack Straw e o seu distrito eleitoral:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_5" type="block" corresp="code_introducao-dados-abertos-conectados_5.txt"></code></pre>
<p>A apresenta&#231;&#227;o (ou <link target="https://pt.wikipedia.org/wiki/Sintaxe">sintaxe</link>) das triplas sem&#226;nticas, incluindo a pontua&#231;&#227;o utilizada acima, ser&#225; discutida mais tarde, na sec&#231;&#227;o sobre RDF e formatos de dados. Por agora, vamos focar-nos na estrutura b&#225;sica. A tripla sem&#226;ntica, n&#227;o surpreendentemente, tem tr&#234;s partes. Estas s&#227;o convencionalmente referidas como sujeito (<emph>subject</emph>), predicado (<emph>predicate</emph>) e objeto (<emph>object</emph>):</p>
<table>
<thead>
<tr>
<th>o sujeito</th>
<th>o predicado</th>
<th>o objeto</th>
</tr>
</thead>
<tbody>
<tr>
<td>pessoa 64183282</td>
<td>representadaNoParlamentoBrit&#226;nico</td>
<td>"blackburn1955-presente"</td>
</tr>
</tbody></table><p>A forma tradicional de representar uma tripla sem&#226;ntica em forma esquem&#225;tica &#233; a seguinte (em ingl&#234;s):</p>
<figure><desc>Forma tradicional de representar uma tripla sem&#226;ntica</desc><graphic url="introducao-dados-abertos-conectados-fig1.png" alt="Imagem com a representa&#231;&#227;o de uma tripla sem&#226;ntica"/></figure>
<p>Assim, a nossa tripla sem&#226;ntica do Jack Straw, apresentado de forma mais leg&#237;vel para o ser humano, poderia assumir a seguinte forma:</p>
<figure><desc>Diagrama da tripla sem&#226;ntica que demonstra que Jack Straw representava Blackburn</desc><graphic url="introducao-dados-abertos-conectados-fig2.png" alt="Imagem com a representa&#231;&#227;o de uma tripla sem&#226;ntica aplicada ao exemplo de Jack Straw"/></figure>
<p>Por enquanto, &#233; importante fixar tr&#234;s pontos-chave:</p>
<ul>
<li>O LOD deve estar aberto e dispon&#237;vel para qualquer pessoa na Internet (caso contr&#225;rio, n&#227;o est&#225; "aberto")</li>
<li>Os defensores do LOD t&#234;m como objetivo normalizar as formas de refer&#234;ncia a entidades &#250;nicas</li>
<li>O LOD consiste em triplas sem&#226;nticas que descrevem as rela&#231;&#245;es entre entidades</li>
</ul>
</div><div n="1"><head>O papel do <emph>Uniform Resource Identifier</emph> (URI)</head>
<p>Uma parte essencial de LOD &#233; o <link target="https://pt.wikipedia.org/wiki/URI">Identificador Uniforme de Recurso</link>(<emph>Uniform Resource Identifier</emph> ou URI). O URI &#233; uma forma &#250;nica e fi&#225;vel de representar uma entidade (uma pessoa, um objeto, uma rela&#231;&#227;o, etc.), de uma forma que &#233; utiliz&#225;vel por todos no mundo.</p>
<p>Na sec&#231;&#227;o anterior, utilizamos dois n&#250;meros diferentes para identificar os diferentes Jack Straws.</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_6" type="block" corresp="code_introducao-dados-abertos-conectados_6.txt"></code></pre>
<p>O problema &#233; que em todo o mundo existem muitas bases de dados que cont&#234;m pessoas com estes n&#250;meros e s&#227;o, provavelmente, todas pessoas diferentes. Fora do nosso contexto imediato, estes n&#250;meros n&#227;o identificam indiv&#237;duos &#250;nicos. Vamos tentar resolver isso. Aqui est&#227;o estes mesmos identificadores, mas como URIs:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_7" type="block" corresp="code_introducao-dados-abertos-conectados_7.txt"></code></pre>
<p>Tal como o n&#250;mero &#250;nico desambiguou os nossos dois Jack Straws, o URI completo acima ajuda-nos a desambiguar entre todos os diferentes ficheiros de autoridade l&#225; fora. Neste caso, &#233; evidente que estamos a utilizar o VIAF como o nosso ficheiro de autoridade. Com certeza, j&#225; viu esta forma de desambigua&#231;&#227;o muitas vezes na web. Existem muitos websites em todo o mundo com p&#225;ginas chamadas <code type="inline">/home</code> ou <code type="inline">/faq</code>. Mas n&#227;o h&#225; confus&#227;o porque o <link target="https://pt.wikipedia.org/wiki/Nome_de_dom%C3%ADnio">dom&#237;nio</link> (a primeira parte do <link target="https://pt.wikipedia.org/wiki/URL">Localizador Uniforme de Recursos</link> (<emph>Uniform Resource Locator</emph> ou URL) - ex. <code type="inline">bbc.co.uk</code>) &#233; &#250;nico, portanto, todas as p&#225;ginas que fazem parte desse dom&#237;nio s&#227;o &#250;nicas em outras p&#225;ginas <code type="inline">/faq</code> de outros websites. No endere&#231;o <code type="inline">http://www.bbc.co.uk/faqs</code> &#233; a parte <code type="inline">bbc.co.uk</code> que torna as p&#225;ginas subsequentes &#250;nicas. Isto &#233; t&#227;o &#243;bvio para as pessoas que utilizam a web a toda a hora que n&#227;o pensam sobre isso. Provavelmente, tamb&#233;m sabe que se quiser criar um website chamado <code type="inline">bbc.co.uk</code> n&#227;o conseguir&#225;, porque esse nome j&#225; foi registado com a autoridade apropriada, que &#233; o <link target="https://pt.wikipedia.org/wiki/Sistema_de_Nomes_de_Dom%C3%ADnio">Sistema de Nomes de Dom&#237;nio</link> (<emph>Domain Name System</emph>). O registo garante a singularidade. Os URIs tamb&#233;m t&#234;m de ser &#250;nicos.</p>
<p>Embora os exemplos acima se pare&#231;am com URLs, tamb&#233;m &#233; poss&#237;vel construir um URI que n&#227;o se pare&#231;a nada com um URL. Temos muitas formas de identificar pessoas e coisas de forma &#250;nica e raramente pensamos ou nos preocupamos com isso. Os c&#243;digos de barras, n&#250;meros de passaporte, at&#233; mesmo os c&#243;digos postais s&#227;o concebidos para serem &#250;nicos. Os n&#250;meros de telefone s&#227;o frequentemente colocados como placas de loja precisamente porque s&#227;o &#250;nicos. Todos eles podem ser utilizados como URIs.</p>
<p>Quando criamos URIs para as entidades descritas pelo projeto '<link target="https://gtr.ukri.org/projects?ref=AH%2FN003446%2F1#/tabOverview">Tobias</link>' (em ingl&#234;s), escolhemos uma estrutura do tipo URL e escolhemos utilizar o nosso espa&#231;o web institucional, pondo de lado <code type="inline">data.history.ac.uk/tobias-project/</code> como um lugar dedicado &#224; hospedagem destes URIs. Ao coloc&#225;-lo em <code type="inline">data.history.ac.uk</code> em vez de <code type="inline">history.ac.uk</code>, houve uma separa&#231;&#227;o clara entre URIs e as p&#225;ginas do website. Por exemplo, um dos URIs do projeto Tobias era 'http://data.history.ac.uk/tobias-project/person/15601'. Embora o formato dos URIs acima mencionados seja o mesmo que um URL, eles n&#227;o se ligam a websites (tente col&#225;-lo num navegador web). Muitas pessoas novas no LOD acham isto confuso. Todos os URLs s&#227;o URIs, mas nem todos os URIs s&#227;o URLs. (nota de tradu&#231;&#227;o: tendo em conta que o site original do projeto Tobias j&#225; n&#227;o se encontra dispon&#237;vel, o leitor da li&#231;&#227;o deve entender os exemplos aqui indicados como meramente ilustrativos daquilo que o autor pretende demonstrar) Um URI pode descrever qualquer coisa, enquanto o URL descreve a localiza&#231;&#227;o de algo na web. Assim, um URL diz-lhe a localiza&#231;&#227;o de uma p&#225;gina web, de um ficheiro ou algo semelhante. Um URI faz apenas o trabalho de identificar algo. Tal como o N&#250;mero internacional Normalizado do Livro (International Standard Book Number ou <link target="https://www.iso.org/standard/36563.html">ISBN</link> (em ingl&#234;s) <code type="inline">978-0-1-873354-6</code> identifica exclusivamente uma edi&#231;&#227;o de capa dura de <emph>Baptism, Brotherhood and Belief in Reformation Germany</emph>, de Kat Hill, mas n&#227;o diz onde obter uma c&#243;pia. Para isso precisaria de algo como um <link target="https://pt.wikipedia.org/wiki/N%C3%BAmero_de_acesso_(biblioteconomia)">n&#250;mero de acesso</link>, que lhe d&#225; uma localiza&#231;&#227;o exata de um livro numa prateleira de uma biblioteca espec&#237;fica.</p>
<p>H&#225; um pouco de jarg&#227;o em torno de URIs. As pessoas falam sobre se s&#227;o ou n&#227;o <link target="https://pt.wikipedia.org/wiki/Refer%C3%AAncia_(ci%C3%AAncia_da_computa%C3%A7%C3%A3o)">desreferenci&#225;veis</link>. Isso apenas significa que <emph>podemos transformar uma refer&#234;ncia abstrata em algo diferente?</emph> Por exemplo, se colarmos um URI na barra de endere&#231;os de um browser, ser&#225; que ele encontra algo? O VIAF URI para o historiador Simon Schama &#233;:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_8" type="block" corresp="code_introducao-dados-abertos-conectados_8.txt"></code></pre>
<p>Se o colocarmos no browser, receberemos de volta uma p&#225;gina web sobre Simon Schama que cont&#233;m dados estruturados sobre ele e a sua hist&#243;ria editorial. Isto &#233; muito &#250;til por um motivo. A partir do URI n&#227;o &#233; &#243;bvio quem ou mesmo o que &#233; que est&#225; a ser referido. Da mesma forma, se tratarmos um n&#250;mero de telefone (com c&#243;digo internacional) como o URI de uma pessoa, ent&#227;o deve ser desreferenci&#225;vel. Algu&#233;m pode atender o telefone e pode at&#233; ser Schama.</p>
<p>Mas isto n&#227;o &#233; essencial. Muitos URIs n&#227;o s&#227;o desreferenci&#225;veis, como no exemplo acima do projeto Tobias. N&#227;o se pode encontr&#225;-lo em lado nenhum; &#233; uma conven&#231;&#227;o.</p>
<p>O exemplo do VIAF leva-nos a outra coisa importante sobre os URIs: n&#227;o os invente a n&#227;o ser que tenha de o fazer. As pessoas e organiza&#231;&#245;es t&#234;m feito esfor&#231;os para construir boas listas de URI e o LOD n&#227;o vai funcionar eficazmente se as pessoas duplicarem esse trabalho criando novos URIs desnecessariamente. Por exemplo, o VIAF tem o apoio de muitas bibliotecas internacionais. Se quiser construir URIs para pessoas, o VIAF &#233; uma escolha muito boa. Se n&#227;o conseguir encontrar algumas pessoas no VIAF, ou noutras listas de autoridade, s&#243; ent&#227;o poder&#225; precisar fazer a sua pr&#243;pria.</p>
</div><div n="1"><head>Como o LOD organiza o conhecimento: ontologias</head>
<p>Pode n&#227;o ter sido &#243;bvio a partir das triplas sem&#226;nticas individuais que analisamos na sec&#231;&#227;o anterior, mas o LOD pode responder a perguntas complexas. Quando se juntam as triplas sem&#226;nticas, estas formam um <link target="https://pt.wikipedia.org/wiki/Mapa_conceitual">Mapa conceitual</link>, devido &#224; forma como as triplas sem&#226;nticas se interligam. Suponhamos que queremos encontrar uma lista de todas as pessoas que foram alunos do compositor Franz Liszt. Se a informa&#231;&#227;o estiver em triplas sem&#226;nticas de dados conectados sobre pianistas e os seus professores, podemos descobrir o que procuramos com uma consulta (veremos esta linguagem de consulta, chamada SPARQL, na sec&#231;&#227;o final).</p>
<p>Por exemplo, o pianista Charles Rosen foi aluno do pianista Moriz Rosenthal, que foi aluno de Franz Liszt. Vamos agora expressar isto em duas triplas sem&#226;nticas (vamos cingir-nos &#224;s sequ&#234;ncias de caracteres para os nomes em vez dos n&#250;meros de identifica&#231;&#227;o, para tornar os exemplos mais leg&#237;veis):</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_9" type="block" corresp="code_introducao-dados-abertos-conectados_9.txt"></code></pre>
<p>Poder&#237;amos igualmente ter criado as nossas triplas sem&#226;nticas desta forma:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_10" type="block" corresp="code_introducao-dados-abertos-conectados_10.txt"></code></pre>
<p>Estamos a inventar exemplos simplesmente para fins de ilustra&#231;&#227;o, mas se quiser ligar os seus dados a outros datasets na "nuvem de dados conectados" deve olhar para as conven&#231;&#245;es que s&#227;o utilizadas nesses datasets e fazer o mesmo. Na verdade, esta &#233; uma das caracter&#237;sticas mais &#250;teis de LOD porque muito do trabalho j&#225; foi feito. As pessoas t&#234;m passado muito tempo a desenvolver formas de modelar a informa&#231;&#227;o dentro de uma determinada &#225;rea de estudo e a pensar sobre como as rela&#231;&#245;es dentro dessa &#225;rea podem ser representadas. Estes modelos s&#227;o geralmente conhecidos como ontologias. Uma ontologia &#233; uma abstra&#231;&#227;o que permite a representa&#231;&#227;o de um conhecimento particular sobre o mundo. Neste sentido, estas s&#227;o bastante recentes e foram concebidas para fazer o que uma <link target="https://pt.wikipedia.org/wiki/Taxonomia_(geral)">taxonomia</link> hier&#225;rquica faz (pense na classifica&#231;&#227;o das esp&#233;cies na <link target="https://pt.wikipedia.org/wiki/Taxonomia_de_Lineu">Taxonomia de Lineu</link>, mas de uma forma mais flex&#237;vel.</p>
<p>Uma ontologia &#233; mais flex&#237;vel porque n&#227;o &#233; hier&#225;rquica. Visa representar a fluidez do mundo real, onde as coisas podem ser relacionadas umas com as outras de formas mais complexas do que quando s&#227;o representadas por uma estrutura hier&#225;rquica em forma de &#225;rvore. Em vez disso, uma ontologia &#233; mais parecida com uma teia de aranha.</p>
<p>O que quer que pretenda representar com LOD, sugerimos que encontre um vocabul&#225;rio existente e que o utilize, em vez de tentar escrever o seu pr&#243;prio vocabul&#225;rio. Esta p&#225;gina tem <link target="http://semanticweb.org/wiki/Main_Page.html">uma lista de alguns dos vocabul&#225;rios mais populares</link> (em ingl&#234;s).</p>
<p>Uma vez que o nosso exemplo acima se concentra nos pianistas, seria uma boa ideia encontrar uma ontologia apropriada em vez de criar o nosso pr&#243;prio sistema. De facto, existe <link target="http://web.archive.org/web/20170715094229/http://www.musicontology.com/">uma ontologia para m&#250;sica</link> (em ingl&#234;s). Para al&#233;m de uma especifica&#231;&#227;o bem desenvolvida, esta tem tamb&#233;m alguns exemplos &#250;teis da sua utiliza&#231;&#227;o. Pode dar uma olhada nas <link target="http://web.archive.org/web/20170718143925/http://musicontology.com/docs/getting-started.html">p&#225;ginas de inicia&#231;&#227;o</link> (em ingl&#234;s) para ter uma ideia de como se pode utilizar esta ontologia em particular.</p>
<p>Infelizmente, n&#227;o conseguimos encontrar nada que descreva a rela&#231;&#227;o entre um professor e um aluno na Ontologia da M&#250;sica. Mas a ontologia &#233; publicada abertamente, logo podemos utiliz&#225;-la para descrever outras caracter&#237;sticas da m&#250;sica e depois criar a nossa pr&#243;pria extens&#227;o. Se ent&#227;o public&#225;ssemos a nossa extens&#227;o abertamente, outros poderiam utiliz&#225;-la se assim o desejassem e este ato pode tornar-se num padr&#227;o. Embora o projeto <emph>Music Ontology</emph> (Ontologia Musical) n&#227;o tenha a rela&#231;&#227;o que precisamos, o <link target="https://linkedjazz.org/">projeto <emph>Linked Jazz</emph></link> (em ingl&#234;s) permite o uso de '<emph>mentorOf</emph>', o que parece funcionar bem no nosso caso. Embora esta n&#227;o seja uma solu&#231;&#227;o ideal, &#233; uma solu&#231;&#227;o que faz um esfor&#231;o para utilizar o que j&#225; existe por a&#237;.</p>
<p>Agora, se estiv&#233;ssemos a estudar a hist&#243;ria do pianismo, poder&#237;amos querer identificar muitos pianistas que foram ensinados por alunos de Liszt, para estabelecer uma esp&#233;cie de &#225;rvore geneal&#243;gica e ver se estes 'netos' de Liszt t&#234;m algo em comum. Poder&#237;amos pesquisar os alunos de Liszt, fazer uma grande lista deles, depois pesquisar cada um dos alunos e tentar fazer listas de quaisquer alunos que eles tivessem. Com LOD poder&#237;amos (novamente, se as triplas sem&#226;nticas existissem) escrever uma query semelhante a:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_11" type="block" corresp="code_introducao-dados-abertos-conectados_11.txt"></code></pre>
<p>Isto encontraria todas as pessoas do dataset que eram alunos de alunos de Liszt. N&#227;o nos entusiasmemos demasiado: esta pergunta n&#227;o nos dar&#225; todos os alunos de todos os alunos de Liszt que j&#225; existiram, porque essa informa&#231;&#227;o provavelmente n&#227;o existe e n&#227;o existe dentro de nenhum conjunto de triplas sem&#226;nticas existentes. Lidar com dados do mundo real mostra todo o tipo de omiss&#245;es e inconsist&#234;ncias, que veremos quando olharmos para o maior conjunto de LOD, a <link target="https://www.dbpedia.org/">DBpedia</link>, na sec&#231;&#227;o final.</p>
<p>Se tiver utilizado <link target="https://pt.wikipedia.org/wiki/Banco_de_dados_relacional">bases de dados relacionais</link> poder&#225; estar a pensar que estas podem desempenhar a mesma fun&#231;&#227;o. No nosso caso de Liszt, a informa&#231;&#227;o sobre pianistas acima descrita pode estar organizada numa <link target="https://pt.wikipedia.org/wiki/Tabela_(banco_de_dados)">tabela</link> de base de dados denominada por algo como 'Alunos'.</p>
<table>
<thead>
<tr>
<th>IDaluno</th>
<th>IDprofessor</th>
</tr>
</thead>
<tbody>
<tr>
<td>31</td>
<td>17</td>
</tr>
<tr>
<td>35</td>
<td>17</td>
</tr>
<tr>
<td>49</td>
<td>28</td>
</tr>
<tr>
<td>56</td>
<td>28</td>
</tr>
<tr>
<td>72</td>
<td>40</td>
</tr>
</tbody></table><p>Se n&#227;o estiver familiarizado com bases de dados n&#227;o se preocupe. Mas, provavelmente, ainda pode ver que alguns pianistas nesta tabela tinham o mesmo professor (n&#250;meros 17 e 28). Sem entrar em pormenores, se Liszt estiver nesta tabela de bases de dados, seria bastante f&#225;cil extrair os alunos de Liszt, ao utilizar um <code type="inline">Join</code> (<link target="https://pt.wikipedia.org/wiki/Join_(SQL)"><emph>join</emph></link>).</p>
<p>De facto, as bases de dados relacionais podem oferecer resultados semelhantes ao LOD. A grande diferen&#231;a &#233; que o LOD pode ir mais longe: pode ligar datasets que foram criados sem inten&#231;&#227;o expl&#237;cita de serem ligados entre si. A utiliza&#231;&#227;o do <link target="https://pt.wikipedia.org/wiki/Resource_Description_Framework">Quadro de Descri&#231;&#227;o de Recursos</link> (<emph>Resource Description Framework</emph> ou RDF) e URIs permite que isto aconte&#231;a.</p>
</div><div n="1"><head>RDF e formatos de dados</head>
<p>LOD utiliza uma norma, definida pelo <link target="https://www.w3.org/">Cons&#243;rcio World Wide Web</link> (em ingl&#234;s) (<emph>World Wide Web Consortium</emph> ou W3C), chamada <emph><link target="https://pt.wikipedia.org/wiki/Resource_Description_Framework">Resource Description Framework</link></emph> ou apenas RDF. As normas s&#227;o &#250;teis desde que sejam amplamente adotadas - pense no metro ou nos tamanhos de parafuso padr&#227;o - mesmo que sejam essencialmente arbitr&#225;rias. O RDF tem sido amplamente adotado como a norma LOD.</p>
<p>Ouvir&#225; frequentemente o LOD referido simplesmente como RDF. Atrasamos a conversa sobre o RDF at&#233; agora porque &#233; bastante abstrato. RDF &#233; um <link target="https://pt.wikipedia.org/wiki/Modelagem_de_dados">modelo de dados</link> que descreve como &#233; que os dados s&#227;o estruturados num n&#237;vel te&#243;rico. Assim, a insist&#234;ncia na utiliza&#231;&#227;o de triplas sem&#226;nticas (em vez de quatro partes, ou duas ou nove, por exemplo) &#233; uma regra no RDF. Mas quando se trata de quest&#245;es mais pr&#225;ticas, h&#225; algumas escolhas quanto &#224; implementa&#231;&#227;o. Assim, o RDF diz-lhe o que tem de fazer, mas n&#227;o exatamente como o tem de fazer. Estas escolhas dividem-se em duas &#225;reas: como se escrevem as coisas (serializa&#231;&#227;o) e as rela&#231;&#245;es que as suas triplas sem&#226;nticas descrevem.</p>
<div n="2"><head>Serializa&#231;&#227;o</head>
<p>A <link target="https://pt.wikipedia.org/wiki/Serializa%C3%A7%C3%A3o">Serializa&#231;&#227;o</link> &#233; o termo t&#233;cnico para "como se escrevem as coisas". O chin&#234;s padr&#227;o (mandarim) pode ser escrito em caracteres tradicionais, caracteres simplificados ou romaniza&#231;&#227;o Pinyin e a l&#237;ngua em si n&#227;o muda. Tal como o mandarim, o RDF pode ser escrito de v&#225;rias formas. Aqui vamos olhar para duas (h&#225; outras, mas por uma quest&#227;o de simplicidade, vamos concentrar-nos nestas):</p>
<ol>
<li><link target="https://en.wikipedia.org/wiki/Turtle_(syntax)">Turtle</link> (em ingl&#234;s)</li>
<li><link target="https://pt.wikipedia.org/wiki/RDF/XML">RDF/XML</link></li>
</ol>
<p>Reconhecer a serializa&#231;&#227;o que est&#225; a ser utilizada significa que podemos ent&#227;o escolher ferramentas apropriadas concebidas para esse formato. Por exemplo, o RDF pode vir serializado no formato <link target="https://pt.wikipedia.org/wiki/XML">XML</link>. Podemos ent&#227;o utilizar uma ferramenta ou biblioteca de c&#243;digos concebida para analisar esse formato em particular, o que &#233; &#250;til se j&#225; souber como trabalhar com ele. O reconhecimento do formato tamb&#233;m lhe d&#225; as palavras-chave certas para procurar ajuda online. Muitos recursos permitem descarregar as suas bases de dados LOD, podendo escolher qual a serializa&#231;&#227;o que deseja fazer o <emph>Download</emph>.</p>
<div n="3"><head>Turtle</head>
<p>'Turtle' &#233; um jogo de palavras. 'Tur' &#233; a abreviatura de 'terse' e 'tle' - &#233; a abreviatura de '<emph>triple language</emph>' (linguagem de triplos). Turtle &#233; uma forma agradavelmente simples de escrever triplas sem&#226;nticas.</p>
<p>O Turtle usa apelidos ou atalhos, conhecidos como <link target="https://www.w3.org/TeamSubmission/turtle/#sec-tutorial">prefixos</link> (em ingl&#234;s), o que nos poupa ter de escrever URIs completos todas as vezes. Voltemos ao URI que criamos na sec&#231;&#227;o anterior:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_12" type="block" corresp="code_introducao-dados-abertos-conectados_12.txt"></code></pre>
<p>N&#227;o queremos escrever isto cada vez que nos referimos a esta pessoa (lembrar-se-&#225; de Jack Straw). Por isso, s&#243; temos de enunciar o nosso atalho:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_13" type="block" corresp="code_introducao-dados-abertos-conectados_13.txt"></code></pre>
<p>Ent&#227;o Jack &#233; <code type="inline">toby:15601</code>, que substitui o longo URI e &#233; mais f&#225;cil &#224; vista. Eu escolhi 'toby', mas poderia igualmente escolher qualquer sequ&#234;ncia de letras.</p>
<p>Vamos agora passar de Jack Straw para William Shakespeare e utilizar Turtle para descrever algumas coisas sobre as suas obras. Vamos ter de decidir sobre os ficheiros de autoridade a utilizar, um processo que, como mencionado acima, &#233; melhor ser selecionado ao olhar para outros conjuntos de LOD. Aqui usaremos como um dos nossos prefixos <link target="https://pt.wikipedia.org/wiki/Dublin_Core"><emph>Dublin Core</emph></link>, uma norma de <link target="https://pt.wikipedia.org/wiki/Metadados">metadados</link> de bibliotecas <link target="https://en.wikipedia.org/wiki/Library_of_Congress_Control_Number">(N&#250;mero de controle da Biblioteca do Congresso</link> (<emph>Library of Congress Control Number</emph>) como outro e, o &#250;ltimo (VIAF) dever&#225; ser-lhe familiar. Juntos, estes tr&#234;s ficheiros de autoridade fornecem identificadores &#250;nicos para todas as entidades que tenciono utilizar neste exemplo:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_14" type="block" corresp="code_introducao-dados-abertos-conectados_14.txt"></code></pre>
<p>Note o espa&#231;amento do ponto final ap&#243;s a &#250;ltima linha. Esta &#233; a forma de Turtle indicar o fim. Tecnicamente n&#227;o &#233; necess&#225;rio ter o espa&#231;o, mas facilita a leitura ap&#243;s uma longa sequ&#234;ncia de caracteres.</p>
<p>No exemplo acima, lccn:n82011242 representa Macbeth; dc:creator liga Macbeth ao seu autor; viaf:96994048 representa William Shakespeare.</p>
<p>O Turtle tamb&#233;m permite listar triplas sem&#226;nticas sem se preocupar em repetir cada URI quando acabou de o usar. Acrescentemos a data em que os estudiosos pensam que Macbeth foi escrito, utilizando o par atributo-valor Dublin Core: <code type="inline">dc:create 'YYYY'</code>:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_15" type="block" corresp="code_introducao-dados-abertos-conectados_15.txt"></code></pre>
<p>Lembra-se da estrutura da tripla sem&#226;ntica discutida na sec&#231;&#227;o 1? A&#237; demos este exemplo:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_16" type="block" corresp="code_introducao-dados-abertos-conectados_16.txt"></code></pre>
<p>O essencial &#233; que o predicado liga o sujeito e o objeto. Ele descreve a rela&#231;&#227;o entre eles. O sujeito vem primeiro na tripla sem&#226;ntica, mas isso &#233; uma quest&#227;o de escolha, como discutimos com o exemplo de pessoas que foram ensinadas a tocar piano por Liszt.</p>
<p>Pode-se usar um ponto e v&#237;rgula se o sujeito for o mesmo mas o predicado e o objeto forem diferentes, ou uma v&#237;rgula se o sujeito e o predicado forem o mesmo e apenas o objeto for diferente.</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_17" type="block" corresp="code_introducao-dados-abertos-conectados_17.txt"></code></pre>
<p>Aqui estamos a dizer que Shakespeare (96994048) e John Fletcher (12323361) foram ambos os criadores da obra <emph>The Two Noble Kinsmen</emph>.</p>
<p>Quando analisamos as ontologias anteriormente sugeri que visse a <link target="http://web.archive.org/web/20170718143925/http://musicontology.com/docs/getting-started.html"><emph>Music Ontology</emph></link> (em ingl&#234;s). D&#234; agora uma olhada novamente. Isto ainda &#233; complicado, mas ser&#225; que agora fazem mais sentido?</p>
<p>Uma das ontologias mais acess&#237;veis &#233; a '<emph>Friend of a Friend</emph>' (amigo de um amigo) ou <link target="https://en.wikipedia.org/wiki/FOAF_(ontology)">FOAF</link> (em ingl&#234;s). Esta &#233; concebida para descrever pessoas e, talvez por essa raz&#227;o, &#233; bastante intuitiva. Se, por exemplo, quiser escrever-me para me dizer que este curso &#233; a melhor coisa que j&#225; leu, aqui est&#225; o meu email expresso como triplas sem&#226;nticas em FOAF:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_18" type="block" corresp="code_introducao-dados-abertos-conectados_18.txt"></code></pre>
</div><div n="3"><head>RDF/XML</head>
<p>Em contraste com o Turtle, o RDF/XML pode parecer um pouco pesado. Para come&#231;ar, vamos apenas converter uma tripla sem&#226;ntica da Turtle acima, aquela que refere que Shakespeare foi o criador de <emph>The Two Noble Kinsmen</emph>:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_19" type="block" corresp="code_introducao-dados-abertos-conectados_19.txt"></code></pre>
<p>Em RDF/XML, com os prefixos declarados dentro do trecho de c&#243;digo de XML, fica:</p>
<pre><code class="language-xml" xml:id="code_introducao-dados-abertos-conectados_20" type="block" corresp="code_introducao-dados-abertos-conectados_20.txt"></code></pre>
<p>O formato RDF/XML tem a mesma informa&#231;&#227;o b&#225;sica que o formato Turtle, mas &#233; escrito de forma muito diferente, baseando-se nos princ&#237;pios das etiquetas XML encaixadas.</p>
<p>Passemos a um exemplo diferente para mostrar como o RDF/XML combina triplas sem&#226;nticas e, ao mesmo tempo, introduz o <link target="https://pt.wikipedia.org/wiki/Simple_Knowledge_Organization_System"><emph>Simple Knowledge Organization System</emph></link> (SKOS) (Sistema Simples de Organiza&#231;&#227;o do Conhecimento), que foi concebido para codificar tesauros ou taxonomias.</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_21" type="block" corresp="code_introducao-dados-abertos-conectados_21.txt"></code></pre>
<p>Aqui estamos a dizer que o conceito SKOS <code type="inline">21250</code>, <emph>markdown abdication</emph>, tem um r&#243;tulo preferido de "<emph>abdication</emph>". A forma como funciona &#233; que o elemento sujeito (incluindo a parte da '<emph>abdication</emph>', que &#233; um valor de atributo em termos de XML) tem o predicado e o objeto encaixados no seu interior. O elemento encaixado &#233; o predicado e <link target="https://pt.wikipedia.org/wiki/%C3%81rvore_(estrutura_de_dados)#Terminologia">o n&#243; folha</link> (em ingl&#234;s), &#233; o objeto. Este exemplo &#233; retirado de um projeto para publicar um <link target="https://www.history.ac.uk/research/digital-history"><emph>Tesauro de Hist&#243;ria Brit&#226;nica e Irlandesa</emph></link> (em ingl&#234;s).</p>
<p>Tal como com o Turtle, podemos acrescentar mais triplas sem&#226;nticas. Portanto, vamos declarar que o termo mais restrito na nossa hierarquia de sujeitos, um abaixo de <emph>Abdication</emph>, vai ser <emph>Abdication crisis (1936)</emph>.</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_22" type="block" corresp="code_introducao-dados-abertos-conectados_22.txt"></code></pre>
<p>Lembra-se de como os predicados e os objetos s&#227;o encaixados dentro do sujeito? Aqui j&#225; o fizemos duas vezes com o mesmo sujeito, para que possamos tornar isto menos prolixo, aninhando ambos os conjuntos de predicados como objetos dentro do mesmo sujeito:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_23" type="block" corresp="code_introducao-dados-abertos-conectados_23.txt"></code></pre>
<p>Se estiver familiarizado com XML isto ser&#225; f&#225;cil. Se n&#227;o estiver, talvez prefira um formato como o Turtle. Mas a vantagem aqui &#233; que ao criar o seu RDF/XML pode usar as ferramentas habituais dispon&#237;veis com XML, como editores e analisadores dedicados ao XML, para verificar se o seu RDF/XML est&#225; corretamente formatado. Se n&#227;o for uma pessoa que use o XML recomendo o Turtle, podendo usar uma <link target="http://www.easyrdf.org/converter">ferramenta online</link> (em ingl&#234;s) para verificar se a sua sintaxe est&#225; correta.</p>
</div></div></div><div n="1"><head>Consulta de RDF com SPARQL</head>
<p>Para esta sec&#231;&#227;o final iremos interrogar algum LOD e ver o que poder&#225; ser feito com ele.</p>
<p>A linguagem de consulta que usamos para LOD &#233; chamada <link target="https://pt.wikipedia.org/wiki/SPARQL">SPARQL</link>. &#201; um daqueles acr&#243;nimos recursivos amados pelos t&#233;cnicos: <emph><hi rend="bold">S</hi>PARQL <hi rend="bold">P</hi>rotocol <hi rend="bold">a</hi>nd <hi rend="bold">R</hi>DF <hi rend="bold">Q</hi>uery <hi rend="bold">L</hi>anguage</emph> (Protocolo SPARQL e Linguagem de Consulta).</p>
<p>Como mencionado no in&#237;cio, o <emph>Programming Historian</emph> tem <link target="/en/lessons/retired/graph-databases-and-SPARQL">uma li&#231;&#227;o completa</link> (em ingl&#234;s), de Matthew Lincoln, sobre a utiliza&#231;&#227;o do SPARQL (embora n&#227;o seja j&#225; mantida (ver nota no in&#237;cio desta tradu&#231;&#227;o). A sec&#231;&#227;o final aqui presente &#233; apenas uma vis&#227;o geral dos conceitos b&#225;sicos. Se o SPARQL despertar o seu interesse, pode obter uma fundamenta&#231;&#227;o completa no tutorial de Lincoln.</p>
<p>Vamos realizar as nossas consultas SPARQL na <link target="https://www.dbpedia.org/">DBpedia</link>, que &#233; um enorme conjunto de LOD derivado da Wikipedia. Al&#233;m de estar cheio de informa&#231;&#227;o que &#233; muito dif&#237;cil de encontrar atrav&#233;s da habitual interface da Wikip&#233;dia, tem v&#225;rios "pontos de extremidade" (end points) SPARQL - interfaces onde se podem digitar as consultas SPARQL e obter resultados a partir das triplas sem&#226;nticas da DBpedia.</p>
<p>O end point de consulta SPARQL que &#233; utilizado chama-se <link target="http://dbpedia.org/snorql/">snorql</link> (em ingl&#234;s). Estes end points ocasionalmente ficam offline. Se for o seu caso, tente procurar por <emph>dbpedia sparql</emph> e dever&#225; encontrar um substituto semelhante.</p>
<p>Se for ao URL snorql acima ver&#225;, no in&#237;cio, um n&#250;mero de prefixos que j&#225; nos foram declarados, o que &#233; &#250;til. Agora tamb&#233;m ir&#225; reconhecer alguns dos prefixos.</p>
<figure><desc>Caixa de consulta padr&#227;o do snorql, com alguns prefixos declarados para si</desc><graphic url="intro-to-linked-data-fig1.png" alt="Captura de tela com a interface de cria&#231;&#227;o de consultas snorql"/></figure>
<p>Na caixa de consulta abaixo das declara&#231;&#245;es de prefixo, dever&#225; ver o seguinte:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_24" type="block" corresp="code_introducao-dados-abertos-conectados_24.txt"></code></pre>
<p>Se alguma vez escreveu uma consulta de bases de dados em <emph>Structured Query Language</emph>, <link target="https://pt.wikipedia.org/wiki/SQL">mais conhecida como SQL</link>, isto vai parecer-lhe bastante familiar e vai ajud&#225;-lo a aprender SPARQL. Se n&#227;o, n&#227;o se preocupe. As palavras-chave aqui utilizadas, <code type="inline">SELECT</code> (SELECIONAR) e <code type="inline">WHERE</code> (ONDE) n&#227;o s&#227;o sens&#237;veis a mai&#250;sculas e min&#250;sculas, mas algumas partes de uma consulta SPARQL podem ser (ver abaixo), por isso recomendo que se cinja ao caso dado ao longo das consultas neste curso.</p>
<p>Aqui <code type="inline">SELECT</code> significa "encontrar alguma coisa" e <code type="inline">*</code> significa "d&#225;-me tudo". <code type="inline">WHERE</code> introduz uma condi&#231;&#227;o, que &#233; onde vamos colocar os detalhes de que tipo de coisas queremos que a consulta encontre.</p>
<p>Vamos come&#231;ar com algo simples para ver como &#233; que isto funciona. Cole (ou, melhor, escreva) isto na caixa de consulta:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_25" type="block" corresp="code_introducao-dados-abertos-conectados_25.txt"></code></pre>
<p>Clique em '<emph>go</emph>' (ir). Se deixar o menu <emph>drop-down</emph> como '<emph>browse</emph>' (navegar) dever&#225; obter duas colunas com os r&#243;tulos "b" e "c". (Note que aqui, ao procurar uma cadeia de caracteres, as mai&#250;sculas/min&#250;sculas importam: lyndal_roper n&#227;o lhe dar&#225; resultados).</p>
<figure><desc>Topo das listas de resultados de uma consulta com todas as triplas sem&#226;nticas com 'Lyndal_Roper' como sujeito</desc><graphic url="intro-to-linked-data-fig2.png" alt="Captura de tela com a interface de resultados de consultas snorql"/></figure>
<p>Ent&#227;o o que &#233; que acabou de acontecer? E como &#233; que soubemos o que escrever?</p>
<p>Na verdade, n&#227;o sab&#237;amos. Esse &#233; um dos problemas com end points do SPARQL. Quando se conhece um dataset, &#233; preciso experimentar coisas e descobrir que termos s&#227;o utilizados. Porque isto vem da <emph>Wikipedia</emph> e n&#243;s est&#225;vamos interessados sobre que informa&#231;&#227;o sobre historiadores pod&#237;amos encontrar. Ent&#227;o vamos &#224; p&#225;gina da <emph>Wikipedia</emph> da historiadora <link target="https://en.wikipedia.org/wiki/Lyndal_Roper">Lyndal Roper</link> (em ingl&#234;s).</p>
<p>A parte final do URL &#233; <code type="inline">Lyndal_Roper</code> e conclu&#237;mos ent&#227;o que &#233; prov&#225;vel que esta cadeia de caracteres seja a forma como Roper &#233; referida na DBpedia. Porque n&#227;o sabemos o que mais poderia estar em triplas sem&#226;nticas que mencionam Roper, n&#243;s utilizamos <code type="inline">?a</code> e <code type="inline">?b</code>: estes s&#227;o apenas marcadores de posi&#231;&#227;o. Poderia igualmente ter digitado <code type="inline">?whatever</code> e <code type="inline">?you_like</code> e as colunas teriam esses r&#243;tulos. Quando quiser ser mais preciso sobre o que se est&#225; a pesquisar, ser&#225; importante etiquetar as colunas de forma significativa.</p>
<p>Experimente agora a sua pr&#243;pria consulta SPARQL: escolha uma p&#225;gina <emph>Wikipedia</emph> e copie a parte final do URL, ap&#243;s a barra final, e coloque-a no lugar de Lyndal_Roper. Depois clique em 'go'.</p>
<p>A partir da informa&#231;&#227;o que se obt&#233;m destes resultados &#233; poss&#237;vel gerar <emph>queries</emph> mais precisas. Isto pode ser pouco fi&#225;vel, por isso n&#227;o se preocupe se algumas n&#227;o funcionarem.</p>
<p>Vamos voltar aos resultados para a consulta que fizemos h&#225; momentos:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_26" type="block" corresp="code_introducao-dados-abertos-conectados_26.txt"></code></pre>
<p>Podemos ver uma longa lista na coluna etiquetada <emph>c</emph>. Estes s&#227;o todos os atributos que Roper tem na <emph>DBpedia</emph> e que nos ajudar&#227;o a encontrar outras pessoas com estes atributos. Por exemplo, podemos ver <code type="inline">http://dbpedia.org/class/yago/Historian110177150</code>. Poderemos utilizar isto para obter uma lista de historiadores? Vamos coloc&#225;-lo na nossa pergunta, mas em terceiro lugar, porque era onde estava quando a encontrei nos resultados da Lyndal Roper. A minha consulta tem este aspecto:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_27" type="block" corresp="code_introducao-dados-abertos-conectados_27.txt"></code></pre>
<p>Fizemos uma pequena mudan&#231;a aqui. Se esta consulta funcionar de todo, ent&#227;o esperemos que os nossos historiadores estejam na primeira coluna, porque 'historiador' n&#227;o parece poder ser um predicado: n&#227;o funciona como um verbo numa frase; por isso vamos chamar &#224; nossa primeira coluna de resultados 'historian_name' e &#224; minha segunda (sobre a qual n&#227;o sabemos nada) 'predicate' (predicado).</p>
<p>Execute a <emph>querie</emph>. Dever&#225; encontrar uma grande lista de historiadores.</p>
<figure><desc>Historiadores de acordo com a DBpedia</desc><graphic url="intro-to-linked-data-fig3.png" alt="Duas capturas de tela com a interface de consultas snorql e respectivos resultados"/></figure>
<p>Assim, esta ferramenta funciona para criar listas, o que &#233; &#250;til, mas seria muito mais poderoso combinar listas para obter intersec&#231;&#245;es de conjuntos. Encontrei mais algumas coisas que podem ser interessantes consultar nos atributos DBpedia de Lyndal Roper: <link target="http://dbpedia.org/class/yago/WikicatBritishHistorians">http://dbpedia.org/class/yago/WikicatBritishHistorians</link> e <link target="http://dbpedia.org/class/yago/WikicatWomenHistorians">http://dbpedia.org/class/yago/WikicatWomenHistorians</link>. &#201; muito f&#225;cil combin&#225;-los pedindo uma vari&#225;vel a ser devolvida (no nosso caso isto &#233; <code type="inline">?name</code> (nome)) e depois utilizando-a em m&#250;ltiplas linhas de uma <emph>querie</emph>. Note tamb&#233;m o espa&#231;o e o ponto completo no final da primeira linha que come&#231;a com <code type="inline">?name</code>:</p>
<pre><code xml:id="code_introducao-dados-abertos-conectados_28" type="block" corresp="code_introducao-dados-abertos-conectados_28.txt"></code></pre>
<p>Funciona! Devemos obter cinco resultados. Na altura em que escrevo, h&#225; cinco historiadoras brit&#226;nicas na <emph>DBpedia</emph>...</p>
<figure><desc>Historiadoras brit&#226;nicas segundo a DBpedia</desc><graphic url="intro-to-linked-data-fig4.png" alt="Duas capturas de tela com a interface de consultas snorql e respectivos resultados"/></figure>
<p>Apenas cinco historiadoras brit&#226;nicas? Claro que h&#225;, na realidade, muitas mais do que isso, como poder&#237;amos facilmente mostr&#225;-lo substituindo o nome de, digamos, Alison Weir na nossa primeira consulta sobre Lyndal Roper. Isto leva-nos ao problema com a <emph>Dbpedia</emph> que mencionamos anteriormente: n&#227;o &#233; muito consistentemente marcado com informa&#231;&#227;o estrutural do tipo que a <emph>DBpedia</emph> que utiliza. A nossa consulta pode listar algumas historiadoras brit&#226;nicas mas acontece que n&#227;o podemos utiliz&#225;-la para gerar uma lista significativa de pessoas nesta categoria. Tudo o que encontr&#225;mos foram as pessoas nas entradas da <emph>Wikipedia</emph> que algu&#233;m decidiu classificar como "historiadora brit&#226;nica" e "historiadora".</p>
<p>Com SPARQL na <emph>DBpedia</emph>, &#233; preciso ter cuidado com as inconsist&#234;ncias do material de origem coletiva. Poder&#225; usar o SPARQL exatamente da mesma forma num dataset mais confi&#225;vel, por exemplo, os dados do governo brit&#226;nico: <link target="https://data-gov.tw.rpi.edu//sparql">https://data-gov.tw.rpi.edu//sparql</link> (em ingl&#234;s) e esperar obter resultados mais robustos (h&#225; aqui um breve tutorial para este dataset: <link target="https://data-gov.tw.rpi.edu/wiki/A_crash_course_in_SPARQL">https://data-gov.tw.rpi.edu/wiki/A_crash_course_in_SPARQL</link> (em ingl&#234;s).</p>
<p>No entanto, apesar das suas inconsist&#234;ncias, a <emph>DBpedia</emph> &#233; um &#243;timo local para aprender SPARQL. Esta foi apenas uma breve introdu&#231;&#227;o, mas h&#225; muito mais em <link target="/en/lessons/retired/graph-databases-and-SPARQL">Usando SPARQL para aceder ao Linked Open Data</link> (em ingl&#234;s).</p>
</div><div n="1"><head>Leituras e recursos adicionais</head>
<ul>
<li>Dean Allemang e James Hendler, <emph>Semantic Web for the Working Ontologist</emph>, 2nd edn, Elsevier, 2011</li>
<li>Tim Berners-Lee <link target="https://www.w3.org/DesignIssues/LinkedData.html"><emph>Linked Data</emph></link> (em ingl&#234;s)</li>
<li>Bob DuCharme, <emph>Learning SPARQL</emph>, O'Reilly, 2011</li>
<li><link target="http://www.snee.com/bobdc.blog/">Blog de Bob DuCharme</link> (em ingl&#234;s) tamb&#233;m vale a pena ler</li>
<li>Richard Gartner, <emph>Metadata: Shaping Knowledge from Antiquity to the Semantic Web</emph>, Springer, 2016</li>
<li>Seth van Hooland and Ruben Verborgh, <emph>Linked Data for Libraries, Archives and Museums</emph>, 2015</li>
<li>Ver tamb&#233;m <link target="http://freeyourmetadata.org/"><emph>companion website</emph></link> (em ingl&#234;s)</li>
<li>Matthew Lincoln <link target="/en/lessons/retired/graph-databases-and-SPARQL">'<emph>Using SPARQL to access Linked Open Data</emph>'</link> (em ingl&#234;s)</li>
<li><link target="http://linkeddata.org/guides-and-tutorials"><emph>Linked Data guides and tutorials</emph></link> (em ingl&#234;s)</li>
<li>Dominic Oldman, Martin Doerr e Stefan Gradmann, '<emph>Zen and the Art of Linked Data: New Strategies for a Semantic Web of Humanist Knowledge</emph>', em <emph>A New Companion to Digital Humanities</emph>, editado por Susan Schreibman et al.</li>
<li>Max Schmachtenberg, Christian Bizer e Heiko Paulheim, <link target="http://linkeddatacatalog.dws.informatik.uni-mannheim.de/state/"><emph>State of the LOD Cloud 2017</emph></link> (em ingl&#234;s)</li>
<li>David Wood, Marsha Zaidman e Luke Ruth, <emph>Linked Data: Structured data on the Web</emph>, Manning, 2014</li>
</ul>
</div><div n="1"><head>Agradecimentos</head>
<p>Gostaria de agradecer aos meus dois colegas revisores, Matthew Lincoln e Terhi Nurmikko-Fuller e ao meu editor, Adam Crymble, por me ajudarem generosamente a melhorar esta li&#231;&#227;o com numerosas sugest&#245;es, esclarecimentos e corre&#231;&#245;es. Este tutorial baseia-se num outro escrito como parte do '<emph>Thesaurus of British and Irish History as SKOS</emph>' <link target="https://gtr.ukri.org/projects?ref=AH%2FN003446%2F1#/tabOverview"><emph>(Tobias) project</emph></link> (em ingl&#234;s), financiado pelo <link target="http://www.ahrc.ac.uk/">AHRC</link> (em ingl&#234;s). A li&#231;&#227;o foi revista para o projeto <emph>Programming Historian</emph>.</p>
</div></body>
  </text>
</TEI>
