<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="installer-ide-python-linux">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Installer un environnement de d&#233;veloppement int&#233;gr&#233; pour Python (Linux)</title>
  <author role="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor role="reviewers"><persName>Jim Clifford</persName><persName>Amanda Morton</persName></editor><author role="translators">Thomas Soubiran</author><editor role="translation-reviewers">Alexandre Bartz</editor><editor role="editors">Miriam Posner</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phfr0019</idno><date type="published">07/17/2012</date><date type="translated">10/06/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#linux-installation"/>.</p><p>There are other translations: <ref target="#instalacion-linux #instalacao-linux"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Cette le&#231;on vous montrera comment installer un environnement de d&#233;veloppement pour Python sur un ordinateur ex&#233;cutant le syst&#232;me d'exploitation Linux.</p></abstract><textClass><keywords><term xml:lang="en">get-ready</term><term xml:lang="en">python</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="fr">
    <body><p>Tout d'abord, merci &#224; John Fink d'avoir fourni les bases de cette le&#231;on.
Elle a &#233;t&#233; pr&#233;par&#233;e avec une distribution Ubuntu 18.04 LTS mais son contenu est aussi valable pour n'importe quel syst&#232;me utilisant apt tel que Debian ou Linux Mint &#224; la seule condition d'avoir install&#233; sudo.</p>
<div type="2"><head>Sauvegarder son disque dur</head>
<p>Veillez &#224; faire des sauvegardes de votre disque dur r&#233;guli&#232;rement. Ce conseil est valable en g&#233;n&#233;ral et ne se limite pas &#224; vos activit&#233;s de programmation.</p>
</div><div type="2"><head>Installer Python 3</head>
<list type="ordered">
<item>Lancez un terminal (allez dans le menu Applications, puis tapez <code rend="inline">Terminal</code>, et cliquez sur l'icone)</item>
<item>Dans le terminal, tapez : <code rend="inline">sudo apt-get install python3</code></item>
<item>Entrez votre mot de passe, puis tapez <code rend="inline">Y</code> pour lancer l'installation (<emph>NdT : ou</emph> <code rend="inline">sudo  apt-get -y install python3</code> <emph>pour &#233;viter d'avoir &#224; taper <code rend="inline">Y</code> &#224; chaque fois</emph>).
Notez qu'il est fort probable que Python soit d&#233;j&#224; install&#233; (<emph>NdT: la commande</emph> <code rend="inline">dpkg -l python3</code> <emph>permet de savoir si Python 3 est d&#233;j&#224; install&#233;</emph>).</item>
</list>
</div><div type="2"><head>Cr&#233;er un r&#233;pertoire de travail</head>
<p>Conservez vos programmes Python dans ce r&#233;pertoire. Il peut se trouver n'importe o&#249; mais il vaut mieux que vous le placiez dans votre r&#233;pertoire personnel. Pour cr&#233;er le r&#233;pertoire, vous pouvez faire quelque chose comme cela:</p>
<ab><code xml:id="code_installer-ide-python-linux_0" corresp="code_installer-ide-python-linux_0.txt" rend="block"/></ab>
</div><div type="2"><head>Installer Komodo Edit</head>
<p>Komodo Edit est un &#233;diteur de texte libre et open source, mais il en existe <ref target="https://wiki.python.org/moin/PythonEditors/">de nombreux autres</ref>. Vous pouvez t&#233;l&#233;charger Komodo Edit depuis le site <ref target="https://www.activestate.com/products/komodo-edit/">Komodo Edit Website</ref>. Une fois t&#233;l&#233;charg&#233;, ouvrez-le avec le gestionnaire de paquets d'Ubuntu, et suivez les instructions d'installation. Apr&#232;s avoir install&#233; Komodo Edit,
ouvrez le r&#233;pertoire <code rend="inline">Komodo-Edit-11/bin</code> de votre r&#233;pertoire personnel, et cliquez sur <code rend="inline">komodo</code>.</p>
</div><div type="2"><head>Ex&#233;cuter une commande <code rend="inline">Run Python</code> dans Komodo Edit</head>
<list type="ordered">
<item>Dans Komodo Edit, assurez-vous que la barre <code rend="inline">Toolbox</code> est visible</item>
<item>Cliquez sur l'ic&#244;ne cr&#233;nel&#233;e et s&#233;lectionnez <code rend="inline">New Command</code></item>
<item>En haut, tapez <code rend="inline">Run Python File</code></item>
<item>Dans le champ <code rend="inline">Command</code>, tapez: <code rend="inline">%(python3) %F</code>. Puis appuyez sur OK en bas de la fen&#234;tre qui permet d'ajouter une commande.</item>
</list>
<p>{% include figure.html caption="Ajouter une nouvelle commande dans Komodo Edit" filename="komodo-edit-tools-linux.png" %}</p>
</div><div type="2"><head>&#171;&#8239;Hello World&#8239;&#187; en Python</head>
<p>Il est de coutume de commencer l'initiation &#224; un langage de programmation en &#233;crivant en programme qui affiche &#171;&#8239;hello world&#8239;&#187; et puis s'arr&#234;te.</p>
<p>Python est un langage de choix pour les personnes qui d&#233;butent la programmation car c'est un langage de tr&#232;s haut niveau. En d'autres termes, il permet faire beaucoup de choses avec des programmes de quelques lignes. Et, plus un programme sera concis, moins il prendra de place &#224; l'&#233;cran et plus il est facile &#224; suivre.</p>
<p>Python est un langage dit interpr&#233;t&#233;. Autrement dit, il existe un programme appel&#233; interpr&#233;teur qui sait comment suivre les instructions &#233;crites dans ce langage. Une fa&#231;on d'utiliser l'interpr&#233;teur consiste &#224; stocker toutes vos instructions dans un fichier et ex&#233;cuter l'interpr&#233;teur avec ce fichier en entr&#233;e. Un fichier qui contient des instructions s'appelle un programme. L'interpr&#233;teur va ex&#233;cuter chacune des instructions que vous lui soumettez.
Voyons maintenant ce que cela donne.  </p>
<p>Dans votre &#233;diteur de texte, cr&#233;er un nouveau fichier, puis copiez-collez les deux lignes suivantes et enregistrez-le dans votre r&#233;pertoire <code rend="inline">programming-historian</code> sous le nom <code rend="inline">hello-world.py</code>:</p>
<ab><code xml:id="code_installer-ide-python-linux_1" corresp="code_installer-ide-python-linux_1.txt" lang="language-python" rend="block"/></ab>
<p>La commande <code rend="inline">Run Python File</code> vous permet d'ex&#233;cuter votre programme. Si vous utilisez un autre &#233;diteur de texte, il proposera s&#251;rement une fonctionnalit&#233; similaire. Si tout c'est bien pass&#233;, le r&#233;sultat devrait ressembler &#224; cela:</p>
<p>{% include figure.html caption="hello world dans Komodo Edit sur Linux" filename="komodo-edit-output-linux.png" %}</p>
</div><div type="2"><head>Interagir avec un shell Python</head>
<p>Une autre fa&#231;on d'interagir avec un interpr&#233;teur est d'utiliser ce qu'on appelle un shell. Vous pouvez alors taper des commandes et appuyer sur entr&#233;e et le shell retournera le r&#233;sultat. Le shell est tr&#232;s pratique si vous souhaitez tester des portions de code pour vous assurer qu'elles font bien ce que vous voulez qu'elles fassent.</p>
<p>Vous pouvez ex&#233;cuter un shell Python en lan&#231;ant un terminal. Dans le terminal, tapez:</p>
<ab><code xml:id="code_installer-ide-python-linux_2" corresp="code_installer-ide-python-linux_2.txt" lang="language-python" rend="block"/></ab>
<p>Ceci aura pour effet de lancer l'invite de commande de Python qui vous permet de soumettre des commandes Python dans le shell. &#192; pr&#233;sent, tapez:</p>
<ab><code xml:id="code_installer-ide-python-linux_3" corresp="code_installer-ide-python-linux_3.txt" lang="language-python" rend="block"/></ab>
<p>et appuyez sur entr&#233;e. L'ordinateur r&#233;pondra par:</p>
<ab><code xml:id="code_installer-ide-python-linux_4" corresp="code_installer-ide-python-linux_4.txt" lang="language-python" rend="block"/></ab>
<p>Pour indiquer une interaction avec le shell, nous utiliserons <code rend="inline">-&gt;</code> pour marquer la r&#233;ponse du shell &#224; votre commande comme suit:</p>
<ab><code xml:id="code_installer-ide-python-linux_5" corresp="code_installer-ide-python-linux_5.txt" lang="language-python" rend="block"/></ab>
<p>&#192; l'&#233;cran, voici ce que vous devriez obtenir:</p>
<p>{% include figure.html caption="hello world dans un terminal Linux" filename="terminal-output-linux.png" %}</p>
<p>Maintenant que tout est pr&#234;t, vous pouvez passer &#224; des choses plus int&#233;ressantes. Si vous souhaitez suivre les le&#231;ons dans l'ordre, nous vous sugg&#233;rons &#171;&#8239;<ref target="/fr/lecons/comprendre-les-pages-web">Comprendre les pages web et le HTML</ref>&#8239;&#187; pour continuer.</p>
</div></body>
  </text>
</TEI>
