<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>An&#225;lise de sentimentos em R com 'syuzhet'</title>
  <layout>lesson</layout>
  <slug>analise-sentimento-R-syuzhet</slug>
  <date>2021-03-23</date>
  <translation_date>2022-03-02</translation_date>
  <authors>Jennifer Isasi</authors>
  <editors>Maria Jos&#233; Afanador-Llach</editors>
  <reviewers>Riva Quiroga</reviewers>
  <translator>Diana Rebelo Rodriguez</translator>
  <translation-editor>Jimmy Medeiros</translation-editor>
  <translation-reviewer>Ana Giulia Aldgeire,Ian Araujo</translation-reviewer>
  <original>analisis-de-sentimientos-r</original>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/467</review-ticket>
  <difficulty>2</difficulty>
  <activity>analyzing</activity>
  <topics>distant-reading,r,data-visualization</topics>
  <abstract>Esta li&#231;&#227;o ensina uma maneira de obter e analisar dados sobre emo&#231;&#245;es e sentimentos em uma narrativa.</abstract>
  <avatar_alt>Gravura com tr&#234;s rostos que expressam emo&#231;&#245;es distintas</avatar_alt>
  <doi>10.46430/phpt0022</doi>
</metadata>
  <text>
    <body>
      <div n="1"><head>Objetivos</head>
<p>Esta li&#231;&#227;o usa a metodologia de an&#225;lise de sentimentos e emo&#231;&#245;es atrav&#233;s da linguagem de programa&#231;&#227;o R para investigar documentos textuais de modo individual. Embora a li&#231;&#227;o n&#227;o seja destinada a usu&#225;rios avan&#231;ados de R, &#233; necess&#225;rio que se tenha algum conhecimento dessa linguagem; assumimos que se tenha o R instalado e saiba como importar pacotes. Tamb&#233;m recomendamos o download do RStudio. Se n&#227;o estiver familiarizado com R, &#233; melhor trabalhar primeiro atrav&#233;s das li&#231;&#245;es <link target="/pt/licoes/processamento-basico-texto-r">Processamento b&#225;sico de texto em R</link>, <link target="/pt/licoes/nocoes-basicas-R-dados-tabulares">No&#231;&#245;es b&#225;sicas de R com dados tabulares</link> ou <link target="/en/lessons/data_wrangling_and_management_in_R">Data Wrangling and Management in R</link> (em ingl&#234;s). Ao final desta li&#231;&#227;o, o(a) pesquisador(a) ser&#225; capaz de:</p>
<ul>
<li>Colocar perguntas de pesquisa com base na an&#225;lise quantitativa de sentimentos em textos de tipo ensa&#237;stico e/ou narrativo.</li>
<li>Usar a linguagem de programa&#231;&#227;o R, o ambiente RStudio e o pacote <code type="inline">syuzhet</code> com o dicion&#225;rio NRC para gerar o indicador de sentimento de um texto em diferentes linguagens. </li>
<li>Analisar criticamente os resultados do processamento de texto.</li>
<li>Visualizar os dados gerais e sua evolu&#231;&#227;o ao longo de um texto.</li>
</ul>
<p>Esta li&#231;&#227;o foi constru&#237;da com a vers&#227;o R 4.0.2, mas acreditamos que funcionar&#225; corretamente em vers&#245;es futuras do programa.</p>
<blockquote>
<p>O uso do R &#233; geralmente o mesmo para Windows, Mac e Linux. Entretanto, como vamos trabalhar com textos em portugu&#234;s, precisaremos escrever algum c&#243;digo extra para indicar o formato UTF-8 em m&#225;quinas Windows. Nesses casos, o c&#243;digo para o sistema operacional correspondente &#233; exibido.</p>
</blockquote>
</div>
      <div n="1"><head>Antes de come&#231;ar</head>
<div n="2"><head>An&#225;lise de sentimentos</head>
<p>A <link target="https://myrabr.com/blog/analise-de-sentimento/">an&#225;lise dos sentimentos ou a minera&#231;&#227;o de opini&#227;o</link> &#233; utilizada para extrair automaticamente informa&#231;&#245;es sobre a conota&#231;&#227;o negativa ou positiva da linguagem de um documento. Embora seja uma tarefa que vem sendo utilizada h&#225; muito tempo no campo do marketing ou da pol&#237;tica, em estudos liter&#225;rios ainda &#233; uma abordagem recente e n&#227;o h&#225; um m&#233;todo &#250;nico. Al&#233;m disso, h&#225; a possibilidade de extrair a polaridade dos sentimentos e tamb&#233;m das emo&#231;&#245;es.</p>
<p>&#201; importante especificar o que estamos procurando com os termos &#8220;sentimento&#8221; e &#8220;emo&#231;&#245;es&#8221;, pois eles s&#227;o frequentemente usados de forma intercambi&#225;vel, de modo geral, mas s&#227;o diferentes. Para Antonio R. Damasio, as emo&#231;&#245;es s&#227;o rea&#231;&#245;es corporais instigantes de nosso corpo, determinadas por est&#237;mulos ambientais e derivadas do desenvolvimento da regulamenta&#231;&#227;o biol&#243;gica (12). Elas podem ser divididas em prim&#225;rias e secund&#225;rias. Embora n&#227;o haja um acordo final sobre o n&#250;mero de emo&#231;&#245;es b&#225;sicas, geralmente s&#227;o seis: raiva, alegria, repugn&#226;ncia, medo, tristeza e surpresa, embora Damasio considere esta &#250;ltima como sendo secund&#225;ria. Al&#233;m disso, no caso do sistema autom&#225;tico que utilizaremos, as emo&#231;&#245;es secund&#225;rias de antecipa&#231;&#227;o e confian&#231;a tamb&#233;m aparecem.</p>
<p>Por outro lado, podemos definir sentimento como a a&#231;&#227;o e o efeito de sentir uma emo&#231;&#227;o ou, em outras palavras, &#233; o resultado do fato de que &#8220;quando um objeto, uma pessoa, uma situa&#231;&#227;o ou um pensamento provoca em n&#243;s a emo&#231;&#227;o da alegria, come&#231;a um processo que pode concluir no sentimento de estar alegre ou feliz&#8221; (Pereira Zazo 32) porque &#233; uma emo&#231;&#227;o positiva. Durante a li&#231;&#227;o faremos uma distin&#231;&#227;o entre os dois termos, pois usaremos o resultado do sentimento para ver a sua evolu&#231;&#227;o ao longo do texto e as emo&#231;&#245;es para ver o uso das palavras em geral.</p>
</div><div n="2"><head>Dicion&#225;rio de l&#233;xicos NRC</head>
<p>O pacote <code type="inline">syuzhet</code> funciona com quatro dicion&#225;rios de sentimentos: Bing, Afinn, Stanford e NRC. Nesta li&#231;&#227;o, trabalharemos com este &#250;ltimo, pois &#233; o &#250;nico dispon&#237;vel em v&#225;rios idiomas, incluindo o portugu&#234;s. Este vocabul&#225;rio com valores de sentimentos negativos ou positivos e oito emo&#231;&#245;es foi desenvolvido por Saif M. Mohammad, um cientista do Conselho Nacional de Pesquisa do Canad&#225; (NRC). O conjunto de dados foi constru&#237;do manualmente atrav&#233;s de pesquisas usando a t&#233;cnica Maximum Difference Scaling ou MaxDiff, que avalia a prefer&#234;ncia por uma s&#233;rie de alternativas (Mohammad e Turney). Assim, o l&#233;xico tem 14.182 palavras com as categorias de sentimentos positivos e negativos e as emo&#231;&#245;es de raiva, antecipa&#231;&#227;o, repugn&#226;ncia, medo, alegria, tristeza, surpresa e confian&#231;a. Al&#233;m disso, est&#225; dispon&#237;vel em mais de 100 idiomas (atrav&#233;s de tradu&#231;&#227;o autom&#225;tica).</p>
<p>Seus termos de uso estabelecem que o vocabul&#225;rio pode ser usado gratuitamente para fins de pesquisa, portanto, todos os dados est&#227;o dispon&#237;veis para download.</p>
<p>Se trabalhamos com o ingl&#234;s, podemos interagir com as diferentes categorias no site do <link target="http://saifmohammad.com/WebPages/NRC-Emotion-Lexicon.htm">NRC Word-Emotion Association Lexicon</link>. L&#225; tamb&#233;m podemos encontrar trabalhos publicados sobre a obten&#231;&#227;o dos valores para o vocabul&#225;rio, sua organiza&#231;&#227;o, extens&#227;o, etc.</p>
</div><div n="2"><head>Pacote <code type="inline">syuzhet</code></head>
<p>O <link target="https://cran.r-project.org/web/packages/syuzhet/vignettes/syuzhet-vignette.html">pacote <code type="inline">syuzhet</code></link> foi desenvolvido em 2015 por Matthew Jockers; que o mant&#233;m funcionando at&#233; hoje e continuamente apresenta novas vers&#245;es (no momento da prepara&#231;&#227;o desta li&#231;&#227;o, foi usada a vers&#227;o de dezembro de 2017). Uma s&#233;rie de posts no blog acompanham o desenvolvimento do pacote, e est&#227;o dispon&#237;veis no blog do professor desde <link target="http://www.matthewjockers.net/page/2/">5 de junho de 2014</link> (em ingl&#234;s).</p>
<p>Naturalmente, o pacote foi desenvolvido com testes em textos escritos ou traduzidos para o ingl&#234;s e n&#227;o sem debate sobre sua utilidade, para atribuir valores a textos liter&#225;rios que muitas vezes s&#227;o, por natureza, bastante subjetivos.  </p>
<blockquote>
<p>Aten&#231;&#227;o: A lista de palavras do dicion&#225;rio est&#225; sendo preparada em ingl&#234;s como l&#237;ngua principal e os dados quantitativos atribu&#237;dos a cada palavra s&#227;o o resultado da avalia&#231;&#227;o humana pelos participantes americanos. Portanto, v&#225;rios fatores devem ser levados em considera&#231;&#227;o ao utilizar esta metodologia:</p>
<ul>
<li>O l&#233;xico em portugu&#234;s &#233; uma tradu&#231;&#227;o direta realizada por tradu&#231;&#227;o autom&#225;tica (estes sistemas j&#225; s&#227;o muito confi&#225;veis entre o ingl&#234;s e o portugu&#234;s, mas n&#227;o em outros idiomas que o NRC afirma ser capaz de analisar como, por exemplo, o basco).</li>
<li>A pontua&#231;&#227;o de cada palavra, ou seja, a val&#234;ncia sentimental e emocional, tem um vi&#233;s cultural e temporal que deve ser levado em conta, e um termo que pareceu positivo para os participantes da pesquisa pode nos parecer negativo.  </li>
<li>O uso desta metodologia n&#227;o &#233; recomendado para textos que s&#227;o altamente metaf&#243;ricos e simb&#243;licos.</li>
<li>O m&#233;todo n&#227;o vai captar a nega&#231;&#227;o de um sentimento positivo como, por exemplo, a frase &#8220;Eu n&#227;o estou feliz&#8221;.</li>
</ul>
<p>Seguindo o esp&#237;rito de adaptabilidade das li&#231;&#245;es do <emph>Programming Historian</emph> a outras l&#237;nguas, foi decidido usar <code type="inline">syuzhet</code> em sua forma original, mas ao final da li&#231;&#227;o indicamos algumas fun&#231;&#245;es avan&#231;adas para usar seu pr&#243;prio dicion&#225;rio de sentimentos com o mesmo pacote.</p>
</blockquote>
<p>Como os resultados nos <emph>dataframes</emph> aparecer&#227;o em ingl&#234;s, se achar necess&#225;rio, dedique um momento para aprender esta tradu&#231;&#227;o:</p>
<table>
<thead>
<tr>
<th>anger</th>
<th>anticipation</th>
<th>disgust</th>
<th>fear</th>
<th>joy</th>
<th>sadness</th>
<th>surprise</th>
<th>trust</th>
<th>negative</th>
<th>positive</th>
</tr>
</thead>
<tbody>
<tr>
<td>raiva</td>
<td>anticipa&#231;&#227;o</td>
<td>desgosto</td>
<td>medo</td>
<td>alegria</td>
<td>tristeza</td>
<td>surpresa</td>
<td>confian&#231;a</td>
<td>negativo</td>
<td>positivo</td>
</tr>
</tbody></table></div><div n="2"><head>Um pequeno exemplo</head>
<p>Antes de come&#231;ar a realizar a an&#225;lise de nossos textos, &#233; &#250;til saber de forma geral qual &#233; o processo de an&#225;lise realizado pela fun&#231;&#227;o de obter sentimentos de <code type="inline">syuzhet</code>, com o dicion&#225;rio NRC e os resultados obtidos sobre os quais trabalharemos.</p>
<p>O sistema ir&#225; processar nosso texto e transform&#225;-lo em um vetor de caracteres (aqui palavras), para analis&#225;-los individualmente (tamb&#233;m &#233; poss&#237;vel faz&#234;-lo por senten&#231;as). Sem entrar ainda no c&#243;digo para realizar a an&#225;lise, d&#234; uma olhada neste breve exemplo (nota de tradu&#231;&#227;o: para a vers&#227;o em portugu&#234;s foi usado o texto <emph>Dom Casmurro</emph> de Machado de Assis, mantendo o tipo de exerc&#237;cios e o c&#243;digo da li&#231;&#227;o original):</p>
<blockquote>
<p>&#8220;Contando aquela crise do meu amor adolescente, sinto uma coisa que n&#227;o sei se explico bem, e &#233; que as dores daquela quadra, a tal ponto se espiritualizaram com o tempo, que chegam a diluir-se no prazer. N&#227;o &#233; claro isto, mas nem tudo &#233; claro na vida ou nos livros. A verdade &#233; que sinto um gosto particular em referir tal aborrecimento, quando &#233; certo que ele me lembra outros que n&#227;o quisera lembrar por nada.&#8221;</p>
<p><emph>Dom Casmurro</emph> de Machado de Assis.</p>
</blockquote>
<p>Este fragmento &#233; transformado em um vetor de caracteres:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_0" type="block" corresp="code_analise-sentimento-R-syuzhet_0.txt"></code></pre>
<p>Com a fun&#231;&#227;o de obter sentimentos, obt&#233;m-se a val&#234;ncia positiva e negativa de cada palavra, assim como a val&#234;ncia das oito emo&#231;&#245;es classificadas pelo NRC. O resultado para este fragmento &#233; o seguinte:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_1" type="block" corresp="code_analise-sentimento-R-syuzhet_1.txt"></code></pre>
<blockquote>
<p>Nota de tradu&#231;&#227;o: na li&#231;&#227;o original, os autores n&#227;o explicaram o passo a passo para se obter esses resultados em um primeiro momento. Apesar de a li&#231;&#227;o explicar detalhadamente o processo, julguei ser interessante demonstrar aqui como obtive esses outputs:</p>
</blockquote>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_2" type="block" corresp="code_analise-sentimento-R-syuzhet_2.txt"></code></pre>
<p>Como podemos ver nos resultados deste objeto tipo <emph>data frame</emph> ou tabela, cada palavra ou ficha tem um valor padr&#227;o de 0 nas dez colunas. Se houver um valor maior que 0 significa, em primeiro lugar, que este termo existe no dicion&#225;rio NRC e, em segundo lugar, que tem um valor atribu&#237;do para alguma emo&#231;&#227;o e/ou sentimento. Neste exemplo, podemos ver que a palavra &#8220;amor&#8221; &#233; entendida de forma positiva, ainda que represente tristeza (<emph>sadness</emph>). Por outro lado, a palavra &#8220;crise&#8221; possui uma conota&#231;&#227;o negativa muito forte, pois h&#225; menos margem para d&#250;vidas.</p>
<p>As possibilidades de explorar, analisar e visualizar estes resultados dependem, em grande parte, das suas habilidades de programa&#231;&#227;o mas, acima de tudo, da sua quest&#227;o de pesquisa. Para ajudar o pesquisador, nesta li&#231;&#227;o introdut&#243;ria aprenderemos como analisar os dados utilizando v&#225;rias formas de visualiza&#231;&#227;o.   </p>
</div><div n="2"><head>Pergunta de pesquisa</head>
<p>Para essa li&#231;&#227;o, vamos utilizar o romance Dom Casmurro, escrito por <link target="https://pt.wikipedia.org/wiki/Machado_de_Assis">Machado de Assis</link>, publicado em 1899, de car&#225;ter realista e ambientado no Rio de Janeiro na segunda metade do s&#233;culo XIX. O protagonista e narrador &#233; Bento Santiago (tamb&#233;m conhecido como Bentinho ou Dom Casmurro), que apresenta relatos desde a sua juventude at&#233; &#224; sua vida adulta, quando escreve. Nesse intervalo de tempo passa por experi&#234;ncias como viver em um semin&#225;rio e se preparar para ser Padre, mas tamb&#233;m desistir dessa vida ao se apaixonar por Capitu. O enredo central da trama &#233; o ci&#250;me envolvido nessa rela&#231;&#227;o.</p>
<p>&#201; poss&#237;vel observar a queda emocional desta trama ao se extrair automaticamente os valores de sentimento do romance? Ou, em outras palavras, nossa recep&#231;&#227;o dos ci&#250;mes de Bentinho coincide com os resultados desse c&#225;lculo autom&#225;tico? Al&#233;m disso, quais s&#227;o as palavras mais usadas na descri&#231;&#227;o das emo&#231;&#245;es do texto?</p>
</div></div>
      <div n="1"><head>Obter valores de sentimentos e emo&#231;&#245;es</head>
<div n="2"><head>Instalar e carregar pacotes</head>
<p>A primeira coisa que precisamos fazer para poder obter o sentimento de nosso texto, &#233; instalar e carregar o pacote R correspondente, neste caso, o <code type="inline">syuzhet</code>. Al&#233;m disso, para facilitar a visualiza&#231;&#227;o dos dados, vamos utilizar os pacotes <code type="inline">RColorBrewer</code>, <code type="inline">wordcloud</code>, <code type="inline">tm</code> e <code type="inline">NLP</code>. Para fazer isto, digite e execute os dois comandos seguintes em seu console; o primeiro para instalar o pacote e o segundo para carreg&#225;-lo (se j&#225; os tiver instalado, s&#243; precisa carreg&#225;-los). Note que a instala&#231;&#227;o destes pacotes pode levar alguns minutos.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_3" type="block" corresp="code_analise-sentimento-R-syuzhet_3.txt"></code></pre>
</div><div n="2"><head>Carregar e preparar o texto</head>
<p>Fa&#231;a o download do texto do romance <link target="/assets/domCasmurro.txt">Dom Casmurro</link>. Como podemos ver, o documento est&#225; em formato de texto simples, pois isto &#233; essencial para realizar seu processamento e an&#225;lise em R.</p>
<p>Com o texto em m&#227;os, a primeira coisa que vamos fazer &#233; carreg&#225;-lo como um objeto de <emph>string</emph>. Certifique-se de mudar o caminho para o texto para corresponder ao seu computador.  </p>
<p><hi rend="bold">Em Mac e Linux</hi></p>
<p>Em sistemas Mac podemos usar a fun&#231;&#227;o <code type="inline">get_text_as_string</code> integrada no pacote <code type="inline">syuzhet</code>:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_4" type="block" corresp="code_analise-sentimento-R-syuzhet_4.txt"></code></pre>
<p><hi rend="bold">Em Windows</hi></p>
<p>Os sistemas Windows n&#227;o l&#234;em diretamente caracteres com acentos ou outras marca&#231;&#245;es t&#237;picas do espanhol, portugu&#234;s ou franc&#234;s, ent&#227;o temos que dizer ao sistema que o nosso texto est&#225; no formato UTF-8 usando a fun&#231;&#227;o <code type="inline">scan</code>.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_5" type="block" corresp="code_analise-sentimento-R-syuzhet_5.txt"></code></pre>
<p>Como a an&#225;lise que vamos realizar precisa de uma lista, seja de palavras ou de frases (aqui s&#243; prestaremos aten&#231;&#227;o a palavras individuais), precisamos de um passo intermedi&#225;rio entre o carregamento do texto e a extra&#231;&#227;o dos valores de sentimento. Assim, vamos dividir o texto (<emph>string</emph>) em uma lista de palavras (<emph>tokens</emph>). Isto &#233; muito comum na an&#225;lise distante de textos.</p>
<p>Para isso, usamos a fun&#231;&#227;o <code type="inline">get_tokens()</code> do pacote e geramos um novo objeto, neste caso um vetor de <emph>tokens</emph> (palavras). Conforme veremos, com esta fun&#231;&#227;o nos livramos da pontua&#231;&#227;o no texto e temos uma lista de palavras.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_6" type="block" corresp="code_analise-sentimento-R-syuzhet_6.txt"></code></pre>
<p>Agora podemos ver quantas palavras ou tokens est&#227;o neste texto com a fun&#231;&#227;o <code type="inline">length()</code>:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_7" type="block" corresp="code_analise-sentimento-R-syuzhet_7.txt"></code></pre>
<p>Se quiser realizar a an&#225;lise para ora&#231;&#245;es, utilize a fun&#231;&#227;o <code type="inline">get_sentences()</code> e siga o mesmo processo, com exce&#231;&#227;o da cria&#231;&#227;o da nuvem de palavras:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_8" type="block" corresp="code_analise-sentimento-R-syuzhet_8.txt"></code></pre>
</div><div n="2"><head>Extra&#231;&#227;o de dados com o NRC Sentiment Lexicon</head>
<p>Agora podemos executar a fun&#231;&#227;o <code type="inline">get_nrc_sentiment</code> para obter os sentimentos no romance <emph>Dom Casmurro</emph>. Como a fun&#231;&#227;o executa por padr&#227;o o vocabul&#225;rio ingl&#234;s, n&#243;s a escrevemos com o argumento &#8220;lang&#8221; (de <emph>language</emph>, ou idioma) para usar o vocabul&#225;rio portugu&#234;s (&#8220;portuguese&#8221;). Por sua vez, criamos um novo objeto para armazenar os dados extra&#237;dos. Este ser&#225; um objeto do tipo <emph>data frame</emph>. Esta fun&#231;&#227;o procura a presen&#231;a das oito emo&#231;&#245;es e dos dois sentimentos para cada palavra em nosso vetor, e atribui um n&#250;mero maior que 0 se elas existirem. Dependendo do desempenho de seu computador e de acordo com as caracter&#237;sticas de nosso texto, este processo pode levar de 15 a 30 minutos.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_9" type="block" corresp="code_analise-sentimento-R-syuzhet_9.txt"></code></pre>
<p>Quando o c&#243;digo terminar de ser executado, um aviso aparecer&#225; porque o <code type="inline">syuzhet</code> usa uma fun&#231;&#227;o que &#233; descontinuada dentro de sua fun&#231;&#227;o <code type="inline">get_nrc_sentiment</code>:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_10" type="block" corresp="code_analise-sentimento-R-syuzhet_10.txt"></code></pre>
<p>Quando o processo terminar, se desejarmos, podemos ler os resultados no novo objeto, simplesmente selecionando o objeto e executando-o. Mas para evitar &#8220;imprimir&#8221; milhares de linhas no console, tamb&#233;m podemos usar a fun&#231;&#227;o <code type="inline">head()</code> para ver os primeiros seis <emph>tokens</emph>. No caso do texto que estamos usando, quando executarmos essa fun&#231;&#227;o, devemos ver o seguinte, que n&#227;o &#233; nada interessante:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_11" type="block" corresp="code_analise-sentimento-R-syuzhet_11.txt"></code></pre>
</div><div n="2"><head>Resumo do texto</head>
<p>O que &#233; interessante &#233; ver um resumo de cada um dos valores que obtivemos utilizando a fun&#231;&#227;o geral <code type="inline">summary()</code>. Isto pode ser muito &#250;til ao comparar v&#225;rios textos, pois permite ver diferentes medidas, tais como a m&#233;dia dos resultados para cada uma das emo&#231;&#245;es e os dois sentimentos. Por exemplo, podemos ver que o romance <emph>Dom Casmurro</emph> &#233;, em <link target="https://pt.wikipedia.org/wiki/M%C3%A9dia">m&#233;dia</link> (<emph>mean</emph>), um pouco mais positivo (0,03892) do que negativo (0,03559). Mas se olharmos para as emo&#231;&#245;es, parece que a tristeza (0,02116) aparece em mais momentos do que a alegria (0,01593). V&#225;rios dos valores fornecidos pela fun&#231;&#227;o de resumo do texto aparecem com um valor igual a 0, incluindo a <link target="https://pt.wikipedia.org/wiki/Mediana_(estat%C3%ADstica)">mediana</link> (<emph>median</emph>). Isto indica que poucas palavras do romance aparecem no dicion&#225;rio que estamos usando (NRC) ou, inversamente, que poucas t&#234;m uma atribui&#231;&#227;o de sentimento ou emo&#231;&#227;o no dicion&#225;rio.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_12" type="block" corresp="code_analise-sentimento-R-syuzhet_12.txt"></code></pre>
<blockquote>
<p>Parab&#233;ns! J&#225; temos os resultados da an&#225;lise de sentimentos! E, agora, o que podemos fazer com esses n&#250;meros?</p>
</blockquote>
</div></div>
      <div n="1"><head>An&#225;lise das emo&#231;&#245;es em um texto</head>
<div n="2"><head>Gr&#225;fico de barras</head>
<p>Para ver quais as emo&#231;&#245;es que est&#227;o mais presentes no texto, a maneira mais simples &#233; criar um <emph>barplot</emph>. Para isso, usamos a fun&#231;&#227;o <code type="inline">barplot()</code> com o resumo das colunas 1 a 8, ou seja, as colunas de raiva (<emph>anger</emph>), antecipa&#231;&#227;o (<emph>antecipation</emph>), desgosto (<emph>disgust</emph>), medo (<emph>fear</emph>), alegria (<emph>joy</emph>), tristeza (<emph>sadness</emph>), surpresa (<emph>surprise</emph>) e confian&#231;a (<emph>trust</emph>). Os resultados obtidos v&#234;m do processamento da fun&#231;&#227;o <code type="inline">prop.table()</code> dos resultados das oito colunas com cada uma das palavras da tabela.</p>
<blockquote>
<p>Para cada barra, todos os valores da coluna de emo&#231;&#245;es correspondentes s&#227;o somados. Ent&#227;o, o resultado de todas as emo&#231;&#245;es que adicionamos na sa&#237;da do gr&#225;fico &#233; somado. No final, a soma de cada emo&#231;&#227;o &#233; dividida pelo total de todas as colunas ou emo&#231;&#245;es. Isto n&#227;o acrescenta as colunas negativas e positivas. <ref type="footnotemark" target="#1"/></p>
</blockquote>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_13" type="block" corresp="code_analise-sentimento-R-syuzhet_13.txt"></code></pre>
<p>O resto dos par&#226;metros que vemos no c&#243;digo s&#227;o &#8220;extras&#8221;, pois s&#227;o uma forma de configurar o formato visual do gr&#225;fico. Assim, indicamos um espa&#231;o (<emph>space</emph>) de 0,2 entre as barras, que estar&#225; na posi&#231;&#227;o vertical ao indicar falsamente (<emph>FALSE</emph>) sua horizontalidade (<emph>horiz</emph>) e, ao contr&#225;rio, a horizontalidade para os valores no eixo Y com <code type="inline">las = 1</code>. Al&#233;m disso, reduzimos o tamanho do nome de cada barra (<emph>cex.names</emph>) para 0,7 para evitar que elas desapare&#231;am, por exemplo, se fizermos um pequeno gr&#225;fico. Gra&#231;as ao pacote que instalamos no in&#237;cio, <code type="inline">RColorBrewer</code>, podemos dar cor &#224;s colunas automaticamente, neste caso, com a paleta de cores (<emph>brewer.pal</emph>) do conjunto n&#250;mero 3 do pacote, com oito cores, uma para cada coluna. Finalmente, vamos colocar um t&#237;tulo e subt&#237;tulo em nosso gr&#225;fico com os par&#226;metros <code type="inline">main</code> e <code type="inline">sub</code>, assim como a palavra &#8220;emo&#231;&#245;es&#8221; no eixo X e nada no eixo Y.</p>
<img src="/images/analisis-de-sentimientos-r/analise-sentimento-R-syuzhet-01.png" alt="Gr&#225;fico de barras com os valores das seis emo&#231;&#245;es capturadas em Dom Casmurro por Machado de Assis"/>
<p>Se esses par&#226;metros n&#227;o forem do seu interesse, basta executar o seguinte c&#243;digo para obter o gr&#225;fico padr&#227;o:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_14" type="block" corresp="code_analise-sentimento-R-syuzhet_14.txt"></code></pre>
<blockquote>
<p>Certifique-se de que h&#225; espa&#231;o suficiente na se&#231;&#227;o de exibi&#231;&#227;o de gr&#225;ficos do R para poder ver os nomes de cada coluna.</p>
</blockquote>
<p>Estas informa&#231;&#245;es j&#225; indicam que as emo&#231;&#245;es de tristeza e confian&#231;a prevalecem mais do que as de desgosto ou surpresa. Mas quais s&#227;o as palavras usadas por Machado na express&#227;o dessa tristeza? Com que frequ&#234;ncia cada uma aparece no romance como um todo?</p>
</div><div n="2"><head>Contando o n&#250;mero de palavras com cada emo&#231;&#227;o</head>
<p>A fim de realizar uma an&#225;lise do texto, &#233; muito interessante saber quais s&#227;o as palavras usadas com mais frequ&#234;ncia no texto em rela&#231;&#227;o &#224; sua identifica&#231;&#227;o com cada emo&#231;&#227;o. Para isso, primeiro temos que criar um objeto de caracteres com todas as palavras que tenham um valor maior que 0 na coluna &#8220;tristeza&#8221; (<emph>sadness</emph>). Para selecionar somente essa coluna, usamos o sinal de d&#243;lar ap&#243;s o nome do <emph>data frame</emph>:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_15" type="block" corresp="code_analise-sentimento-R-syuzhet_15.txt"></code></pre>
<p>O conte&#250;do de <code type="inline">palavras_tristeza</code> nos indica que esta lista n&#227;o diz muito, pois retorna apenas a listagem de palavras sem maiores informa&#231;&#245;es. Para obter a contagem das vezes que cada palavra relacionada &#224; tristeza aparece no romance, geramos uma tabela do primeiro conjunto de caracteres com as fun&#231;&#245;es <code type="inline">unlist</code>  e <code type="inline">table</code>, que depois ordenamos em ordem decrescente (se quisermos uma ordem ascendente mudamos TRUE para FALSE); criamos um novo objeto de tipo tabela e imprimimos as primeiras 12 palavras da lista com sua frequ&#234;ncia:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_16" type="block" corresp="code_analise-sentimento-R-syuzhet_16.txt"></code></pre>
<p>Se quisermos saber quantas palavras &#250;nicas foram relacionadas &#224; tristeza, basta usar a fun&#231;&#227;o <code type="inline">length</code> no objeto que agora agrupa as palavras em ordem:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_17" type="block" corresp="code_analise-sentimento-R-syuzhet_17.txt"></code></pre>
<p>Podemos repetir a mesma opera&#231;&#227;o com o resto das emo&#231;&#245;es ou com aquela que nos interessa, assim como com os sentimentos positivos e negativos. Tente obter os resultados para a emo&#231;&#227;o &#8220;alegria&#8221; e compare os resultados <ref type="footnotemark" target="#2"/>.</p>
<p>Dependendo do tipo de an&#225;lise que se deseje fazer, tal resultado &#233; eficiente. Agora, para o prop&#243;sito introdut&#243;rio da li&#231;&#227;o, vamos gerar uma nuvem de palavras que ajuda a visualizar facilmente os termos associados a cada emo&#231;&#227;o (embora iremos visualizar aqui apenas quatro para facilitar a leitura).</p>
</div><div n="2"><head>Nuvem de emo&#231;&#245;es</head>
<p>A fim de gerar uma nuvem com as palavras que correspondem a cada emo&#231;&#227;o em <emph>Dom Casmurro</emph>, criaremos primeiro um vetor no qual armazenaremos todas as palavras que, nas colunas que indicamos ap&#243;s o s&#237;mbolo <code type="inline">$</code>, t&#234;m um valor maior que 0. &#201; gerado um novo objeto do tipo vetor, que cont&#233;m um elemento para a lista de cada emo&#231;&#227;o.</p>
<p>Neste caso, devemos indicar novamente &#224; fun&#231;&#227;o que temos caracteres acentuados se for uma m&#225;quina Windows.</p>
<p><hi rend="bold">Em Mac e Linux</hi></p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_18" type="block" corresp="code_analise-sentimento-R-syuzhet_18.txt"></code></pre>
<p><hi rend="bold">Em Windows</hi></p>
<p>Uma vez gerado o vetor, deve convert&#234;-lo em caracteres UTF-8 utilizando a fun&#231;&#227;o <code type="inline">iconv</code>.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_19" type="block" corresp="code_analise-sentimento-R-syuzhet_19.txt"></code></pre>
<p>Agora que temos o vetor, criamos um <emph>corpus</emph> de palavras com quatro &#8220;documentos&#8221; para a nuvem:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_20" type="block" corresp="code_analise-sentimento-R-syuzhet_20.txt"></code></pre>
<p>Em seguida, transformamos este corpus em uma matriz termo-documento com a fun&#231;&#227;o <code type="inline">TermDocumentMatrix()</code>. Com isto, agora usamos a fun&#231;&#227;o <code type="inline">as.matrix()</code> para converter o TDM em uma matriz que, como podemos ver, lista os termos no texto com um valor maior que zero para cada uma das quatro emo&#231;&#245;es que extra&#237;mos aqui. Para ver o in&#237;cio desta informa&#231;&#227;o, use novamente a fun&#231;&#227;o <code type="inline">head</code>:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_21" type="block" corresp="code_analise-sentimento-R-syuzhet_21.txt"></code></pre>
<p>Agora, atribua um nome a cada um dos grupos de palavras ou documentos (<emph>Docs</emph>) em nossa matriz. Aqui vamos usar o termo em portugu&#234;s para as colunas que selecionamos para exibir na nuvem. Mais uma vez, podemos ver a mudan&#231;a feita ao executar a fun&#231;&#227;o <code type="inline">head</code>.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_22" type="block" corresp="code_analise-sentimento-R-syuzhet_22.txt"></code></pre>
<p>Finalmente, podemos visualizar a nuvem de palavras que estamos acostumados a ver na m&#237;dia ou em estudos acad&#233;micos. O tamanho e a localiza&#231;&#227;o da palavra correspondem &#224; sua maior ou menor ocorr&#234;ncia com valor emocional atribu&#237;do no texto. Primeiro, executamos a fun&#231;&#227;o <code type="inline">set.seed()</code> para que quando reproduzirmos o resultado visual seja o mesmo que o nosso (se n&#227;o o fizer, ser&#225; o mesmo, mas as palavras aparecer&#227;o em posi&#231;&#245;es diferentes). E, para gerar a nuvem, vamos usar a fun&#231;&#227;o <code type="inline">comparison.cloud</code> do pacote <code type="inline">wordcloud</code>. Indicamos o objeto a representar, aqui &#8216;nuvem_tdm&#8217;, indicamos uma ordem n&#227;o aleat&#243;ria das palavras, atribu&#237;mos uma cor para cada grupo de palavras e damos tamanhos ao t&#237;tulo e &#224; escala geral, e atribu&#237;mos um n&#250;mero m&#225;ximo de termos que ser&#227;o exibidos.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_23" type="block" corresp="code_analise-sentimento-R-syuzhet_23.txt"></code></pre>
<p>O resultado deve ser semelhante &#224; imagem abaixo, mas a localiza&#231;&#227;o das palavras pode ser diferente uma vez que a figura &#233; gerada segundo o tamanho da tela:</p>
<img src="/images/analisis-de-sentimientos-r/analise-sentimento-R-syuzhet-02.png" alt="Nuvem das palavras mais frequentes correspondentes &#224;s emo&#231;&#245;es de tristeza, felicidade, raiva e confian&#231;a no romance Dom Casmurro de Machado de Assis."/>
<p>O que sugere o resultado desta nuvem? Ficamos impressionados com o aparecimento de palavras como &#8220;entre&#8221; no conjunto da tristeza e &#8220;cavalo&#8221; no conjunto da raiva. Este &#8220;disparate&#8221; est&#225; relacionado com o aviso j&#225; anunciado no in&#237;cio da li&#231;&#227;o. O vocabul&#225;rio para an&#225;lise de sentimentos que estamos usando aqui &#233; traduzido do ingl&#234;s, um tradutor autom&#225;tico que n&#227;o &#233; &#8220;perfeito&#8221;.</p>
</div></div>
      <div n="1"><head>Visualizando a evolu&#231;&#227;o dos sentimentos em um texto</head>
<p>Para complementar a leitura isolada das emo&#231;&#245;es, estudando a flutua&#231;&#227;o dos sentimentos positivos e negativos ao longo de um texto, h&#225; uma maneira de normalizar e visualizar estas informa&#231;&#245;es. Como a an&#225;lise da fun&#231;&#227;o de extra&#231;&#227;o de sentimento atribui um valor positivo tanto ao sentimento positivo quanto ao negativo, precisamos gerar dados entre um intervalo de -1 para o momento mais negativo e 1 para o mais positivo, e onde 0 &#233; neutro. Para isso, calculamos a val&#234;ncia do texto multiplicando os valores na coluna de valores negativos de nosso <emph>data frame</emph> com os resultados por -1 e adicionamos o valor na coluna de valores positivos.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_24" type="block" corresp="code_analise-sentimento-R-syuzhet_24.txt"></code></pre>
<p>Finalmente, podemos gerar um gr&#225;fico com a fun&#231;&#227;o <code type="inline">simple_plot()</code> integrada no pacote <code type="inline">syuzhet</code>, que nos dar&#225; duas imagens diferentes; a primeira, tem todas as medidas que o algoritmo calcula e, a segunda, &#233; uma normaliza&#231;&#227;o das mesmas. O eixo horizontal apresenta o texto em 100 fragmentos normalizados e o eixo vertical nos informa sobre a val&#234;ncia do sentimento no texto. Dependendo das caracter&#237;sticas de seu computador, este gr&#225;fico pode levar at&#233; 20-30 minutos para ser gerado.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_25" type="block" corresp="code_analise-sentimento-R-syuzhet_25.txt"></code></pre>
<blockquote>
<p>Assegure-se de possuir espa&#231;o suficiente no espa&#231;o de visualiza&#231;&#227;o de gr&#225;ficos do R para que ele seja gerado. Caso contr&#225;rio, aparecer&#225; o erro: <emph>Error in plot.new() : figure margins too large</emph></p>
</blockquote>
<img src="/images/analisis-de-sentimientos-r/analise-sentimento-R-syuzhet-03.png" alt="Evolu&#231;&#227;o das emo&#231;&#245;es ao longo do texto"/>
<p>Assim, neste caso, podemos interpretar que o romance <emph>Dom Casmurro</emph> varia bastante entre momentos positivos e negativos. Come&#231;a de forma mais negativa, fica mais positivo, sendo seguido por um novo momento negativo e um segundo positivo (por&#233;m menos do que o primeiro) para um desfecho negativo. Qualquer pessoa que tenha lido o romance pode confirmar esta varia&#231;&#227;o de sentimentos vivida pelo protagonista.</p>
<div n="2"><head>Salvar seus dados</head>
<p>Se quiser salvar seus dados para retornar a eles mais tarde, &#233; poss&#237;vel faz&#234;-lo em um ficheiro de valores separados por v&#237;rgula (CSV) com a fun&#231;&#227;o <code type="inline">write.csv()</code>. Aqui dizemos para salvar o <emph>data frame</emph>, que cont&#233;m o resultado das oito emo&#231;&#245;es e os dois sentimentos de texto em um ficheiro com uma extens&#227;o <code type="inline">.csv</code>. Al&#233;m disso, podemos acrescentar a palavra &#224; qual cada linha de resultados corresponde, em uma coluna &#224; esquerda usando a palavra vetor feita no in&#237;cio da an&#225;lise.</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_26" type="block" corresp="code_analise-sentimento-R-syuzhet_26.txt"></code></pre>
<p>Agora, pode come&#231;ar a analisar seus pr&#243;prios textos e compar&#225;-los uns com os outros!</p>
</div></div>
      <div n="1"><head>Outras funcionalidades e suas limita&#231;&#245;es</head>
<p>Talvez esteja trabalhando em um projeto onde j&#225; tem um dicion&#225;rio de sentimentos criado, ou talvez precise personalizar o vocabul&#225;rio e sua val&#234;ncia sentimental por raz&#245;es culturais ou temporais, ou talvez esteja procurando melhorar os resultados traduzidos automaticamente do NRC usado aqui. Em qualquer um destes casos, a partir do final de 2020, tamb&#233;m &#233; poss&#237;vel usar o seu pr&#243;prio conjunto de dados no <emph>script</emph> gra&#231;as &#224; fun&#231;&#227;o <code type="inline">custom</code> e realizar algumas das opera&#231;&#245;es que foram aprendidas nesta li&#231;&#227;o.</p>
<p>Para carregar seu pr&#243;prio &#8220;dicion&#225;rio de sentimentos&#8221;, &#233; preciso primeiro criar (ou modificar) uma tabela contendo, pelo menos, uma coluna para palavras e uma coluna para sua val&#234;ncia, por exemplo:</p>
<table>
<thead>
<tr>
<th>word</th>
<th>value</th>
</tr>
</thead>
<tbody>
<tr>
<td>amor</td>
<td>1</td>
</tr>
<tr>
<td>c&#243;lera</td>
<td>-1</td>
</tr>
<tr>
<td>tapete</td>
<td>0</td>
</tr>
<tr>
<td>cat&#225;strofe</td>
<td>-2</td>
</tr>
</tbody></table><p>Em seguida, carregue os seus dados salvos como um CSV com a fun&#231;&#227;o <code type="inline">read.csv</code>, que criar&#225; um novo conjunto dispon&#237;vel como <code type="inline">data.frame</code>, no qual &#233; poss&#237;vel verificar seu texto:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_27" type="block" corresp="code_analise-sentimento-R-syuzhet_27.txt"></code></pre>
<p>Se quiser visualizar o progresso do sentimento ao longo de seu texto, podemos usar a fun&#231;&#227;o <code type="inline">plot</code> com outros par&#226;metros que j&#225; vimos:</p>
<pre><code class="language-R" xml:id="code_analise-sentimento-R-syuzhet_28" type="block" corresp="code_analise-sentimento-R-syuzhet_28.txt"></code></pre>
<p>Entretanto, tenha em mente que esta forma de an&#225;lise ser&#225; limitada e n&#227;o ser&#225; poss&#237;vel realizar as mesmas opera&#231;&#245;es como explicado acima. Por exemplo, seguindo o modelo do exemplo, n&#227;o conseguimos as informa&#231;&#245;es sobre emo&#231;&#245;es, portanto n&#227;o somos capazes de fazer uma nuvem de palavras.</p>
</div>
      <div n="1"><head>Refer&#234;ncias</head>
<p>Assis, Machado de. <emph>Dom Casmurro</emph>. S&#227;o Paulo: Editora &#193;tica, 1996.</p>
<p>Jockers, Matthew L. <emph>Syuzhet: Extract Sentiment and Plot Arcs from Text</emph>, 2015. <link target="https://github.com/mjockers/syuzhet">https://github.com/mjockers/syuzhet</link></p>
<p>Jockers, Matthew L. "Introduction to the Syuzhet Package", CRAN R Project, 2017. <link target="https://mran.microsoft.com/snapshot/2017-12-31/web/packages/syuzhet/vignettes/syuzhet-vignette.html">https://mran.microsoft.com/snapshot/2017-12-31/web/packages/syuzhet/vignettes/syuzhet-vignette.html</link></p>
<p>Damasio, Antonio R. <emph>El error de Descartes: La raz&#243;n de las emociones</emph>. Barcelona: Andres Bello, 1999.</p>
<p>Mohammad, Saif, and Peter D. Turney. "Crowdsourcing a Word&#8211;Emotion Association Lexicon". <emph>Computational intelligence</emph> 29 (2013): 436-465, doi: 10.1111/j.1467-8640.2012.00460.x</p>
<p>Pereira Zazo, &#211;scar. <emph>El analisis de la comunicaci&#243;n en espa&#241;ol</emph>. Iowa: Kendal Hunt, 2015.</p>
<p>Rodr&#237;guez Aldape, Fernando Manuel. <emph>Cuantificaci&#243;n del Inter&#233;s de un usuario en un tema mediante miner&#237;a de texto y an&#225;lisis de sentimiento.</emph> Tese de Mestrado, Universidad Aut&#243;noma de Nuevo Le&#243;n, 2013.</p>
</div>
      <div n="1"><head>Notas</head>
<p><note id="1">Agradecemos Mounika Puligurthi, estagi&#225;ria da Universidade do Texas (UT), pelo seu aux&#237;lio na compreens&#227;o deste c&#225;lculo (durante a primavera de 2019).</note></p>
<p><note id="2">Perceba que a palavra &#8220;amor&#8221;, por exemplo, aparece em ambas as emo&#231;&#245;es com um valor de 20 pontos. O que ser&#225; que isso significa?</note></p>
</div>
    </body>
  </text>
</TEI>
