<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="installation-modules-python-pip">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Installation de biblioth&#232;ques Python avec pip</title>
  <author role="original_author">Fred Gibbs</author><editor role="reviewers"><persName>Ben Hurwitz</persName><persName>Amanda Morton</persName></editor><author role="translators">Lucas Terriel</author><editor role="translation-reviewers">Fran&#231;ois Dominic Laram&#233;e</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phfr0015</idno><date type="published">05/06/2013</date><date type="translated">01/06/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#installing-python-modules-pip"/>.</p><p>There are other translations: <ref target="#instalar-modulos-python-pip #instalacao-modulos-python-pip"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Il existe de nombreuses mani&#232;res d'installer des biblioth&#232;ques Python externes; cette le&#231;on explique l'une des m&#233;thodes les plus courantes utilisant pip.</p></abstract><textClass><keywords><term xml:lang="en">get-ready</term><term xml:lang="en">python</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="fr">
    <body>
      <div type="2"><head>Objectifs de la le&#231;on</head>
<p>Cette le&#231;on vous pr&#233;sente la mani&#232;re de t&#233;l&#233;charger et d'installer des biblioth&#232;ques Python en plus des biblioth&#232;ques standards distribu&#233;es (built-in) avec le langage de base. Il existe de nombreuses fa&#231;ons d'installer des biblioth&#232;ques externes, ici nous allons utiliser un programme appel&#233; <ref target="https://pip.pypa.io/en/stable/">pip</ref>, facilement installable sur les distributions <ref target="https://docs.python.org/fr/3.5/installing/index.html#how-do-i">Mac/Linux/Windows</ref>. Depuis Python 3.4, pip est inclus dans l&#8217;installation par d&#233;faut. Si pour quelque raison que ce soit vous avez besoin d'installer ou mettre &#224; jour vous-m&#234;me pip, ces instructions devraient vous aider.</p>
</div>
      <div type="2"><head>Pr&#233;sentation des biblioth&#232;ques</head>
<p>L'un des principaux avantages dans l'utilisation de Python est le nombre important de biblioth&#232;ques de code qui sont mises &#224; la disposition des programmeurs. Elles permettent d'&#233;conomiser du temps de programmation, ou simplement de rendre une t&#226;che sp&#233;cifique (comme la cr&#233;ation d'un fichier <ref target="https://fr.wikipedia.org/wiki/Comma-separated_values">CSV</ref>, ou la copie d'information d'une page web de mani&#232;re automatique - <emph>scraping</emph>) beaucoup plus facile. Quand vous recherchez des solutions &#224; des probl&#232;mes sur Google, vous trouverez souvent des exemples de code qui utilisent des biblioth&#232;ques dont vous n'avez jamais entendu parler auparavant. Ne les laissez pas vous impressionner ! Une fois ces biblioth&#232;ques install&#233;es sur votre ordinateur, vous pouvez les utiliser en les important au d&#233;but de votre code; vous pouvez importer autant de biblioth&#232;ques que vous le souhaitez, par exemple :</p>
<ab><code xml:id="code_installation-modules-python-pip_0" corresp="code_installation-modules-python-pip_0.txt" lang="language-python" rend="block"/></ab>
<p>Pour les nouveaux utilisateurs de Python, il peut &#234;tre quelque peu intimidant de t&#233;l&#233;charger et d'installer des biblioth&#232;ques externes la premi&#232;re fois. Il existe de nombreuses fa&#231;ons de le faire, ce qui ajoute ainsi de la confusion; cette le&#231;on pr&#233;sente l'une des plus simples et des plus couramment utilis&#233;es.</p>
<p>Le but ici est d'installer un gestionnaire sur votre ordinateur qui peut t&#233;l&#233;charger et installer automatiquement des biblioth&#232;ques Python pour vous. Ce programme s'appelle <ref target="https://pip.pypa.io/en/stable/">pip</ref>.</p>
<div type="3"><head>Instructions pour Mac et Linux</head>
<p>Selon la documentation de <ref target="https://pip.pypa.io/en/stable/">pip</ref>, nous pouvons installer un <emph>script</emph> Python qui se chargera d'installer <code rend="inline">pip</code> pour nous. En utilisant un Mac ou un Linux, nous pouvons installer <code rend="inline">pip</code> via la ligne de commande en utilisant la <ref target="https://riptutorial.com/fr/curl">commande curl</ref>, qui t&#233;l&#233;charge le <emph>script</emph> <ref target="https://fr.wikipedia.org/wiki/Perl_(langage)">Perl</ref> d'installation de <code rend="inline">pip</code>.  </p>
<ab><code xml:id="code_installation-modules-python-pip_1" corresp="code_installation-modules-python-pip_1.txt" lang="language-bash" rend="block"/></ab>
<p>Une fois que vous avez t&#233;l&#233;charg&#233; le fichier <hi rend="bold">get-pip.py</hi>, vous devez l'ex&#233;cuter avec l'interpr&#233;teur Python. Cependant, si vous essayez d&#8217;ex&#233;cuter le <emph>script</emph> avec Python de cette mani&#232;re :</p>
<ab><code xml:id="code_installation-modules-python-pip_2" corresp="code_installation-modules-python-pip_2.txt" lang="language-bash" rend="block"/></ab>
<p>le <emph>script</emph> &#233;chouera tr&#232;s probablement, car il n'aura pas les permissions pour mettre &#224; jour certains r&#233;pertoires de votre syst&#232;me de fichiers, qui sont par d&#233;faut d&#233;finis de sorte que les <emph>scripts</emph> de provenance inconnue ne puissent pas modifier les fichiers importants et vous transmettre des virus. Dans ce cas - et dans les cas o&#249; vous devez autoriser un <emph>script</emph> dans lequel vous avez confiance &#224; &#233;crire dans votre syst&#232;me - vous pouvez utiliser la commande <code rend="inline">sudo</code> (abr&#233;viation de "Super User Do") devant la commande Python, tel que :</p>
<ab><code xml:id="code_installation-modules-python-pip_3" corresp="code_installation-modules-python-pip_3.txt" lang="language-bash" rend="block"/></ab>
</div><div type="3"><head>Instructions pour Windows</head>
<p>Comme pour les distributions pr&#233;c&#233;dentes, la fa&#231;on la plus simple d'installer <code rend="inline">pip</code> est d'utiliser un programme Python appel&#233; <hi rend="bold">get-pip.py</hi>, que vous pouvez t&#233;l&#233;charger <ref target="https://bootstrap.pypa.io/get-pip.py">ici</ref>. Lorsque vous ouvrez ce lien, vous pourriez prendre peur devant le fouillis massif de code qui vous attend. Je vous en pris, n'ayez crainte. Utilisez simplement votre navigateur pour enregistrer cette page sous son nom par d&#233;faut, qui est <hi rend="bold">get-pip.py</hi>. Il peut &#234;tre judicieux d'enregistrer ce fichier dans votre r&#233;pertoire Python, afin que vous sachiez o&#249; le trouver.</p>
<p>Une fois que vous l'avez enregistr&#233;, vous devez l&#8217;ex&#233;cuter. Deux options s'offrent &#224; vous : si vous pr&#233;f&#233;rez utiliser l'interpr&#233;teur Python, faites un clic droit sur le fichier <hi rend="bold">get-pip.py</hi> et choisissez l'option &#171;ouvrir avec&#187; puis s&#233;lectionnez l'interpr&#233;teur Python que vous souhaitez utiliser.</p>
<p>Si vous pr&#233;f&#233;rez installer <code rend="inline">pip</code> &#224; l'aide de la ligne de commande Windows, acc&#233;dez au r&#233;pertoire dans lequel se trouvent <hi rend="bold">Python</hi> et <hi rend="bold">get-pip.py</hi>. Pour cet exemple, nous supposerons que ce r&#233;pertoire est <hi rend="bold">Python27</hi>, nous utiliserons donc la commande <code rend="inline">C:\&gt;cd python27</code>. Une fois dans ce r&#233;pertoire, pour installer <code rend="inline">pip</code>, ex&#233;cutez la commande :</p>
<ab><code xml:id="code_installation-modules-python-pip_4" corresp="code_installation-modules-python-pip_4.txt" lang="language-bash" rend="block"/></ab>
<p>Si vous souhaitez plus d'informations ou de l'aide concernant un &#233;trange message d'erreur, consultez la page <ref target="https://stackoverflow.com/questions/4750806/how-to-install-pip-on-windows">StackOverflow</ref> qui semble &#234;tre r&#233;guli&#232;rement mise &#224; jour.</p>
</div></div>
      <div type="2"><head>Installation des biblioth&#232;ques</head>
<p>Maintenant que vous disposez de <code rend="inline">pip</code>, il est facile d'installer des biblioth&#232;ques Python car <code rend="inline">pip</code> fait tout le travail pour vous. Lorsque vous trouvez une biblioth&#232;que que vous souhaitez utiliser, g&#233;n&#233;ralement, la documentation ou les instructions d'installation incluent la commande <code rend="inline">pip</code> n&#233;cessaire, telle que :</p>
<ab><code xml:id="code_installation-modules-python-pip_5" corresp="code_installation-modules-python-pip_5.txt" lang="language-bash" rend="block"/></ab>
<p><emph>(Note du traducteur: Le gestionnaire pip cr&#233;e des liens logiques vers les versions de Python. En effet, si votre ordinateur inclut initialement la version 2.x de Python, la commande <code rend="inline">pip</code> pointera alors sur cette version de Python. En revanche, si vous d&#233;cidez d'installer Python en version 3.x en plus de Python 2.x, il vous faudra tr&#232;s certainement utiliser la  commande <code rend="inline">pip3</code> dans votre terminal et non plus <code rend="inline">pip</code> pour installer des biblioth&#232;ques pour Python 3.x. Afin de conna&#238;tre quelle version de Python vous utilisez avec la commande <code rend="inline">pip</code>, il suffit de lancer dans le terminal la commande <code rend="inline">pip -V</code> ou <code rend="inline">pip --version</code>).</emph></p>
<p>N'oubliez pas, pour les m&#234;mes raisons expliqu&#233;es ci-dessus (sous les distributions Mac ou Linux, mais pas sous Windows), vous devrez peut-&#234;tre ex&#233;cuter <code rend="inline">pip</code> avec <code rend="inline">sudo</code>, comme suit :</p>
<ab><code xml:id="code_installation-modules-python-pip_6" corresp="code_installation-modules-python-pip_6.txt" lang="language-bash" rend="block"/></ab>
<p>Parfois, en particulier sous Windows, vous pouvez trouver utile d'utiliser l'indicateur <code rend="inline">-m</code> (pour aider Python a trouver la biblioth&#232;que <code rend="inline">pip</code>), comme :</p>
<ab><code xml:id="code_installation-modules-python-pip_7" corresp="code_installation-modules-python-pip_7.txt" lang="language-bash" rend="block"/></ab>
<p>Bonne installation ! </p>
</div>
    </body>
  </text>
</TEI>
