<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introduccion-e-instalacion">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introducci&#243;n a Python e Instalaci&#243;n</title>
  <author role="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor role="reviewers"><persName>Jim Clifford</persName><persName>Amanda Morton</persName></editor><author role="translators">V&#237;ctor Gayol</author><editor role="translation-reviewers"><persName>Jairo A. Melo</persName><persName>Maria Jos&#233; Afanador-Llach</persName><persName>Antonio Rojas Castro</persName></editor><editor role="editors">Miriam Posner</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0016</idno><date type="published">07/17/2012</date><date type="translated">03/15/2017</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#introduction-and-installation"/>.</p><p>There are other translations: <ref target="#introducao-instalacao-python #introduction-et-installation"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Esta primera lecci&#243;n de nuestra secci&#243;n sobre recursos en l&#237;nea est&#225; dise&#241;ada para introducirte en el tema y preparar tu computadora para comenzar a programar. Nos enfocaremos en la instalaci&#243;n del software necesario para hacerlo &#8211;que es software libre y de buena reputaci&#243;n-, y finalmente te ayudaremos a dar una probadita en programaci&#243;n (como dicen en ingl&#233;s: &#8220;get your toes wet&#8221;), con unos programas sencillos que producen resultados inmediatos.</p></abstract><textClass><keywords><term xml:lang="en">python</term><term xml:lang="en">get-ready</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Objetivos de la lecci&#243;n</head>
<p>Esta primera lecci&#243;n de nuestra secci&#243;n sobre recursos en l&#237;nea est&#225; dise&#241;ada para introducirte en el tema y preparar tu computadora para comenzar a programar. Nos enfocaremos en la instalaci&#243;n del software necesario para hacerlo &#8211;que es software libre y de buena reputaci&#243;n-, y finalmente te ayudaremos a dar una probadita en programaci&#243;n (como dicen en ingl&#233;s: &#8220;get your toes wet&#8221;), con unos programas sencillos que producen resultados inmediatos.</p>
<p>En este m&#243;dulo inicial instalar&#225;s el <ref target="https://www.python.org">Lenguaje de programaci&#243;n Python</ref>, el <ref target="https://www.crummy.com/software/BeautifulSoup/">Analizador sint&#225;ctico (<emph>parser</emph>) Beautiful Soup HTML/XML</ref>, y un editor de texto. Las capturas de pantalla que se ofrecen como ejemplo provienen del editor de texto <ref target="http://komodoide.com/komodo-edit/">Komodo Edit</ref>, pero puedes utilizar cualquier otro editor de texto capaz de trabajar con Python. Aqu&#237; hay una lista de opciones al respecto: <ref target="https://wiki.python.org/moin/PythonEditors/">Editores de Texto para Python</ref>. Una vez que todo est&#233; instalado, escribir&#225;s tu primer programa (el cl&#225;sico &#8220;Hola Mundo&#8221;) en Python y HTML.</p>
</div>
      <div type="2"><head>El lenguaje de programaci&#243;n Python</head>
<p>Python fue el primer lenguaje de programaci&#243;n que se introdujo en Programming Historian. Es un lenguaje de programaci&#243;n libre y de c&#243;digo abierto. Antes de que descargues el software es necesario tomar nota de que en todas las lecciones se utilizar&#225; <hi rend="bold">Python v.3.x</hi> porque la versi&#243;n anterior, <hi rend="bold">Python v.2.</hi>, dejar&#225; de recibir actualizaciones. Si ya utilizabas la versi&#243;n 2 reconocer&#225;s la mayor parte de la sintaxis pero deber&#225;s seguir los ejemplos con m&#225;s detenimiento para estar pendiente a los cambios.</p>
</div>
      <div type="2"><head>&#161;Respalda los datos de tu computadora!</head>
<p>Antes de descargar o instalar cualquier nuevo <emph>software</emph> en tu computadora, es muy importante hacer el respaldo de los datos en tu computadora. Todos los d&#237;as y antes de programar cualquier cosa, aseg&#250;rate de hacer una copia de seguridad de la base de datos de <ref target="https://www.zotero.org">Zotero</ref>. Al final de un d&#237;a de trabajo, respalda nuevamente la base de datos de Zotero y de cualquier programa que hayas escrito ese d&#237;a. Por lo menos una vez a la semana se debe hacer un respaldo de toda la computadora, aunque es recomendable hacerlo con m&#225;s frecuencia (en el caso de computadoras Mac, el uso del Time Machine es imprescindible). Tambi&#233;n es muy buena idea hacer copias de seguridad de tu trabajo en l&#237;nea; para que en el caso de que algo le pase a tu equipo, casa u oficina no pierdas todo lo hecho. Hay sitios que proveen formas f&#225;ciles y relativamente econ&#243;micas de hacer copias de seguridad, como <ref target="https://www.jungledisk.com">Jungle Disk</ref> y <ref target="https://www.dropbox.com">Dropbox</ref>.</p>
<div type="3"><head>Selecciona tu sistema operativo</head>
</div></div>
      <div type="2"><head>Paso 1.- Instalar el software</head>
<p>Con el fin de trabajar con las diversas t&#233;cnicas que se ofrecen en <emph>Programming Historian</emph>, debes descargar e instalar algunos programas de <emph>software</emph> libre disponibles. Se ofrecen las instrucciones para hacerlo en Mac, Windows y Linux. Una vez que los hayas instalado de acuerdo al sistema operativo de tu equipo, sigue a la siguiente lecci&#243;n: <ref target="/es/lecciones/ver-archivos-html">Para entender p&#225;ginas Web y HTML</ref>. Si tienes alg&#250;n problema con las instrucciones o encuentras algo que no funciona en tu plataforma, ponte en contacto con nosotros.</p>
<list type="unordered">
<item><ref target="/es/lecciones/instalacion-mac">Instalaci&#243;n de Python en Mac</ref></item>
<item><ref target="/es/lecciones/instalacion-windows">Instalaci&#243;n de Python en Windows</ref></item>
<item><ref target="/es/lecciones/instalacion-linux">Instalaci&#243;n de Python en Linux</ref></item>
</list>
</div>
    </body>
  </text>
</TEI>
