<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>An&#225;lisis de redes temporal en R
</title>
  <authors>Alex Brey</authors>
  <date>2018-11-04</date>
  <modified>2018-11-05</modified>
  <translation_date>2019-04-23</translation_date>
  <editors>Matthew Lincoln</editors>
  <reviewers>Zoe LeBlanc,Ryan Deschamps</reviewers>
  <translator>Jennifer Isasi</translator>
  <translation-editor>Antonio Rojas Castro</translation-editor>
  <translation-reviewer>Gabriela Elgarrista,Antonio S&#225;nchez-Padial</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/218</review-ticket>
  <layout>lesson</layout>
  <original>temporal-network-analysis-with-r</original>
  <difficulty>3</difficulty>
  <activity>analyzing</activity>
  <topics>network-analysis,r,data-visualization</topics>
  <abstract>Aprende a utilizar R para analizar c&#243;mo cambian las redes a lo largo del tiempo.</abstract>
  <avatar_alt>Dibujo t&#233;cnico</avatar_alt>
  <doi>10.46430/phes0042</doi>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Introducci&#243;n</head>
<p>Si est&#225;s leyendo este tutorial seguramente ya tendr&#225;s experiencia en modelar datos de humanidades en forma de red. Quiz&#225;s seas un/a historiador/a de religi&#243;n investigando las redes de correspondencia de <link target="https://es.wikipedia.org/wiki/Sociedad_Religiosa_de_los_Amigos">la Sociedad Religiosa de los Amigos o cu&#225;queros</link>, en las que los nodos representan a los emisores y los receptores de las cartas y los v&#237;nculos representan los intercambios epistolares. O quiz&#225;s seas un/a historiador/a del arte que estudia una red compuesta de dise&#241;adores de medios impresos y grabadores, con conexiones derivadas de su colaboraci&#243;n en libros. Probablemente hayas visualizado y analizado tu red est&#225;tica, pero a lo mejor crees que hay algo que est&#225;s pasando por alto o que algo est&#225; mal. Puede que la red te parezca m&#225;s grande y robusta de lo que te parec&#237;a al obtener los datos de los archivos, o quiz&#225;s las medidas de centralidad de tus nodos no tienen mucho sentido en el contexto hist&#243;rico concreto en que existieron.</p>
<p>En realidad la mayor&#237;a de las redes hist&#243;ricas cambian a lo largo del tiempo. Hay momentos en los que pueden crecer, encogerse o disolverse por completo. Los actores y los objetos entran y salen de estas redes a lo largo de su existencia. Las personas o las cosas pueden tener un protagonismo destacado durante periodos breves de tiempo -un d&#237;a, un a&#241;o o una d&#233;cada- pero raramente comienzan y terminan su existencia dentro de una red en dicha posici&#243;n. &#191;No ser&#237;a estupendo si pudieras mostrar estos cambios y desarrollos en tus visualizaciones y an&#225;lisis de una red?</p>
<p>El an&#225;lisis de redes temporal (Temporal Network Analysis o TNA por sus siglas en ingl&#233;s), tambi&#233;n conocido como an&#225;lisis de redes sociales temporal (Temporal Social Network Analysis o TSNA) o an&#225;lisis de redes din&#225;mico (Dynamic Network Analysis o DNA), es justo lo que est&#225;s buscando.</p>
<p>El an&#225;lisis de redes temporal es un acercamiento bastante nuevo fuera de los campos de la epidemiolog&#237;a o del an&#225;lisis de redes sociales. Este tutorial introduce m&#233;todos para la visualizaci&#243;n y an&#225;lisis de redes temporal mediante el uso de unos paquetes escritos para el lenguaje de programaci&#243;n estad&#237;stico R. Al paso al que el an&#225;lisis de redes se est&#225; desarrollando, pronto habr&#225; formas m&#225;s intuitivas para producir visualizaciones y an&#225;lisis similares, as&#237; como m&#233;tricas de inter&#233;s completamente nuevas. Por estas razones, este tutorial se enfoca tanto en los principios de creaci&#243;n, visualizaci&#243;n y an&#225;lisis de redes temporal (el por qu&#233;) como en la t&#233;cnica particular que permite alcanzar dichos objetivos (el c&#243;mo). Tambi&#233;n resalta algunas de las simplificaciones poco afortunadas que los historiadores deben realizar al preparar los datos para el an&#225;lisis temporal de redes, un &#225;rea en la que nuestra disciplina puede aportar nuevas aproximaciones en el an&#225;lisis temporal de redes.</p>
<p>Una de las formas b&#225;sicas de argumentaci&#243;n hist&#243;rica es identificar, describir y analizar cambios en un fen&#243;meno o un conjunto de fen&#243;menos que ocurren a lo largo del tiempo. La premisa para este tutorial es que cuando los historiadores estudiamos redes deber&#237;amos, en la medida de lo posible, reconocer e investigar c&#243;mo las redes cambian con el tiempo.</p>
</div>
      <div type="2"><head>Objetivos de la lecci&#243;n</head>
<p>En este tutorial aprender&#225;s:</p>
<ul>
<li>Los tipos de datos necesarios para el modelado de una red temporal.</li>
<li>C&#243;mo visualizar una red temporal usando el paquete NDTV de R.</li>
<li>C&#243;mo cuantificar y visualizar algunas medidas relevantes a nivel de la red y de los nodos que describen redes temporales usando el paquete TSNA de R.</li>
</ul>
</div>
      <div type="2"><head>Prerrequisitos</head>
<p>Este tutorial asume que tienes:</p>
<ul>
<li>Un conocimiento b&#225;sico de la visualizaci&#243;n y el an&#225;lisis de redes est&#225;ticas, algo que puedes aprender con tutoriales de Programming Historian como <link target="/es/lecciones/creando-diagramas-de-redes-desde-fuentes-historicas">De la hermen&#233;utica a las redes de datos: Extracci&#243;n de datos y visualizaci&#243;n de redes en fuentes hist&#243;ricas</link> y <link target="/en/lessons/exploring-and-analyzing-network-data-with-python">Exploring and Analyzing Network Data with Python</link> (en ingl&#233;s).</li>
<li>R Studio con la versi&#243;n 3.0 o superior de R instalado.</li>
<li>Un entendimiento b&#225;sico de c&#243;mo utilizar R para modificar tus datos. Te recomendamos revisar el excelente tutorial <link target="/es/lecciones/datos-tabulares-en-r">Datos tabulares en R</link>.</li>
</ul>
</div>
      <div type="2"><head>Paquetes para el an&#225;lisis temporal de redes</head>
<p>Mientras sigues este tutorial te recomiendo que escribas el c&#243;digo en el archivo de comandos (<emph>script</emph>) de R para poder guardarlo y editarlo a medida que trabajas. Puedes ejecutar la l&#237;nea de c&#243;digo o selecci&#243;n de este <emph>script</emph> usando un atajo del teclado (Ctrl+Intro en Windows y Linux, Command+Intro en Mac).</p>
<p>En este tutorial usaremos dos paquetes para el an&#225;lisis temporal de redes. El primero y el m&#225;s importante de todos es el paquete <hi rend="bold">tsna</hi>. Estas herramientas para el an&#225;lisis temporal de redes (<emph>Tools for Temporal Social Network Analysis</emph>) extienden las funciones del paquete de an&#225;lisis de redes sociales (<hi rend="bold">sna</hi>) para el modelaje y an&#225;lisis de redes longitudinales (sin&#243;nimo de temporal).</p>
<p>El segundo paquete, <hi rend="bold">ndtv</hi>, sirve para visualizar redes temporales. Acr&#243;nimo de visualizaciones din&#225;micas de redes temporales (<emph>Network Dynamic Temporal Visualizations</emph>), <hi rend="bold">ndtv</hi> muestra los datos de redes temporales como pel&#237;culas, animaciones interactivas u otras representaciones de estructuras relacionales y atributos cambiantes.</p>
<p>Ambos paquetes extienden y dependen del paquete <hi rend="bold">networkDynamic</hi>, que provee una estructura de datos robusta para almacenar y manipular datos de redes temporales. Se instalar&#225; autom&#225;ticamente cuando instales uno de los otros dos paquetes, as&#237; que no te preocupes por su instalaci&#243;n individual. Nota para los usuarios de Mac: para instalar estos paquetes correctamente puede que sea necesaria la instalaci&#243;n de las Herramientas de desarrollo de l&#237;nea de comando Xcode si todav&#237;a no las tienes.</p>
<p>Utiliza la funci&#243;n <code type="inline">install.packages()</code> de la siguiente manera:</p>
<pre><code xml:id="code_analisis-temporal-red_0" type="block" corresp="code_analisis-temporal-red_0.txt"></code></pre>
<p>Para asegurarte de que los paquetes est&#225;n instalados y cargados cuando utilizas los comandos de R, utiliza la funci&#243;n <code type="inline">library()</code> al comienzo de tu c&#243;digo:</p>
<pre><code xml:id="code_analisis-temporal-red_1" type="block" corresp="code_analisis-temporal-red_1.txt"></code></pre>
</div>
      <div type="2"><head>Obtener tus datos</head>
<div type="3"><head>Red est&#225;tica inicial</head>
<p>Digamos que ya tienes una red est&#225;tica basada en un archivo de intercambios epistolares, colaboraciones art&#237;sticas o la matriculaci&#243;n en cursos de las escuelas culinarias del siglo XIX. Cualquiera que sea el contenido de tu red est&#225;tica, podemos pensar en dos partes que componen el conjunto de datos:</p>
<ol>
<li>Una lista que contiene todos los nodos (o v&#233;rtices -t&#233;rminos que vamos a usar de forma indistinta en este tutorial-)</li>
<li>Una lista de conexiones que contiene una de las conexiones<ref type="footnotemark" target="#1"/></li>
</ol>
<p>Para evitar que este tutorial sea demasiado abstracto, voy a utilizar un ejemplo concreto durante toda la lecci&#243;n. Este conjunto de datos describe la colaboraci&#243;n entre talleres franceses de manuscritos g&#243;ticos iluminados de entre 1260 y 1320.<ref type="footnotemark" target="#2"/> La lista de nodos de este conjunto de datos es simplemente una lista larga de talleres. Los nombres de estos talleres no son muy importantes. En unos pocos casos en el colof&#243;n (una parte de texto al final del manuscrito que describe las circunstancia de su producci&#243;n) se menciona el nombre del iluminador. En la mayor&#237;a de los casos, sin embargo, estos nombres han sido asignados por acad&#233;micos bas&#225;ndose en la ciudad o regi&#243;n en que el taller estaba situado, o por alg&#250;n manuscrito famoso que produjo.</p>
<p>Todos los paquetes de R de este tutorial asumen que tu red es unimodal - esto es, que todos los nodos son el mismo tipo de cosa-, y lo mismo ocurre con las conexiones. Tal y como <link target="http://www.scottbot.net/HIAL/index.html@p=41158.html">explic&#243; Scott Weingart</link>, los historiadores frecuentemente comienzan con datos multimodales o bimodales. Si quieres producir datos cuantitativos relevantes de tu red con las herramientas disponibles, tienes que convertir (o "proyectar") una red bimodal a una red unimodal. El conjunto de datos que usamos de ejemplo en este tutorial no es una excepci&#243;n. Comenz&#243; como una lista de talleres y de los manuscritos a los que contribuyeron. Primero model&#233; estos datos en forma de una red bimodal que consist&#237;a en talleres y manuscritos. Luego convert&#237; la red bimodal a una red unimodal, en la que cada nodo representa un iluminador o un taller.<ref type="footnotemark" target="#3"/> Cada v&#237;nculo indica la contribuci&#243;n de dos o m&#225;s talleres a uno o varios manuscritos. Por esta raz&#243;n, a veces un manuscrito puede estar representado por m&#250;ltiples v&#237;nculos y un v&#237;nculo puede representar m&#250;ltiples manuscritos.</p>
<p>La diferencia entre una red est&#225;tica y una temporal din&#225;mica es la cantidad de informaci&#243;n contenida en las listas de nodos y v&#237;nculos. Para convertir una red est&#225;tica en una temporal, necesitas a&#241;adir <emph>informaci&#243;n temporal</emph> a ambas listas. B&#225;sicamente, tenemos que proveer un rango de tiempo que representa el periodo en que existen cada v&#237;nculo y cada nodo.</p>
<div type="4"><head>Listado de v&#237;nculos</head>
<p>Un listado de v&#237;nculos sin direcci&#243;n contiene tres columnas de datos: un identificador &#250;nico para el v&#237;nculo, un nodo de origen o <emph>tail</emph> (uno de los talleres implicados) y un nodo de destino o <emph>head</emph> (otro taller implicado) por cada v&#237;nculo. Algo as&#237;:</p>
<table>
<thead>
<tr>
<th>edge.id</th>
<th>tail</th>
<th>head</th>
</tr>
</thead>
<tbody>
<tr>
<td>1</td>
<td>2</td>
<td>12</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>5</td>
</tr>
<tr>
<td>3</td>
<td>2</td>
<td>17</td>
</tr>
<tr>
<td>...</td>
<td>...</td>
<td>...</td>
</tr>
<tr>
<td>142</td>
<td>97</td>
<td>73</td>
</tr>
</tbody></table><p>Adem&#225;s de esta informaci&#243;n, una lista de v&#233;rtices o aristas temporales debe contener como m&#237;nimo dos partes m&#225;s de informaci&#243;n: el momento en que un v&#237;nculo comienza su existencia, tambi&#233;n conocido como el <code type="inline">onset</code> o inicio del v&#237;nculo, y cu&#225;ndo desaparece ese v&#237;nculo, esto es, su <code type="inline">terminus</code> o t&#233;rmino. Los paquetes NDTV y TSNA que vamos a usar en este tutorial presuponen que tus datos incluyen el <emph>onset</emph>, el <emph>terminus</emph>, el <emph>tail</emph>, el <emph>head</emph> y un <emph>edge id</emph>. Dependiendo de c&#243;mo conceptualices tu red, puede que el inicio y el t&#233;rmino del intervalo de tiempo que conecta dos nodos sea o relativamente breve o prolongado, y en este &#250;ltimo caso el comienzo y el final implican una serie de eventos en la relaci&#243;n. Para los talleres de manuscritos, la lista de v&#237;nculos temporales es as&#237;:</p>
<table>
<thead>
<tr>
<th>onset</th>
<th>terminus</th>
<th>tail</th>
<th>head</th>
<th>onset.censored</th>
<th>terminus.censored</th>
<th>duration</th>
<th>edge.id</th>
</tr>
</thead>
<tbody>
<tr>
<td>1300.0</td>
<td>1301.0</td>
<td>10</td>
<td>11</td>
<td>FALSE</td>
<td>FALSE</td>
<td>1</td>
<td>1</td>
</tr>
<tr>
<td>1300.0</td>
<td>1301.0</td>
<td>10</td>
<td>12</td>
<td>FALSE</td>
<td>FALSE</td>
<td>1</td>
<td>2</td>
</tr>
<tr>
<td>1320.0</td>
<td>1321.0</td>
<td>10</td>
<td>30</td>
<td>FALSE</td>
<td>FALSE</td>
<td>1</td>
<td>3</td>
</tr>
<tr>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
</tr>
<tr>
<td>1319.0</td>
<td>1320.0</td>
<td>99</td>
<td>100</td>
<td>FALSE</td>
<td>FALSE</td>
<td>1</td>
<td>108</td>
</tr>
</tbody></table><p>La primera colaboraci&#243;n en esta lista tuvo lugar entre los talleres 10 y 11 entre los a&#241;os 1300 y 1301, y dur&#243; un a&#241;o (en realidad no sabemos cu&#225;nto tardaron ambos talleres en producir el manuscrito juntos, esto es una aproximaci&#243;n), etc. A lo mejor te preguntes qu&#233; son las columnas <code type="inline">onset.censored</code> y <code type="inline">terminus.censored</code> aqu&#237;. En el an&#225;lisis temporal de redes <hi rend="bold">censurar</hi> es una forma de ignorar el comienzo y el final de un v&#237;nculo o un nodo. Esta capacidad para ignorar el inicio o el t&#233;rmino de un elemento puede ser &#250;til a la hora de modelar tipos espec&#237;ficos de redes temporales, para crear visualizaciones cumulativas o para limpiar tu c&#243;digo, entre otras cosas. Para este tutorial no censuraremos nada [Nota de la T.: para no censurar se indica con la palabra <emph>FALSE</emph>, y para censurar con la palabra <emph>TRUE</emph>].</p>
</div><div type="4"><head>Lista de nodos</head>
<p>En la mayor&#237;a de los an&#225;lisis de redes est&#225;ticas, una lista de nodos es simplemente una lista de todos los elementos que est&#225;n conectados. Es una lista de identificaci&#243;n por n&#250;meros de cada nodo.</p>
<p>|node.id|
|1|
|2|
|3|
|...|
|106|</p>
<p>En una red temporal, sin embargo, los actores y los objetos entran y salen de la red todo el tiempo. Puede que nuestros talleres de iluminadores generaran libros preciosos durante dos, cinco o incluso treinta a&#241;os y medio. Para reflejar el surgimiento y la desaparici&#243;n de dichos talleres, necesitamos un <code type="inline">onset</code> (punto de inicio), un <code type="inline">terminus</code> (punto de desaparici&#243;n), y la <code type="inline">duration</code> (duraci&#243;n) de cada uno de ellos. El paquete de R que estamos utilizando espera un conjunto de datos como este:</p>
<table>
<thead>
<tr>
<th>onset</th>
<th>terminus</th>
<th>vertex.id</th>
<th>onset.censored</th>
<th>terminus.censored</th>
<th>duration</th>
</tr>
</thead>
<tbody>
<tr>
<td>1280.0</td>
<td>1311.0</td>
<td>1</td>
<td>FALSE</td>
<td>FALSE</td>
<td>31</td>
</tr>
<tr>
<td>1288.5</td>
<td>1311.0</td>
<td>2</td>
<td>FALSE</td>
<td>FALSE</td>
<td>22.5</td>
</tr>
<tr>
<td>1257.5</td>
<td>1290.0</td>
<td>3</td>
<td>FALSE</td>
<td>FALSE</td>
<td>32.5</td>
</tr>
<tr>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
<td>...</td>
</tr>
<tr>
<td>1267.0</td>
<td>1277.0</td>
<td>106</td>
<td>FALSE</td>
<td>FALSE</td>
<td>10.0</td>
</tr>
</tbody></table><p>Aqu&#237;, el segundo taller comienza su actividad alrededor de 1288 y cesa de colaborar sobre 1311, d&#225;ndole un periodo de vida de unos 22,5 a&#241;os. Puesto que no tenemos registros de archivo que documenten cuando se form&#243; o disolvi&#243; cada taller, estos tres n&#250;meros son una aproximaci&#243;n basada en las fechas asociadas con su primera y su &#250;ltima colaboraci&#243;n en un manuscrito.</p>
</div></div><div type="3"><head>Tomar decisiones complicadas: convertir datos hist&#243;ricos en un conjunto de datos TNA</head>
<p>Modelar la producci&#243;n de manuscritos medievales como una red temporal implica adentrarse en el terreno de la aproximaci&#243;n. En este sentido, es bastante frecuente que los historiadores tengan que modelar eventos o procesos hist&#243;ricos como redes din&#225;micas. Los acad&#233;micos deben tomar algunas decisiones para modelar datos hist&#243;ricos relativamente directos de alguna forma para que las herramientas de an&#225;lisis de redes temporales puedan aceptar los datos.</p>
<p>Si est&#225;s estudiando una red de correspondencia, tendr&#225;s que decidir si el inicio y el t&#233;rmino van a representar el comienzo y el final en una serie de intercambios entre dos personas, o el comienzo y el final de un &#250;nico intercambio. Si te interesan las cartas de forma individual, el inicio podr&#237;a, te&#243;ricamente, representar el momento en que la carta fue comenzada, completada o enviada, mientras que el t&#233;rmino podr&#237;a representar el momento en que fue recibida o le&#237;da. Puede que solamente tengas la informaci&#243;n de la fecha en que una carta fue escrita, en cuyo caso tendr&#225; que servir tanto de inicio como de t&#233;rmino.</p>
<p>Como historiadores, solo podemos ser tan espec&#237;ficos y consistentes como lo sean nuestras fuentes. Una red temporal puede reflejar con m&#225;s exactitud el proceso hist&#243;rico revelado en tus fuentes que una red est&#225;tica, pero en realidad ambos son modelos imperfectos. Tienes que considerar bien tus posibilidades antes de tomar una decisi&#243;n sobre c&#243;mo vas a combinar la complejidad e incertidumbre inherentes a los datos hist&#243;ricos. Es buena idea que tomes nota de estas decisiones y su razonamiento para usar en una secci&#243;n de metodolog&#237;a, un ap&#233;ndice o una nota a pie de p&#225;gina cuando presentes tus conclusiones.</p>
<p>Los manuscritos medievales iluminados son un buen ejemplo de cu&#225;n complicados son los datos hist&#243;ricos. En algunos casos se puede fechar los manuscritos por un &#250;nico a&#241;o en el colof&#243;n (una nota breve al comienzo o final del texto sobre la producci&#243;n del manuscrito). Puede que los historiadores del arte que han dedicado toda su carrera al estudio de estos manuscritos solo se sientan c&#243;modos fechando los manuscritos por d&#233;cadas (por ejemplo, de la d&#233;cada de 1290) o incluso un tiempo de varias d&#233;cadas (entre 1275 y 1300). Para el prop&#243;sito de este tutorial he creado un conjunto de datos temporales haciendo la media de estos rangos de tiempo y us&#225;ndolos como el inicio de cada colaboraci&#243;n, fijando su t&#233;rmino a un a&#241;o desde el inicio. Esto no es una soluci&#243;n ideal, pero tampoco es arbitraria o injustificable.<ref type="footnotemark" target="#4"/></p>
</div></div>
      <div type="2"><head>Visualizaciones est&#225;ticas</head>
<p>Ahora que tenemos una idea de d&#243;nde provienen los datos para la red temporal y c&#243;mo est&#225; estructurada, podemos empezar a visualizar y analizar la red. Primero cargamos nuestra red como una lista est&#225;tica de v&#237;nculos, a la que hemos llamado <code type="inline">VinculosEstaticosPH</code> con sus atributos de v&#233;rtice asociados, aqu&#237; llamados <code type="inline">AtributosVerticesPH</code>. Descarga la <link target="/assets/temporal-network-analysis-with-r/ATR_VinculosEstaticos.csv">lista de v&#237;nculos est&#225;tica</link> y c&#225;rgala en R usando el comando <code type="inline">read.csv()</code> (leer archivo separado por comas). En vez de recordar la ruta al archivo, puedes abrir una ventana que te deje navegar visualmente al archivo usando la funci&#243;n <code type="inline">file.choose()</code>:</p>
<pre><code xml:id="code_analisis-temporal-red_2" type="block" corresp="code_analisis-temporal-red_2.txt"></code></pre>
<p>Despu&#233;s utiliza la misma funci&#243;n para cargar los <link target="/assets/temporal-network-analysis-with-r/ATR_AtributosVertices.csv">atributos de los v&#233;rtices</link> en R.</p>
<pre><code xml:id="code_analisis-temporal-red_3" type="block" corresp="code_analisis-temporal-red_3.txt"></code></pre>
<p>Ahora que tenemos los datos b&#225;sicos en R, podemos ver la red:</p>
<pre><code xml:id="code_analisis-temporal-red_4" type="block" corresp="code_analisis-temporal-red_4.txt"></code></pre>
<p>Esto deber&#237;a producir algo parecido a esta imagen - una red de nodos y v&#237;nculos que muestra cada taller y colaboraci&#243;n del per&#237;odo de sesenta a&#241;os capturado en los datos de los manuscritos:</p>
<figure><desc>Una visualizaci&#243;n est&#225;tica de la red</desc><graphic url="tna_with_r_1.png"/></figure>
<p>Ahora hagamos nuestra red din&#225;mica. Primero, tenemos que importar los datos temporales asociados con los <link target="/assets/temporal-network-analysis-with-r/TNAWR_DynamicEdges.csv">v&#237;nculos din&#225;micos</link> y los <link target="/assets/temporal-network-analysis-with-r/TNAWR_DynamicNodes.csv">nodos din&#225;micos</link>.</p>
<pre><code xml:id="code_analisis-temporal-red_5" type="block" corresp="code_analisis-temporal-red_5.txt"></code></pre>
<p>Una vez que hayamos importado los datos temporales, podemos a&#241;adirlos a la red est&#225;tica que hab&#237;amos creado m&#225;s arriba para formar una red din&#225;mica, usando la funci&#243;n <code type="inline">networkDynamic()</code> (red din&#225;mica):</p>
<pre><code xml:id="code_analisis-temporal-red_6" type="block" corresp="code_analisis-temporal-red_6.txt"></code></pre>
<p>La funci&#243;n <code type="inline">networkDynamic()</code> toma como su primer argumento la red est&#225;tica ya creada, y le a&#241;ade los datos temporales para los v&#233;rtices y los nodos. Probablemente sea una buena idea comprobar la red din&#225;mica para asegurarse de que todo est&#225; correcto mediante la funci&#243;n <code type="inline">network.dynamic.check()</code> (comprobar red din&#225;mica).</p>
<pre><code xml:id="code_analisis-temporal-red_7" type="block" corresp="code_analisis-temporal-red_7.txt"></code></pre>
<p>Si todo ha ido bien, mostrar&#225; una serie de comprobaciones, todas con el valor <code type="inline">TRUE</code>.</p>
<p>Ahora que hemos creado una red din&#225;mica &#161;podemos convertirla en un gr&#225;fico para ver como se ve!</p>
<pre><code xml:id="code_analisis-temporal-red_8" type="block" corresp="code_analisis-temporal-red_8.txt"></code></pre>
<p>Esto produce... algo que, de manera decepcionante, se parece a la red est&#225;tica de m&#225;s arriba.</p>
<figure><desc>Una visualizaci&#243;n decepcionante de la red din&#225;mica</desc><graphic url="tna_with_r_2.png"/></figure>
<p>Esto es porque la funci&#243;n <code type="inline">plot()</code> (gr&#225;fico) produce una imagen est&#225;tica de la red din&#225;mica al completo. Para poder ver las transformaciones temporales dentro de la red, necesitamos usar una visualizaci&#243;n diferente que divida la red en partes temporales sucesivas. Una forma de hacer esto es con la funci&#243;n <code type="inline">filmstrip()</code> (tira de pel&#237;cula).</p>
<pre><code xml:id="code_analisis-temporal-red_9" type="block" corresp="code_analisis-temporal-red_9.txt"></code></pre>
<p>[Nota de la T: Aqu&#237; indicamos que no muestre las etiquetas mediante <emph>displaylabels</emph>].</p>
<p>&#161;Ahora tenemos algo! Esto nos da una muestra de c&#243;mo la red se desarrolla a lo largo del tiempo, tomando muestras en algunos momentos clave a lo largo de su vida.</p>
<figure><desc>Una visualizaci&#243;n de la red din&#225;mica en fragmentos</desc><graphic url="tna_with_r_3.png"/></figure>
<p>Puesto que, relativamente, las colaboraciones entre talleres era poco frecuente, esta tira f&#237;lmica es demasiado escasa para que podamos entender c&#243;mo las colaboraciones en la red emergieron y cambiaron durante el tiempo. Para poder ver estos cambios, vamos a utilizar una animaci&#243;n que muestra el intervalo cambiante del per&#237;odo de sesenta a&#241;os y agrega todas las colaboraciones dentro de ese intervalo.</p>
<div type="3"><head>Crear una animaci&#243;n</head>
<p>A pesar de que los fen&#243;menos hist&#243;ricos que estamos modelando son continuos, la mayor&#237;a de los acercamientos a la visualizaci&#243;n y el an&#225;lisis de redes convierten la red din&#225;mica continuada en una serie de redes est&#225;ticas, conocidas como segmentos de redes, que representan el estado acumulado de la red en un espacio temporal concreto - 10 a&#241;os, o 1 a&#241;o, o 1 d&#237;a-. Estas partes pueden estar conectadas de forma secuencial, como fragmentos de una pel&#237;cula.</p>
<p>Hacer una animaci&#243;n as&#237; es algo complicado, as&#237; que el paquete NDTV hace el c&#225;lculo matem&#225;tico detr&#225;s de dicha animaci&#243;n desde la representaci&#243;n de la animaci&#243;n en s&#237;. Primero, computariza la animaci&#243;n seg&#250;n unos par&#225;metros que le dicen cu&#225;ndo empezar, parar, cu&#225;nto avanzar entre fragmentos, y de cu&#225;nto tiempo queremos que est&#233; compuesto cada intervalo. Dependiendo de cu&#225;n grande sea tu red, esta funci&#243;n puede tomar un tiempo en ejecutarse.</p>
<pre><code xml:id="code_analisis-temporal-red_10" type="block" corresp="code_analisis-temporal-red_10.txt"></code></pre>
<p>Veamos lo que es cada par&#225;metro. Hay unas cuantas formas de ejecutar el dise&#241;o de nuestra animaci&#243;n, as&#237; que hemos decidido usar un algoritmo de fuerza dirigida conocido como Kamada Kawai.<ref type="footnotemark" target="#5"/> Establecemos el a&#241;o de inicio (<emph>start</emph>) en 1260 y el de finalizaci&#243;n (<emph>end</emph>) en 1320, y que el intervalo (<emph>interval</emph>) entre cada animaci&#243;n sean fragmentos de un a&#241;o. Puesto que las colaboraciones entre talleres es infrecuente o durante un per&#237;odo relativamente corto de tiempo (al menos en nuestra aproximaci&#243;n), hemos agregado los v&#237;nculos (<emph>aggregate.dur</emph>) mostrados en cada fragmento durante un periodo significativo de tiempo, 20 a&#241;os en este caso.</p>
<p>Una vez que NDTV haya creado la animaci&#243;n, puedes generar una p&#225;gina web con esta animaci&#243;n con la funci&#243;n <code type="inline">render.d3movie()</code> (reproducir pel&#237;cula). Como la funci&#243;n <code type="inline">compute.animation()</code> (ejecutar animaci&#243;n) de arriba, este paso puede tomar algo de tiempo dependiendo del tama&#241;o de tu red.</p>
<pre><code xml:id="code_analisis-temporal-red_11" type="block" corresp="code_analisis-temporal-red_11.txt"></code></pre>
<p>Esto deber&#237;a generar una p&#225;gina web con una visualizaci&#243;n interactiva de tu red temporal y abrirla en tu navegador por defecto. Puede que la consola de R Studio muestre algunos mensajes de aviso, pero estos solo especifican que si hay valores m&#250;ltiples en los atributos de los v&#233;rtices, la funci&#243;n <code type="inline">render.d3movie()</code> utiliza el primer atributo en el tiempo para cada v&#233;rtice. Si todo ha ido bien, deber&#237;a verse as&#237;:</p>
<figure><desc/><graphic url="tna_with_r_dynamic_visualization.html"/></figure>
<p>Las etiquetas por defecto son simplemente el n&#250;mero de identificaci&#243;n de cada v&#233;rtice, as&#237; que lo hemos desconectado (<emph>FALSE</emph>). El par&#225;metro <code type="inline">vertex.tooltip</code> de esta funci&#243;n puede dar algo de miedo, pero b&#225;sicamente proporciona a cada fragmento de la animaci&#243;n la informaci&#243;n sobre la herramienta correcta para que podamos ver el nombre y la regi&#243;n de cada v&#233;rtice cuando hacemos clic en ellos.</p>
</div></div>
      <div type="2"><head>M&#225;s all&#225; de la bola de pelo: la m&#233;trica de redes din&#225;micas</head>
<p>Esta animaci&#243;n funciona de maravilla para nuestra red de talleres de manuscritos porque es peque&#241;a y las colaboraciones en un tiempo dado fueron escasas. Para comparar diferentes momentos, sin embargo, las m&#233;tricas cuantificables para la red o para nodos individuales puede ser m&#225;s &#250;til que una visualizaci&#243;n animada.</p>
<p>Puede que queramos saber cu&#225;ndo surgieron las colaboraciones entre talleres a lo largo de la duraci&#243;n de nuestros datos.</p>
<pre><code xml:id="code_analisis-temporal-red_12" type="block" corresp="code_analisis-temporal-red_12.txt"></code></pre>
<p>El gr&#225;fico deber&#237;a verse as&#237;:</p>
<figure><desc>Formaci&#243;n de v&#237;nculos en la red de talleres, 1260-1320</desc><graphic url="tna_with_r_4.png"/></figure>
<p>Nuestra animaci&#243;n podr&#237;a darnos una idea intuitiva de que la mayor&#237;a de las colaboraciones se dieron entre 1280 y 1300, pero este gr&#225;fico de la formaci&#243;n de v&#237;nculos proporciona informaci&#243;n m&#225;s concreta. Al establecer el intervalo de muestras cada 6 meses (medio a&#241;o), podemos ver exactamente cu&#225;ndo y c&#243;mo tuvieron lugar muchas colaboraciones entre los talleres.</p>
<div type="3"><head>Cambiar la centralidad</head>
<p>Si bien no todo lo que se puede hacer con el an&#225;lisis de redes est&#225;ticas se puede replicar con los paquetes para el an&#225;lisis de redes temporales en R, s&#237; se pueden hacer la mayor&#237;a de los c&#225;lculos comunes para las propiedades de redes. Al igual que puedes analizar la centralidad a nivel de nodo o del conjunto de una red est&#225;tica, puedes analizar c&#243;mo cambia la centralidad a lo largo del tiempo con el an&#225;lisis de redes temporal. En vez de estudiar la centralidad de un taller o de un iluminador de manuscritos durante los sesenta a&#241;os de nuestros datos, puede que tenga sentido investigar c&#243;mo cambia la centralidad de la red cada a&#241;o, o si tus datos son escasos como los nuestros sobre manuscritos, puedes tomar un per&#237;odo de veinte a&#241;os para ver los cambios.</p>
<pre><code xml:id="code_analisis-temporal-red_13" type="block" corresp="code_analisis-temporal-red_13.txt"></code></pre>
<p>Esto genera un gr&#225;fico de la centralizaci&#243;n agregada cambiante de la red, que muestra c&#243;mo la centralizaci&#243;n intermedia de la red de manuscritos en colaboraci&#243;n alcanza su punto m&#225;ximo alrededor del a&#241;o 1280 y cae alrededor de 1300. [Nota de la T.: A&#241;adimos <code type="inline">xlab=</code> para cambiar la etiqueta del eje-x o eje horizontal].</p>
<figure><desc>Centralidad de intermediaci&#243;n de la red de talleres, 1260-1320</desc><graphic url="atr_1.png"/></figure>
<p>Tambi&#233;n es posible calcular y crear el gr&#225;fico de la m&#233;tricas a nivel de nodo a medida que cambian con el tiempo usando la funci&#243;n <code type="inline">tSnaStat()</code>, pero es una funci&#243;n computacional intensiva y producir&#225; errores si los nodos aparecen y desaparecen de la red.</p>
</div><div type="3"><head>Pensar en t&#233;rminos temporales: conjuntos alcanzables</head>
<p>Agregar un componente cronol&#243;gico a las mediciones de red est&#225;tica podr&#237;a ser suficiente para convencerte de que el an&#225;lisis de la red temporal merece un esfuerzo extra para tu proyecto. Pero el an&#225;lisis de redes temporal tambi&#233;n te permite analizar propiedades que <emph>solo</emph> ocurren en redes con informaci&#243;n temporal.</p>
<p>En una red temporal, puesto que los nodos y los v&#237;nculos aparecen y desaparecen todo el tiempo, puede ser &#250;til saber no s&#243;lo cu&#225;ntos nodos pueden conectarse con un nodo en un momento espec&#237;fico, sino que tambi&#233;n podemos saber cu&#225;ntos nodos estaban o estar&#225;n conectados a un nodo concreto a lo largo de la existencia de la red. Estos grupos pasados y futuros son conocidos como <hi rend="bold">conjuntos accesibles hacia atr&#225;s</hi> y <hi rend="bold">conjuntos alcanzables hacia adelante</hi>, respectivamente.</p>
<p>El tama&#241;o de estos conjuntos a&#241;ade informaci&#243;n importante a los c&#225;lculos de centralidad, dependiendo de si un taller vino a ocupar una posici&#243;n central en la red cerca del comienzo o del final del per&#237;odo que estamos observando, el impacto real que podr&#237;a haber tenido en la comunidad es totalmente diferente. Puede ser &#250;til pensar en esto en t&#233;rminos epidemiol&#243;gicos: una persona que se infecta con la enfermedad de una epidemia relativamente pronto podr&#237;a tener un impacto mucho mayor en su propagaci&#243;n que una persona que se infecta relativamente tarde.</p>
<p>Para analizar nuestra red de talleres de iluminadores, podemos preguntarnos qu&#233; talleres pudieron tener un mayor impacto en las modas de producci&#243;n de manuscritos como consecuencia de su propia colaboraci&#243;n y las colaboraciones entre los iluminadores y los talleres que colaboraron con ellos, etc. Este grupo de todos los talleres e iluminadores que tocaron directa e indirectamente es conocido como el conjunto alcanzable hacia adelante.</p>
<p>Para calcular el tama&#241;o del conjunto alcanzable hacia adelante de cada nodo, podemos usar la funci&#243;n <code type="inline">tReach()</code> en nuestra red. Por defecto, esta funci&#243;n calcula el tama&#241;o de un conjunto accesible hacia adelante de un nodo dado, por tanto, para calcular el conjunto hacia atr&#225;s simplemente especificamos la direcci&#243;n con <code type="inline">direction = "bkwd"</code> (de <emph>backward</emph>).</p>
<pre><code xml:id="code_analisis-temporal-red_14" type="block" corresp="code_analisis-temporal-red_14.txt"></code></pre>
<p>Esto produce un gr&#225;fico de los tama&#241;os de los conjuntos accesibles hacia adelante y hacia atr&#225;s para cada taller o iluminador. A partir de este gr&#225;fico podemos tener una idea de qui&#233;n estaba en posici&#243;n de tener un mayor impacto en la red en funci&#243;n del alcance hacia adelante y qui&#233;n estaba bien conectado con sus predecesores en funci&#243;n de sus colaboraciones.</p>
<figure><desc>Tama&#241;o de conjuntos accesibles hacia adelante y hacia atr&#225;s de talleres/iluminadores</desc><graphic url="atr_2.png"/></figure>
<p>Tambi&#233;n podemos visualizar estos conjuntos utilizando la funci&#243;n <code type="inline">tPath()</code> para encontrar la ruta que conecta un nodo concreto a sus conjuntos hacia atr&#225;s y hacia adelante, y la funci&#243;n <code type="inline">plotPaths()</code> para crear un gr&#225;fico donde se represente en el conjunto de la red. En el siguiente ejemplo, vamos a escoger un &#250;nico taller - el de Hospitaller Master, seleccionado por su identificaci&#243;n de v&#233;rtice n&#250;mero 3 - y visualizamos su conjunto accesible hacia adelante (con "fwd" de <emph>forward</emph>).</p>
<pre><code xml:id="code_analisis-temporal-red_15" type="block" corresp="code_analisis-temporal-red_15.txt"></code></pre>
<p>Esto produce una visualizaci&#243;n del alcance de Hospitaller Master y su taller hacia futuro basado en la cronolog&#237;a de sus colaboraciones.</p>
<figure><desc>La ruta de acceso hacia delante de Hospitaller Master, con etiquetas del tiempo transcurrido en los v&#237;nculos</desc><graphic url="tna_with_r_7.png"/></figure>
<p>Podemos ver que Hospitaller Master ten&#237;a una posici&#243;n favorable para tener un impacto considerable en el futuro de la iluminaci&#243;n de manuscritos en la regi&#243;n de Par&#237;s a trav&#233;s de su trabajo colaborativo. Este potencial de impacto se debi&#243; no s&#243;lo a su posici&#243;n dentro de la red, sino tambi&#233;n al desarrollo de la red en el tiempo.</p>
<p>Si las etiquetas num&#233;ricas que muestran el tiempo transcurrido por cada colaboraci&#243;n te molesta, puedes hacerlas transparentes a&#241;adiendo  <code type="inline">edge.lable.col = rgb (0,0,0,0)</code> (color de la etiqueta del v&#237;nculo = valor de color 0) a la funci&#243;n <code type="inline">plotPaths()</code>.</p>
<figure><desc>La ruta de acceso hacia delante de Hospitaller Master, sin la etiqueta de los v&#237;nculos</desc><graphic url="tna_with_r_8.png"/></figure>
<p>Si, por otro lado, nos interesara ver la red de colaboraci&#243;n entre talleres que prepar&#243; el camino para el surgimiento de Hospitaller Master, podemos ver su conjunto accesible hacia atr&#225;s. Usando <code type="inline">tpath()</code> de nuevo, usamos <code type="inline">direction = "bkwd"</code> y <code type="inline">type = "latest.depart"</code> para encontrar las rutas formadas por colaboraciones anteriores en manuscritos. Para distinguir visualmente esto de su alcance hacia el futuro, usamos la propiedad <code type="inline">path.col</code> para poner en azul las rutas del pasado en vez de rojo.</p>
<pre><code xml:id="code_analisis-temporal-red_16" type="block" corresp="code_analisis-temporal-red_16.txt"></code></pre>
<p>El resultado ser&#225; algo as&#237;:</p>
<figure><desc>La ruta de acceso hacia el pasado de Hospitaller Master</desc><graphic url="tna_with_r_9.png"/></figure>
<p>Podemos ver que el conjunto accesible hacia atr&#225;s de Hospitaller Master era un grupo central en la comunidad de talleres parisinos. Debido a que este taller particip&#243; activamente en producciones colaborativas entre alrededor de 1260 y 1290, durante la primera mitad del per&#237;odo que estamos estudiando, puede que no nos sorprenda del todo que su alcance hacia futuro sea mayor que su alcance hacia el pasado. Sin embargo, dada la centralidad de Hospitaller Master, ambos conjuntos pueden parecer m&#225;s peque&#241;os de lo esperado.</p>
<p>Al igual que las m&#233;tricas realizadas con anterioridad a las redes temporales, estas rutas hacia adelante y hacia atr&#225;s proporcionan un contrapunto a las m&#233;tricas de red est&#225;ticas. En el caso de los iluminadores franceses del medievo, podr&#237;amos observar que algunos talleres con una centralidad relativamente alta tienen conjuntos hacia futuro peque&#241;os pero conjuntos del pasado grandes. Estos iluminadores colaboraron activamente con otros talleres durante el &#250;ltimo tercio del per&#237;odo en cuesti&#243;n. Esto puede ayudarnos a contextualizar cualquier conclusi&#243;n que extraigamos de su centralidad.</p>
<p>Si ya hab&#237;amos observado ciertas caracter&#237;sticas dentro de los manuscritos producidos por Hospitaller Master y sus colaboradores, estos conjuntos nos pueden ayudar a formular nuevas preguntas sobre si &#233;l fue el origen de ideas y t&#233;cnicas innovadoras, o si jug&#243; un papel importante en diseminarlas. Como siempre, es importante tener en cuenta que las m&#233;tricas de redes como el grado de centralidad y sus alcances representan el potencial de transmisi&#243;n de ideas y conceptos m&#225;s que una transmisi&#243;n concreta como tal.<ref type="footnotemark" target="#6"/></p>
</div></div>
      <div type="2"><head>Conclusi&#243;n</head>
<p>Vamos a dar un paso atr&#225;s y reflexionar sobre lo que hemos aprendido. En este momento tenemos una idea de c&#243;mo estructurar los datos de la red temporal y qu&#233; tipo de decisiones tenemos que tomar para producirlos. Hemos aprendido a crear visualizaciones din&#225;micas y est&#225;ticas que muestran los cambios de una red en el tiempo. Sabemos que las m&#233;tricas de redes est&#225;ticas, como el alcance, toman diferentes propiedades en el contexto de redes temporales. Podemos ver el tama&#241;o del alcance pasado y futuro de cada nodo en un gr&#225;fico y visualizar las rutas que forman estos conjuntos.</p>
<p>Si hay algo que espero que hayas aprendido con este tutorial es la idea de que agregar datos temporales a los nodos y a los v&#237;nculos transforma una herramienta general de las ciencias sociales en un m&#233;todo &#250;til para la argumentaci&#243;n hist&#243;rica. La comparaci&#243;n de estructuras de red y las m&#233;tricas para comparar intervalos de tiempo les da significaci&#243;n hist&#243;rica que puede ser dif&#237;cil o imposible de discernir en los an&#225;lisis de redes sociales est&#225;ticos tradicionales.</p>
<p>Este tutorial ha presentado solo algunas de las muchas herramientas y t&#233;cnicas que se pueden usar para el an&#225;lisis de redes temporal. Un &#225;rea especialmente interesante de este campo es la simulaci&#243;n din&#225;mica que modela la transmisi&#243;n de algo como, por ejemplo, una enfermedad o una idea entre individuos dentro de una red temporal. Si eso te suena interesante, echa un vistazo al paquete <link target="http://www.epimodel.org">EpiModel</link> (en ingl&#233;s) u otras herramientas creadas por los epidemi&#243;logos para modelar la difusi&#243;n dentro de redes din&#225;micas.</p>
<p>Dependiendo de los datos hist&#243;ricos con los que est&#233;s trabajando, el an&#225;lisis de redes temporal te puede ofrecer ideas importantes sobre c&#243;mo las propiedades de los nodos, sus v&#237;nculos y la red en su conjunto cambian a lo largo del tiempo. Tanto si decides o no dar el salto al an&#225;lisis de redes temporal, es &#250;til recordar que las redes de todo tipo son fen&#243;menos hist&#243;ricos que emergen, se desarrollan, se transforman m&#225;s all&#225; de su reconocimiento y desaparecen con el transcurso del tiempo.</p>
</div>
      <div type="2"><head>Lecturas complementarias</head>
<p>Si has hecho este tutorial pero todav&#237;a te sientes m&#225;s c&#243;modo/a usando una interfaz gr&#225;fica de usuario en vez de un entorno de programaci&#243;n como R Studio, hay algunos tutoriales de Gephi que presentan algunos conceptos b&#225;sicos:</p>
<ul>
<li><link target="https://seinecle.github.io/gephi-tutorials/generated-html/creating-a-simple-dynamic-network.html">Crear una red din&#225;mica simple</link> (en ingl&#233;s) de Cl&#233;ment Levallois.</li>
<li><link target="https://seinecle.github.io/gephi-tutorials/generated-html/converting-a-network-with-dates-into-dynamic.html">Convertir una red con fechas en una red din&#225;mica</link> (en ingl&#233;s) de Cl&#233;ment Levallois.</li>
<li>Ken Cherven hace un buen recorrido por el An&#225;lisis de Redes Din&#225;mico con Gephi en su libro <emph>Mastering Gephi Network Visualization</emph> (2015)</li>
</ul>
<p>Si tienes m&#225;s ganas de realizar an&#225;lisis de redes temporal con R, <link target="https://web.archive.org/web/20180423112846/http://statnet.csde.washington.edu/workshops/SUNBELT/current/ndtv/ndtv_workshop.html">este tutorial</link> (en ingl&#233;s) de Skye Bender-deMoll explica funciones adicionales y propiedades de los paquetes que hemos usado. Me sirvi&#243; como gu&#237;a para aprender sobre el an&#225;lisis de redes temporal, inspir&#225;ndome a escribir este tutorial.</p>
<p>Tambi&#233;n puedes adentrarte en la documentaci&#243;n de los paquetes <link target="https://cran.r-project.org/web/packages/networkDynamic/index.html">networkDynamic</link>, <link target="https://cran.r-project.org/web/packages/tsna/index.html">TSNA</link> y <link target="https://cran.r-project.org/web/packages/networkDynamic/index.html">NDTV</link>.</p>
</div>
      <div type="2"><head>Referencias</head>
<p><note id="1"> Se pueden representar estos datos en otros formatos (como por ejemplo con una <link target="https://es.wikipedia.org/wiki/Matriz_de_adyacencia">matriz de adyacencia</link> o una <link target="https://es.wikipedia.org/wiki/Lista_de_adyacencia">lista de adyacencia</link>) pero para el prop&#243;sito de transformar redes est&#225;ticas en din&#225;micas, conceptualizar y manipular los datos de la red en forma de una lista de nodos y conexiones puede ser m&#225;s sencillo.</note></p>
<p><note id="2"> Estos datos forman la base de un proyecto en el que estoy trabajando con Maeve Doyle, quien me ha ayudado a dar forma y mejorar mi idea sobre el an&#225;lisis temporal de redes. Provienen de un cat&#225;logo multivolumen magn&#237;fico de manuscritos franceses g&#243;ticos, de Alison Stones. Stones, Alison. 2013. <emph>Gothic manuscripts: 1260-1320</emph>. London: Harvey Miller Publishers.</note></p>
<p><note id="3"> Puesto que necesitas conservar datos temporales asociados con cada conexi&#243;n, convertir una red bimodal a una unimodal para realizar un an&#225;lisis temporal es algo m&#225;s complicado que hacer una representaci&#243;n est&#225;tica de una red bimodal.</note></p>
<p><note id="4"> Hay muchas formas de saber cu&#225;nta variaci&#243;n se perder&#225; en las diferentes m&#233;tricas de an&#225;lisis de la red como consecuencia de esta decisi&#243;n, pero son algo complicadas para incluirlas aqu&#237;.</note></p>
<p><note id="5"> Gracias a Rachel Starry por esta referencia, as&#237; como a los comentarios a un borrador de este tutorial. Kamada, T., and S. Kawai. 1989. &#8220;An Algorithm for Drawing General Undirected Graphs.&#8221; Information Processing Letters 31.1: 7-15.</note></p>
<p><note id="6"> Recomiendo el excelente ensayo "How Reliable are Centrality Measures for Data Collected from Fragmentary and Heterogeneous Historical Sources? A Case Study" de Marten D&#252;ring (en ingl&#233;s), pues demuestra claramente que los actores hist&#243;ricos que ocupaban posiciones centrales en las redes sociales ten&#237;an el potencial de usar sus conexiones o su control sobre las conexiones de otros de maneras &#250;nicas, pero no siempre ten&#237;an la motivaci&#243;n para hacerlo. D&#252;ring, Marten. &#8220;How Reliable Are Centrality Measures for Data Collected from Fragmentary and Heterogeneous Historical Sources? A Case Study.&#8221; In The Connected Past. Challenges to Network Studies in Archaeology and History, edited by Tom Brughmans, Anna Collar, and Fiona Coward, 85&#8211;102. Oxford: Oxford Publishing, 2016.</note></p>
</div>
    </body>
  </text>
</TEI>
