<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Cria&#231;&#227;o e Visualiza&#231;&#227;o de Ficheiros HTML com Python</title>
  <layout>lesson</layout>
  <slug>criacao-visualizacao-ficheiros-html-python</slug>
  <date>2012-07-17</date>
  <translation_date>2022-10-31</translation_date>
  <authors>William J. Turkel,Adam Crymble</authors>
  <reviewers>Jim Clifford</reviewers>
  <editors>Miriam Posner</editors>
  <translator>Felipe Lamarca</translator>
  <translation-editor>Jimmy Medeiros</translation-editor>
  <translation-reviewer>Gabriela Kucuruza,Ana Carolina Erthal</translation-reviewer>
  <difficulty>2</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/462</review-ticket>
  <activity>presenting</activity>
  <topics>python,website</topics>
  <abstract>Com esta li&#231;&#227;o aprender&#225; a criar ficheiros HTML com scripts Python e a usar o Python para abrir automaticamente um ficheiro HTML no Firefox.</abstract>
  <original>creating-and-viewing-html-files-with-python</original>
  <avatar_alt>Crian&#231;a desenhando numa t&#225;bua</avatar_alt>
  <doi>10.46430/phpt0030</doi>
</metadata>
  <text>
    <body>
      <div n="1"><head>Objetivos da Li&#231;&#227;o</head>
<p>Esta li&#231;&#227;o usa o Python para criar e visualizar um ficheiro HTML. Se escrever programas que produzem HTML, pode utilizar qualquer navegador para ver os seus resultados. Isso &#233; especialmente conveniente se o seu programa cria automaticamente hiperlinks ou entidades gr&#225;ficas, como gr&#225;ficos e diagramas.</p>
<p>Aqui ir&#225; aprender como criar ficheiros HTML com scripts Python e como utilizar o Python para abrir um ficheiro HTML automaticamente no Firefox.</p>
</div>
      <div n="1"><head>Ficheiros Necess&#225;rios para esta Li&#231;&#227;o</head>
<ul>
<li><code type="inline">obo.py</code></li>
</ul>
<p>Caso n&#227;o possua esses ficheiros da li&#231;&#227;o anterior, pode fazer o <emph>download</emph> do programming-historian-5, um <link target="/assets/python-lessons5.zip">ficheiro zip da li&#231;&#227;o anterior</link>.</p>
</div>
      <div n="1"><head>Criando HTML com Python</head>
<p>At&#233; aqui, aprendemos como usar o Python para fazer o <emph>download</emph> de fontes <emph>online</emph> e extrair informa&#231;&#227;o delas de forma autom&#225;tica. Lembre-se de que o nosso objetivo final &#233; incorporar perfeitamente a programa&#231;&#227;o em nossa pr&#225;tica de investiga&#231;&#227;o. Em linha com este objetivo, nesta li&#231;&#227;o e na pr&#243;xima aprenderemos como apresentar dados de volta &#224; forma de HTML. Isso possui algumas vantagens. Primeiro, ao armazenar a informa&#231;&#227;o no nosso disco r&#237;gido como um ficheiro HTML, podemos abri-lo com o Firefox e usar o <link target="https://www.zotero.org/">Zotero</link>, por exemplo, para indexar e fazer anota&#231;&#245;es posteriormente. Segundo, h&#225; uma ampla gama de op&#231;&#245;es de visualiza&#231;&#227;o para HTML que podemos usar mais tarde.</p>
<p>Caso ainda n&#227;o tenha feito o <link target="http://www.w3schools.com/html/default.asp">tutorial de HTML do W3 Schools</link>, reserve alguns minutos para faz&#234;-lo antes de continuar. Criaremos um documento HTML usando Python, ent&#227;o ser&#225; saber o que &#233; um documento HTML!</p>
</div>
      <div n="1"><head>"Ol&#225; mundo" em HTML usando Python</head>
<p>Uma das ideias mais poderosas na ci&#234;ncia da computa&#231;&#227;o &#233; que um ficheiro que parece conter c&#243;digo sob uma perspectiva pode ser visto como dados sob outra. &#201; poss&#237;vel, em outras palavras, escrever programas que manipulam outros programas. O que faremos a seguir &#233; criar um ficheiro HTML que diz "Ol&#225; mundo!" usando Python. Faremos isso armazenando <emph>tags</emph> HTML em uma string multilinha de Python e guardando os conte&#250;dos em um novo ficheiro. Esse ficheiro ser&#225; armazenado com uma extens&#227;o <code type="inline">.html</code> ao inv&#233;s de uma extens&#227;o <code type="inline">.txt</code>.</p>
<p>Tipicamente um ficheiro HTML come&#231;a com uma <link target="http://www.w3schools.com/tags/tag_doctype.asp">declara&#231;&#227;o do tipo de documento</link>. Vimos isso ao escrever um programa HTML "Ol&#225; mundo!" em uma li&#231;&#227;o anterior. Para facilitar a leitura do nosso c&#243;digo, omitiremos o <code type="inline">doctype</code> neste exemplo. Lembre-se de que uma string multilinha &#233; criada colocando o texto entre tr&#234;s aspas (veja abaixo):</p>
<pre><code class="language-python" xml:id="code_criacao-visualizacao-ficheiros-html-python_0" type="block" corresp="code_criacao-visualizacao-ficheiros-html-python_0.txt"></code></pre>
<p>Salve o programa acima como <code type="inline">write-html.py</code> e execute-o. Use <code type="inline">Ficheiro -&gt; Abrir</code> (ou <code type="inline">Arquivo -&gt; Abrir</code>, na vers&#227;o brasileira) no editor de texto de sua escolha para abrir <code type="inline">helloworld.html</code> para verificar que seu programa de fato criou o ficheiro. O conte&#250;do deve se parecer com isto:</p>
<figure><desc>Fonte HTML gerada pelo programa Python</desc><graphic url="hello-world-html.png"/></figure>
<p>Agora v&#225; para o seu navegador Firefox e escolha <code type="inline">Ficheiro -&gt; Nova Guia</code> (ou <code type="inline">Arquivo -&gt; Nova aba</code>, na vers&#227;o brasileira), v&#225; para a guia e escolha <code type="inline">Ficheiro -&gt; Abrir Ficheiro</code> (ou <code type="inline">Arquivo -&gt; Abrir arquivo</code>, na vers&#227;o brasileira). Selecione <code type="inline">helloworld.html</code>. Deve agora ser capaz de ver a sua mensagem no navegador. Reserve um momento para pensar sobre isso: agora tem a habilidade de escrever um programa que pode criar uma p&#225;gina web automaticamente. N&#227;o h&#225; raz&#227;o pela qual n&#227;o possa escrever um programa para criar automaticamente um <emph>site</emph> inteiro, caso deseje.</p>
<div class="alert alert-warning">
  Por quest&#245;es de versionamento, &#233; poss&#237;vel que o seu navegador Firefox n&#227;o possua a op&#231;&#227;o de abrir um ficheiro manualmente na guia. Nesse caso, procure pelo ficheiro HTML no seu diret&#243;rio, clique nele com o bot&#227;o direito e selecione a op&#231;&#227;o de abri-lo com o navegador Firefox. 
</div>
</div>
      <div n="1"><head>Usando o Python para Controlar o Firefox</head>
<p>N&#243;s criamos um ficheiro HTML automaticamente, mas depois precisamos deixar o nosso editor, ir para o Firefox e abrir o ficheiro em uma nova guia. N&#227;o seria melhor incluir essa etapa final no nosso programa Python? Digite ou copie o c&#243;digo abaixo e armazene-o como <code type="inline">write-html-2.py</code>. Quando execut&#225;-lo, ele deve criar o seu ficheiro HTML e depois abri-lo automaticamente numa nova guia do Firefox. Maravilha!</p>
<div n="2"><head>Instru&#231;&#245;es para Mac</head>
<p>Usu&#225;rios de Mac precisar&#227;o especificar a localiza&#231;&#227;o precisa do ficheiro <code type="inline">.html</code> nos seus computadores. Para fazer isso, localize a pasta <code type="inline">programming-historian</code> que criou para fazer esses tutoriais, clique com o bot&#227;o direito nela e selecione "Obter Informa&#231;&#245;es" (ou "<emph>Get Info</emph>").</p>
<p>Pode ent&#227;o recortar e colar a localiza&#231;&#227;o do ficheiro listado depois de "Onde:" (ou "<emph>Where:</emph>") e se certificar de incluir uma barra final (/) para que o computador saiba que deseja algo dentro desse diret&#243;rio (e n&#227;o o diret&#243;rio em si).</p>
<pre><code class="language-python" xml:id="code_criacao-visualizacao-ficheiros-html-python_1" type="block" corresp="code_criacao-visualizacao-ficheiros-html-python_1.txt"></code></pre>
<p>Caso receba um erro "Ficheiro n&#227;o encontrado" (ou "<emph>File not found</emph>"), significa que n&#227;o mudou o caminho para o ficheiro corretamente.</p>
</div><div n="2"><head>Instru&#231;&#245;es para Windows</head>
<pre><code class="language-python" xml:id="code_criacao-visualizacao-ficheiros-html-python_2" type="block" corresp="code_criacao-visualizacao-ficheiros-html-python_2.txt"></code></pre>
<p>***</p>
<p>No final, n&#227;o s&#243; escreveu um programa Python que pode criar um HTML simples, mas tamb&#233;m controlou o seu navegador Firefox utilizando Python. Na pr&#243;xima li&#231;&#227;o, focaremos em apresentar os dados que coletamos na forma de um ficheiro HTML.</p>
</div></div>
      <div n="1"><head>Leituras Sugeridas</head>
<ul>
<li>
Lutz, Learning Python<ul>
<li>Re-read and review Chs. 1-17</li>
</ul>
</li>
</ul>
</div>
      <div n="1"><head>Sincroniza&#231;&#227;o de C&#243;digo</head>
<p>Para acompanhar li&#231;&#245;es futuras, &#233; importante ter os ficheiros e programas corretos no seu diret&#243;rio &#8220;programming-historian&#8221;. No final de cada li&#231;&#227;o, &#233; poss&#237;vel fazer o <emph>download</emph> do ficheiro zip &#8220;programming-historian&#8221; para garantir que possui o c&#243;digo correto. Caso esteja acompanhando com a vers&#227;o para Mac / Linux, deve ter que abrir o ficheiro <code type="inline">obo.py</code> e mudar "file:///Users/username/Desktop/programming-historian/" para o caminho at&#233; o diret&#243;rio no seu pr&#243;prio computador.</p>
<ul>
<li><link target="/assets/python-lessons6.zip">python-lessons6.zip</link></li>
</ul>
</div>
    </body>
  </text>
</TEI>
