<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="reutilizando-colecciones-digitales-glam-labs">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Reutilizar colecciones digitales: GLAM Labs</title>
  <author role="original_author"><persName>Gustavo Candela</persName><persName>Mar&#237;a Dolores S&#225;ez</persName><persName>Mar&#237;a Pilar Escobar</persName><persName>Manuel Marco Such</persName></author><editor role="reviewers"><persName>Silvia Guti&#233;rrez De la Torre</persName><persName>V&#237;ctor Gayol</persName></editor><editor role="editors"><persName>M</persName><persName>a</persName><persName>r</persName><persName>i</persName><persName>a</persName><persName> </persName><persName>J</persName><persName>o</persName><persName>s</persName><persName>&#233;</persName><persName> </persName><persName>A</persName><persName>f</persName><persName>a</persName><persName>n</persName><persName>a</persName><persName>d</persName><persName>o</persName><persName>r</persName><persName>-</persName><persName>L</persName><persName>l</persName><persName>a</persName><persName>c</persName><persName>h</persName></editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0054</idno><date type="published">08/30/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. This lesson is original.</p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Esta lecci&#243;n muestra c&#243;mo reutilizar colecciones digitales publicadas por instituciones de patrimonio cultural.</p></abstract><textClass><keywords><term xml:lang="en">data-manipulation</term><term xml:lang="en">python</term><term xml:lang="en">lod</term><term xml:lang="en">data-visualization</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Objetivos de la lecci&#243;n</head>
<p>Esta lecci&#243;n muestra c&#243;mo reutilizar colecciones digitales publicadas por instituciones de patrimonio cultural y tiene como objetivos principales los siguientes:</p>
<list type="unordered">
<item>Conocer qu&#233; es un Lab en el marco de una instituci&#243;n GLAM</item>
<item>Reutilizar de forma innovadora y creativa colecciones digitales</item>
<item>Enriquecer los datos a trav&#233;s de diferentes t&#233;cnicas</item>
</list>
</div>
      <div type="2"><head>Prerrequisitos</head>
<p>En esta lecci&#243;n asumimos que tienes cierto conocimiento sobre <ref target="https://es.wikipedia.org/wiki/Python">Python</ref>. Si conoces otro lenguaje de programaci&#243;n tambi&#233;n te ser&#225; &#250;til. Si necesitas un lugar donde empezar, te recomendamos trabajar con los excelentes tutoriales sobre Python con los que cuenta  <ref target="/es/lecciones/?topic=python">Programming Historian en espa&#241;ol</ref>. Tambi&#233;n necesitar&#225;s conocimientos sobre <ref target="https://es.wikipedia.org/wiki/Proyecto_Jupyter">Jupyter Notebooks</ref>, para ello te recomendamos la lecci&#243;n <ref target="/en/lessons/jupyter-notebooks">Introduction to Jupyter Notebooks</ref>. Adem&#225;s, para los ejemplos de reutilizaci&#243;n, ser&#225; necesario tener algunos conocimientos sobre <ref target="https://es.wikipedia.org/wiki/Est%C3%A1ndares_MARC#MARC-XML">MARCXML</ref>, <ref target="https://es.wikipedia.org/wiki/Datos_enlazados">Linked Open Data</ref> y <ref target="https://es.wikipedia.org/wiki/SPARQL">SPARQL</ref>; para esto te recomendamos la lecci&#243;n de <ref target="/es/lecciones/introduccion-datos-abiertos-enlazados">datos abiertos enlazados</ref>.</p>
</div>
      <div type="2"><head>Introducci&#243;n</head>
<p>Tradicionalmente las instituciones de patrimonio cultural conocidas como <ref target="https://es.wikipedia.org/wiki/GLAM_(cultura)">GLAM</ref> (del ingl&#233;s, <emph>Galleries, Libraries, Archives and Museums</emph>) han publicado colecciones digitales que incluyen todo tipo de materiales con el objetivo de facilitar a la sociedad el acceso a la informaci&#243;n.
El avance de las tecnolog&#237;as ha favorecido un nuevo contexto en el que las colecciones digitales pueden ser utilizadas en investigaci&#243;n por medio de diferentes m&#233;todos, como visi&#243;n por computador o t&#233;cnicas de aprendizaje autom&#225;tico. Actualmente, las instituciones GLAM promueven e incentivan la reutilizaci&#243;n de sus colecciones digitales a trav&#233;s de programas de colaboraci&#243;n directa con investigadores pero tambi&#233;n con empresas e instituciones acad&#233;micas.</p>
<p>Las instituciones de patrimonio cultural han comenzado a experimentar de forma creativa e innovadora con las colecciones digitales, que tradicionalmente han puesto a disposici&#243;n del p&#250;blico, lo que ha favorecido la creaci&#243;n de nuevos espacios en el seno de las instituciones, conocidos como "Labs".
Uno de los primeros, l&#237;der en este &#225;mbito, y que ha establecido las bases para el resto, es el de la <ref target="http://labs.bl.uk">Biblioteca Brit&#225;nica</ref>, financiado por la <ref target="https://mellon.org/">Mellon Foundation</ref>. Como resultado de dos encuentros de car&#225;cter internacional en la sede de la Biblioteca Brit&#225;nica y en la <ref target="https://www.kb.dk/en">Biblioteca Real de Dinamarca</ref>, en Copenhague, se cre&#243; la <ref target="https://glamlabs.io">Comunidad Internacional GLAM Labs</ref> compuesta por numerosas instituciones, que se muestran en la Figura 1.</p>
<figure><desc>Mapa que representa las instituciones de la Comunidad Internacional GLAM Labs</desc><graphic url="reutilizando-colecciones-digitales-glam-labs1.png"/></figure>
<p>En septiembre de 2019, diecis&#233;is personas pertenecientes a dicha comunidad se reunieron en Doha, Catar, para escribir, a partir de la metodolog&#237;a <ref target="https://www.booksprints.net/book/book-sprint-open-a-glam-lab/">Book Sprint</ref>, el libro <ref target="https://glamlabs.io/books/open-a-glam-lab/">Open a GLAM Lab</ref> que actualmente ha sido traducido a diversos idiomas, entre ellos <ref target="http://rua.ua.es/dspace/handle/10045/110281">espa&#241;ol</ref> y <ref target="https://qspace.qu.edu.qa/handle/10576/13484">&#225;rabe</ref>.</p>
<p>Una colecci&#243;n digital publicada por una instituci&#243;n GLAM puede estar formada por cualquier tipo de contenido incluyendo metadatos, textos, im&#225;genes, mapas, videos o audios. En este sentido, reutilizar una colecci&#243;n digital consiste en analizar el contenido para adquirir nuevo conocimiento. El an&#225;lisis puede constar de fases tales como extracci&#243;n, transformaci&#243;n y enriquecimiento. Como resultado podemos obtener una nueva colecci&#243;n descrita con otro vocabulario m&#225;s expresivo y rico, una visualizaci&#243;n que facilite el descubrimiento de conocimiento, o una agregaci&#243;n de diferentes colecciones digitales basadas en un tema espec&#237;fico.</p>
<p>A la hora de reutilizar una colecci&#243;n digital existen diferentes aspectos que deben ser tenidos en cuenta, como por ejemplo la licencia o el tipo de material. Las instituciones han comenzado a utilizar licencias abiertas, pero en algunos casos la licencia no es evidente, lo que impide su reutilizaci&#243;n. Dependiendo del m&#233;todo de investigaci&#243;n a aplicar ser&#225; necesario un tipo espec&#237;fico de material. Por ejemplo, si deseamos realizar reconocimiento de formas necesitaremos un repositorio que se base en im&#225;genes.</p>
<p>Recientemente se public&#243; el estudio <emph><ref target="https://collectionsasdata.github.io/">Collections as data</ref></emph>, que proporciona un nuevo enfoque para publicar las colecciones digitales que facilitan el procesamiento por parte de las computadoras. Por ejemplo, es posible utilizar un corpus de miles de textos para identificar personas o lugares de forma autom&#225;tica. Las computadoras permiten la aplicaci&#243;n de m&#233;todos de investigaci&#243;n en Humanidades Digitales como <ref target="https://es.wikipedia.org/wiki/Miner%C3%ADa_de_textos">miner&#237;a de textos</ref>, <ref target="https://es.wikipedia.org/wiki/Visualizaci%C3%B3n_de_datos">visualizaci&#243;n de datos</ref> o el uso de <ref target="https://es.wikipedia.org/wiki/Sistema_de_informaci%C3%B3n_geogr%C3%A1fica">Sistemas de Informaci&#243;n Geogr&#225;fica (SIG)</ref>, como tambi&#233;n <ref target="https://es.wikipedia.org/wiki/Procesamiento_de_lenguajes_naturales">procesamiento de lenguaje natural</ref>, <ref target="https://es.wikipedia.org/wiki/Inteligencia_artificial">inteligencia artificial</ref> y <ref target="https://es.wikipedia.org/wiki/Visi%C3%B3n_artificial">visi&#243;n por computador</ref>.</p>
<p>La combinaci&#243;n de las colecciones digitales proporcionadas por las instituciones GLAM, junto a c&#243;digo y narrativa, proporcionan el marco ideal para la reproducci&#243;n de los resultados de investigaci&#243;n. En este sentido, los Jupyter Notebooks permiten integrar estos tres elementos y se han convertido en un recurso muy popular tanto en la comunidad investigadora como en la educativa. Numerosos proyectos se centran en la publicaci&#243;n de colecciones de notebooks, como por ejemplo <ref target="https://glam-workbench.github.io/">GLAM Workbench</ref> o <ref target="http://data.cervantesvirtual.com/blog/notebooks/">GLAM Jupyter Notebooks</ref>. Los Labs favorecen un espacio para poner de manifiesto estas nuevas tendencias para mejorar y mantener la relevancia de las instituciones de patrimonio cultural.</p>
<p>En esta lecci&#243;n se incluyen varias opciones para localizar colecciones digitales publicadas por instituciones GLAM para su reutilizaci&#243;n. A continuaci&#243;n, se introducen dos ejemplos implementados como Jupyter Notebooks que muestran de forma reproducible c&#243;mo reutilizar las colecciones digitales a trav&#233;s de diferentes t&#233;cnicas que se encuentran disponibles en <ref target="https://zenodo.org/record/5340157">Zenodo</ref><ref type="footnotemark" target="#note_1"/>. El &#250;ltimo apartado corresponde a las conclusiones.</p>
</div>
      <table>
<row>
<cell role="label">Instituci&#243;n</cell>
<cell role="label">Colecci&#243;n</cell>
<cell role="label">URL</cell>
</row>
<row>
<cell>State Library New South Wales</cell>
<cell>DX Lab</cell>
<cell><ref target="https://dxlab.sl.nsw.gov.au">https://dxlab.sl.nsw.gov.au</ref></cell>
</row>
<row>
<cell>Staatsbibliothek zu Berlin</cell>
<cell>SBB Labs</cell>
<cell><ref target="https://lab.sbb.berlin/?lang=en">https://lab.sbb.berlin/?lang=en</ref></cell>
</row>
<row>
<cell>&#214;sterreichische Nationalbibliothek</cell>
<cell>ONB Labs</cell>
<cell><ref target="https://labs.onb.ac.at/en/">https://labs.onb.ac.at/en/</ref></cell>
</row>
<row>
<cell>Library of Congress</cell>
<cell>LC Labs</cell>
<cell><ref target="https://labs.loc.gov/data-for-exploration">https://labs.loc.gov/data-for-exploration</ref></cell>
</row>
<row>
<cell>National Library of Scotland</cell>
<cell>Data Foundry</cell>
<cell><ref target="https://data.nls.uk/">https://data.nls.uk/</ref></cell>
</row>
<row>
<cell>National Library of Netherlands</cell>
<cell>KB Lab</cell>
<cell><ref target="https://lab.kb.nl/">https://lab.kb.nl/</ref></cell>
</row>
<row>
<cell>History Trust of South Australia</cell>
<cell>Learn section</cell>
<cell><ref target="https://history.sa.gov.au/">https://history.sa.gov.au/</ref></cell>
</row>
<row>
<cell>Europeana</cell>
<cell>Europeana IIIF APIs</cell>
<cell><ref target="https://pro.europeana.eu/page/iiif">https://pro.europeana.eu/page/iiif</ref></cell>
</row>
<row>
<cell>Det Kgl. Bibliotek</cell>
<cell>KB Labs</cell>
<cell><ref target="https://labs.kb.dk/">https://labs.kb.dk/</ref></cell>
</row>
<row>
<cell>Biblioteca Virtual Miguel de Cervantes</cell>
<cell>BVMC Labs</cell>
<cell><ref target="http://data.cervantesvirtual.com/blog/labs">http://data.cervantesvirtual.com/blog/labs</ref></cell>
</row>
<row>
<cell>British Library</cell>
<cell>BL Labs</cell>
<cell>[temporalmente no disponible]</cell>
</row>
<row>
<cell>Biblioth&#232;que Nationale du Luxembourg</cell>
<cell>BnL Open Data</cell>
<cell><ref target="https://data.bnl.lu/">https://data.bnl.lu/</ref></cell>
</row>
<row>
<cell>Bibliot&#232;que Nationale de France</cell>
<cell>BnF API et jeux de donn&#233;es</cell>
<cell><ref target="http://api.bnf.fr/">http://api.bnf.fr/</ref></cell>
</row>
</table>
      <div type="2"><head>Extracci&#243;n y visualizaci&#243;n de datos</head>
<p>Para este ejemplo vamos a utilizar la colecci&#243;n <ref target="https://data.nls.uk/data/metadata-collections/moving-image-archive/">Moving Image Archive</ref> proporcionada por el <ref target="https://data.nls.uk/">Data Foundry de la Biblioteca Nacional de Escocia</ref>, publicada bajo dominio p&#250;blico y que contiene alrededor de 6.000 registros descritos con el est&#225;ndar <ref target="https://www.loc.gov/standards/marcxml/">MARC 21 XML</ref>. Esta colecci&#243;n contiene informaci&#243;n sobre im&#225;genes en movimiento como v&#237;deos, pel&#237;culas y documentales, que est&#225;n relacionadas con Escocia y que fueron creadas por aficionados o profesionales. Este ejemplo est&#225; disponible en <ref target="https://zenodo.org/record/5340157">Zenodo</ref> y puede ser ejecutado en <ref target="https://mybinder.org/v2/zenodo/10.5281/zenodo.5340157/">MyBinder</ref>.</p>
<p>Para poder procesar de forma sencilla la colecci&#243;n digital vamos a cambiar de MARCXML a un formato m&#225;s sencillo de manipular como el <ref target="https://es.wikipedia.org/wiki/Valores_separados_por_comas">CSV</ref>. Posteriormente, haciendo uso de varias librer&#237;as, es posible identificar y obtener un listado de los temas, favoreciendo as&#237; el descubrimiento de nuevo conocimiento.</p>
<p>En primer lugar, importamos las librer&#237;as que vamos a necesitar para trabajar con la colecci&#243;n, incluyendo librer&#237;as para el manejo de MARC<ref type="footnotemark" target="#note_2"/>, CSV, <ref target="https://es.wikipedia.org/wiki/Expresi%C3%B3n_regular">expresiones regulares</ref>, visualizaci&#243;n y empaquetado de datos. El uso de Binder nos facilita la ejecuci&#243;n sin necesidad de instalar ning&#250;n software; sin embargo, si deseamos ejecutar la colecci&#243;n de Jupyter Notebooks en nuestro ordenador es necesario instalar cada librer&#237;a mediante el comando pip (por ejemplo, <code rend="inline">pip install pymarc</code>). Si quieres conocer m&#225;s detalles sobre este comando, te recomendamos la lecci&#243;n <ref target="/es/lecciones/instalar-modulos-python-pip">instalar m&#243;dulos de Python con pip</ref>.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_0" corresp="code_reutilizando-colecciones-digitales-glam-labs_0.txt" lang="language-python" rend="block"/></ab>
<p>Despu&#233;s, creamos un fichero CSV con el contenido de la colecci&#243;n descrito en MARCXML y que previamente hemos descargado. El fichero CSV debe incluir la cabecera con los campos que vamos a extraer.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_1" corresp="code_reutilizando-colecciones-digitales-glam-labs_1.txt" lang="language-python" rend="block"/></ab>
<p>A continuaci&#243;n, comenzamos a extraer la informaci&#243;n del fichero MARCXML. El formato <ref target="https://es.wikipedia.org/wiki/MARC_21">MARC21</ref> facilita la descripci&#243;n de los registros bibliogr&#225;ficos, estructur&#225;ndolos en campos (que identifica mediante n&#250;meros) y subcampos (que identifica por caracteres). Por ejemplo, el campo <code rend="inline">245 $a</code> corresponde al t&#237;tulo principal de una obra y el campo <code rend="inline">100 $a</code> representa su autor principal. Como se observa en el siguiente fragmento de c&#243;digo, mediante la librer&#237;a pymarc recorremos los registros y localizamos los campos que deseamos recuperar mediante sus identificadores para generar y almacenar el resultado en el fichero CSV.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_2" corresp="code_reutilizando-colecciones-digitales-glam-labs_2.txt" lang="language-python" rend="block"/></ab>
<p>Una vez que ya hemos generado el fichero CSV, podemos cargarlo mediante la librer&#237;a <ref target="https://pandas.pydata.org/docs/index.html">Pandas</ref><ref type="footnotemark" target="#note_3"/>, que permite cargar y manipular datos tabulados por medio de su estructura b&#225;sica: el DataFrame.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_3" corresp="code_reutilizando-colecciones-digitales-glam-labs_3.txt" lang="language-python" rend="block"/></ab>
<p>Para ver el contenido del DataFrame debemos mostrar la variable <code rend="inline">df</code>, como se ilustra en la Figura 2. Tambi&#233;n podemos comprobar las columnas existentes, as&#237; como el n&#250;mero de registros.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_4" corresp="code_reutilizando-colecciones-digitales-glam-labs_4.txt" lang="language-python" rend="block"/></ab>
<figure><desc>Primeras cinco filas del contenido del DataFrame</desc><graphic url="reutilizando-colecciones-digitales-glam-labs2.png"/></figure>
<p>Tambi&#233;n podemos mostrar las columnas que tiene nuestro fichero CSV con el m&#233;todo <code rend="inline">df.columns</code>, como se observa en la Figura 3. Para obtener el n&#250;mero de registros en nuestro DataFrame ejecutamos el comando <code rend="inline">len(df)</code>.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_5" corresp="code_reutilizando-colecciones-digitales-glam-labs_5.txt" lang="language-python" rend="block"/></ab>
<figure><desc>Nombres de las columnas incluidas en el DataFrame</desc><graphic url="reutilizando-colecciones-digitales-glam-labs3.png"/></figure>
<p>Pandas permite la manipulaci&#243;n y visualizaci&#243;n del DataFrame de diferentes formas. Por ejemplo, podemos identificar la lista de materias (corresponde a la columna materias) y ordenarla alfab&#233;ticamente.</p>
<p>Cada registro contiene el metadato materia que consiste en un listado de elementos separados por dos guiones. Por ejemplo, <code rend="inline">Ceremonies -- Emotions, Attitudes and Behaviour -- Local Government -- Transport -- Edinburgh -- amateur</code>. Pandas permite dividir este tipo de cadenas para tratar los elementos individuales mediante el comando <ref target="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.split.html">split</ref>, que recibe como par&#225;metros el car&#225;cter a usar para dividir la cadena de texto y mediante la opci&#243;n <code rend="inline">expand=True</code> crea una nueva columna para cada elemento. El m&#233;todo <ref target="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.stack.html">stack</ref>, por su parte, permite convertir las columnas a un &#237;ndice. El resto de c&#243;digo ordena alfab&#233;ticamente los elementos, como se puede observar en la Figura 4.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_6" corresp="code_reutilizando-colecciones-digitales-glam-labs_6.txt" lang="language-python" rend="block"/></ab>
<figure><desc>Listado de materias ordenadas alfab&#233;ticamente</desc><graphic url="reutilizando-colecciones-digitales-glam-labs4.png"/></figure>
<p>Con el objetivo de demostrar que el c&#243;digo se puede adaptar y modificar a otras colecciones digitales, se ha incluido un ejemplo adicional basado en la <ref target="https://datos.gob.es/es/catalogo/e00123904-bibliografia-espanola-de-cartografia-2017">Bibliograf&#237;a Espa&#241;ola de Cartograf&#237;a</ref> de la Biblioteca Nacional de Espa&#241;a, que incluye mapas, planos, cartas n&#225;uticas, atlas, etc&#233;tera, tanto en formato impreso como electr&#243;nico. Tras el an&#225;lisis de las materias se obtiene que la mayor&#237;a de los registros tratan sobre mapas, excursionismo, carreteras, senderismo, planos y comercio.</p>
<p>De forma adicional y para quienes quieran profundizar en la reutilizaci&#243;n de estas dos colecciones, los ejemplos proporcionan la documentaci&#243;n necesaria para identificar y visualizar la frecuencia de t&#243;picos, lo que puede ser interesante para una primera exploraci&#243;n de los metadatos. Para realizar el proceso completo es necesario consultar los Jupyter Notebooks dedicados a estos dos ejemplos que se encuentran en <ref target="https://zenodo.org/record/5340157">Zenodo</ref> y que se pueden ejecutar en <ref target="https://mybinder.org/v2/zenodo/10.5281/zenodo.5340157/">Binder</ref>.</p>
</div>
      <div type="2"><head>Crear mapas a partir de Linked Open Data</head>
<p>Para el segundo ejemplo nos vamos a basar en un repositorio creado mediante tecnolog&#237;as avanzadas, como <ref target="https://es.wikipedia.org/wiki/Datos_enlazados#Proyecto_de_comunidad_para_la_inter-conexi%C3%B3n_de_datos_abiertos">Linked Open Data</ref>. Puedes consultar m&#225;s informaci&#243;n sobre Linked Open Data y <ref target="https://es.wikipedia.org/wiki/SPARQL">SPARQL</ref> en la lecci&#243;n de <ref target="/es/lecciones/introduccion-datos-abiertos-enlazados">datos abiertos enlazados</ref>.</p>
<p>La plataforma <ref target="https://bnb.data.bl.uk/">BNB Linked Data</ref> provee acceso a la <ref target="https://bnb.data.bl.uk/">British National Bibliography (BNB)</ref> como Linked Open Data proporcionando acceso a trav&#233;s de SPARQL.
Este ejemplo se basa en la recuperaci&#243;n de localizaciones geogr&#225;ficas relacionadas con las obras de un autor. La localizaci&#243;n corresponde al lugar de publicaci&#243;n original de una obra en particular. Una vez recuperadas las localizaciones, y gracias a que los datos est&#225;n enlazados a <ref target="https://www.geonames.org/">GeoNames</ref>, es posible obtener informaci&#243;n adicional sobre esa localizaci&#243;n, como por ejemplo la latitud y longitud, que nos servir&#225; para representarla en un mapa.</p>
<p>En este sentido, este ejemplo pretende introducir los pasos necesarios para reutilizar una colecci&#243;n digital publicada, siguiendo los principios de Linked Open Data que facilitan el establecimiento de enlaces a repositorios externos. Los repositorios sem&#225;nticos publicados por instituciones GLAM son una fuente de informaci&#243;n de gran valor que se encuentran a disposici&#243;n de los investigadores sin ning&#250;n tipo de restricci&#243;n para su uso. Sin embargo, su reutilizaci&#243;n no es sencilla ya que requiere conocimientos avanzados en tecnolog&#237;as como <ref target="https://es.wikipedia.org/wiki/Resource_Description_Framework">RDF</ref> (del ingl&#233;s Resource Description Framework) o SPARQL para poder realizar las consultas.</p>
<p>Este ejemplo utiliza los metadatos del repositorio que indican localizaciones, como por ejemplo las propiedades <code rend="inline">blt:publication</code> y <code rend="inline">blt:projectedPublication</code> que indican lugares de publicaci&#243;n. Gracias a que los registros est&#225;n enlazados a GeoNames, vamos a poder acceder a Wikidata para recuperar las coordenadas geogr&#225;ficas de las localizaciones y mostrar los beneficios de Linked Open Data. El vocabulario utilizado por BNB Linked Data es <ref target="http://bibliontology.com/">Bibliographic Ontology (BIBO)</ref> que es un vocabulario sencillo que permite describir los metadatos de un repositorio bibliogr&#225;fico.</p>
<p>En primer lugar, importamos las librer&#237;as necesarias para procesar esta colecci&#243;n: <ref target="https://pypi.org/project/folium/0.1.4/">folium</ref><ref type="footnotemark" target="#note_4"/> para visualizar informaci&#243;n geogr&#225;fica en un mapa; csv y json para el procesamiento de los formatos de entrada y salida; request para la realizaci&#243;n de peticiones HTTP; pandas para la gesti&#243;n de datos tabulares con columnas de tipo heterog&#233;neo y <ref target="https://matplotlib.org/">matplotlib</ref><ref type="footnotemark" target="#note_5"/> para la creaci&#243;n de gr&#225;ficas.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_7" corresp="code_reutilizando-colecciones-digitales-glam-labs_7.txt" lang="language-python" rend="block"/></ab>
<p>A continuaci&#243;n, vemos un ejemplo de consulta SPARQL que recupera las obras publicadas en un lugar en concreto: &#8220;York&#8221;. Las sentencias SPARQL de este apartado las podemos ejecutar en el punto de acceso <ref target="https://bnb.data.bl.uk/flint-sparql">SPARQL</ref>, como se observa en la Figura 5.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_8" corresp="code_reutilizando-colecciones-digitales-glam-labs_8.txt" lang="language-sql" rend="block"/></ab>
<figure><desc>Punto de acceso SPARQL para la plataforma BNB Linked Data</desc><graphic url="reutilizando-colecciones-digitales-glam-labs5.png"/></figure>
<p>En el modelo de la plataforma BNB Linked Data, un recurso de tipo publicaci&#243;n contiene una propiedad <code rend="inline">c4dm:place</code> que enlaza a GeoNames en alrededor de cuatro millones de registros (un 50% del cat&#225;logo completo). Sin embargo, el resultado de la sentencia SPARQL anterior no proporciona las coordenadas geogr&#225;ficas, a pesar de que algunos datos se encuentren enlazados a GeoNames.</p>
<p>Con la siguiente sentencia SPARQL recuperamos las obras relacionadas con el autor <ref target="https://es.wikipedia.org/wiki/Miguel_de_Cervantes">Miguel de Cervantes Saavedra</ref> que tienen un lugar de publicaci&#243;n y que adem&#225;s este est&#225; enlazado a GeoNames. En este caso, la variable <code rend="inline">?p</code> que se usa en la tripleta que filtra los resultados del autor puede ser cualquier rol, como por ejemplo colaborador, creador o autor en el caso de la BNB. En este sentido, podr&#237;a ser interesante filtrar por un rol en concreto para obtener resultados m&#225;s espec&#237;ficos.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_9" corresp="code_reutilizando-colecciones-digitales-glam-labs_9.txt" lang="language-sql" rend="block"/></ab>
<p>Para poder ejecutar esta sentencia SPARQL en Python, necesitamos especificar el punto de acceso SPARQL y la sentencia SPARQL a ejecutar:</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_10" corresp="code_reutilizando-colecciones-digitales-glam-labs_10.txt" lang="language-python" rend="block"/></ab>
<p>A continuaci&#243;n, recuperamos el resultado mediante la configuraci&#243;n de la cabecera de la petici&#243;n para que devuelva un objeto <ref target="https://es.wikipedia.org/wiki/JSON">JSON</ref>. La Figura 6 muestra un ejemplo del resultado de la petici&#243;n.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_11" corresp="code_reutilizando-colecciones-digitales-glam-labs_11.txt" lang="language-python" rend="block"/></ab>
<figure><desc>Resultados de la petici&#243;n a la plataforma BNB Linked Data</desc><graphic url="reutilizando-colecciones-digitales-glam-labs6.png"/></figure>
<p>Y almacenamos el resultado en un fichero CSV m&#225;s sencillo de manipular.
En primer lugar cargamos en un objeto JSON el resultado obtenido.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_12" corresp="code_reutilizando-colecciones-digitales-glam-labs_12.txt" lang="language-python" rend="block"/></ab>
<p>Despu&#233;s creamos el fichero CSV y volcamos el contenido del objeto JSON a este fichero. Para ello, recorreremos cada &#237;tem del listado de resultados dentro del objeto JSON con la variable <code rend="inline">bnbdatos</code> y accederemos a los atributos <code rend="inline">['results']['bindings']</code>. Cada propiedad tiene un atributo <code rend="inline">value</code> que contiene el valor que necesitamos recuperar.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_13" corresp="code_reutilizando-colecciones-digitales-glam-labs_13.txt" lang="language-python" rend="block"/></ab>
<p>Una vez que tenemos creado el fichero CSV, podemos cargarlo en un objeto DataFrame de Pandas que nos facilita el an&#225;lisis y tratamiento. La Figura 7 muestra el DataFrame con las filas y columnas.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_14" corresp="code_reutilizando-colecciones-digitales-glam-labs_14.txt" lang="language-python" rend="block"/></ab>
<figure><desc>Visualizaci&#243;n del objeto DataFrame con los resultados</desc><graphic url="reutilizando-colecciones-digitales-glam-labs7.png"/></figure>
<p>A continuaci&#243;n, podemos analizar cu&#225;ntos enlaces diferentes tenemos a GeoNames en el listado de resultados. Pandas permite acceder a las columnas del objeto DataFrame mediante el operador <code rend="inline">groupby</code>. En este ejemplo agrupamos por la columna lugar de publicaci&#243;n (<code rend="inline">lugar</code>) y en la segunda posici&#243;n marcamos la columna que queremos utilizar para realizar la agregaci&#243;n, en este caso, la obra (<code rend="inline">recurso</code>). La Figura 8 muestra el resultado.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_15" corresp="code_reutilizando-colecciones-digitales-glam-labs_15.txt" lang="language-python" rend="block"/></ab>
<figure><desc>Enlaces a GeoNames en el listado de resultados</desc><graphic url="reutilizando-colecciones-digitales-glam-labs8.png"/></figure>
<p>La plataforma BNB Linked Data proporciona los enlaces a GeoNames pero no contiene las coordenadas geogr&#225;ficas. Sin embargo, esta informaci&#243;n puede ser recuperada de otros repositorios, como por ejemplo Wikidata. Las entidades en Wikidata disponen de un conjunto de propiedades que las describen y tambi&#233;n incluyen un segundo apartado para identificadores externos. La Figura 9 corresponde a la entidad <ref target="https://www.wikidata.org/wiki/Q84?uselang=es">Londres en Wikidata</ref> y en ella podemos observar el identificador de GeoNames.</p>
<figure><desc>Enlace a GeoNames desde Wikidata</desc><graphic url="reutilizando-colecciones-digitales-glam-labs9.png"/></figure>
<p>Hasta ahora disponemos de las URIs de cada elemento de GeoNames. Para poder enlazar a Wikidata necesitamos &#250;nicamente el identificador. El siguiente c&#243;digo extrae los identificadores haciendo tratamiento de cadenas, como se puede observar en la Figura 10.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_16" corresp="code_reutilizando-colecciones-digitales-glam-labs_16.txt" lang="language-python" rend="block"/></ab>
<figure><desc>Extracci&#243;n de identificadores de GeoNames</desc><graphic url="reutilizando-colecciones-digitales-glam-labs10.png"/></figure>
<p>Una vez tenemos preparado nuestro listado de identificadores a GeoNames, vamos a recuperar las coordenadas geogr&#225;ficas de Wikidata. Para ello es necesario crear una consulta SPARQL. Vamos a utilizar la instrucci&#243;n <code rend="inline">VALUES</code> que permite especificar los valores para una determinada variable, en nuestro caso, los identificadores de GeoNames. La propiedad <ref target="https://www.wikidata.org/wiki/Property:P1566">P1566</ref> corresponde al identificador de GeoNames en Wikidata y la propiedad <ref target="https://www.wikidata.org/wiki/Property:P625">P625</ref> corresponde a las propiedades geogr&#225;ficas.</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_17" corresp="code_reutilizando-colecciones-digitales-glam-labs_17.txt" lang="language-python" rend="block"/></ab>
<p>A continuaci&#243;n, creamos un objeto folium para implementar un mapa y a&#241;adir las coordenadas recuperadas desde Wikidata en el paso anterior. Recuperamos cada coordenada geogr&#225;fica (variables <code rend="inline">lat</code> y <code rend="inline">lon</code>) y montamos el texto (<code rend="inline">popup</code>) que se mostrar&#225; al hacer click sobre cada localizaci&#243;n en el mapa. Finalmente, a&#241;adimos al mapa cada elemento (<code rend="inline">marker</code>).</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_18" corresp="code_reutilizando-colecciones-digitales-glam-labs_18.txt" lang="language-python" rend="block"/></ab>
<p>Y como resultado se obtiene un mapa que se puede consultar en la Figura 11 con los lugares de publicaci&#243;n de las obras del autor seleccionado, en nuestro caso, Miguel de Cervantes Saavedra.</p>
<figure><desc>Lugares de publicaci&#243;n de las obras de Miguel de Cervantes</desc><graphic url="reutilizando-colecciones-digitales-glam-labs11.png"/></figure>
<p>Tambi&#233;n es posible realizar un estudio de todas las localizaciones geogr&#225;ficas incluidas en el repositorio enlazadas a GeoNames. Para ello podemos calcular el n&#250;mero total de obras por localizaci&#243;n geogr&#225;fica relacionada con GeoNames a trav&#233;s de la propiedad <code rend="inline">c4dm:place</code> de la siguiente forma:</p>
<ab><code xml:id="code_reutilizando-colecciones-digitales-glam-labs_19" corresp="code_reutilizando-colecciones-digitales-glam-labs_19.txt" lang="language-sql" rend="block"/></ab>
<p>De forma similar a como se ha creado el mapa en el ejemplo de Miguel de Cervantes Saavedra, podemos obtener una visualizaci&#243;n m&#225;s representativa a trav&#233;s de un mapa que muestra el total de localizaciones enlazadas a GeoNames incluidas en el repositorio (alrededor de cuatro millones de resultados). Como se puede observar en la Figura 12, la localizaci&#243;n m&#225;s relevante es Inglaterra.</p>
<figure><desc>Lugares de publicaci&#243;n enlazados a GeoNames en BNB</desc><graphic url="reutilizando-colecciones-digitales-glam-labs12.png"/></figure>
</div>
      <div type="2"><head>Discusi&#243;n</head>
<p>En el primer ejemplo se han reutilizado dos colecciones digitales descritas con MARCXML. Aunque la mayor&#237;a del c&#243;digo es reutilizable para ambos casos, los campos utilizados para describir los metadatos en cada colecci&#243;n son diferentes y por lo tanto es necesario un an&#225;lisis previo.</p>
<p>En el caso de la BNB, y teniendo en cuenta la forma de representar los distintos roles que se pueden dar en un repositorio bibliogr&#225;fico, la elecci&#243;n del vocabulario a utilizar puede ser crucial a la hora de dotar de suficiente expresividad a los metadatos. En este sentido, vocabularios ricos en t&#233;rminos sem&#225;nticos como <ref target="http://www.rdaregistry.info">Resource Description and Access (RDA)</ref> proporcionan un listado de elementos para representar numerosos roles con el objetivo de relacionar las obras con los autores como por ejemplo director, ilustrador, impresor o narrador. Adem&#225;s, es relevante resaltar que tan solo alrededor de un 50% de las obras se encuentran enlazadas a GeoNames y que el mapa que obtenemos como resultado no incluye el total de ubicaciones del repositorio.</p>
</div>
      <div type="2"><head>Conclusiones</head>
<p>En este tutorial se han introducido varios ejemplos de reutilizaci&#243;n de colecciones digitales publicadas por instituciones GLAM. Los ejemplos facilitan la  reproducci&#243;n y an&#225;lisis de los resultados, teniendo en cuenta las limitaciones de los metadatos proporcionados por las instituciones ya sea debido a la forma de utilizar los vocabularios o al n&#250;mero de enlaces externos incluido en la colecci&#243;n. La combinaci&#243;n de los Labs, las colecciones digitales y su acceso computacional a trav&#233;s de Jupyter Notebooks facilita un nuevo entorno en el que es posible reutilizar las colecciones digitales para construir nuevo conocimiento.</p>
<p>Las instituciones GLAM se est&#225;n adaptando al nuevo entorno proporcionando colecciones aptas para el procesamiento por computador. Los Labs en el seno de las instituciones GLAM desempe&#241;an un papel fundamental en este sentido para promover las colecciones digitales y su reutilizaci&#243;n de forma innovadora. La Comunidad Internacional GLAM Labs ha fomentado la creaci&#243;n de Labs por todo el mundo; sin embargo, se observa una escasez de Labs en los pa&#237;ses hispanohablates, lo que limita el potencial y la reutilizaci&#243;n de las colecciones digitales en espa&#241;ol. Adem&#225;s, todav&#237;a es posible mejorar en lo que respecta a las licencias para proporcionar colecciones digitales libres de derechos, como tambi&#233;n a la publicaci&#243;n de ejemplos y prototipos de uso. En ese sentido, los Jupyter Notebooks pueden promover la creaci&#243;n de prototipos basados en m&#233;todos de investigaci&#243;n de Humanidades Digitales facilitando su reproducibilidad en entornos basados en la nube.</p>
</div>
      <div type="2"><head>Glosario</head>
<dl>
  <dt><hi rend="bold">Collections as data</hi></dt>
  <dd>Movimiento para promover el acceso computacional a las colecciones digitales.</dd>
  <dt><hi rend="bold">CSV (del ingl&#233;s Comma Separated Values)</hi></dt>
  <dd>Un archivo CSV consiste en un fichero de texto que contiene filas formadas columnas y separadas por comas.</dd>
  <dt><hi rend="bold">DataFrame</hi></dt>
  <dd>Estructura que permite almacenar y manipular datos tabulados en filas formadas por columnas de variables.</dd>
  <dt><hi rend="bold">Folium</hi></dt>
  <dd>Biblioteca de software Python que permite crear mapas interactivos.</dd>
  <dt><hi rend="bold">GeoNames</hi></dt>
  <dd>Repositorio geogr&#225;fico gratuito que proporciona un identificador &#250;nico para cada recurso.</dd>
  <dt><hi rend="bold">GLAM Workbench</hi></dt>
  <dd>Conjunto de herramientas, tutoriales y ejemplos basados en collectiones digitales publicadas por instituciones GLAM y desarrollado por el australiano Tim Sherratt.</dd>
  <dt><hi rend="bold">Jupyter Notebook</hi></dt>
  <dd>Plataforma de c&#243;digo abierto que permite crear y compartir documentos compuestos por c&#243;digo, gr&#225;ficas y documentaci&#243;n.</dd>
  <dt><hi rend="bold">Linked Open Data</hi></dt>
  <dd>Publicaci&#243;n de informaci&#243;n basada en RDF y conectada con repositorios externos de diferentes fuentes e instituciones.</dd>
  <dt><hi rend="bold">MARCXML</hi></dt>
  <dd>Formato para la codificaci&#243;n de un registro MARC en XML.</dd>
  <dt><hi rend="bold">MyBinder</hi></dt>
  <dd>Plataforma gratuita para la ejecuci&#243;n de Jupyter Notebooks alojados en repositorios como GitHub o Zenodo evitando la instalaci&#243;n de software.</dd>
  <dt><hi rend="bold">Pandas</hi></dt>
  <dd>Biblioteca de software Python que permite crear y manipular conjuntos de datos.</dd>
  <dt><hi rend="bold">Python</hi></dt>
  <dd>Lenguaje de programaci&#243;n interpretado y multiplataforma, de libre uso y con una curva de aprendizaje amigable y corta.</dd>
  <dt><hi rend="bold">RDF (del ingl&#233;s Resource Description Framework)</hi></dt>
  <dd>Marco de descripci&#243;n de recursos publicado por el W3C para publicar informaci&#243;n en Internet a modo de tripletas.</dd>  
  <dt><hi rend="bold">SPARQL</hi></dt>
  <dd>Lenguaje de consulta para informaci&#243;n almacenada en formato RDF.</dd>
  <dt><hi rend="bold">URI (del ingl&#233;s Universal Resource Identifier)</hi></dt>
  <dd>Identificador uniforme de recursos para la web.</dd>
</dl>
</div>
      <div type="2"><head>Notas</head>
<p><ref type="footnotemark" target="#note_1"/> : Candela, Gustavo, Mar&#237;a Dolores S&#225;ez, Mar&#237;a Pilar Escobar y Manuel Marco-Such. <emph>hibernator11/notebook-ph: Release 1</emph> v1.0 (2021). <ref target="https://doi.org/10.5281/zenodo.5340157">https://doi.org/10.5281/zenodo.5340157</ref></p>
<p><ref type="footnotemark" target="#note_2"/> : Summers, Ed. <emph>pymarc</emph> v4.0.0 (2020). <ref target="https://pymarc.readthedocs.io/en/stable/">https://pymarc.readthedocs.io/en/stable/</ref></p>
<p><ref type="footnotemark" target="#note_3"/> : The Pandas Development Team. <emph>pandas-dev/pandas: Pandas.</emph> v.1.2.2 (2020). <ref target="https://doi.org/10.5281/zenodo.4524629">https://doi.org/10.5281/zenodo.4524629</ref></p>
<p><ref type="footnotemark" target="#note_4"/> : Filipe, Martin Journois, Frank, Rob Story, James Gardiner, Halfdan Rump, Andrew Bird, et al. <emph>Python-visualization/folium:</emph> v0.10.1 (2019). <ref target="https://doi.org/10.5281/zenodo.3559751">https://doi.org/10.5281/zenodo.3559751</ref>.</p>
<p><ref type="footnotemark" target="#note_5"/> : Thomas A Caswell, Michael Droettboom, John Hunter, Eric Firing, Antony Lee, Jody Klymak, David Stansby, et al. <emph>Matplotlib/matplotlib</emph> v2.2.4 (2019). <ref target="https://doi.org/10.5281/zenodo.2669103">https://doi.org/10.5281/zenodo.2669103</ref>.</p>
</div>
    </body>
  </text>
</TEI>
