<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introducao-estilometria-python">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introdu&#231;&#227;o &#224; estilometria com Python</title>
  <author role="original_author">Fran&#231;ois Dominic Laram&#233;e</author><editor role="reviewers"><persName>Folgert Karsdorp</persName><persName>Jan Rybicki</persName><persName>Antonio Rojas Castro</persName></editor><author role="translators">Daniel Bonatto Seco</author><editor role="translation-reviewers"><persName>Bruno Almeida</persName><persName>Suemi HIguchi</persName></editor><editor role="editors">Adam Crymble</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0024</idno><date type="published">04/21/2018</date><date type="translated">12/27/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#introduction-to-stylometry-with-python"/>.</p><p>There are other translations: <ref target="#introduction-a-la-stylometrie-avec-python"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Nesta li&#231;&#227;o, aprender&#225; a realizar an&#225;lises estilom&#233;tricas e a determinar a autoria de textos. A li&#231;&#227;o cobre tr&#234;s m&#233;todos: Curvas Caracter&#237;sticas de Composi&#231;&#227;o de Mendenhall, M&#233;todo Qui-Quadrado de Kilgariff e M&#233;todo Delta de John Burrows.</p></abstract><textClass><keywords><term xml:lang="en">distant-reading</term><term xml:lang="en">python</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body>
      <div type="2"><head>Introdu&#231;&#227;o</head>
<p><ref target="https://perma.cc/NYH2-KWLA">Estilometria</ref> &#233; o estudo quantitativo do estilo liter&#225;rio por meio de m&#233;todos de <ref target="https://perma.cc/XK8J-F6ZF">leitura distante</ref> computacional. &#201; baseado na observa&#231;&#227;o de que os autores tendem a escrever de maneiras relativamente consistentes, reconhec&#237;veis e &#250;nicas. Por exemplo:</p>
<list type="unordered">
<item>Cada pessoa tem seu pr&#243;prio vocabul&#225;rio &#250;nico, &#224;s vezes rico, &#224;s vezes limitado. Embora um vocabul&#225;rio mais amplo esteja geralmente associado &#224; qualidade liter&#225;ria, nem sempre &#233; esse o caso. Ernest Hemingway &#233; famoso por usar um n&#250;mero surpreendentemente pequeno de palavras diferentes em sua escrita,<ref type="footnotemark" target="#note_1"/> o que n&#227;o o impediu de ganhar o Pr&#234;mio Nobel de Literatura em 1954;</item>
<item>Algumas pessoas escrevem frases curtas, enquanto outras preferem blocos longos de texto compostos por muitas frases;</item>
<item>N&#227;o h&#225; duas pessoas que usem ponto-e-v&#237;rgulas, travess&#245;es e outras formas de pontua&#231;&#227;o exatamente da mesma maneira.</item>
</list>
<p>As maneiras como os escritores usam pequenas <ref target="https://perma.cc/284C-CNHD"><emph>function words</emph></ref>, como artigos, preposi&#231;&#245;es e conjun&#231;&#245;es, mostram-se particularmente reveladoras. Em uma pesquisa dos m&#233;todos estilom&#233;tricos hist&#243;ricos e atuais, Efstathios Stamatatos aponta que as palavras funcionais s&#227;o "usadas de maneira amplamente inconsciente pelos autores e s&#227;o independentes do t&#243;pico"<ref type="footnotemark" target="#note_2"/>. Para a an&#225;lise estilom&#233;trica, isso &#233; muito vantajoso, visto que esse padr&#227;o inconsciente tende a variar menos no <ref target="https://perma.cc/9XQ4-J4A5"><emph>corpus</emph></ref> de um autor do que seu vocabul&#225;rio geral (e tamb&#233;m &#233; muito dif&#237;cil para um pretenso falsificador copiar). As palavras funcionais tamb&#233;m foram identificadas como marcadores importantes do g&#234;nero liter&#225;rio e da cronologia.</p>
<p>Os pesquisadores t&#234;m usado a estilometria como uma ferramenta para estudar uma variedade de quest&#245;es culturais. Por exemplo, uma quantidade consider&#225;vel de pesquisas estudou as diferen&#231;as entre as maneiras como homens e mulheres escrevem<ref type="footnotemark" target="#note_3"/> ou sobre o que escrevem.<ref type="footnotemark" target="#note_4"/> Outros pesquisadores estudaram as maneiras como uma mudan&#231;a repentina no estilo de escrita em um &#250;nico texto pode indicar pl&#225;gio<ref type="footnotemark" target="#note_5"/> e at&#233; mesmo a maneira como as letras dos m&#250;sicos John Lennon e Paul McCartney se tornaram cada vez menos alegres e menos ativas &#224; medida que os <ref target="https://perma.cc/DQ66-M79T">Beatles</ref> se aproximavam do fim de sua carreira de grava&#231;&#227;o na d&#233;cada de 1960.<ref type="footnotemark" target="#note_6"/></p>
<p>No entanto, uma das aplica&#231;&#245;es mais comuns da estilometria &#233; na atribui&#231;&#227;o de autoria. Dado um texto an&#244;nimo, &#224;s vezes &#233; poss&#237;vel inferir quem o escreveu medindo certas caracter&#237;sticas, como o n&#250;mero m&#233;dio de palavras por frase ou a propens&#227;o do autor de usar "todavia" em vez de "no entanto", e comparando as medidas com outros textos escritos pelo suposto autor. Este &#233; o objetivo deste tutorial, onde a partir de um conjunto de obras cl&#225;ssicas de romancistas lusos e brasileiros do s&#233;culo XIX iremos comparar exemplares de suas obras com o estilo liter&#225;rio do conjunto de autores a fim de tentar inferir suas respectivas autorias (nota de tradu&#231;&#227;o: foi decidido mudar o <emph>corpus</emph> usado nesta li&#231;&#227;o para um que fosse culturalmente mais relevante para o p&#250;blico que fala e escreve portugu&#234;s; foi mantida a restante estrutura da li&#231;&#227;o original, com excep&#231;&#227;o de ligeiras adapta&#231;&#245;es face &#224; mudan&#231;a do <emph>corpus</emph>).</p>
<div type="3"><head>Objetivos de aprendizado</head>
<p>No final desta li&#231;&#227;o, teremos percorrido os seguintes t&#243;picos:</p>
<list type="unordered">
<item>Como aplicar v&#225;rios m&#233;todos estilom&#233;tricos para inferir a autoria de um texto an&#244;nimo ou conjunto de textos;</item>
<item>Como usar estruturas de dados relativamente avan&#231;adas, incluindo <ref target="https://perma.cc/TTF4-SJ23">dicion&#225;rios</ref> de <ref target="https://perma.cc/7DCC-M9AT">strings</ref> e dicion&#225;rios de dicion&#225;rios, em <ref target="https://perma.cc/Z82S-3L3M">Python</ref>;</item>
<item>O b&#225;sico do <ref target="https://perma.cc/E7LZ-WECZ">Natural Language Toolkit</ref> (NLTK), um m&#243;dulo Python popular dedicado a <ref target="https://perma.cc/MFX4-LAVZ">processamento de linguagem natural</ref>.</item>
</list>
</div><div type="3"><head>Leitura pr&#233;via</head>
<p>Se voc&#234; n&#227;o tem experi&#234;ncia com a linguagem de programa&#231;&#227;o Python ou est&#225; tendo dificuldade nos exemplos apresentados neste tutorial, o autor recomenda que voc&#234; leia as li&#231;&#245;es <ref target="/pt/licoes/trabalhando-ficheiros-texto-python">Trabalhando com ficheiros de texto em Python</ref> e <ref target="/pt/licoes/manipular-strings-python">Manipular Strings com Python</ref>. Note que essas li&#231;&#245;es foram escritas em Python vers&#227;o 2, enquanto esta usa Python vers&#227;o 3. As diferen&#231;as de <ref target="https://perma.cc/E5LQ-S65P">sintaxe</ref> entre as duas vers&#245;es da linguagem podem ser sutis. Se voc&#234; ficar em d&#250;vida, siga os exemplos conforme descritos nesta li&#231;&#227;o e use as outras li&#231;&#245;es como material de apoio. (Este tutorial encontra-se atualizado at&#233; &#224; vers&#227;o <ref target="https://perma.cc/XCT2-Q4AT">Python 3.8.5</ref>; as <ref target="https://perma.cc/U6Q6-59V3">strings literais formatadas</ref> na linha <code rend="inline">with open(f'data/pg{filename}.txt', 'r', encoding='utf-8') as f:</code>, por exemplo, requerem Python 3.6 ou uma vers&#227;o mais recente da linguagem.) </p>
</div><div type="3"><head>Materiais requeridos</head>
<p>Este tutorial usa conjuntos de dados e software que voc&#234; ter&#225; que baixar e instalar.</p>
<div type="4"><head>O conjunto de dados</head>
<p>Para trabalhar nesta li&#231;&#227;o, voc&#234; precisar&#225; baixar e descompactar o ficheiro <ref target="/assets/introduction-to-stylometry-with-python/dataset_estilometria.zip">.zip</ref> contendo as 15 obras que comp&#245;em o <emph>corpus</emph> que ser&#225; utilizado neste tutorial. As obras foram originalmente extra&#237;das do <ref target="https://perma.cc/8GTT-3M9N">Projeto Gutenberg</ref>. Ao descompactar o ficheiro, ser&#225; criada uma pasta com o nome <code rend="inline">dados</code>. Este ser&#225; o seu <ref target="https://perma.cc/9KVS-T3A5">diret&#243;rio de trabalho</ref> e todo o trabalho deve ser salvo aqui durante a execu&#231;&#227;o da li&#231;&#227;o.</p>
</div><div type="4"><head>O software</head>
<p>Esta li&#231;&#227;o usa as seguintes vers&#245;es da linguagem Python e <ref target="https://pt.wikipedia.org/wiki/Biblioteca_(computa%C3%A7%C3%A3o)">bibliotecas</ref>:</p>
<list type="unordered">
<item><ref target="https://www.python.org/downloads/">Python 3.x</ref> - a &#250;ltima vers&#227;o est&#225;vel &#233; recomendada;</item>
<item><ref target="https://www.nltk.org/">nltk</ref> - Natural Language Toolkit, geralmente abreviado <code rend="inline">nltk</code>;</item>
<item><ref target="https://matplotlib.org/">matplotlib</ref> - visualiza&#231;&#227;o de dados e gera&#231;&#227;o de gr&#225;ficos;</item>
<item><ref target="https://docs.python.org/pt-br/3/library/re.html">re</ref> - limpeza de dados via Regex (veremos durante o tutorial o porqu&#234;).</item>
</list>
<p>Alguns desses m&#243;dulos podem n&#227;o estar pr&#233;-instalados em seu computador. Se voc&#234; encontrar mensagens de erro como: "M&#243;dulo n&#227;o encontrado" ou similares, voc&#234; ter&#225; que baixar e instalar o(s) m&#243;dulo(s) ausente(s). A forma mais simples de realizar esta tarefa &#233; atrav&#233;s do comando <code rend="inline">pip</code>. Mais detalhes est&#227;o dispon&#237;veis atrav&#233;s do tutorial do <emph>Programming Historian</emph> <ref target="/pt/licoes/instalacao-modulos-python-pip">Instala&#231;&#227;o de M&#243;dulos Python com pip</ref>. </p>
</div></div><div type="3"><head>Algumas notas sobre Independ&#234;ncia Lingu&#237;stica</head>
<p>Este tutorial aplica a an&#225;lise estilom&#233;trica a um conjunto de textos em portugu&#234;s (PT-PT e PT-BR) usando uma biblioteca Python chamada <code rend="inline">nltk</code>. Muitas das funcionalidades fornecidas pelo <code rend="inline">nltk</code> operam com outros idiomas. Contanto que um idioma forne&#231;a uma maneira clara de distinguir os limites de uma palavra, o <code rend="inline">nltk</code> deve ter um bom desempenho. Idiomas como o chin&#234;s, para os quais n&#227;o h&#225; distin&#231;&#227;o clara entre os limites das palavras, podem ser problem&#225;ticos. O autor original desta li&#231;&#227;o utilizou <code rend="inline">nltk</code> com textos em franc&#234;s sem nenhum problema; outros idiomas que usam <ref target="https://perma.cc/7VGD-5968">diacr&#237;ticos</ref>, como espanhol e alem&#227;o, tamb&#233;m devem funcionar bem com <code rend="inline">nltk</code>. Consulte a <ref target="https://perma.cc/S4EX-2DBT">documenta&#231;&#227;o do nltk</ref> para obter detalhes. </p>
<p>Apenas uma das tarefas neste tutorial requer c&#243;digo dependente do idioma. Para dividir um texto em um conjunto de palavras em uma l&#237;ngua diferente do ingl&#234;s, voc&#234; precisar&#225; especificar o idioma apropriado como um par&#226;metro para o <ref target="https://perma.cc/NGM5-4MED">tokenizador</ref> da biblioteca <code rend="inline">nltk</code>, que usa o ingl&#234;s como padr&#227;o. Isso ser&#225; explicado no tutorial.</p>
<p>Por fim, observe que algumas tarefas lingu&#237;sticas, como <ref target="https://perma.cc/L9SU-PS9D"><emph>part-of-speech tagging</emph></ref>, podem n&#227;o ser suportadas pelo <code rend="inline">nltk</code> em outros idiomas al&#233;m do ingl&#234;s. Este tutorial n&#227;o cobre a aplica&#231;&#227;o de <emph>part-of-speech tagging</emph>. Se voc&#234; precisar para os seus pr&#243;prios projetos, consulte a <ref target="https://perma.cc/S4EX-2DBT">documenta&#231;&#227;o do nltk</ref> para obter orienta&#231;&#245;es.</p>
</div></div>
      <table>
<row>
<cell role="label">Autor</cell>
<cell role="label">Obra 1</cell>
<cell role="label">Obra 2</cell>
<cell role="label">Obra 3</cell>
</row>
<row>
<cell><ref target="https://perma.cc/8LU3-RADW">Manuel Pinheiro <hi rend="bold">Chagas</hi></ref> (Portugal)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/29394">Historia alegre de Portugal</ref> (<hi rend="bold">29394</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/23400">A Lenda da Meia-Noite</ref> (<hi rend="bold">23400</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/29342">Astucias de Namorada, e Um melodrama em Santo Thyrso</ref> (<hi rend="bold">29342</hi>)</cell>
</row>
<row>
<cell><ref target="https://perma.cc/LZ9J-3H5Z">Ant&#243;nio Feliciano de <hi rend="bold">Castilho</hi></ref> (Portugal)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/32002">A Chave do Enigma</ref> (<hi rend="bold">32002</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/65021">A Primavera</ref> (<hi rend="bold">65021</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/28127">O presbyterio da montanha</ref> (<hi rend="bold">28127</hi>)</cell>
</row>
<row>
<cell><ref target="https://perma.cc/Q4AJ-VZBH">Camilo <hi rend="bold">Castelo Branco</hi></ref> (Portugal)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/26025">Carlota Angela</ref> (<hi rend="bold">26025</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/26988">Amor de Salva&#231;&#227;o</ref> (<hi rend="bold">26988</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/16425">Amor de Perdi&#231;&#227;o: Memorias d'uma familia</ref> (<hi rend="bold">16425</hi>)</cell>
</row>
<row>
<cell><ref target="https://perma.cc/Y3Y2-VHJ5">Jos&#233; de <hi rend="bold">Alencar</hi></ref> (Brasil)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/38496">Ubirajara</ref> (<hi rend="bold">38496</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/44540">Cinco minutos</ref> (<hi rend="bold">44540</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/29040">Como e porque sou romancista</ref> (<hi rend="bold">29040</hi>)</cell>
</row>
<row>
<cell><ref target="https://perma.cc/6BMU-UKZL">Machado de <hi rend="bold">Assis</hi></ref> (Brasil)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/55682">Quincas Borba</ref> (<hi rend="bold">55682</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/54829">Memorias Posthumas de Braz Cubas</ref> (<hi rend="bold">54829</hi>)</cell>
<cell><ref target="https://www.gutenberg.org/ebooks/55752">Dom Casmurro</ref> (<hi rend="bold">55752</hi>)</cell>
</row>
</table>
      <div type="2"><head>Nossos casos de teste</head>
<p>Nesta li&#231;&#227;o, usaremos obras de romancistas brasileiros e portugueses do s&#233;culo XIX como um estudo de caso para demonstrar tr&#234;s abordagens estilom&#233;tricas diferentes:</p>
<list type="ordered">
<item>Curvas caracter&#237;sticas de composi&#231;&#227;o de Mendenhall</item>
<item>M&#233;todo Qui-Quadrado de Kilgariff </item>
<item>M&#233;todo Delta de John Burrows</item>
</list>
<p>Em todas as abordagens acima mencionadas, utilizaremos os documentos das colunas <hi rend="bold">Obra 1</hi> e <hi rend="bold">Obra 2</hi> para definir o estilo de cada autor. Os documentos da coluna <hi rend="bold">Obra 3</hi> ser&#227;o testados individualmente com cada um dos 5 autores para tentarmos inferir a autoria pela proximidade de estilo. </p>
</div>
      <div type="2"><head>Preparando os dados para an&#225;lise</head>
<p>Antes de prosseguirmos com a an&#225;lise estilom&#233;trica, precisamos carregar os ficheiros contendo todas as 15 obras em <ref target="https://perma.cc/P843-J4LB">estruturas de dados</ref> na mem&#243;ria do computador.</p>
<p>O primeiro passo neste processo &#233; designar cada obra para o seu respectivo conjunto. Como cada obra est&#225; relacionada com o seu respectivo <code rend="inline">EBook-No.</code>, podemos atribuir cada obra (valor) &#224; chave do seu autor (ou a uma chave separada, se ela fizer parte da amostra de teste) usando um <emph>dicion&#225;rio</emph> Python. O dicion&#225;rio &#233; um tipo de conjunto de dados composto de um n&#250;mero arbitr&#225;rio de pares de chave-valor; neste caso, os nomes dos autores servir&#227;o como chaves (separados entre treino e teste), enquanto os <code rend="inline">EBook-No.</code> das obras ser&#227;o os valores associados a essas chaves.</p>
<ab><code xml:id="code_introducao-estilometria-python_0" corresp="code_introducao-estilometria-python_0.txt" lang="language-python" rend="block"/></ab>
<p>Os dicion&#225;rios Python s&#227;o muito flex&#237;veis. Por exemplo, podemos acessar um valor espec&#237;fico <emph>indexando</emph> o dicion&#225;rio com uma de suas chaves, podemos varrer o dicion&#225;rio inteiro fazendo um loop em sua lista de chaves, etc. Faremos amplo uso desta funcionalidade &#224; medida que avan&#231;armos.</p>
<p>A seguir, como estamos interessados no vocabul&#225;rio de cada autor, definiremos uma breve <ref target="https://perma.cc/P8CA-Y43Q">fun&#231;&#227;o</ref> em Python que ir&#225; criar uma longa lista de palavras em cada uma das obras atribu&#237;das a um &#250;nico autor. Isso ser&#225; armazenado como uma <ref target="https://perma.cc/7DCC-M9AT">string</ref>.
Abra o seu ambiente de desenvolvimento Python escolhido. Se voc&#234; n&#227;o sabe como fazer isso, leia "Configurar um ambiente de desenvolvimento integrado para Python" (<ref target="/pt/licoes/instalacao-windows">Windows</ref>, <ref target="/pt/licoes/instalacao-linux">Linux</ref>, <ref target="/pt/licoes/instalacao-mac">Mac</ref>) antes de prosseguir.</p>
<ab><code xml:id="code_introducao-estilometria-python_1" corresp="code_introducao-estilometria-python_1.txt" lang="language-python" rend="block"/></ab>
<p>Perceba que, dentro da fun&#231;&#227;o, temos tamb&#233;m uma etapa de limpeza dos textos usando <ref target="https://perma.cc/DT3K-XUBG">express&#245;es regulares</ref>. Isso foi necess&#225;rio para este corpus espec&#237;fico pois as obras publicadas no Projeto Gutenberg possuem uma estrutura de cabe&#231;alho e rodap&#233; de <ref target="https://perma.cc/E8P8-GKDR">metadados</ref> que n&#227;o pode ser considerada na an&#225;lise estilom&#233;trica, uma vez que n&#227;o foram redigidas pelos autores analisados. A utiliza&#231;&#227;o de express&#245;es regulares n&#227;o faz parte do escopo deste tutorial, ent&#227;o limitaremo-nos a compreender que estamos utilizando a biblioteca <code rend="inline">re</code> para capturar apenas o conjunto de caracteres entre os marcadores <code rend="inline">*** START OF THIS PROJECT GUTENBERG [NOME DA OBRA] ***</code> e <code rend="inline">*** END OF THIS PROJECT GUTENBERG [NOME DA OBRA] ***</code> presentes em cada documento do projeto. Para maiores d&#250;vidas sobre a utiliza&#231;&#227;o de express&#245;es regulares e da biblioteca <code rend="inline">re</code>, consulte a <ref target="https://perma.cc/JFP3-B4P4">documenta&#231;&#227;o</ref>.</p>
<p>Na sequ&#234;ncia, constru&#237;mos uma nova estrutura de dados chamando repetidamente a fun&#231;&#227;o <code rend="inline">ler_ficheiros_para_string ()</code>, passando a ela uma lista diferente de documentos a cada vez. Armazenaremos os resultados em outro dicion&#225;rio, este com nomes do autor/caso de teste como chaves e todo o texto dos respectivos documentos como valores. Para simplificar, iremos nos referir &#224; string contendo uma lista de documentos como "corpus do autor".</p>
<ab><code xml:id="code_introducao-estilometria-python_2" corresp="code_introducao-estilometria-python_2.txt" lang="language-python" rend="block"/></ab>
<p>Para nos certificarmos de que os ficheiros foram carregados corretamente, imprima os primeiros cem caracteres de cada entrada do dicion&#225;rio na tela:</p>
<ab><code xml:id="code_introducao-estilometria-python_3" corresp="code_introducao-estilometria-python_3.txt" lang="language-python" rend="block"/></ab>
<p>Se esta opera&#231;&#227;o de impress&#227;o exibir quaisquer trechos de texto no console, ent&#227;o a opera&#231;&#227;o de leitura dos ficheiros funcionou conforme o esperado e voc&#234; pode prosseguir para a an&#225;lise estilom&#233;trica.</p>
<p style="alert alert-warning">
Se os ficheiros n&#227;o forem carregados, o motivo mais prov&#225;vel &#233; que o seu diret&#243;rio de trabalho atual n&#227;o seja o reposit&#243;rio `dados` criado ao descompactar o ficheiro da se&#231;&#227;o de Materiais Requeridos acima; mudar o seu diret&#243;rio de trabalho deve resolver o problema. Como voc&#234; faz isso depende do seu ambiente de desenvolvimento Python.
</p>
</div>
      <table>
<row>
<cell role="label"/>
<cell role="label">Assis</cell>
<cell role="label">Alencar</cell>
<cell role="label">Castelo Branco</cell>
<cell role="label">Castilho</cell>
<cell role="label">Chagas</cell>
</row>
<row>
<cell><hi rend="bold">Chagas (teste)</hi></cell>
<cell>0.7746</cell>
<cell>0.5883</cell>
<cell>0.6636</cell>
<cell>0.6732</cell>
<cell><hi rend="bold"><span style="color:orange">0.5888</span></hi></cell>
</row>
<row>
<cell><hi rend="bold">Castilho (teste)</hi></cell>
<cell>0.4396</cell>
<cell>0.4624</cell>
<cell>0.4114</cell>
<cell><hi rend="bold"><span style="color:green">0.1394</span></hi></cell>
<cell>0.3184</cell>
</row>
<row>
<cell><hi rend="bold">Castelo Branco (teste)</hi></cell>
<cell>0.2812</cell>
<cell>0.4436</cell>
<cell><hi rend="bold"><span style="color:red">0.4761</span></hi></cell>
<cell>0.2772</cell>
<cell>0.2803</cell>
</row>
<row>
<cell><hi rend="bold">Alencar (teste)</hi></cell>
<cell>0.9744</cell>
<cell><hi rend="bold"><span style="color:red">0.9844</span></hi></cell>
<cell>0.4313</cell>
<cell>0.6979</cell>
<cell>0.7897</cell>
</row>
<row>
<cell><hi rend="bold">Assis (teste)</hi></cell>
<cell><hi rend="bold"><span style="color:green">0.2578</span></hi></cell>
<cell>0.5192</cell>
<cell>0.7410</cell>
<cell>0.4687</cell>
<cell>0.3466</cell>
</row>
</table>
      <table>
<row>
<cell role="label"/>
<cell role="label">Assis</cell>
<cell role="label">Alencar</cell>
<cell role="label">Castelo Branco</cell>
<cell role="label">Castilho</cell>
<cell role="label">Chagas</cell>
</row>
<row>
<cell><hi rend="bold">Chagas (teste)</hi></cell>
<cell>6683</cell>
<cell>5700</cell>
<cell>5836</cell>
<cell>6970</cell>
<cell><hi rend="bold"><span style="color:green">5332</span></hi></cell>
</row>
<row>
<cell><hi rend="bold">Castilho (teste)</hi></cell>
<cell>11349</cell>
<cell>9203</cell>
<cell>8925</cell>
<cell><hi rend="bold"><span style="color:green">4531</span></hi></cell>
<cell>7548</cell>
</row>
<row>
<cell><hi rend="bold">Castelo Branco (teste)</hi></cell>
<cell>17294</cell>
<cell>12063</cell>
<cell><hi rend="bold"><span style="color:green">11187</span></hi></cell>
<cell>18133</cell>
<cell>13954</cell>
</row>
<row>
<cell><hi rend="bold">Alencar (teste)</hi></cell>
<cell>2550</cell>
<cell><hi rend="bold"><span style="color:red">3153</span></hi></cell>
<cell>2581</cell>
<cell>2663</cell>
<cell>2765</cell>
</row>
<row>
<cell><hi rend="bold">Assis (teste)</hi></cell>
<cell><hi rend="bold"><span style="color:green">12266</span></hi></cell>
<cell>13832</cell>
<cell>15659</cell>
<cell>19458</cell>
<cell>13681</cell>
</row>
</table>
      <div type="2"><head>Terceiro teste estilom&#233;trico: m&#233;todo Delta de John Burrows (avan&#231;ado)</head>
<p>Os primeiros dois m&#233;todos estilom&#233;tricos foram mais f&#225;ceis de implementar. Este pr&#243;ximo, baseado na estat&#237;stica <emph>Delta</emph> de John Burrows<ref type="footnotemark" target="#note_10"/>, &#233; consideravelmente mais complexo, tanto conceitualmente (a matem&#225;tica &#233; mais complicada) quanto computacionalmente (mais c&#243;digo necess&#225;rio). &#201;, no entanto, um dos m&#233;todos estilom&#233;tricos mais proeminentes em uso hoje.</p>
<p>Assim como o qui-quadrado de Kilgariff, o m&#233;todo Delta de Burrows &#233; uma medida da "dist&#226;ncia" entre um texto cuja autoria queremos averiguar e algum outro corpus. Ao contr&#225;rio do qui-quadrado, no entanto, o m&#233;todo Delta &#233; projetado para comparar um texto an&#244;nimo (ou conjunto de textos) com as assinaturas de v&#225;rios autores diferentes ao mesmo tempo. Mais precisamente, o m&#233;todo Delta mede como o texto an&#244;nimo <emph>e conjuntos de textos escritos por um n&#250;mero arbitr&#225;rio de autores conhecidos</emph> divergem da m&#233;dia de todos eles juntos. Al&#233;m disso, o m&#233;todo Delta atribui peso igual a todas as caracter&#237;sticas que mede, evitando assim o problema de palavras comuns sobrecarregarem os resultados, o que era um problema com os testes de qui-quadrado. Por todas essas raz&#245;es, o m&#233;todo Delta de John Burrows &#233; geralmente uma solu&#231;&#227;o mais eficaz para a quest&#227;o da autoria.</p>
<p>O algoritmo original de Burrows pode ser resumido da seguinte forma:</p>
<list type="unordered">
<item>Re&#250;na um grande corpus composto por textos escritos por um n&#250;mero arbitr&#225;rio de autores; digamos que o n&#250;mero de autores seja <code rend="inline">x</code>;</item>
<item>Encontre as <code rend="inline">n</code> palavras mais frequentes no corpus para usar como elementos;</item>
<item>Para cada uma dessas <code rend="inline">n</code> caracter&#237;sticas, calcule a participa&#231;&#227;o de cada subcorpora dos <code rend="inline">x</code> autores, como uma porcentagem do n&#250;mero total de palavras. Por exemplo, a palavra "ele" pode representar 4,72% das palavras no subcorpus do Autor A;</item>
<item>Em seguida, calcule a m&#233;dia e o desvio padr&#227;o desses <code rend="inline">x</code> valores e use-os como a m&#233;dia oficial e o desvio padr&#227;o para esse elemento em todo o corpus. Em outras palavras, estaremos usando uma <emph>m&#233;dia de m&#233;dias</emph> em vez de calcular um &#250;nico valor que represente a parcela de todo o corpus dado por cada palavra. Fazemos isso porque queremos evitar que um subcorpus maior tenha maior influ&#234;ncia nos resultados a seu favor e defina a norma do corpus de tal forma que se espere que tudo se pare&#231;a com ele;</item>
<item>Para cada um dos <code rend="inline">n</code> elementos e <code rend="inline">x</code> subcorpora, calcule um <ref target="https://perma.cc/S2RH-LF9K"><code rend="inline">z-score</code></ref> descrevendo o qu&#227;o distante da norma do corpus est&#225; o uso desse elemento particular neste subcorpus espec&#237;fico. Para fazer isso, subtraia a "m&#233;dia das m&#233;dias" de um dado elemento da frequ&#234;ncia com que ela &#233; encontrada no subcorpus e divida o resultado pelo seu desvio padr&#227;o. A Figura 3 mostra a equa&#231;&#227;o de z-score para o elemento 'i', onde C(i) representa a frequ&#234;ncia observada, a letra grega mu representa a m&#233;dia das m&#233;dias e a letra grega sigma, o desvio padr&#227;o;</item>
</list>
<figure><desc>Imagem 3: Equa&#231;&#227;o para a estat&#237;stica de z-score.</desc><graphic url="stylometry-python-7.jpg"/></figure>
<list type="unordered">
<item>Em seguida, calcule os mesmos <code rend="inline">z-scores</code> para cada elemento no texto para o qual queremos determinar a autoria;</item>
<item>Finalmente, calcule um <emph>score delta</emph> comparando o documento de teste com o subcorpus de cada candidato. Para fazer isso, tome a <emph>m&#233;dia dos valores absolutos das diferen&#231;as entre os <code rend="inline">z-scores</code> para cada elemento entre o documento de teste e o subcorpus do candidato</emph>. (leia duas vezes!) Isso d&#225; peso igual a cada elemento, n&#227;o importa a frequ&#234;ncia com que as palavras ocorram nos textos; caso contr&#225;rio, os 3 ou 4 principais elementos sobrecarregariam todo o resto. A Figura 4 mostra a equa&#231;&#227;o para Delta, onde Z(c,i) &#233; o <code rend="inline">z-score</code> para o elemento 'i' no candidato 'c', e Z(t,i) &#233; o <code rend="inline">z-score</code> para o elemento 'i' no caso de teste;</item>
</list>
<figure><desc>Imagem 4: Equa&#231;&#227;o para a estat&#237;stica Delta de John Burrows.</desc><graphic url="stylometry-python-8.jpg"/></figure>
<list type="unordered">
<item>O candidato "vencedor", assim como nas duas outras t&#233;cnicas que aplicamos, &#233; o autor para o qual a pontua&#231;&#227;o delta entre o subcorpus do autor e o documento de teste &#233; a mais baixa.</item>
</list>
<p>Stefan Evert <emph>et al</emph>.<ref type="footnotemark" target="#note_11"/> fornece uma discuss&#227;o aprofundada das variantes, refinamentos e complexidades do m&#233;todo, mas nos ateremos ao essencial para os prop&#243;sitos desta li&#231;&#227;o. Uma explica&#231;&#227;o diferente de Delta, escrita em espanhol, e uma aplica&#231;&#227;o a um corpus de romances espanh&#243;is tamb&#233;m podem ser encontradas em um artigo recente de Jos&#233; Calvo Tello.<ref type="footnotemark" target="#note_12"/></p>
<div type="3"><head>Sele&#231;&#227;o de elementos</head>
<p>Vamos combinar todos os subcorpora em um &#250;nico corpus para Delta calcular um "padr&#227;o" para trabalhar. Ent&#227;o, vamos selecionar um n&#250;mero de palavras para usar como caracter&#237;stica. Lembre-se de que usamos 500 palavras para calcular o qui-quadrado de Kilgariff; desta vez, usaremos um conjunto menor de 30 palavras (a maioria, sen&#227;o todas, palavras funcionais e verbos comuns) como nossos elementos.</p>
<ab><code xml:id="code_introducao-estilometria-python_9" corresp="code_introducao-estilometria-python_9.txt" lang="language-python" rend="block"/></ab>
<p>Uma amostra das palavras mais frequentes e suas respectivas ocorr&#234;ncias parece com o seguinte:</p>
<ab><code xml:id="code_introducao-estilometria-python_10" corresp="code_introducao-estilometria-python_10.txt" rend="block"/></ab>
</div><div type="3"><head>Calculando elementos para cada subcorpus</head>
<p>Vejamos as frequ&#234;ncias de cada caracter&#237;stica no subcorpus de cada candidato, como uma propor&#231;&#227;o do n&#250;mero total de tokens no subcorpus. Vamos calcular esses valores e armazen&#225;-los em um dicion&#225;rio de dicion&#225;rios, uma maneira conveniente de construir um <ref target="https://perma.cc/HR9K-24MG">array bidimensional</ref> em Python.</p>
<ab><code xml:id="code_introducao-estilometria-python_11" corresp="code_introducao-estilometria-python_11.txt" lang="language-python" rend="block"/></ab>
</div><div type="3"><head>Calculando m&#233;dias de elementos e desvios-padr&#227;o</head>
<p>Dadas as frequ&#234;ncias de elementos para todos os subcorpora que acabamos de calcular, podemos encontrar uma "m&#233;dia das m&#233;dias" e um desvio padr&#227;o para cada elemento. Armazenaremos esses valores em outro "dicion&#225;rio de dicion&#225;rios".</p>
<ab><code xml:id="code_introducao-estilometria-python_12" corresp="code_introducao-estilometria-python_12.txt" lang="language-python" rend="block"/></ab>
</div><div type="3"><head>Calculando z-scores</head>
<p>Em seguida, transformamos as frequ&#234;ncias de caracter&#237;sticas observadas no subcorpora dos cinco candidatos em <code rend="inline">z-scores</code>, descrevendo o qu&#227;o distante da "estat&#237;stica padr&#227;o do corpus" essas observa&#231;&#245;es est&#227;o. Nada extravagante aqui: n&#243;s meramente aplicamos a defini&#231;&#227;o do <code rend="inline">z-score</code> para cada elemento e armazenamos os resultados em outro array bidimensional.</p>
<ab><code xml:id="code_introducao-estilometria-python_13" corresp="code_introducao-estilometria-python_13.txt" lang="language-python" rend="block"/></ab>
</div><table>
<row>
<cell role="label"/>
<cell role="label">Assis</cell>
<cell role="label">Alencar</cell>
<cell role="label">Castelo Branco</cell>
<cell role="label">Castilho</cell>
<cell role="label">Chagas</cell>
</row>
<row>
<cell><hi rend="bold">Chagas (teste)</hi></cell>
<cell>1.1444</cell>
<cell>1.0169</cell>
<cell>0.9462</cell>
<cell>0.9864</cell>
<cell><hi rend="bold"><span style="color:green">0.7756</span></hi></cell>
</row>
<row>
<cell><hi rend="bold">Castilho (teste)</hi></cell>
<cell>1.5705</cell>
<cell>1.2553</cell>
<cell>1.0970</cell>
<cell><hi rend="bold"><span style="color:green">0.4518</span></hi></cell>
<cell>0.8176</cell>
</row>
<row>
<cell><hi rend="bold">Castelo Branco (teste)</hi></cell>
<cell>1.004</cell>
<cell>1.3208</cell>
<cell><hi rend="bold"><span style="color:green">0.8182</span></hi></cell>
<cell>1.5202</cell>
<cell>1.2829</cell>
</row>
<row>
<cell><hi rend="bold">Alencar (teste)</hi></cell>
<cell>1.9762</cell>
<cell><hi rend="bold"><span style="color:green">1.3355</span></hi></cell>
<cell>1.3878</cell>
<cell>1.6425</cell>
<cell>1.5042</cell>
</row>
<row>
<cell><hi rend="bold">Assis (teste)</hi></cell>
<cell><hi rend="bold"><span style="color:green">0.8715</span></hi></cell>
<cell>1.2624</cell>
<cell>1.2303</cell>
<cell>1.6276</cell>
<cell>1.0527</cell>
</row>
</table></div>
      <div type="2"><head>Leituras adicionais e recursos</head>
<div type="3"><head>Estudos de caso interessantes</head>
<p>Estilometria e/ou atribui&#231;&#227;o de autoria t&#234;m sido utilizadas em diversos contextos, empregando diversas t&#233;cnicas. Aqui est&#227;o alguns estudos de caso interessantes:</p>
<list type="unordered">
<item>Javier de la Rosa e Juan Luis Su&#225;rez procuram o autor de um famoso romance espanhol do s&#233;culo XVI entre uma lista consider&#225;vel de candidatos. <ref type="footnotemark" target="#note_13"/></item>
<item>Maria Slautina e Mikhail Marusenko usam o reconhecimento de padr&#245;es em um conjunto de recursos sint&#225;ticos, gramaticais e lexicais, desde a contagem de palavras simples (com marca&#231;&#227;o de classe gramatical) a v&#225;rios tipos de frases, a fim de estabelecer semelhan&#231;as estil&#237;sticas entre os textos medievais.<ref type="footnotemark" target="#note_14"/></item>
<item>Ellen Jordan, Hugh Craig e Alexis Antonia examinam o caso de peri&#243;dicos brit&#226;nicos do s&#233;culo XIX, nos quais os artigos geralmente n&#227;o eram assinados, para determinar o autor de quatro resenhas de trabalhos de ou sobre as irm&#227;s Bront&#235;.<ref type="footnotemark" target="#note_15"/> Este estudo de caso aplica uma vers&#227;o inicial de outro m&#233;todo desenvolvido por John Burrows, o m&#233;todo Zeta, que se concentra nas palavras favoritas de um autor em vez de palavras de fun&#231;&#227;o comum.<ref type="footnotemark" target="#note_16"/></item>
<item>Val&#233;rie Beaudoin e Fran&#231;ois Yvon analisaram 58 pe&#231;as em verso dos dramaturgos franceses Corneille, Racine e Moli&#232;re, descobrindo que as duas primeiras foram muito mais consistentes na maneira como estruturaram sua escrita do que as &#250;ltimas.<ref type="footnotemark" target="#note_17"/></item>
<item>Marcelo Luiz Brocardo, Issa Traore, Sherif Saad e Isaac Woungang aplicam <ref target="https://perma.cc/7TAQ-JECD">aprendizagem supervisionada</ref> e <ref target="https://perma.cc/X34K-5R9X">modelos n-gram</ref> para determinar a autoria de mensagens curtas com um grande n&#250;mero de autores em potencial, como e-mails e tweets.<ref type="footnotemark" target="#note_18"/></item>
<item>Moshe Koppel e Winter Yaron prop&#245;em o "m&#233;todo do impostor", que tenta determinar se dois textos foram escritos pelo mesmo autor, inserindo-os em um conjunto de textos escritos por falsos candidatos.<ref type="footnotemark" target="#note_19"/> Justin Anthony Stover <emph>et al.</emph> recentemente aplicou a t&#233;cnica para determinar a autoria de um manuscrito do s&#233;culo II rec&#233;m-descoberto.<ref type="footnotemark" target="#note_20"/></item>
<item>Finalmente, uma equipe liderada por David I. Holmes estudou o caso peculiar de documentos escritos por um soldado da Guerra Civil ou por sua vi&#250;va que pode ter copiado intencionalmente seu estilo de escrita.<ref type="footnotemark" target="#note_21"/></item>
</list>
</div><div type="3"><head>Refer&#234;ncias adicionais sobre autoria e estilometria</head>
<p>A refer&#234;ncia mais exaustiva em todos os assuntos relacionados &#224; atribui&#231;&#227;o de autoria, incluindo a hist&#243;ria do campo, seus fundamentos matem&#225;ticos e lingu&#237;sticos e seus v&#225;rios m&#233;todos, foi escrita por Patrick Juola em 2007.<ref type="footnotemark" target="#note_22"/> O Cap&#237;tulo 7, em particular, mostra como a atribui&#231;&#227;o de autoria pode servir como um marcador para v&#225;rias identidades de grupo (g&#234;nero, nacionalidade, dialeto, etc.), para mudan&#231;as na linguagem ao longo do tempo, e at&#233; mesmo para personalidade e sa&#250;de mental.</p>
<p>Uma pesquisa mais curta pode ser encontrada em Moshe Koppel <emph>et al.</emph>, que discute casos em que h&#225; um &#250;nico autor candidato cuja autoria deve ser confirmada, um grande n&#250;mero de candidatos para os quais apenas pequenas amostras de escrita est&#227;o dispon&#237;veis para treinar um algoritmo de aprendizado de m&#225;quina, ou nenhum candidato conhecido.<ref type="footnotemark" target="#note_23"/></p>
<p>O artigo de Stamatatos citado anteriormente<ref type="footnotemark" target="#note_2"/> tamb&#233;m cont&#233;m uma pesquisa qualitativa do campo.</p>
</div><div type="3"><head>Varia</head>
<p><emph>Programming historians</emph> que desejam explorar mais a estilometria podem fazer o download do pacote <ref target="https://cran.r-project.org/web/packages/stylo/index.html">Stylo</ref>,<ref type="footnotemark" target="#note_24"/> que se tornou um padr&#227;o <emph>de facto</emph>. Entre outras coisas, o pacote Stylo fornece uma implementa&#231;&#227;o do m&#233;todo Delta, funcionalidade de extra&#231;&#227;o de recursos e interfaces gr&#225;ficas de usu&#225;rio convenientes tanto para manipula&#231;&#227;o de dados quanto para produ&#231;&#227;o de resultados visualmente atraentes. Observe que o Stylo &#233; escrito em <ref target="https://www.r-project.org/">R</ref>, o que significa que voc&#234; precisar&#225; do R instalado no seu computador para execut&#225;-lo, mas entre a interface gr&#225;fica do usu&#225;rio e os tutoriais, pouco ou nenhum conhecimento pr&#233;vio de programa&#231;&#227;o R deve ser necess&#225;rio.</p>
<p>Leitores fluentes em franc&#234;s interessados em explorar as implica&#231;&#245;es <ref target="https://perma.cc/6DFE-QTWV">epistemol&#243;gicas</ref> das intera&#231;&#245;es entre m&#233;todos quantitativos e qualitativos na an&#225;lise do estilo de escrita devem ler Cl&#233;mence Jacquot.<ref type="footnotemark" target="#note_25"/></p>
<p>Surpreendentemente, os dados obtidos por meio de <ref target="https://perma.cc/R9U6-TRGE">reconhecimento &#243;tico de caracteres</ref> (OCR) se mostraram adequados para fins de atribui&#231;&#227;o de autoria, mesmo quando os dados sofrem de altas taxas de erro de OCR.<ref type="footnotemark" target="#note_26"/></p>
<p>Por fim, existe um <ref target="https://www.zotero.org/groups/643516/stylometry_bibliography/items">grupo Zotero</ref> dedicado &#224; estilometria, onde voc&#234; pode encontrar muitas outras refer&#234;ncias a m&#233;todos e estudos.</p>
</div></div>
      <div type="2"><head>Agradecimentos</head>
<p>Agradecimentos a St&#233;fan Sinclair e Andrew Piper, em cujos semin&#225;rios na Universidade McGill este projeto come&#231;ou. Tamb&#233;m agrade&#231;o &#224; minha orientadora de tese, Susan Dalton, cuja orienta&#231;&#227;o &#233; sempre inestim&#225;vel.</p>
</div>
      <div type="2"><head>Notas finais</head>
<p><ref type="footnotemark" target="#note_1"/> : Veja, por exemplo, Justin Rice, <ref target="https://perma.cc/W8TR-UH6S">"What Makes Hemingway Hemingway? A statistical analysis of the data behind Hemingway's style"</ref> </p>
<p><ref type="footnotemark" target="#note_2"/> : Efstathios Stamatatos, &#8220;A Survey of Modern Authorship Attribution Method,&#8221; <emph>Journal of the American Society for Information Science and Technology</emph>, vol. 60, no. 3 (December 2008), p. 538&#8211;56, citation on p. 540, <ref target="https://doi.org/10.1002/asi.21001">https://doi.org/10.1002/asi.21001</ref>.</p>
<p><ref type="footnotemark" target="#note_3"/> : Jan Rybicki, &#8220;Vive La Diff&#233;rence: Tracing the (Authorial) Gender Signal by Multivariate Analysis of Word Frequencies,&#8221; <emph>Digital Scholarship in the Humanities</emph>, vol. 31, no. 4 (December 2016), pp. 746&#8211;61, <ref target="https://doi.org/10.1093/llc/fqv023">https://doi.org/10.1093/llc/fqv023</ref>. Sean G. Weidman e James O&#8217;Sullivan, &#8220;The Limits of Distinctive Words: Re-Evaluating Literature&#8217;s Gender Marker Debate,&#8221; <emph>Digital Scholarship in the Humanities</emph>, 2017, <ref target="https://doi.org/10.1093/llc/fqx017">https://doi.org/10.1093/llc/fqx017</ref>.</p>
<p><ref type="footnotemark" target="#note_4"/> : Ted Underwood, David Bamman, e Sabrina Lee, &#8220;The Transformation of Gender in English-Language Fiction&#8221;, <emph>Cultural Analytics</emph>, Feb. 13, 2018, <ref target="https://doi.org/10.22148/16.019">https://doi.org/10.22148/16.019</ref>.</p>
<p><ref type="footnotemark" target="#note_5"/> : Sven Meyer zu Eissen e Benno Stein, &#8220;Intrinsic Plagiarism Detection,&#8221; in <emph>ECIR 2006</emph>, edited by Mounia Lalmas, Andy MacFarlane, Stefan R&#252;ger, Anastasios Tombros, Theodora Tsikrika, e Alexei Yavlinsky, Berlin, Heidelberg: Springer, 2006, pp. 565&#8211;69, <ref target="https://doi.org/10.1007/11735106_66">https://doi.org/10.1007/11735106_66</ref>.</p>
<p><ref type="footnotemark" target="#note_6"/> : Cynthia Whissell, &#8220;Traditional and Emotional Stylometric Analysis of the Songs of Beatles Paul McCartney and John Lennon,&#8221; <emph>Computers and the Humanities</emph>, vol. 30, no. 3 (1996), pp. 257&#8211;65.</p>
<p><ref type="footnotemark" target="#note_7"/> : Douglass Adair, "The Authorship of the Disputed Federalist Papers", <emph>The William and Mary Quarterly</emph>, vol. 1, no. 2 (April 1944), pp. 97-122.</p>
<p><ref type="footnotemark" target="#note_8"/> : T. C. Mendenhall, "The Characteristic Curves of Composition", <emph>Science</emph>, vol. 9, no. 214 (Mar. 11, 1887), pp. 237-249.</p>
<p><ref type="footnotemark" target="#note_9"/> : Adam Kilgarriff, "Comparing Corpora", <emph>International Journal of Corpus Linguistics</emph>, vol. 6, no. 1 (2001), pp. 97-133.</p>
<p><ref type="footnotemark" target="#note_10"/> : John Burrows, "'Delta': a Measure of Stylistic Difference and a Guide to Likely Authorship", <emph>Literary and Linguistic Computing</emph>, vol. 17, no. 3 (2002), pp. 267-287.</p>
<p><ref type="footnotemark" target="#note_11"/> : Stefan Evert et al., "Understanding and explaining Delta measures for authorship attribution", <emph>Digital Scholarship in the Humanities</emph>, vol. 32, no. suppl_2 (2017), pp.  ii4-ii16.</p>
<p><ref type="footnotemark" target="#note_12"/> : Jos&#233; Calvo Tello, &#8220;Entendiendo Delta desde las Humanidades,&#8221; <ref target="https://perma.cc/LNF3-QP8V"><emph>Caracteres</emph>, vol.5, no.1 (May 27 2016)</ref>, pp.140-176.</p>
<p><ref type="footnotemark" target="#note_13"/> : Javier de la Rosa and Juan Luis Su&#225;rez, &#8220;The Life of Lazarillo de Tormes and of His Machine Learning Adversities,&#8221; <emph>Lemir</emph>, vol. 20 (2016), pp. 373-438.</p>
<p><ref type="footnotemark" target="#note_14"/> : Maria Slautina e Mikha&#239;l Marusenko, &#8220;L&#8217;&#233;mergence du style, The emergence of style,&#8221; <emph>Les Cahiers du num&#233;rique</emph>, vol. 10, no. 4 (November 2014), pp. 179&#8211;215, <ref target="https://doi.org/10.3166/LCN.10.4.179-215">https://doi.org/10.3166/LCN.10.4.179-215</ref>.</p>
<p><ref type="footnotemark" target="#note_15"/> : Ellen Jordan, Hugh Craig, e Alexis Antonia, &#8220;The Bront&#235; Sisters and the &#8216;Christian Remembrancer&#8217;: A Pilot Study in the Use of the &#8216;Burrows Method&#8217; to Identify the Authorship of Unsigned Articles in the Nineteenth-Century Periodical Press,&#8221; <emph>Victorian Periodicals Review</emph>, vol. 39, no. 1 (2006), pp. 21&#8211;45.</p>
<p><ref type="footnotemark" target="#note_16"/> : John Burrows, &#8220;All the Way Through: Testing for Authorship in Different Frequency Strata,&#8221; <emph>Literary and Linguistic Computing</emph>, vol. 22, no. 1 (April 2007), pp. 27&#8211;47, <ref target="https://doi.org/10.1093/llc/fqi067">https://doi.org/10.1093/llc/fqi067</ref>.</p>
<p><ref type="footnotemark" target="#note_17"/> : Val&#233;rie Beaudoin e Fran&#231;ois Yvon, &#8220;Contribution de La M&#233;trique &#224; La Stylom&#233;trie,&#8221; <emph>JADT 2004: 7e Journ&#233;es internationales d'Analyse statistique des Donn&#233;es Textuelles</emph>, vol. 1, Louvain La Neuve, Presses Universitaires de Louvain, 2004, pp. 107&#8211;18.</p>
<p><ref type="footnotemark" target="#note_18"/> : Marcelo Luiz Brocardo, Issa Traore, Sherif Saad e Isaac Woungang, &#8220;Authorship Verification for Short Messages Using Stylometry,&#8221; <emph>2013 International Conference on Computer, Information and Telecommunication Systems (CITS)</emph>, 2013, <ref target="https://doi.org/10.1109/CITS.2013.6705711">https://doi.org/10.1109/CITS.2013.6705711</ref>.</p>
<p><ref type="footnotemark" target="#note_19"/> : Moshe Koppel e Winter Yaron, &#8220;Determining If Two Documents Are Written by the Same Author,&#8221; <emph>Journal of the Association for Information Science and Technology</emph>, vol. 65, no. 1 (October 2013), pp. 178&#8211;87, <ref target="https://doi.org/10.1002/asi.22954">https://doi.org/10.1002/asi.22954</ref>.</p>
<p><ref type="footnotemark" target="#note_20"/> : Justin Anthony Stover et al., "Computational authorship verification method attributes a new work to a major 2nd century African author", <emph>Journal of the Association for Information Science and Technology</emph>, vol. 67, no. 1 (2016), pp. 239&#8211;242.</p>
<p><ref type="footnotemark" target="#note_21"/> : David I. Holmes, Lesley J. Gordon, e Christine Wilson, "A widow and her soldier: Stylometry and the American Civil War", <emph>Literary and Linguistic Computing</emph>, vol. 16, no 4 (2001), pp. 403&#8211;420.</p>
<p><ref type="footnotemark" target="#note_22"/> : Patrick  Juola, &#8220;Authorship Attribution,&#8221; <emph>Foundations and Trends in Information Retrieval</emph>, vol. 1, no. 3 (2007), pp. 233&#8211;334, <ref target="https://doi.org/10.1561/1500000005">https://doi.org/10.1561/1500000005</ref>.</p>
<p><ref type="footnotemark" target="#note_23"/> : Moshe Koppel, Jonathan Schler, e Shlomo Argamon, &#8220;Computational Methods in Authorship Attribution,&#8221; <emph>Journal of the Association for Information Science and Technology</emph>. vol. 60, no. 1 (January 2009), pp. 9&#8211;26, <ref target="https://doi.org/10.1002/asi.v60:1">https://doi.org/10.1002/asi.v60:1</ref>.</p>
<p><ref type="footnotemark" target="#note_24"/> : Maciej Eder, Jan Rybicki, e Mike Kestemont, &#8220;Stylometry with R: A Package for Computational Text Analysis,&#8221; <emph>The R Journal</emph>, vol. 8, no. 1 (2016), pp. 107&#8211;21.</p>
<p><ref type="footnotemark" target="#note_25"/> : Cl&#233;mence Jacquot, &#8220;R&#234;ve d'une &#233;piphanie du style: visibilit&#233; et saillance en stylistique et en stylom&#233;trie,&#8221; <emph>Revue d&#8217;Histoire Litt&#233;raire de la France</emph> , vol. 116, no. 3 (2016),  pp. 619&#8211;39.</p>
<p><ref type="footnotemark" target="#note_26"/> : Patrick Juola, John Noecker Jr, e Michael Ryan, "Authorship Attribution and Optical Character Recognition Errors", <emph>TAL</emph>, vol. 53, no. 3 (2012), pp. 101&#8211;127.</p>
</div>
    </body>
  </text>
</TEI>
