<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="instalacion-windows">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Creaci&#243;n de un entorno de desarrollo integrado para Python (Windows)</title>
  <author role="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor role="reviewers"><persName>Jim Clifford</persName><persName>Amanda Morton</persName></editor><author role="translators">V&#237;ctor Gayol</author><editor role="translation-reviewers"><persName>Jairo A. Melo</persName><persName>Maria Jos&#233; Afanador-Llach</persName><persName>Antonio Rojas Castro</persName></editor><editor role="editors">Miriam Posner</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0011</idno><date type="published">07/17/2012</date><date type="translated">03/15/2017</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#windows-installation"/>.</p><p>There are other translations: <ref target="#instalacao-windows #installation-windows-py"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Este tutorial te ayudar&#225; a configurar un entorno de desarrollo integrado para Python en un computador con el sistema operativo de Windows.</p></abstract><textClass><keywords><term xml:lang="en">get-ready</term><term xml:lang="en">python</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Respalda toda tu computadora.</head>
<p>Siempre es importante asegurarse de tener copias de seguridad hechas de modo regular y, sobre todo, recientes. Este es un buen consejo de por vida y no se limita a los momentos en los que est&#233;s dedicado a programar.</p>
</div>
      <div type="2"><head>Instalar Python v.3</head>
<p>Dir&#237;gete al <ref target="https://www.python.org">sitio web de Python</ref>, descarga la &#250;ltima versi&#243;n estable del lenguaje de programaci&#243;n Python (3.8 es la correspondiente a noviembre de 2019), e inst&#225;lalo siguiendo las instrucciones del sitio web de Python.</p>
</div>
      <div type="2"><head>Creaci&#243;n de un directorio</head>
<p>Para mantener organizados los datos en tu equipo, lo mejor es crear un directorio o carpeta en tu computadora dedicado exclusivamente a almacenar todos tus programas que escribas con Python (i.e, <code rend="inline">programming-historian</code>) y mantenlo en el lugar de tu disco duro que mejor te acomode.</p>
</div>
      <div type="2"><head>Instalar Komodo Edit</head>
<p>Komodo Edit es un editor de texto libre y de c&#243;digo abierto, pero puedes utilizar varias <ref target="https://wiki.python.org/moin/PythonEditors/">opciones de editores de texto</ref> si quieres utilizar otros programas. Puedes descargar una copia desde el <ref target="http://komodoide.com/komodo-edit/">sitio web de Komodo Edit</ref>.</p>
</div>
      <div type="2"><head>Inicia Komodo Edit</head>
<p>Se deber&#225; ver algo parecido a la siguiente ventana:</p>
<figure><desc>Komodo Edit en Windows</desc><graphic url="komodo-edit11-windows-main.png"/></figure>
<p>Si no est&#225; visible el panel de Caja de Herramientas (Toolbox) de la derecha, es necesario activarlo en el men&#250; correspondiente. Selecciona <code rend="inline">View -&gt; Tabs -&gt; Toolbox</code>. No importa si el panel del proyecto est&#225; abierto o no. T&#243;mate un tiempo para familiarizarte con el dise&#241;o del Komodo Editor. El archivo de ayuda es bastante bueno.</p>
<div type="3"><head>Configuraci&#243;n de Komodo Edit</head>
<p>Ahora es necesario configurarlo para que puedas correr los programas de Python.</p>
<p>1 .  Selecciona <code rend="inline">Edit -&gt; Preferences</code>. Esto abrir&#225; una nueva ventana de di&#225;logo. En "<emph>Languages</emph>" y "<emph>Python 3</emph>" selecciona "<emph>Browse</emph>" y navega hasta <code rend="inline">C:\Users\tunombredeusuario\AppData\Local\Programs\Python\Python38-32</code>)
Si se ve m&#225;s o menos as&#237;, oprime OK:</p>
<figure><desc>Seleccionar Python como int&#233;rprete por defecto.</desc><graphic url="komodo-edit11-windows-interpreter.png"/></figure>
<p>2 .  Enseguida en la secci&#243;n  "<emph>Preferences</emph>" selecciona <emph>Internacionalization</emph>. Selecciona <emph>Python</emph> del men&#250; despegable que se llama <emph>Language-specific Default Encoding</emph> y aseg&#250;rate que <ref target="https://es.wikipedia.org/wiki/UTF-8">UTF-8</ref> est&#233; seleccionado como el m&#233;todo de codificaci&#243;n por defecto.</p>
<figure><desc>Configurar lenguaje a UFT-8.</desc><graphic url="komodo-edit11-windows-utf-set.png"/></figure>
<p>Enseguida selecciona <code rend="inline">Toolbox -&gt; Add -&gt; New Command</code> . Esto abrir&#225; una nueva ventana de di&#225;logo en la que deber&#225;s renombrar tu comando como <code rend="inline">Run Python</code>. Debajo de <code rend="inline">Command</code> teclea:</p>
<ab><code xml:id="code_instalacion-windows_0" corresp="code_instalacion-windows_0.txt" lang="language-python" rend="block"/></ab>
<p>Si olvidas este comando, Python se quedar&#225; colgado porque no estar&#225; recibiendo las &#243;rdenes (input).</p>
<p>El campo activo &#8216;Start in&#8217; debes escribir:</p>
<ab><code xml:id="code_instalacion-windows_1" corresp="code_instalacion-windows_1.txt" lang="language-python" rend="block"/></ab>
<p>Si se ve as&#237;, oprime OK:</p>
<figure><desc>Configuraci&#243;n del comando 'Run Python'.</desc><graphic url="komodo-edit11-windows-python-command.png"/></figure>
<figure><desc>Configuraci&#243;n del comando 'Run Python Start'.</desc><graphic url="komodo-edit11-windows-python-start.png"/></figure>
<p>Tu nuevo comando debe aparecer en el panel de la caja de herramientas (<emph>Toolbox</emph>). Probablemente deber&#225;s reiniciar tu computadora para completar el paso antes de que Python trabaje con Komodo Edit.</p>
</div></div>
      <div type="2"><head>Paso 2 &#8211; &#8220;Hola Mundo&#8221; en Python</head>
<p>Es tradicional que para comenzar a programar en un nuevo lenguaje tratemos de crear un programa que despliegue la frase &#8220;Hola Mundo&#8221; y termine. Vamos a mostrar c&#243;mo hacer esto en Python y en HTML.</p>
<p>Python es un buen lenguaje de programaci&#243;n para principiantes gracias a que es un lenguaje de programaci&#243;n de muy alto nivel. Es posible, en otras palabras, escribir programas cortos que realizan una gran cantidad de procesos. Entre m&#225;s corto es el programa, lo m&#225;s probable es que todo quepa en una pantalla y que sea m&#225;s f&#225;cil hacer un seguimiento de todo en tu mente.</p>
<p>Python es un lenguaje de programaci&#243;n "interpretado". Esto significa que hay un programa de c&#243;mputo especial (conocido como int&#233;rprete) que sabe c&#243;mo seguir las instrucciones escritas en este lenguaje. Una manera de usar el int&#233;rprete es guardar todas tus instrucciones en un archivo y luego ejecutar el int&#233;rprete sobre ese archivo. El archivo que contiene instrucciones de lenguaje de programaci&#243;n es conocido como programa.  El int&#233;rprete ejecutar&#225; cada una de las instrucciones que le hayas dado en tu programa y luego se detendr&#225;. Vamos a intentar esto.</p>
<p>En tu editor de texto crea un nuevo archivo y escribe el siguiente programa de dos l&#237;neas y gu&#225;rdalo en tu carpeta <code rend="inline">programming-historian</code> con el nombre <code rend="inline">hola-mundo.py</code>.</p>
<ab><code xml:id="code_instalacion-windows_2" corresp="code_instalacion-windows_2.txt" lang="language-python" rend="block"/></ab>
<p>El editor de texto que seleccionaste debe tener un bot&#243;n <code rend="inline">Run</code>  que te permitir&#225; ejecutar tu programa. Si todo funciona bien, deber&#225;s ver algo como sigue (El ejemplo es como se ve en Komodo Edit. Da un clic en la imagen para ver una copia en tama&#241;o completo):</p>
<figure><desc>Hola Mundo en Komodo Edit</desc><graphic url="komodo-edit11-windows-hola.png"/></figure>
</div>
      <div type="2"><head>Interactuar con el int&#233;rprete de comandos (shell) de Python</head>
<p>Otra manera de interactuar con un int&#233;rprete es usando lo que se conoce como <emph>shell</emph> o int&#233;rprete de comandos. Se puede escribir en una declaraci&#243;n y oprimir la tecla Enter, y el shell responder&#225; a tus comandos. Utilizar un shell es una excelente forma de comprobar que la construcci&#243;n de tus declaraciones es adecuada al asegurarte que hace lo que tu piensas que deber&#237;a hacer. Esto se puede hacer de maneras un tanto distintas en las diversas plataformas (Mac, Windows o Linux).</p>
<p>Puedes ejecutar un shell de Python haciendo doble clic en el archivo ejecutable <code rend="inline">python.exe</code>. Si instalaste la m&#225;s reciente versi&#243;n de Python 3.8 (la m&#225;s reciente para noviembre de 2019), probablemente el archivo .exe  est&#233; localizado en el directorio <code rend="inline">C:\Users\tunombredeusuario\AppData\Local\Programs\Python\Python38-32</code>. En la ventana del int&#233;rprete de comandos ("S&#237;mbolo de Sistema"), escribe:</p>
<ab><code xml:id="code_instalacion-windows_3" corresp="code_instalacion-windows_3.txt" lang="language-python" rend="block"/></ab>
<p>Oprime la tecla Enter. La computadora responder&#225; con:</p>
<ab><code xml:id="code_instalacion-windows_4" corresp="code_instalacion-windows_4.txt" lang="language-python" rend="block"/></ab>
<p>Cuando queramos representar la interacci&#243;n con el int&#233;rprete de comandos usaremos -&gt; para indicar la respuesta del shell a tus comandos, como se muestra inmediatamente:</p>
<ab><code xml:id="code_instalacion-windows_5" corresp="code_instalacion-windows_5.txt" lang="language-python" rend="block"/></ab>
<p>En la pantalla de tu computadora aparecer&#225; de esta manera:</p>
<figure><desc>Python Shell en Windows</desc><graphic url="windows-python3-cmd.png"/></figure>
<p>Ahora que t&#250; y tu computadora est&#225;n en marcha y funcionando, podemos movernos hacia unas tareas algo m&#225;s interesantes. Si est&#225;s trabajando de manera ordenada las lecciones de Python, te sugerimos que pases ahora a la lecci&#243;n <ref target="/es/lecciones/ver-archivos-html">Para entender p&#225;ginas web y HTML</ref>.</p>
</div>
    </body>
  </text>
</TEI>
