<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="extrair-paginas-ilustradas-com-python">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Extrair P&#225;ginas Ilustradas de Bibliotecas Digitais com Python</title>
  <author role="original_author">Stephen Krewson</author><editor role="reviewers"><persName>Catherine DeRose</persName><persName>Taylor Arnold</persName></editor><author role="translators">Jo&#227;o Domingues Pereira</author><editor role="translation-reviewers"><persName>Felipe Lamarca</persName><persName>Salete Farias</persName></editor><editor role="editors">Anandi Silva Knuppel</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0040</idno><date type="published">01/14/2019</date><date type="translated">05/03/2023</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#extracting-illustrated-pages"/>.</p><p>There are other translations: <ref target=""/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>A aprendizagem de m&#225;quina e as extens&#245;es de API do HathiTrust e do Internet Archive est&#227;o a tornar mais f&#225;cil a extra&#231;&#227;o de regi&#245;es de p&#225;gina com interesse visual de volumes digitalizados. Esta li&#231;&#227;o mostra como extrair eficientemente essas regi&#245;es e, ao faz&#234;-lo, como fomentar novas quest&#245;es sobre a pesquisa visual.</p></abstract><textClass><keywords><term xml:lang="en">api</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body>
      <div type="2"><head>Vis&#227;o Geral</head>
<p>E se s&#243; quisesse ver as imagens num livro? Este &#233; um pensamento que j&#225; ocorreu tanto a jovens crian&#231;as como a pesquisadores adultos. Se soubesse que o livro est&#225; dispon&#237;vel atrav&#233;s duma biblioteca digital, seria &#250;til fazer o <emph>download</emph> somente das p&#225;ginas com imagens e ignorar o resto.</p>
<p>Aqui est&#227;o as miniaturas de p&#225;gina dum volume do HathiTrust com o identificador exclusivo <code rend="inline">osu.32435078698222</code>. Ap&#243;s o processo descrito nesta li&#231;&#227;o, apenas as p&#225;ginas com imagens (31 no total) foram baixadas como JPEGs para uma pasta.</p>
<figure><desc>Visualiza&#231;&#227;o dum volume para o qual s&#243; as p&#225;ginas com imagens foram baixadas.</desc><graphic url="file-explorer-example.png"/></figure>
<p>Para ver quantas p&#225;ginas <emph>n&#227;o ilustradas</emph> foram filtradas, compare com o <ref target="https://babel.hathitrust.org/cgi/pt?id=osu.32435078698222%3Bview=thumb%3Bseq=1">conjunto total de miniaturas</ref> para todas as 148 p&#225;ginas nesta edi&#231;&#227;o revisada de 1845 do livro infantil <emph>bestseller</emph> de Samuel Griswold Goodrich, <emph>The Tales of Peter Parley About America</emph> (1827).</p>
<figure><desc>Visualiza&#231;&#227;o das miniaturas do HathiTrust para todas as p&#225;ginas.</desc><graphic url="parley-full-thumbnails.png"/></figure>
<p>Esta li&#231;&#227;o mostra como completar estas etapas de filtragem e de <emph>download</emph> para volumes de texto em dom&#237;nio p&#250;blico detidos pelo HathiTrust (HT) e pelo Internet Archive (IA), duas das maiores bibliotecas digitais no mundo. Ser&#225; do interesse de qualquer um que deseje criar cole&#231;&#245;es de imagens com o fim de aprender sobre a Hist&#243;ria da Ilustra&#231;&#227;o e o <emph>layout</emph> (<emph>mise en page</emph>) dos livros. As abordagens visuais &#224; bibliografia digital est&#227;o a tornar-se populares, seguindo os esfor&#231;os pioneiros do <ref target="https://perma.cc/3QYS-XNSF">EBBA</ref> e do <ref target="https://perma.cc/SH49-K56K">Aida</ref>. Projetos recentemente conclu&#237;dos ou financiados exploram maneiras de <ref target="https://web.archive.org/web/20190526050917/http://culturalanalytics.org/2018/12/detecting-footnotes-in-32-million-pages-of-ecco/">identificar notas de rodap&#233;</ref> e de <ref target="https://perma.cc/QB4J-55GU">rastrear notas de margem de p&#225;gina</ref>, para dar s&#243; dois <ref target="https://perma.cc/9RC2-PJBL">exemplos</ref>.</p>
<p>A minha pr&#243;pria pesquisa tenta responder a quest&#245;es emp&#237;ricas sobre altera&#231;&#245;es na frequ&#234;ncia e modo de ilustra&#231;&#227;o em textos m&#233;dicos e educacionais do s&#233;culo dezanove. Isto envolve agregar m&#250;ltiplas imagens por livro e tentar estimar que processo de impress&#227;o foi usado para fazer tais imagens. Um caso de uso mais direcionado para a extra&#231;&#227;o de p&#225;ginas ilustradas pode ser a cataloga&#231;&#227;o de ilustra&#231;&#245;es ao longo de <ref target="https://perma.cc/2FCU-YW6D">diferentes edi&#231;&#245;es</ref> do mesmo livro. Trabalhos futuros poder&#227;o investigar com sucesso as caracter&#237;sticas visuais e o <emph>significado</emph> das imagens extra&#237;das: a sua cor, o seu tamanho, o seu tema, o seu g&#233;nero, o n&#250;mero de figuras e assim por diante.</p>
<p>Como obter informa&#231;&#227;o <emph>localizada</emph> sobre regi&#245;es visuais de interesse est&#225; para al&#233;m do &#226;mbito desta li&#231;&#227;o, visto que o processo envolve uma quantidade significativa de aprendizagem de m&#225;quina. No entanto, a classifica&#231;&#227;o sim/n&#227;o de p&#225;ginas com (ou sem) imagens &#233; um primeiro passo pr&#225;tico para reduzir o enorme volume de <emph>todas</emph> as p&#225;ginas para cada livro numa cole&#231;&#227;o visada, tornando vi&#225;vel a localiza&#231;&#227;o de ilustra&#231;&#245;es. Para dar um ponto de refer&#234;ncia, os textos m&#233;dicos do s&#233;culo dezanove cont&#234;m (em m&#233;dia) ilustra&#231;&#245;es em 1-3% das suas p&#225;ginas. Se estiver a tentar estudar a ilustra&#231;&#227;o no interior dum <emph>corpus</emph> duma biblioteca digital sobre o qual n&#227;o tem qualquer informa&#231;&#227;o preexistente, &#233;, consequentemente, razo&#225;vel assumir que 90+% das p&#225;ginas nesse <emph>corpus</emph> N&#195;O estar&#227;o ilustradas.</p>
<p>O HT e o IA permitem que a quest&#227;o com imagens/sem imagens seja respondida indiretamente atrav&#233;s da an&#225;lise dos dados gerados pelo <emph>software</emph> <emph>optical character recognition</emph> (OCR) ou reconhecimento &#243;tico de caracteres, em portugu&#234;s (o OCR &#233; aplicado ap&#243;s um volume f&#237;sico ser digitalizado com o objetivo de gerar uma transcri&#231;&#227;o do texto muitas vezes desordenada). Aproveitar o resultado do <emph>output</emph> do OCR para encontrar p&#225;ginas ilustradas foi proposto primeiramente por Kalev Leetaru numa <ref target="https://perma.cc/3J79-4QA6">colabora&#231;&#227;o de 2014</ref> com o Internet Archive e o Flickr. Esta li&#231;&#227;o transfere a abordagem de Leetaru para o HathiTrust e tira proveito de bibliotecas de processamento de XML mais r&#225;pidas no Python, bem como da gama recentemente ampliada de formatos de ficheiro de imagem do IA.</p>
<p>Uma vez que o HT e o IA exp&#245;em a sua informa&#231;&#227;o derivada do OCR de maneiras ligeiramente diferentes, eu irei adiar a apresenta&#231;&#227;o dos detalhes das "caracter&#237;sticas visuais" de cada biblioteca para as suas sec&#231;&#245;es respetivas.</p>
</div>
      <div type="2"><head>Objetivos</head>
<p>No final da li&#231;&#227;o, o leitor ser&#225; capaz de:</p>
<list type="unordered">
<item>Configurar a vers&#227;o "m&#237;nima" da distribui&#231;&#227;o Anaconda do Python (Miniconda) e criar um ambiente;</item>
<item>Salvar e iterar sobre uma lista de IDs de volumes do HT ou do IA gerados por uma pesquisa;</item>
<item>Acessar aos <emph>application programming interfaces</emph> (APIs) ou interfaces de programa&#231;&#227;o de aplica&#231;&#245;es, em portugu&#234;s, de dados do HT e do IA atrav&#233;s das bibliotecas do Python;</item>
<item>Encontrar caracter&#237;sticas visuais ao n&#237;vel da p&#225;gina;</item>
<item>Fazer o <emph>download</emph> dos JPEGs de p&#225;ginas programaticamente.</item>
</list>
<p>O grande objetivo &#233; fortalecer as compet&#234;ncias de coleta e explora&#231;&#227;o de dados ao criar um <emph>corpus</emph> de ilustra&#231;&#227;o hist&#243;rica. Combinar dados de imagem com os metadados dum volume permite a formula&#231;&#227;o de quest&#245;es de pesquisa promissoras sobre a mudan&#231;a visual ao longo do tempo.</p>
</div>
      <div type="2"><head>Requisitos</head>
<p>Os requisitos de <emph>software</emph> desta li&#231;&#227;o s&#227;o m&#237;nimos: o acesso a uma m&#225;quina executando um sistema operacional padr&#227;o e um navegador de internet. O Miniconda est&#225; dispon&#237;vel em duas vers&#245;es de 32 e de 64 <emph>bits</emph> para Windows, macOS e Linux. O Python 3 &#233; a vers&#227;o est&#225;vel atual da linguagem e ser&#225; suportado indefinidamente<ref type="footnotemark" target="#note_1"/>.</p>
<p>Este tutorial assume um conhecimento b&#225;sico da linha de comando e da linguagem de programa&#231;&#227;o Python. O leitor deve compreender as conven&#231;&#245;es para coment&#225;rios e comandos num tutorial baseado num <emph>shell</emph>. Eu recomendo a <ref target="/en/lessons/intro-to-bash"><emph>Introduction to the Bash Command Line</emph></ref>, de Ian Milligan e James Baker, para aprender ou para rever as suas compet&#234;ncias com a linha de comando.</p>
</div>
      <div type="2"><head>Configura&#231;&#227;o</head>
<div type="3"><head>Depend&#234;ncias</head>
<p>Os leitores mais experientes podem querer simplesmente instalar as depend&#234;ncias e executar os <emph>notebooks</emph> nos seus ambientes de escolha. Mais informa&#231;&#245;es sobre a minha pr&#243;pria configura&#231;&#227;o do Miniconda (e algumas diferen&#231;as entre o Windows e o *nix) s&#227;o providenciadas.</p>
<quote>
<p><hi rend="bold">Nota de tradu&#231;&#227;o</hi>: Para instalar as depend&#234;ncias, altere o seu diret&#243;rio de trabalho para a pasta onde se encontra instalado o Python executando o comando <code rend="inline">cd</code> e, depois, digite o comando <code rend="inline">pip install</code> ou <code rend="inline">pip3 install</code> acompanhado pelas seguintes linhas:</p>
</quote>
<list type="unordered">
<item><code rend="inline">hathitrust-api</code> ou <code rend="inline">hathitrust_api</code> (<ref target="https://github.com/rlmv/hathitrust-api">Documentos de Instala&#231;&#227;o</ref>);</item>
<item><code rend="inline">internetarchive</code> (<ref target="https://archive.org/services/docs/api/internetarchive/">Documentos de Instala&#231;&#227;o</ref>);</item>
<item><code rend="inline">jupyter</code> (<ref target="https://jupyter.org/install">Documentos de Instala&#231;&#227;o</ref>);</item>
<item><code rend="inline">requests</code> (<ref target="https://requests.readthedocs.io/en/latest/user/install/#install">Documentos de Instala&#231;&#227;o</ref>) [o criador recomenda a instala&#231;&#227;o do<code rend="inline">pipenv</code>; para a instala&#231;&#227;o do <code rend="inline">pip</code>, veja <ref target="https://pypi.org/project/requests2/">PyPI</ref>].</item>
</list>
</div><div type="3"><head>Ficheiros da Li&#231;&#227;o</head>
<p>Fa&#231;a o <emph>download</emph> desta <ref target="/assets/extracting-illustrated-pages/lesson-files.zip">pasta comprimida</ref> que cont&#233;m dois <emph>Jupyter notebooks</emph>, um para cada uma das bibliotecas digitais. A pasta tamb&#233;m cont&#233;m um ficheiro de metadados JSON de amostra descrevendo uma cole&#231;&#227;o do HathiTrust. Descomprima e confirme que os seguintes ficheiros est&#227;o presentes: <code rend="inline">554050894-1535834127.json</code>, <code rend="inline">hathitrust.ipynb</code> e <code rend="inline">internetarchive.ipynb</code>.</p>
<p style="alert alert-warning">
Todos os comandos subsequentes assumem que o seu diret&#243;rio de trabalho atual &#233; a pasta que cont&#233;m os ficheiros da li&#231;&#227;o.
</p>
<div type="4"><head>Destino do <emph>Download</emph></head>
<p>Aqui est&#225; o diret&#243;rio predefinido que ser&#225; criado assim que todas as c&#233;lulas em ambos os <emph>notebooks</emph> tiverem sido executadas (como providenciado). Depois de obter uma lista de quais p&#225;ginas num volume cont&#234;m imagens, as fun&#231;&#245;es de <emph>download</emph> do HT e do IA solicitam essas p&#225;ginas como JPEGs (nomeadas pelo n&#250;mero de p&#225;gina) e arquivam-nas em subdiret&#243;rios (nomeados pelo ID do item). &#201; claro que o leitor pode usar diferentes listas de volumes ou mudar o destino <code rend="inline">out_dir</code> para algo que n&#227;o <code rend="inline">items</code>.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_0" corresp="code_extrair-paginas-ilustradas-com-python_0.txt" rend="block"/></ab>
<p>As fun&#231;&#245;es de <emph>download</emph> s&#227;o lentas; se executar os <emph>notebooks</emph> novamente, com o diret&#243;rio <code rend="inline">items</code> similar ao que se apresenta em cima, qualquer item que j&#225; tenha a sua pr&#243;pria subpasta ser&#225; ignorado.</p>
</div></div><div type="3"><head>Anaconda (Opcional)</head>
<p>A Anaconda &#233; a principal distribui&#231;&#227;o cient&#237;fica do Python. O seu gerenciador de pacotes <code rend="inline">conda</code> permite-lhe instalar bibliotecas como a <code rend="inline">numpy</code> e a <code rend="inline">tensorflow</code> com facilidade. A vers&#227;o "Miniconda" n&#227;o &#233; acompanhada por quaisquer pacotes sup&#233;rfluos pr&#233;-instalados, o que incentiva o leitor a manter o seu ambiente de base limpo e a instalar apenas o que necessita para um projeto dentro dum ambiente nomeado.</p>
<p>Fa&#231;a o <emph>download</emph> e instale o <ref target="https://conda.io/miniconda.html">Miniconda</ref>. Escolha a vers&#227;o est&#225;vel mais recente do Python 3. Se tudo correr bem, o leitor conseguir&#225; executar <code rend="inline">which conda</code> (no Linux/macOS) ou <code rend="inline">where conda</code> (no Windows) no seu <emph>shell</emph> e ver a localiza&#231;&#227;o do programa execut&#225;vel no <emph>output</emph>.</p>
<p>A Anaconda tem uma <ref target="http://web.archive.org/web/20190115051900/https://conda.io/docs/_downloads/conda-cheatsheet.pdf"><emph>cheat sheet</emph></ref> ou folha de dicas, em portugu&#234;s, &#250;til para comandos de uso frequente.</p>
<div type="4"><head>Criar um Ambiente</head>
<p>Os ambientes, entre outras coisas, ajudam a controlar a complexidade associada ao uso de m&#250;ltiplos gerenciadores de pacotes em conjunto. Nem todas as bibliotecas do Python podem ser instaladas atrav&#233;s do <code rend="inline">conda</code>. Em alguns casos, n&#243;s recorreremos ao gestor de pacote padr&#227;o do Python, o <code rend="inline">pip</code> (ou altera&#231;&#245;es planejadas, como o <code rend="inline">pipenv</code>). No entanto, quando o fizermos, n&#243;s usaremos uma vers&#227;o do <code rend="inline">pip</code> instalada atrav&#233;s do <code rend="inline">conda</code>. Isto mant&#233;m todos os pacotes que n&#243;s precisamos para o projeto no mesmo espa&#231;o virtual.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_1" corresp="code_extrair-paginas-ilustradas-com-python_1.txt" lang="language-bash" rend="block"/></ab>
<p>Agora n&#243;s criamos um ambiente nomeado, configuramo-lo para usar Python 3, e ativamo-lo.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_2" corresp="code_extrair-paginas-ilustradas-com-python_2.txt" lang="language-bash" rend="block"/></ab>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_3" corresp="code_extrair-paginas-ilustradas-com-python_3.txt" lang="language-bash" rend="block"/></ab>
<p>Para sair dum ambiente, execute <code rend="inline">source deactivate</code> no Linux/macOS ou <code rend="inline">deactivate</code> no Windows. Mas certifique-se que permanece no ambiente <code rend="inline">extract-pages</code> durante o decorrer da li&#231;&#227;o!</p>
</div><div type="4"><head>Instalar os Pacotes do Conda</head>
<p>N&#243;s podemos usar o <code rend="inline">conda</code> para instalar os nossos primeiros pacotes. Todos os outros pacotes necess&#225;rios (gzip, JSON, os, sys e time) fazem parte da <ref target="https://docs.python.org/3/library/">biblioteca padr&#227;o do Python</ref>. Note como n&#243;s precisamos de especificar um canal em alguns casos. O leitor pode pesquisar por pacotes no <ref target="https://anaconda.org/">Anaconda Cloud</ref>.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_4" corresp="code_extrair-paginas-ilustradas-com-python_4.txt" lang="language-bash" rend="block"/></ab>
<p>O Jupyter tem muitas depend&#234;ncias (outros pacotes dos quais depende), por isso esta etapa pode exigir alguns minutos. Recorde-se que quando o <code rend="inline">conda</code> lhe pergunta se deseja continuar com a instala&#231;&#227;o por via da quest&#227;o <code rend="inline">Proceed ([y]/n)?</code>, o leitor deve digitar um <code rend="inline">y</code> ou um <code rend="inline">yes</code> e, depois, pressionar <emph>Enter</emph> para aceitar a instala&#231;&#227;o do pacote.</p>
<p style="alert alert-warning">
Nos bastidores, o <code rend="inline">conda</code> est&#225; a trabalhar para certificar-se que todos os pacotes e depend&#234;ncias necess&#225;rios ser&#227;o instalados numa maneira compat&#237;vel.
</p>
</div><div type="4"><head>Instalar Pacotes do Pip</head>
<p>Se estiver a usar um ambiente <code rend="inline">conda</code>, &#233; melhor usar a vers&#227;o local do <code rend="inline">pip</code>. Confirme que os seguintes comandos d&#227;o como resultado do <emph>output</emph> um programa cujo caminho absoluto cont&#233;m algo como <code rend="inline">/Miniconda/envs/extract-pages/Scripts/pip</code>.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_5" corresp="code_extrair-paginas-ilustradas-com-python_5.txt" lang="language-bash" rend="block"/></ab>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_6" corresp="code_extrair-paginas-ilustradas-com-python_6.txt" lang="language-bash" rend="block"/></ab>
<p>Se vir duas vers&#245;es do <code rend="inline">pip</code> no <emph>output</emph> em cima, certifique-se de digitar o caminho absoluto para a vers&#227;o do ambiente <emph>local</emph> ao instalar as bibliotecas <emph>wrapper</emph> da API.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_7" corresp="code_extrair-paginas-ilustradas-com-python_7.txt" lang="language-bash" rend="block"/></ab>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_8" corresp="code_extrair-paginas-ilustradas-com-python_8.txt" lang="language-bash" rend="block"/></ab>
</div></div><div type="3"><head><emph>Jupyter Notebooks</emph></head>
<p>O <ref target="/en/lessons/text-mining-with-extracted-features#start-a-notebook"><emph>Text Mining in Python Through the HTRC Feature Reader</emph></ref>, de Peter Organisciak e Boris Capitanu, explica os benef&#237;cios dos <emph>notebooks</emph> para o desenvolvimento e a explora&#231;&#227;o de dados. Tamb&#233;m cont&#233;m informa&#231;&#227;o &#250;til sobre como executar eficazmente as c&#233;lulas. Visto que n&#243;s instal&#225;mos a vers&#227;o minimalista da Anaconda, n&#243;s precisamos de iniciar o Jupyter a partir da linha de comandos. No seu <emph>shell</emph> (a partir do interior da pasta contendo os ficheiros da li&#231;&#227;o) execute <code rend="inline">jupyter notebook</code>.</p>
<p>Isto executar&#225; o servidor do <emph>notebook</emph> no seu <emph>shell</emph> e iniciar&#225; o seu navegador de internet predefinido com a p&#225;gina inicial do Jupyter<ref type="footnotemark" target="#note_2"/>. A p&#225;gina inicial mostra todos os ficheiros no diret&#243;rio de trabalho atual.</p>
<figure><desc>A p&#225;gina inicial do Jupyter mostrando os ficheiros da li&#231;&#227;o.</desc><graphic url="jupyter-home.png"/></figure>
<p style="alert alert-warning">
No seu shell, certifique-se que usou o comando <code rend="inline">cd</code> para ir at&#233; ao diret&#243;rio descomprimido <code rend="inline">lesson-files</code>.
</p>
<p>Clique nos <emph>notebooks</emph> <code rend="inline">hathitrust.ipynb</code> e <code rend="inline">internetarchive.ipynb</code> para abri-los em novas abas do navegador de internet. A partir daqui, n&#243;s n&#227;o precisamos de executar qualquer comando no <emph>shell</emph>. Os <emph>notebooks</emph> permitem-nos executar o c&#243;digo Python e ter acesso total ao sistema de pastas do computador. Quando o leitor tiver terminado, pode parar o servidor do <emph>notebook</emph> carregando em "<emph>Quit</emph>" na p&#225;gina inicial do Jupyter ou executando <code rend="inline">ctrl+c</code> no <emph>shell</emph>.</p>
</div></div>
      <div type="2"><head>HathiTrust</head>
<div type="3"><head>Acesso &#224; API</head>
<p>O leitor precisa efetuar um registro no HathiTrust antes de usar o API de dados. Dirija-se ao <ref target="https://babel.hathitrust.org/cgi/kgs/request">portal de registro</ref> e preencha o seu nome, a sua organiza&#231;&#227;o e o seu e-mail para requerer chaves de acesso. O leitor dever&#225; receber uma resposta no e-mail dentro de cerca dum minuto (<hi rend="bold">nota de tradu&#231;&#227;o</hi>: verifique tamb&#233;m a caixa de <emph>spam</emph>). Clique no link, que o trar&#225; a uma p&#225;gina tempor&#225;ria com ambas as chaves exibidas.</p>
<p>No <emph>notebook</emph> <code rend="inline">hathitrust.ipynb</code>, examine a primeira c&#233;lula (mostrada em baixo). Preencha as suas chaves da API como indicado. Depois, execute a c&#233;lula clicando em "<emph>Run</emph>" na barra de navega&#231;&#227;o do <emph>notebook</emph>.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_9" corresp="code_extrair-paginas-ilustradas-com-python_9.txt" lang="language-python" rend="block"/></ab>
<p style="alert alert-warning">
Cuidado! N&#227;o exponha as suas chaves de acesso atrav&#233;s dum reposit&#243;rio p&#250;blico no GitHub (ou outro <i>host</i> de controle de vers&#245;es). Elas ser&#227;o pesquis&#225;veis por qualquer outra pessoa. Uma boa pr&#225;tica para um projeto Python &#233; a de armazenar as suas chaves de acesso como vari&#225;veis de ambiente ou salv&#225;-las num ficheiro que n&#227;o &#233; <i>versionado</i>.
</p>
</div><div type="3"><head>Criar uma Lista de Volumes</head>
<p>O HT permite a qualquer um fazer uma cole&#231;&#227;o de itens&#8212;o leitor nem sequer tem que estar na sua conta! No entanto, o leitor deveria registrar uma conta se quiser salvar a sua lista de volumes. Siga as <ref target="https://babel.hathitrust.org/cgi/mb?colltype=updated">instru&#231;&#245;es</ref> para fazer algumas pesquisas no texto completo e para, depois, adicionar resultados escolhidos a uma cole&#231;&#227;o. Atualmente, o HathiTrust n&#227;o tem uma API de pesquisa p&#250;blica para adquirir volumes programaticamente; o leitor precisa de pesquisar atrav&#233;s da sua <emph>interface</emph> da internet.</p>
<p>Ao atualizar uma cole&#231;&#227;o, o HT mant&#233;m o rastro dos metadados associados para cada item nela. Eu inclu&#237; nos ficheiros da li&#231;&#227;o os metadados para uma li&#231;&#227;o de amostra no formato JSON. Se quisesse usar o ficheiro da sua pr&#243;pria cole&#231;&#227;o do HT, o leitor navegaria at&#233; &#224; p&#225;gina das suas cole&#231;&#245;es e colocaria o cursor do <emph>mouse</emph> sobre o link dos metadados &#224; esquerda para revelar a op&#231;&#227;o para fazer o <emph>download</emph> como JSON, como observado na seguinte captura de tela.</p>
<figure><desc>Captura de tela de como fazer o *download* dos metadados de cole&#231;&#245;es no formato JSON.</desc><graphic url="download-ht-json.png"/></figure>
<p>Assim que o leitor tiver feito o <emph>download</emph> do ficheiro JSON, basta mov&#234;-lo para o diret&#243;rio onde colocou os <emph>Jupyter notebooks</emph>. Substitua o nome do ficheiro JSON no <emph>notebook</emph> do HT com o nome do ficheiro da sua cole&#231;&#227;o.</p>
<p>O <emph>notebook</emph> mostra como usar <emph>list comprehension</emph> para obter todas as <emph>strings</emph> <code rend="inline">htitem_id</code> dentro do objeto <code rend="inline">gathers</code> que contem todas as informa&#231;&#245;es da cole&#231;&#227;o.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_10" corresp="code_extrair-paginas-ilustradas-com-python_10.txt" lang="language-python" rend="block"/></ab>
<p style="alert alert-warning">
Os tutoriais normalmente mostram-lhe como processar um item de exemplo (muitas vezes de tamanho ou complexidade trivial). Isto &#233; pedagogicamente conveniente, mas significa que o leitor est&#225; menos equipado para aplicar esse c&#243;digo a m&#250;ltiplos itens&#8212;de longe o caso de uso mais comum. Nos <i>notebooks</i>, o leitor ver&#225; como encapsular transforma&#231;&#245;es aplicadas a um item em <i>fun&#231;&#245;es</i> que podem ser usadas num <i>loop</i> sobre uma cole&#231;&#227;o de itens.
</p>
</div><div type="3"><head>Caracter&#237;stica Visual: IMAGE_ON_PAGE</head>
<p>Dada uma lista de volumes, n&#243;s queremos explorar que caracter&#237;sticas visuais eles t&#234;m ao n&#237;vel da p&#225;gina. A <ref target="https://perma.cc/Y6UU-G9HZ">documenta&#231;&#227;o mais recente</ref> (2015) para o API de dados descreve um objeto metadados chamado <code rend="inline">htd:pfeat</code> nas p&#225;ginas 9-10. <code rend="inline">htd:pfeat</code> &#233; a abrevia&#231;&#227;o para "HathiTrust Data API: Page Features".</p>
<quote>
<list type="unordered">
<item>
<code rend="inline">htd:pfeat</code>&#173; - the page feature key (if available):<list type="unordered">
<item>CHAPTER_START</item>
<item>COPYRIGHT</item>
<item>FIRST_CONTENT_CHAPTER_START</item>
<item>FRONT_COVER</item>
<item>INDEX</item>
<item>REFERENCES</item>
<item>TABLE_OF_CONTENTS</item>
<item>TITLE</item>
</list>
</item>
</list>
</quote>
<p>O que o <emph>wrapper</emph> <code rend="inline">hathitrust-api</code> faz &#233; disponibilizar os metadados completos para um volume do HT como um objeto Python. Dado o identificador dum volume, n&#243;s podemos pedir os seus metadados e, depois, fazer o <emph>drill down</emph> atrav&#233;s da <emph>sequ&#234;ncia</emph> de p&#225;ginas at&#233; &#224; informa&#231;&#227;o ao n&#237;vel da p&#225;gina. A <emph>lista</emph> <code rend="inline">htd:pfeat</code> est&#225; associada com cada p&#225;gina num volume e, em teoria, cont&#233;m todas as caracter&#237;sticas que se aplicam a essa p&#225;gina. Na pr&#225;tica, existem mais algumas <emph>tags</emph> de caracter&#237;sticas do que as oito listadas em cima. Aquela com a qual n&#243;s iremos trabalhar chama-se <code rend="inline">IMAGE_ON_PAGE</code> e &#233; mais abstratamente visual que <emph>tags</emph> estruturais como <code rend="inline">CHAPTER_START</code>.</p>
<p>Tom Burton-West, um bibliotec&#225;rio pesquisador na biblioteca da <emph>University of Michigan</emph>, trabalha em estreita colabora&#231;&#227;o com o HathiTrust e o HTRC, o Centro de Pesquisa do HathiTrust. O Tom disse-me por e-mail que o HathiTrust recebe a informa&#231;&#227;o <code rend="inline">htd:pfeat</code> via o Google, com o qual trabalham proximamente desde a funda&#231;&#227;o do HT, em 2008. Um contacto no Google deu permiss&#227;o ao Tom para partilhar o seguinte:</p>
<quote>
<p>Estas <emph>tags</emph> s&#227;o derivadas duma combina&#231;&#227;o de Heur&#237;stica, de aprendizagem de m&#225;quina e de anota&#231;&#227;o humana.</p>
</quote>
<p>Um exemplo heur&#237;stico pode ser o facto do primeiro elemento na sequ&#234;ncia de p&#225;ginas do volume ser quase sempre a <code rend="inline">FRONT_COVER</code>. A aprendizagem de m&#225;quina pode ser usada para treinar modelos a discriminar, digamos, entre dados de imagem que s&#227;o mais t&#237;picos das linhas de prosa numa escrita ocidental ou das linhas numa gravura. A anota&#231;&#227;o humana &#233; a atribui&#231;&#227;o manual de etiquetas a imagens. A habilidade de ver as ilustra&#231;&#245;es dum volume nos bancos de dados do EEBO e do ECCO &#233; um exemplo de anota&#231;&#227;o humana.</p>
<p>O uso da "aprendizagem de m&#225;quina" pelo Google parece um pouco misterioso. At&#233; o Google publicitar os seus m&#233;todos, &#233; imposs&#237;vel saber todos os detalhes. No entanto, &#233; prov&#225;vel que as <emph>tags</emph> <code rend="inline">IMAGE_ON_PAGE</code> tenham sido propostas pela primeira vez ap&#243;s a dete&#231;&#227;o de blocos de "Imagens" nos ficheiros de <emph>output</emph> do OCR (um processo discutido em baixo, na sec&#231;&#227;o do Internet Archive). Mais filtragem pode, ent&#227;o, ser aplicada.</p>
</div><div type="3"><head>Passo a Passo Para o C&#243;digo</head>
<div type="4"><head>Encontrar as imagens</head>
<p>N&#243;s vimos como criar uma lista de volumes e observ&#225;mos que a API de dados pode ser usada para obter objetos metadados contendo caracter&#237;sticas experimentais ao n&#237;vel da p&#225;gina. A fun&#231;&#227;o essencial no <emph>notebook</emph> do HT tem a assinatura digital <code rend="inline">ht_picture_download(item_id, out_dir=None)</code>. Dado um identificador exclusivo e um diret&#243;rio de destino opcional, esta fun&#231;&#227;o ir&#225;, em primeiro lugar, obter os metadados do volume a partir da API e convert&#234;-los num formato JSON. Depois, percorre a sequ&#234;ncia de p&#225;ginas e verifica se a <emph>tag</emph> <code rend="inline">IMAGE_ON_PAGE</code> est&#225; na lista <code rend="inline">htd:pfeat</code> (se a mesma existir).</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_11" corresp="code_extrair-paginas-ilustradas-com-python_11.txt" lang="language-python" rend="block"/></ab>
<p>Note que n&#243;s precisamos de fazer o <emph>drill down</emph> por v&#225;rios n&#237;veis at&#233; ao objeto do n&#237;vel de topo para obter o objeto <code rend="inline">htd:seq</code>, sobre o qual n&#243;s podemos iterar.</p>
<p>As duas exce&#231;&#245;es que eu quero evitar s&#227;o o <code rend="inline">KeyError</code>, que ocorre quando a p&#225;gina n&#227;o tem qualquer caracter&#237;stica ao n&#237;vel da p&#225;gina a si associada, e o <code rend="inline">TypeError</code>, que ocorre quando o campo <code rend="inline">pseq</code> para a p&#225;gina &#233;, por alguma raz&#227;o, n&#227;o num&#233;rico e, portanto, n&#227;o pode ser destinado a um <code rend="inline">int</code>. Se algo correr mal com uma p&#225;gina, n&#243;s simplesmente executamos <code rend="inline">continue</code> para passar &#224; pr&#243;xima. O plano &#233; obter todos os dados bons que conseguirmos. N&#227;o &#233; limpar inconsist&#234;ncias ou falhas nos metadados do item.</p>
</div><div type="4"><head>Fazer o <emph>Download</emph> das Imagens</head>
<p>Assim que <code rend="inline">img_pages</code> cont&#233;m a lista completa de p&#225;ginas com a <emph>tag</emph> <code rend="inline">IMAGE_ON_PAGE</code>, n&#243;s podemos fazer o download dessas p&#225;ginas. Note que, se nenhum <code rend="inline">out_dir</code> for fornecido a <code rend="inline">ht_picture_download()</code>, ent&#227;o a fun&#231;&#227;o simplesmente retorna a lista <code rend="inline">img_pages</code> e N&#195;O faz o <emph>download</emph> do quer que seja.</p>
<p>A chamada da API <code rend="inline">getpageimage()</code> retorna um JPEG por predefini&#231;&#227;o. N&#243;s simplesmente colocamos os bytes do JPEG num ficheiro na forma normal. Dentro da subpasta do volume (ela pr&#243;pria dentro do <code rend="inline">out_dir</code>), as p&#225;ginas ser&#227;o nomeadas <code rend="inline">1.jpg</code> para a p&#225;gina 1 e assim sucessivamente.</p>
<p>Uma coisa a considerar &#233; a nossa taxa de uso da API. N&#243;s n&#227;o queremos abusar do nosso acesso ao fazer centenas de pedidos por minuto. Para estar a salvo, especialmente se pretendermos executar grandes trabalhos, n&#243;s esperamos dois segundos antes de fazer cada pedido de p&#225;gina. Isto pode ser frustrante a curto prazo, mas ajuda a evitar o sufocamento ou a suspen&#231;&#227;o da API.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_12" corresp="code_extrair-paginas-ilustradas-com-python_12.txt" lang="language-python" rend="block"/></ab>
</div></div></div>
      <div type="2"><head>Internet Archive</head>
<div type="3"><head>Acesso &#224; API</head>
<p>N&#243;s conectamos &#224; biblioteca API do Python usando uma conta no Archive.org com e-mail e palavra-chave ao inv&#233;s das chaves de acesso do API. Isto &#233; discutido no <ref target="https://archive.org/services/docs/api/internetarchive/quickstart.html">Guia Quickstart</ref>. Se n&#227;o tiver uma conta, <ref target="https://archive.org/account/login.createaccount.php">registre-se</ref> para obter o seu "Virtual Library Card".</p>
<p>Na primeira c&#233;lula do <emph>notebook</emph> <code rend="inline">internetarchive.ipynb</code>, introduza as suas credenciais como indicado. Execute a c&#233;lula para autenticar-se perante a API.</p>
<quote>
<p><hi rend="bold">Nota de tradu&#231;&#227;o</hi>: O comando <code rend="inline">ia.configure(ia_email, ia_password)</code> &#233; atualmente desnecess&#225;rio e pode gerar um erro extenso, em cuja mensagem final consta: <code rend="inline">InvalidURL: Invalid URL 'https:///services/xauthn/': No host supplied</code>. Sugerimos que o mesmo n&#227;o seja executado no ficheiro IPYNB.</p>
</quote>
</div><div type="3"><head>Criar uma Lista de Volumes</head>
<p>A biblioteca IA do Python permite-lhe submeter <emph>query strings</emph> e receber uma lista de pares chave-valor correspondentes na qual a palavra "<emph>identifier</emph>", ou identificador, em portugu&#234;s, &#233; a chave e o verdadeiro identificador &#233; o valor. A sintaxe para uma <emph>query</emph> &#233; explicada na <ref target="https://archive.org/advancedsearch.php">p&#225;gina de Advanced Search</ref> para o IA. O leitor pode especificar par&#226;metros ao usar uma palavra-chave como "<emph>date</emph>" ou "<emph>mediatype</emph>" seguida de dois pontos e o valor que quer atribuir a esse par&#226;metro. Por exemplo, eu s&#243; quero resultados que s&#227;o <emph>textos</emph> (em oposi&#231;&#227;o a v&#237;deos, <emph>etc.</emph>). Certifique-se que os par&#226;metros e as op&#231;&#245;es que est&#225; a tentar usar s&#227;o suportadas pela funcionalidade de pesquisa do IA. Caso contr&#225;rio, pode perder ou obter resultados estranhos e n&#227;o saber porqu&#234;.</p>
<p>No <emph>notebook</emph>, eu gero uma lista de IDs do IA com o seguinte c&#243;digo:</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_13" corresp="code_extrair-paginas-ilustradas-com-python_13.txt" lang="language-python" rend="block"/></ab>
</div><div type="3"><head>Caracter&#237;stica Visual: Blocos de Imagens</head>
<p>O Internet Archive n&#227;o apresenta quaisquer caracter&#237;sticas ao n&#237;vel da p&#225;gina. Ao inv&#233;s, disponibiliza um certo n&#250;mero de ficheiros brutos do processo de digitaliza&#231;&#227;o aos utilizadores. O mais importante destes para os nossos prop&#243;sitos &#233; o ficheiro XML Abbyy. Abbyy &#233; uma empresa russa cujo <emph>software</emph> FineReader domina o mercado do OCR.</p>
<p>Todas as vers&#245;es recentes do FineReader produzem um <ref target="https://perma.cc/83EK-LXP2">documento XML</ref> que associa diferentes "blocos" com cada p&#225;gina no documento digitalizado. O tipo de bloco mais comum &#233; <code rend="inline">Text</code> mas tamb&#233;m existem blocos <code rend="inline">Picture</code> ou "Imagem", em portugu&#234;s. Aqui est&#225; um bloco de exemplo tirado dum ficheiro de XML Abbyy do IA. Os cantos superior esquerdo ("t" e "l") e inferior direito ("b" e "r") s&#227;o suficientes para identificar a regi&#227;o de bloco retangular.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_14" corresp="code_extrair-paginas-ilustradas-com-python_14.txt" lang="language-xml" rend="block"/></ab>
<p>O equivalente no IA a ver as <emph>tags</emph> <code rend="inline">IMAGE_ON_PAGE</code> no HT &#233; a an&#225;lise do ficheiro XML Abbyy e a itera&#231;&#227;o sobre cada p&#225;gina. Se existir pelo menos um bloco <code rend="inline">Picture</code> nessa p&#225;gina, a p&#225;gina &#233; sinalizada como possivelmente contendo uma imagem.</p>
<p>Enquanto a caracter&#237;stica <code rend="inline">IMAGE_ON_PAGE</code> do HT n&#227;o cont&#233;m informa&#231;&#227;o sobre a <emph>localiza&#231;&#227;o</emph> dessa imagem, os blocos <code rend="inline">Picture</code> no ficheiro XML est&#227;o associados a uma regi&#227;o retangular na p&#225;gina. No entanto, porque o FineReader se especializa no reconhecimento de letras de conjuntos de caracteres ocidentais, &#233; muito menos preciso a identificar regi&#245;es de imagem. O projeto de Leetaru (veja <emph>Vis&#227;o Geral</emph>) usou as coordenadas da regi&#227;o para cortar imagens, mas nesta li&#231;&#227;o n&#243;s iremos simplesmente fazer o <emph>download</emph> da p&#225;gina inteira.</p>
<p>Parte da divers&#227;o intelectual desta li&#231;&#227;o &#233; usar um <emph>dataset</emph> (<emph>tags</emph> de bloco do OCR) por vezes confuso para um prop&#243;sito largamente n&#227;o intencional: identificar imagens e n&#227;o palavras. A certa altura, tornar-se-&#225; computacionalmente vi&#225;vel executar modelos de aprendizagem aprofundada em todas as p&#225;ginas ilustradas nuas num volume e escolher o(s) tipo(s) de imagem(/ns) desejada(s). Mas, como a maior parte das p&#225;ginas na maioria dos volumes n&#227;o s&#227;o ilustradas, esta &#233; uma tarefa dispendiosa. Por agora, faz mais sentido aproveitar os dados existentes que n&#243;s detemos do processo de ingest&#227;o do OCR.</p>
<p>Para mais informa&#231;&#245;es sobre como o pr&#243;prio OCR funciona e interage com o processo de digitaliza&#231;&#227;o, por favor, veja a li&#231;&#227;o do <emph>PH</emph> de Mila Oiva, <ref target="/en/lessons/retired/OCR-with-Tesseract-and-ScanTailor">OCR With Tesseract and ScanTailor</ref> (aten&#231;&#227;o que esta li&#231;&#227;o j&#225; n&#227;o &#233; actualizada). Erros podem surgir por causa de distor&#231;&#245;es, artefactos e muitos outros problemas. Estes erros acabam por afetar a fiabilidade e a precis&#227;o dos blocos "Picture". Em muitos casos, o Abbyy estimar&#225; que p&#225;ginas em branco ou descoloridas s&#227;o, na realidade, imagens. Estas <emph>tags</emph> de bloco incorretas, ainda que indesejadas, podem ser combatidas com o uso de redes neurais convolucionais retreinadas. Pense nas p&#225;ginas com imagens cujo download foi feito nesta li&#231;&#227;o como um primeiro passo num processo mais longo para obter um <emph>dataset</emph> limpo e &#250;til de ilustra&#231;&#245;es hist&#243;ricas.</p>
</div><div type="3"><head>Passo a Passo do C&#243;digo</head>
<div type="4"><head>Encontrar as Imagens</head>
<p>Tal como com o HT, a fun&#231;&#227;o principal para o IA &#233; <code rend="inline">ia_picture_download(item_id, out_dir=None)</code>.</p>
<p>Visto que envolve o I/O dum ficheiro, o processo para obter a lista <code rend="inline">img_pages</code> &#233; mais complicado do que o do HT. Usando a utilidade <code rend="inline">ia</code> (que &#233; instalada com a biblioteca) da linha de comando, o leitor pode obter uma ideia dos ficheiros de metadados dispon&#237;veis para um volume. Com muitas poucas exce&#231;&#245;es, um ficheiro com o formato "Abbyy GZ" deveria estar dispon&#237;vel para volumes com o tipo de <emph>media</emph> <code rend="inline">text</code> no Internet Archive.</p>
<p>Estes ficheiros, mesmo quando comprimidos, podem facilmente ter centenas de megabytes de tamanho! Se existir um ficheiro Abbyy para o volume, n&#243;s obtemos o seu nome e depois fazemos o <emph>download</emph>. A chamada <code rend="inline">ia.download()</code> usa alguns par&#226;metros &#250;teis para ignorar a solicita&#231;&#227;o se o ficheiro j&#225; existe e, se n&#227;o, para fazer o seu <emph>download</emph> sem criar um diret&#243;rio aninhado. Para salvar espa&#231;o, n&#243;s eliminamos o ficheiro Abbyy depois de o analisar.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_15" corresp="code_extrair-paginas-ilustradas-com-python_15.txt" lang="language-python" rend="block"/></ab>
<p>Assim que n&#243;s tivermos o ficheiro, n&#243;s precisamos de analisar o XML usando a biblioteca padr&#227;o do Python. N&#243;s tomamos vantagem do facto de que n&#243;s podemos abrir o ficheiro comprimido diretamente com a biblioteca <code rend="inline">gzip</code>. Os ficheiros Abbyy s&#227;o indexadas a partir do zero, por isso a primeira p&#225;gina na sequ&#234;ncia digitalizada tem o &#237;ndice de 0. No entanto, n&#243;s temos que filtrar 0 porque n&#227;o pode ser exigido do IA. A exclus&#227;o do &#237;ndice 0 por parte do IA n&#227;o est&#225; documentada em qualquer lugar; em vez disso, eu descobri atrav&#233;s de tentativa e erro. Se o leitor ver uma mensagem de erro de explica&#231;&#227;o dif&#237;cil, tente rastrear a origem e n&#227;o tenha medo em pedir ajuda, seja a algu&#233;m com experi&#234;ncia relevante, seja a algu&#233;m da pr&#243;pria organiza&#231;&#227;o.</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_16" corresp="code_extrair-paginas-ilustradas-com-python_16.txt" lang="language-python" rend="block"/></ab>
</div><div type="4"><head>Fazer o <emph>Download</emph> das Imagens</head>
<p>O <emph>wrapper</emph> do IA incorporado no Python n&#227;o providencia uma fun&#231;&#227;o de download de p&#225;ginas &#250;nicas&#8212;apenas em massa. Isto significa que n&#243;s usaremos a RESTful API do IA para obter p&#225;ginas espec&#237;ficas. Primeiro, n&#243;s constru&#237;mos um URL para cada p&#225;gina de que n&#243;s precisamos. Depois, n&#243;s usamos a biblioteca <code rend="inline">requests</code> para enviar uma solicita&#231;&#227;o <code rend="inline">GET</code> de HTTP e, se tudo correr bem (<emph>i.e.</emph> o c&#243;digo 200 &#233; enviado na resposta), n&#243;s escrevemos o conte&#250;do da resposta num ficheiro JPEG.</p>
<p>O IA tem estado a trabalhar numa <ref target="https://perma.cc/F6HJ-YGM7">vers&#227;o <emph>alpha</emph></ref> duma API para o corte e redimensionamento de imagens que obede&#231;a &#224;s exig&#234;ncias do International Image Interoperability Framework (<ref target="https://perma.cc/7ABF-GGJM">IIIF</ref>). O IIIF representa uma profunda melhoria face ao antigo m&#233;todo para <emph>downloads</emph> de p&#225;ginas &#250;nicas que requeriam a realiza&#231;&#227;o do <emph>download</emph> de ficheiros JP2, um formato de ficheiro largamente n&#227;o suportado. Agora, &#233; extremamente simples obter um s&#243; JPEG duma p&#225;gina:</p>
<ab><code xml:id="code_extrair-paginas-ilustradas-com-python_17" corresp="code_extrair-paginas-ilustradas-com-python_17.txt" lang="language-python" rend="block"/></ab>
</div></div></div>
      <div type="2"><head>Pr&#243;ximos Passos</head>
<p>Assim que o leitor tiver entendido as principais fun&#231;&#245;es e o c&#243;digo de <emph>unpacking</emph> dos dados nos <emph>notebooks</emph>, sinta-se livre para executar as c&#233;lulas em sequ&#234;ncia ou carregar em "<emph>Run All</emph>" e ver as p&#225;ginas ilustradas a entrar nas pastas. O leitor &#233; encorajado a adaptar estes <emph>scripts</emph> e fun&#231;&#245;es para as suas pr&#243;prias quest&#245;es de pesquisa.</p>
<p><ref type="footnotemark" target="#note_1"/> : <hi rend="bold">Nota de tradu&#231;&#227;o</hi>: Aconselhamos o leitor a adicionar o Python ao PATH, processo que pode ser feito na ocasi&#227;o da sua instala&#231;&#227;o. Isto ir&#225; suavizar a incorpora&#231;&#227;o das depend&#234;ncias (veja <emph>Depend&#234;ncias</emph>).</p>
<p><ref type="footnotemark" target="#note_2"/> : <hi rend="bold">Nota de tradu&#231;&#227;o</hi>: Inicialmente, aparece uma p&#225;gina de transi&#231;&#227;o, a qual dever&#225; remeter rapidamente para o Jupyter. Caso tal n&#227;o aconte&#231;a, basta seguir as instru&#231;&#245;es nesta p&#225;gina.</p>
</div>
    </body>
  </text>
</TEI>
