<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introduction &#224; la stylom&#233;trie en Python</title>
  <layout>lesson</layout>
  <slug>introduction-a-la-stylometrie-avec-python</slug>
  <authors>Fran&#231;ois Dominic Laram&#233;e</authors>
  <date>2018-04-21</date>
  <editors>Adam Crymble</editors>
  <reviewers>Folgert Karsdorp,Jan Rybicki,Antonio Rojas Castro</reviewers>
  <translator>Fran&#231;ois Dominic Laram&#233;e</translator>
  <translation_date>2019-05-03</translation_date>
  <translation-editor>Sofia Papastamkou</translation-editor>
  <translation-reviewer>Isabelle Gribomont,Fanny M&#233;zard</translation-reviewer>
  <difficulty>2</difficulty>
  <activity>analyzing</activity>
  <topics>distant-reading</topics>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/231</review-ticket>
  <abstract>Ce tutoriel vous apprendra comment appliquer diverses m&#233;thodes stylom&#233;triques pour d&#233;terminer les auteurs de textes disput&#233;s. Trois m&#233;thodes sont abord&#233;es: les courbes caract&#233;ristiques de composition de Mendenhall, la m&#233;thode du khi carr&#233; de Kilgariff et, enfin, la m&#233;thode du Delta de John Burrows.</abstract>
  <original>introduction-to-stylometry-with-python</original>
  <avatar_alt>Femme lisant &#224; c&#244;t&#233; d'une peinture</avatar_alt>
  <doi>10.46430/phfr0003</doi>
</metadata>
  <text>
    <body>
      <div n="2"><head>Introduction</head>
<p>La <link target="https://fr.wikipedia.org/wiki/Stylom%C3%A9trie">stylom&#233;trie</link> est l'&#233;tude quantitative du style litt&#233;raire &#224; l'aide de m&#233;thodes informatiques de lecture distante. Elle se base sur l'observation faite que chaque auteur a tendance &#224; &#233;crire de fa&#231;on relativement constante, reconnaissable et unique. Par exemple&#160;:</p>
<ul>
<li>Chaque individu poss&#232;de son propre vocabulaire, parfois riche, parfois limit&#233;. Bien qu'un vocabulaire &#233;tendu soit g&#233;n&#233;ralement associ&#233; &#224; une litt&#233;rature de qualit&#233;, ce n'est pas toujours le cas. Le romancier am&#233;ricain Ernest Hemingway, par exemple, &#233;tait c&#233;l&#232;bre pour employer un nombre &#233;tonnamment faible de mots diff&#233;rents,<ref type="footnotemark" target="#1"/> ce qui ne l'a pas emp&#234;ch&#233; de gagner le prix Nobel de litt&#233;rature en 1954.</li>
<li>Certaines personnes &#233;crivent en phrases courtes, tandis que d'autres pr&#233;f&#232;rent les phrases complexes comportant plusieurs propositions.</li>
<li>Il n'y a pas deux auteurs qui utilisent les points-virgules, les tirets et autres signes de ponctuation exactement de la m&#234;me fa&#231;on.</li>
</ul>
<p>Les habitudes d'usage des <link target="https://fr.wikipedia.org/wiki/Mot-outil">mots-outils</link>, comme les articles, les pr&#233;positions et les conjonctions, se sont montr&#233;es particuli&#232;rement r&#233;v&#233;latrices en stylom&#233;trie. Dans son survol des m&#233;thodes stylom&#233;triques du pass&#233; et du pr&#233;sent, Efstathios Stamatatos souligne que les auteurs emploient ces mots de fa&#231;on largement inconsciente et ind&#233;pendante du sujet &#224; l'&#233;tude.<ref type="footnotemark" target="#2"/> Ces caract&#233;ristiques sont tr&#232;s utiles pour l'analyse stylom&#233;trique puisqu'une tendance inconsciente est moins susceptible de changer au cours de la carri&#232;re d'un auteur que son vocabulaire en g&#233;n&#233;ral. (Une tendance inconsciente est aussi beaucoup plus difficile &#224; imiter pour un faussaire.) Les mots-outils ont &#233;galement &#233;t&#233; identifi&#233;s comme d'importants marqueurs de la temporalit&#233; et du genre litt&#233;raire.</p>
<p>La communaut&#233; des chercheurs a fait appel &#224; la stylom&#233;trie pour &#233;tudier une multitude de questions d'ordre culturel. Par exemple, on a beaucoup &#233;tudi&#233; les diff&#233;rences entre les mani&#232;res dont les hommes et les femmes &#233;crivent<ref type="footnotemark" target="#3"/> ou sont d&#233;crits dans la litt&#233;rature.<ref type="footnotemark" target="#4"/> D'autres chercheurs ont tent&#233; de d&#233;celer des signes de plagiat dans les irr&#233;gularit&#233;s stylistiques au sein d'un texte<ref type="footnotemark" target="#5"/>, ou m&#234;me de quantifier l'&#233;volution des paroles des chansons &#233;crites par John Lennon et Paul McCartney, arrivant &#224; la conclusion que celles-ci devenaient de moins en moins actives et joyeuses &#224; la fin des ann&#233;es 1960, alors que la carri&#232;re des <link target="https://fr.wikipedia.org/wiki/The_Beatles">Beatles</link> tirait &#224; sa fin.<ref type="footnotemark" target="#6"/></p>
<p>L'identification de l'auteur d'un texte anonyme constitue cependant l'une des applications les plus courantes de la stylom&#233;trie. Il est parfois possible de d&#233;couvrir l'identit&#233; de l'auteur d'un texte en mesurant certaines caract&#233;ristiques de ce texte, comme la longueur moyenne des phrases ou le rapport entre le nombre d'articles d&#233;finis et ind&#233;finis. Ces mesures sont ensuite compar&#233;es avec celles observ&#233;es dans des textes dont les auteurs sont connus. C'est ce que nous ferons dans cette le&#231;on, &#224; l'aide d'une &#233;tude de cas bas&#233;e sur ce qui constitue peut-&#234;tre la controverse la plus c&#233;l&#232;bre de l'histoire de la science politique am&#233;ricaine, celle des <emph>Federalist Papers</emph>.</p>
<div n="3"><head>Objectifs d'apprentissage</head>
<p>&#192; la fin de la le&#231;on, nous aurons &#233;tudi&#233; les sujets suivants:</p>
<ul>
<li>Comment appliquer diverses m&#233;thodes stylom&#233;triques pour d&#233;terminer l'auteur d'un texte anonyme ou d'un ensemble de textes anonymes.</li>
<li>Comment utiliser des structures de donn&#233;es relativement avanc&#233;es, comme les <link target="https://fr.wikipedia.org/wiki/Dictionnaire_des_donn%C3%A9es">dictionnaires</link> de <link target="https://fr.wikipedia.org/wiki/Cha%C3%AEne_de_caract%C3%A8res">cha&#238;nes de caract&#232;res</link> et les dictionnaires de dictionnaires, dans le langage de programmation <link target="https://fr.wikipedia.org/wiki/Python_(langage)">Python</link>.</li>
<li>Les rudiments du <link target="https://www.nltk.org/">Natural Language Toolkit (documentation en anglais)</link> (nltk), un module Python populaire d&#233;di&#233; au <link target="https://fr.wikipedia.org/wiki/Traitement_automatique_du_langage_naturel">traitement du langage naturel</link>.</li>
</ul>
<div class="alert alert-warning">
Veuillez noter que le code informatique de cette le&#231;on a &#233;t&#233; con&#231;u pour &#234;tre ex&#233;cut&#233; en s&#233;quence. Si, par exemple, vous d&#233;sirez passer outre la m&#233;thode de Mendenhall et vous diriger directement vers celle de Kilgariff ou celle de Burrows, veuillez vous assurer de copier-coller les instructions de pr&#233;-traitement qui apparaissent dans la description de la m&#233;thode de Mendenhall vers votre propre bloc de code. Sinon, vous n'obtiendrez pas exactement les r&#233;sultats pr&#233;sent&#233;s ici.
</div>
</div><div n="3"><head>Lectures pr&#233;alables</head>
<p>Si vous n'avez pas d'exp&#233;rience de programmation en Python ou si vous trouvez les exemples dans ce tutoriel difficiles, l'auteur vous recommande de lire les le&#231;ons intitul&#233;es <link target="/fr/lecons/travailler-avec-des-fichiers-texte">Travailler avec des fichiers texte en Python</link> et <link target="/fr/lecons/manipuler-chaines-caracteres-python">Manipuler des cha&#238;nes de caract&#232;res en Python</link>. Notez aussi que ces le&#231;ons ont &#224; l'origine &#233;t&#233; r&#233;dig&#233;es en Python 2 tandis que ce tutoriel utilise Python 3. Les diff&#233;rences de <link target="https://fr.wikipedia.org/wiki/Syntaxe">syntaxe</link> entre les deux versions du langage peuvent &#234;tre subtiles. En cas de conflit, suivez les exemples tels qu'ils sont cod&#233;s dans le pr&#233;sent tutoriel et n'utilisez les autres ressources qu'&#224; titre indicatif. (Plus pr&#233;cis&#233;ment, le code int&#233;gr&#233; &#224; ce tutoriel a &#233;t&#233; &#233;crit en <link target="https://www.python.org/downloads/release/python-364/">Python 3.6.4</link>; la cha&#238;ne de type <link target="https://docs.python.org/3/whatsnew/3.6.html#pep-498-formatted-string-literals">f-string</link> qui appara&#238;t dans la ligne <code type="inline">with open(f'data/federalist_{nom_fichier}.txt', 'r') as f:</code>, par exemple, requiert Python 3.6 ou une version plus r&#233;cente du langage.)</p>
</div><div n="3"><head>Mat&#233;riel requis</head>
<p>Ce tutoriel utilise un jeu de donn&#233;es et des logiciels que vous devrez t&#233;l&#233;charger et installer.</p>
<div n="4"><head>Le jeu de donn&#233;es</head>
<p>Pour compl&#233;ter les exercices de ce tutoriel, vous devrez t&#233;l&#233;charger et ouvrir l'archive des <emph>Federalist Papers</emph> <link target="/assets/introduction-to-stylometry-with-python/stylometry-federalist.zip">.zip</link> qui contient les 85 articles dont nous aurons besoin pour effectuer notre analyse. L'archive contient &#233;galement le <link target="http://www.gutenberg.org/cache/epub/1404/pg1404.txt">livre &#233;lectronique du Projet Gutenberg</link> dont ces 85 documents ont &#233;t&#233; extraits. L'ouverture du fichier .zip cr&#233;era un <link target="https://fr.wikipedia.org/wiki/R%C3%A9pertoire_(informatique)">r&#233;pertoire</link> nomm&#233; <code type="inline">data</code> dans votre r&#233;pertoire de travail courant. Assurez-vous de rester dans ce r&#233;pertoire de travail courant et d'y sauvegarder tout le travail que vous r&#233;aliserez en suivant le tutoriel.</p>
</div><div n="4"><head>Le logiciel</head>
<p>Ce tutoriel requiert une version r&#233;cente du langage Python et certaines <link target="https://fr.wikipedia.org/wiki/Biblioth%C3%A8que_logicielle">biblioth&#232;ques logicielles</link>:</p>
<ul>
<li><link target="https://www.python.org/downloads/">Python 3.x</link> - la version stable la plus r&#233;cente est recommand&#233;e.</li>
<li><link target="https://www.nltk.org/">nltk</link> - Le module Natural Language Toolkit, couramment abbr&#233;vi&#233; <code type="inline">nltk</code>.</li>
<li><link target="https://matplotlib.org/">matplotlib</link></li>
</ul>
<p>Certaines de ces ressources peuvent &#234;tre absentes de votre ordinateur. Si vous recevez des messages d'erreurs comme "Module not found" ("module introuvable") ou l'&#233;quivalent, vous devrez t&#233;l&#233;charger et installer les modules manquants vous-m&#234;mes. La m&#233;thode la plus simple consiste &#224; utiliser la commande <code type="inline">pip</code>. Consultez la le&#231;on (en anglais) intitul&#233;e <link target="/en/lessons/installing-python-modules-pip">Installing Python modules with pip</link> pour les d&#233;tails.</p>
</div></div><div n="3"><head>Quelques notes au sujet des langues</head>
<p>Ce tutoriel applique des m&#233;thodes d'analyse stylom&#233;trique &#224; un ensemble de textes r&#233;dig&#233;s en anglais &#224; l'aide d'un module Python nomm&#233; <code type="inline">nltk</code>. Plusieurs des fonctions offertes par <code type="inline">nltk</code> sont cependant disponibles dans d'autres langues. Pour peu qu'une langue &#233;crite divise ses mots de fa&#231;on claire et pr&#233;cise, <code type="inline">nltk</code> devrait fonctionner correctement. Les langues pour lesquelles il n'y a pas de s&#233;paration nette entre les mots &#224; l'&#233;crit, comme par exemple le chinois, pourraient poser probl&#232;me. J'ai utilis&#233; <code type="inline">nltk</code> avec des textes fran&#231;ais sans difficult&#233;; les autres langues qui utilisent des <link target="https://fr.wikipedia.org/wiki/Diacritique">signes diacritiques</link>, comme l'espagnol et l'allemand, devraient &#234;tre compatibles avec <code type="inline">nltk</code> elles aussi. Veuillez consulter la <link target="http://www.nltk.org/book/">documentation de nltk (en anglais seulement)</link> pour plus de d&#233;tails.</p>
<p>Une seule des t&#226;ches de ce tutoriel exige du code qui varie en fonction de la langue. Pour diviser un texte en un ensemble de mots en fran&#231;ais ou en espagnol, vous devrez sp&#233;cifier la langue appropri&#233;e &#224; <link target="https://fr.wikipedia.org/wiki/Analyse_lexicale#Analyseur_lexical">l'analyseur lexical</link> de <code type="inline">nltk</code>. La proc&#233;dure &#224; suivre sera expliqu&#233;e au moment venu.</p>
<p>Enfin, veuillez noter que certaines t&#226;ches linguistiques, comme <link target="https://fr.wikipedia.org/wiki/%C3%89tiquetage_morpho-syntaxique">l'&#233;tiquetage grammatical</link> des mots, peuvent ne pas &#234;tre support&#233;es par <code type="inline">nltk</code> dans les langues autres que l'anglais. Ce tutoriel ne couvre pas l'&#233;tiquetage grammatical. Si vos propres projets en ont besoin, veuillez consulter la <link target="http://www.nltk.org/book/">documentation de nltk</link> pour obtenir des conseils.</p>
</div></div>
      <div n="2"><head>Les <emph>Federalist Papers</emph> - Contexte historique</head>
<p>Les <link target="https://fr.wikipedia.org/wiki/Le_F%C3%A9d%C3%A9raliste">Federalist Papers</link> (parfois simplement appel&#233;s le <emph>F&#233;d&#233;raliste</emph>) sont une collection de 85 articles fondamentaux de la th&#233;orie politique am&#233;ricaine, publi&#233;s entre octobre 1787 et mai 1788. Ces articles, r&#233;dig&#233;s alors que le d&#233;bat sur la ratification de l'actuelle Constitution des &#201;tats-Unis d'Am&#233;rique faisait rage, argumentent en faveur de cette ratification et du syst&#232;me de gouvernement sous lequel les Am&#233;ricains vivent depuis 1789. Par cons&#233;quent, le <emph>F&#233;d&#233;raliste</emph> est parfois d&#233;crit comme la contribution la plus importante et la plus imp&#233;rissable des &#201;tats-Unis dans le domaine de la philosophie politique.</p>
<p>Trois des hommes d'&#201;tat les plus en vue de la jeune r&#233;publique am&#233;ricaine ont &#233;crit les articles:</p>
<ul>
<li><link target="https://fr.wikipedia.org/wiki/Alexander_Hamilton">Alexander Hamilton</link>, qui fut le premier Secr&#233;taire du Tr&#233;sor (l'&#233;quivalent du ministre des Finances) des &#201;tats-Unis.</li>
<li><link target="https://fr.wikipedia.org/wiki/James_Madison">James Madison</link>, quatri&#232;me Pr&#233;sident des &#201;tats-Unis, qui est parfois surnomm&#233; le "P&#232;re de la Constitution" en raison du r&#244;le-cl&#233; qu'il a jou&#233; lors de la convention constitutionnelle de 1787 au cours de laquelle celle-ci a &#233;t&#233; r&#233;dig&#233;e.</li>
<li><link target="https://fr.wikipedia.org/wiki/John_Jay">John Jay</link>, premier juge en chef de la Cour supr&#234;me des &#201;tats-Unis, second gouverneur de l'&#201;tat de New York et diplomate.</li>
</ul>
<p>Cependant, <emph>qui a &#233;crit quel article au juste</emph> est rest&#233; un myst&#232;re pendant plus de 150 ans, et ce par la faute des auteurs eux-m&#234;mes.</p>
<p>Premi&#232;rement, parce que le <emph>F&#233;d&#233;raliste</emph> a &#233;t&#233; publi&#233; sous le pseudonyme partag&#233; "Publius". La publication anonyme n'&#233;tait pas chose rare au dix-huiti&#232;me si&#232;cle, surtout dans les cas de textes politiques sujets &#224; controverse. Dans le cas du <emph>F&#233;d&#233;raliste</emph>, le fait que trois personnes aient partag&#233; le m&#234;me pseudonyme rend cependant l'identification de l'auteur de chaque article difficile. Une t&#226;che encore compliqu&#233;e par le fait que les trois hommes &#233;crivent sur des sujets similaires, en m&#234;me temps, et en s'inspirant des m&#234;mes courants politiques et culturels, ce qui rend leurs vocabulaires respectifs difficiles &#224; distinguer.</p>
<p>Deuxi&#232;mement, parce que Madison et Hamilton ont laiss&#233; des t&#233;moignages contradictoires concernant leurs r&#244;les respectifs au sein du projet. Dans un article c&#233;l&#232;bre publi&#233; en 1944, l'historien Douglass Adair<ref type="footnotemark" target="#7"/> a expliqu&#233; que ni Madison, ni Hamilton ne souhaitait que la paternit&#233; du <emph>F&#233;d&#233;raliste</emph> soit r&#233;v&#233;l&#233;e, m&#234;me longtemps apr&#232;s la ratification de la Constitution, parce qu'ils regrettaient une partie de ce qu'ils avaient &#233;crit. Hamilton voulait cependant s'assurer que <emph>la post&#233;rit&#233;</emph> lui reconna&#238;trait le premier r&#244;le. En 1804, deux jours avant le duel o&#249; il a trouv&#233; la mort, Hamilton a donc confi&#233; &#224; un ami une lettre dans laquelle il affirmait avoir &#233;crit 63 des 85 articles. Dix ans plus tard, Madison a r&#233;fut&#233; certaines des pr&#233;tentions de son rival, affirmant qu'il avait lui-m&#234;me r&#233;dig&#233; 12 des articles qui apparaissaient sur la liste de Hamilton et qu'il avait &#233;t&#233; l'auteur principal de trois autres dont Hamilton se pr&#233;tendait un co-auteur d'&#233;gale importance. Hamilton &#233;tant mort depuis longtemps, il &#233;tait impossible pour lui de r&#233;pondre &#224; Madison.</p>
<p>Troisi&#232;mement, parce que, comme le soulignent David Holmes et Richard Forsyth,<ref type="footnotemark" target="#8"/> les styles d'&#233;criture de Hamilton et de Madison &#233;taient anormalement similaires. Frederick Mosteller et Frederick Williams ont calcul&#233; que, dans les articles dont la paternit&#233; n'est pas en doute, les longueurs moyennes des phrases &#233;crites par les deux hommes sont &#224; la fois singuli&#232;rement &#233;lev&#233;es et presque identiques: respectivement 34,59 et 34,55 mots.<ref type="footnotemark" target="#9"/> Les <link target="https://fr.wikipedia.org/wiki/%C3%89cart_type">&#233;carts-types</link> des longueurs de phrases sont aussi tr&#232;s proches. Enfin, comme ironise Mosteller, ni l'un ni l'autre n'avait l'habitude d'utiliser un mot court quand un mot long faisait l'affaire. Il n'y avait donc aucune fa&#231;on simple de d&#233;tecter la signature stylistique de Hamilton ou de Madison dans un article sp&#233;cifique.</p>
<p>Ce n'est qu'en 1964 que Mosteller et David Lee Wallace<ref type="footnotemark" target="#10"/> sont parvenus &#224; formuler une solution relativement satisfaisante au myst&#232;re &#224; l'aide de statistiques sur l'usage des mots. En comparant les fr&#233;quences auxquelles Madison et Hamilton utilisaient des mots courants comme <emph>may</emph> (peut), <emph>also</emph> (aussi), <emph>an</emph> (un ou une), <emph>his</emph> (son, sa), etc., ils ont conclu que les articles controvers&#233;s avaient tous &#233;t&#233; r&#233;dig&#233;s par Madison. M&#234;me dans le cas du <emph>F&#233;d&#233;raliste 55</emph>, l'article pour lequel ils consid&#233;raient les indices comme &#233;tant les moins convaincants, Mosteller et Wallace estimaient les chances que Madison en ait &#233;t&#233; l'auteur &#224; 100 contre une.</p>
<p>Depuis ce temps, la r&#233;partition des articles du <emph>F&#233;d&#233;raliste</emph> en fonction de leur(s) auteur(s) est rest&#233;e un cas d'esp&#232;ce pour les <link target="https://fr.wikipedia.org/wiki/Apprentissage_automatique">algorithmes d'apprentissage automatique</link>, du moins dans le monde anglophone.<ref type="footnotemark" target="#11"/> La stylom&#233;trie a aussi continu&#233; &#224; utiliser le <emph>F&#233;d&#233;raliste</emph> pour raffiner ses m&#233;thodes, notamment pour chercher des preuves de collaborations entre de multiples auteurs dans un m&#234;me texte.<ref type="footnotemark" target="#12"/> Curieusement, certains r&#233;sultats de ces recherches tendent &#224; d&#233;montrer que l'&#233;nigme du <emph>F&#233;d&#233;raliste</emph> n'est peut-&#234;tre pas aussi r&#233;solue que Mosteller et Wallace le pensaient. En effet, Hamilton et Madison ont peut-&#234;tre co-r&#233;dig&#233; une plus grande partie de la collection qu'on ne le croyait.</p>
</div>
      <div n="2"><head>Nos cas de test</head>
<p>Dans ce tutoriel, nous utiliserons le <emph>F&#233;d&#233;raliste</emph> pour expliquer et tester trois m&#233;thodes stylom&#233;triques diff&#233;rentes:</p>
<ol>
<li>Les courbes caract&#233;ristiques de composition de Mendenhall</li>
<li>La m&#233;thode du khi carr&#233; de Kilgarriff</li>
<li>La m&#233;thode du Delta de John Burrows</li>
</ol>
<p>Pour ce faire, il faudra diviser les articles en six cat&#233;gories:</p>
<ol>
<li>Les 51 articles dont l'attribution &#224; Alexander Hamilton est certaine.</li>
<li>Les 14 articles dont l'attribution &#224; James Madison est certaine.</li>
<li>Quatre des cinq articles dont l'attribution &#224; John Jay est certaine.</li>
<li>Trois articles qui ont probablement &#233;t&#233; co-&#233;crits par Madison et Hamilton, et dont Madison r&#233;clame la paternit&#233;.</li>
<li>Les 12 articles qui font l'objet de la dispute entre Hamilton et Madison.</li>
<li>L'article <emph>F&#233;d&#233;raliste 64</emph> tout seul.</li>
</ol>
<p>Cette division suit essentiellement la voie trac&#233;e par Mosteller.<ref type="footnotemark" target="#13"/> La seule exception est <emph>F&#233;d&#233;raliste 64</emph>, qui a certainement &#233;t&#233; r&#233;dig&#233; par John Jay mais que nous gardons s&#233;par&#233; pour des raisons qui seront expliqu&#233;es plus tard.</p>
<p>Nos deux premiers tests, qui utiliseront les courbes de composition caract&#233;ristiques de T.C. Mendenhall et le <link target="https://fr.wikipedia.org/wiki/Test_du_%CF%87%C2%B2">khi carr&#233;</link> d'Adam Kilgariff, examineront les 12 articles disput&#233;s pour voir si, en tant que groupe, ils se rapprochent du corpus d'un auteur en particulier. Notre troisi&#232;me test utilisera quant &#224; lui la m&#233;thode du delta de John Burrows pour confirmer que <emph>Federalist 64</emph> a bel et bien &#233;t&#233; &#233;crit par John Jay.</p>
</div>
      <div n="2"><head>Pr&#233;paration des donn&#233;es pour l'analyse</head>
<p>Avant de commencer l'analyse stylom&#233;trique proprement dite, il nous faut charger les fichiers contenant les 85 articles dans des <link target="https://fr.wikipedia.org/wiki/Structure_de_donn%C3%A9es">structures de donn&#233;es</link> en m&#233;moire vive.</p>
<p>La premi&#232;re &#233;tape de ce processus consiste &#224; assigner chacun des 85 articles &#224; l'ensemble appropri&#233;. Puisque nous avons donn&#233; &#224; nos fichiers des noms standardis&#233;s de <code type="inline">federalist_1.txt</code> &#224; <code type="inline">federalist_85.txt</code>, nous pouvons assigner chaque article &#224; son auteur (ou &#224; son ensemble de test, si nous souhaitons conna&#238;tre son auteur) &#224; l'aide d'un <emph>dictionnaire</emph>. En Python, le dictionnaire est une structure de donn&#233;es qui contient un nombre arbitraire de paires cl&#233;-valeur; dans le cas qui nous concerne, les noms des auteurs serviront de cl&#233;s tandis que les listes des num&#233;ros d'articles constitueront les valeurs associ&#233;es &#224; ces cl&#233;s.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_0" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_0.txt"></code></pre>
<p>Les dictionnaires Python sont tr&#232;s flexibles. Par exemple, nous pouvons acc&#233;der &#224; une valeur en <emph>indexant</emph> le dictionnaire &#224; l'aide d'une de ses cl&#233;s, nous pouvons parcourir l'ensemble du dictionnaire en it&#233;rant sur l'ensemble de ses cl&#233;s, etc. Nous tirerons pleinement avantage de ces propri&#233;t&#233;s au cours du tutoriel.</p>
<p>Ensuite, puisque nous nous int&#233;ressons au vocabulaire employ&#233; par chaque auteur, nous allons d&#233;finir une courte <link target="https://fr.wikipedia.org/wiki/Sous-programme">fonction</link> en Python pour cr&#233;er la longue liste des mots contenus dans chacun des articles de chaque auteur. Cette liste sera enregistr&#233;e dans une <link target="https://fr.wikipedia.org/wiki/Cha%C3%AEne_de_caract%C3%A8res">cha&#238;ne de caract&#232;res</link>. Ouvrez votre environnement de d&#233;veloppement Python. Si vous ne savez pas comment faire, consultez la le&#231;on appropri&#233;e pour votre syst&#232;me <link target="/en/lessons/mac-installation">Mac</link>, <link target="/en/lessons/linux-installation">Linux</link> ou <link target="/en/lessons/windows-installation">Windows</link> avant de continuer.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_1" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_1.txt"></code></pre>
<p>Troisi&#232;mement, nous allons construire les structures de donn&#233;es en appelant plusieurs fois cette fonction <code type="inline">lire_fichiers_en_chaine()</code> et en lui passant &#224; chaque fois une liste d'articles diff&#233;rente. Nous allons enregistrer les r&#233;sultats dans un autre dictionnaire, dont les six cl&#233;s sont celles du dictionnaire <code type="inline">article</code> ci-dessus et dont les valeurs sont les six corpus correspondants. Dor&#233;navant, par souci de simplicit&#233;, nous utiliserons l'expression "le <link target="https://fr.wikipedia.org/wiki/Corpus">corpus</link> d'un auteur" pour r&#233;f&#233;rer &#224; un ensemble d'articles, m&#234;me lorsque cet ensemble contient des articles contest&#233;s ou partag&#233;s plut&#244;t que des textes dont nous connaissons l'auteur.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_2" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_2.txt"></code></pre>
<p>Afin de v&#233;rifier que le chargement des donn&#233;es s'est effectu&#233; comme pr&#233;vu, affichez les cent premiers caract&#232;res de chacune des entr&#233;es du dictionnaire &#224; l'&#233;cran:</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_3" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_3.txt"></code></pre>
<p>Si cette op&#233;ration produit des r&#233;sultats lisibles, la lecture des textes en m&#233;moire a fonctionn&#233; comme pr&#233;vu et nous pouvons passer &#224; l'analyse stylom&#233;trique.</p>
<div class="alert alert-warning">
Si le chargement des fichiers de texte &#233;choue, c'est probablement que votre r&#233;pertoire de travail courant n'est pas le r&#233;pertoire `data` que vous avez cr&#233;&#233; en ouvrant l'archive zip que vous avez obtenue en suivant les instructions de la section "Mat&#233;riel requis", ci-dessus. Changer votre r&#233;pertoire de travail devrait r&#233;gler le probl&#232;me. La mani&#232;re d'effectuer cette op&#233;ration d&#233;pend de votre environnement de d&#233;veloppement Python.
</div>
</div>
      <div n="2"><head>Premier test stylom&#233;trique : les courbes caract&#233;ristiques de composition de Mendenhall</head>
<p>Le chercheur en litt&#233;rature T. C. Mendenhall a &#233;mis l'hypoth&#232;se que la signature stylistique d'un individu pourrait &#234;tre d&#233;cel&#233;e en comptant les nombres de mots de diff&#233;rentes longueurs dans ses oeuvres.<ref type="footnotemark" target="#14"/> Par exemple, si l'on comptait les longueurs de mots dans plusieurs segments de 1000 ou de 5000 mots d'un roman et que l'on tra&#231;ait les graphes des r&#233;sultats, les courbes seraient similaires quelles que soient les parties du roman choisies. En fait, Mendenhall pensait que si l'on comptait les longueurs d'un assez grand nombre de mots tir&#233;s de l'ensemble de l'oeuvre d'un auteur (disons 100 000 mots) sa "courbe caract&#233;ristique" pourrait &#234;tre calcul&#233;e de fa&#231;on si pr&#233;cise que celle-ci demeurerait constante pendant toute la vie de l'auteur.</p>
<p>Selon les standards d'aujourd'hui, compter les longueurs de mots peut sembler une fa&#231;on bien rudimentaire de mesurer le style d'&#233;criture. Mendenhall ne tient pas compte des mots eux-m&#234;mes, ce qui est &#233;videmment probl&#233;matique. Nous ne pouvons donc pas traiter les courbes de composition comme des sources d'information stylom&#233;trique particuli&#232;rement fiables. Cependant, Mendenhall a publi&#233; sa th&#233;orie il y a plus de 130 ans et il effectuait ses calculs &#224; la main. Il est donc compr&#233;hensible qu'il ait choisi de travailler avec une statistique qui, bien que rudimentaire, &#233;tait au moins facile &#224; calculer. En l'honneur de la valeur historique de son approche, et parce que les courbes de composition produisent des r&#233;sultats visuels attrayants et faciles &#224; implanter, nous utiliserons la m&#233;thode de Mendenhall comme premi&#232;re &#233;tape de notre &#233;tude des m&#233;thodes d'identification des auteurs.</p>
<p>Le code requis pour calculer les courbes caract&#233;ristiques des auteurs du <emph>F&#233;d&#233;raliste</emph> est le suivant:</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_4" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_4.txt"></code></pre>
<p>La clause <code type="inline">%matplotlib inline</code> sous la ligne <code type="inline">import nltk</code> est n&#233;cessaire si vous travaillez dans un environnement de d&#233;veloppement <link target="https://jupyter.org/">Jupyter Notebook</link>, comme c'&#233;tait le cas pour moi lorsque j'ai r&#233;dig&#233; ce tutoriel; en son absence, les graphes pourraient ne pas appara&#238;tre &#224; l'&#233;cran. Si vous travaillez plut&#244;t dans <link target="https://jupyterlab.readthedocs.io/en/stable/getting_started/installation.html">Jupyter Lab</link>, veuillez remplacer cette clause par <code type="inline">%matplotlib ipympl</code>.</p>
<p>La premi&#232;re ligne du segment de code ci-dessus charge le module <emph>Natural Language Toolkit (nltk)</emph>, qui regorge de fonctions et de ressources utiles pour la manipulation informatique des textes. Nous ne ferons qu'effleurer ses bases dans ce tutoriel; si vous d&#233;cidez d'explorer l'analyse de texte en Python plus en profondeur, je vous recommande fortement de commencer en lisant la <link target="https://www.nltk.org/">documentation de nltk</link>.</p>
<p>Les lignes suivantes pr&#233;parent des structures de donn&#233;es qui seront remplies par le bloc de code &#224; l'int&#233;rieur de la boucle <code type="inline">for</code>. Cette boucle applique les m&#234;mes calculs aux corpus de chacun de nos "auteurs":</p>
<ul>
<li>Elle invoque la m&#233;thode <code type="inline">word_tokenize()</code> de <code type="inline">nltk</code> pour diviser le corpus d'un auteur en ses diff&#233;rents &#233;l&#233;ments constitutifs : les mots, les nombres, les signes de ponctuation, etc. En anglais, ces &#233;l&#233;ments constitutifs sont appel&#233;s "tokens"; en fran&#231;ais, ce sont des occurrences.</li>
<li>Elle filtre la liste d'occurrences pour en retirer tout ce qui n'est pas un mot;</li>
<li>Elle cr&#233;e une liste des longueurs (nombre de caract&#232;res) de toutes les occurrences de mots qui ont surv&#233;cu &#224; l'&#233;tape pr&#233;c&#233;dente;</li>
<li>Elle calcule une <emph>distribution des fr&#233;quences</emph> de cette liste de longueurs, ce qui consiste &#224; compter le nombre de 1, le nombre de 2, etc., que l'on retrouve dans le corpus d'un auteur;</li>
<li>Elle trace une courbe de la distribution des fr&#233;quences dans le corpus, pour toutes les longueurs de mots entre 1 et 15.</li>
</ul>
<p>Par d&#233;faut, <code type="inline">nltk.word_tokenize()</code> divise un texte en suivant les r&#232;gles de la grammaire anglaise. Pour appliquer les r&#232;gles d'une autre langue, il suffit de changer une ligne dans le code ci-dessus pour fournir la langue d&#233;sir&#233;e &#224; l'analyseur lexical. Par exemple:
<code type="inline">occs = nltk.word_tokenize(federalist_par_auteur[auteur], language='french')</code>. Lisez la <link target="https://www.nltk.org/">documentation de nltk</link> pour plus de d&#233;tails.</p>
<p>Les r&#233;sultats devraient ressembler &#224; ceci :</p>
<figure><desc>Figure 1: Courbe de Mendenhall pour Hamilton.</desc><graphic url="stylometry-python-1.jpg"/></figure>
<figure><desc>Figure 2: Courbe de Mendenhall pour Madison.</desc><graphic url="stylometry-python-2.jpg"/></figure>
<figure><desc>Figure 3: Courbe de Mendenhall pour les articles contest&#233;s.</desc><graphic url="stylometry-python-3.jpg"/></figure>
<figure><desc>Figure 4: Courbe de Mendenhall pour Jay.</desc><graphic url="stylometry-python-4.jpg"/></figure>
<figure><desc>Figure 5: Courbe de Mendenhall pour les articles co-r&#233;dig&#233;s par Madison et par Hamilton.</desc><graphic url="stylometry-python-5.jpg"/></figure>
<p>Comme vous pouvez le constater &#224; la lecture des graphiques, la courbe caract&#233;ristique associ&#233;e aux articles contest&#233;s s'apparente &#224; un compromis entre celles de Madison et de Hamilton. Sur la gauche des graphiques, l&#224; o&#249; l'on retrouve les longueurs de mots les plus fr&#233;quentes, la courbe des articles contest&#233;s ressemble un peu plus &#224; celle de Madison; &#224; droite, &#224; celle de Hamilton. Cela concorde avec l'observation historique selon laquelle les styles des deux auteurs sont assez similaires, mais cela ne nous aide pas beaucoup dans notre t&#226;che d'identification de l'auteur des textes contest&#233;s. Tout au mieux pouvons-nous affirmer que John Jay n'a presque certainement <emph>pas</emph> &#233;crit ceux-ci puisque sa courbe ne ressemble en rien aux autres. Les points correspondant aux longueurs de mots 6 et 7 sont m&#234;mes invers&#233;s dans le cas de son corpus.</p>
<p>Si nous ne disposions d'aucune information suppl&#233;mentaire, il faudrait se r&#233;soudre &#224; conclure (sans beaucoup de confiance) que les articles contest&#233;s sont probablement l'oeuvre de Madison. Mais heureusement, la stylom&#233;trie a beaucoup progress&#233; depuis l'&#233;poque de Mendenhall.</p>
</div>
      <div n="2"><head>Deuxi&#232;me test stylom&#233;trique : la m&#233;thode du khi carr&#233; de Kilgariff</head>
<p>En 2001, Adam Kilgariff<ref type="footnotemark" target="#15"/> a propos&#233; d'utiliser la statistique du khi carr&#233; (&#233;galement nomm&#233;e "khi deux") pour d&#233;terminer l'auteur d'un texte anonyme. Les lecteurs familiers avec les m&#233;thodes quantitatives savent peut-&#234;tre que le khi carr&#233; est parfois utilis&#233; pour d&#233;terminer si un ensemble d'observations, par exemple les intentions de vote &#233;nonc&#233;es par les &#233;lecteurs lors d'un sondage, suivent une <link target="https://fr.wikipedia.org/wiki/Loi_de_probabilit%C3%A9">loi de probabilit&#233;</link> particuli&#232;re. Ce n'est pas ce que nous cherchons ici. Nous utiliserons plut&#244;t la statistique pour mesurer la "distance" entre les vocabulaires employ&#233;s dans deux ensembles de texte. Plus ces vocabulaires sont similaires, plus il est probable que les ensembles de textes sous-jacents soient l'oeuvre de la m&#234;me personne. (Cela suppose que le vocabulaire d'une personne et ses habitudes d'usage des mots soient relativement constants.)</p>
<p>Voici comment appliquer la statistique du khi carr&#233; &#224; notre probl&#232;me d'identification :</p>
<ul>
<li>Prenons les corpus associ&#233;s &#224; deux auteurs.</li>
<li>Fusionnons-les en un seul corpus combin&#233; de plus grande taille.</li>
<li>Comptons les occurrences de tous les mots qui apparaissent dans ce corpus combin&#233;.</li>
<li>Conservons les <link target="https://fr.wikipedia.org/wiki/%C3%89chantillon_(statistiques)">n</link> mots les plus fr&#233;quents.</li>
<li>Calculons le nombre d'occurrences de ces <code type="inline">n</code> mots les plus fr&#233;quents que l'on se serait attendu &#224; observer dans chacun des deux corpus originaux si ceux-ci avaient &#233;t&#233; r&#233;dig&#233;s par la m&#234;me personne. Pour ce faire, il faut diviser le nombre d'occurrences observ&#233; dans le corpus combin&#233;, proportionnellement aux tailles des deux corpus originaux.</li>
<li>Calculons un khi carr&#233; en additionnant, pour chacun des <code type="inline">n</code> mots les plus fr&#233;quents, <emph>les carr&#233;s des diff&#233;rences entre les nombres d'occurrences observ&#233;s dans les corpus des auteurs et les nombres d'occurrences attendus, divis&#233;s par les nombres d'occurrences attendus</emph>. La figure 6 montre la formule de calcul du khi carr&#233;, o&#249; C(i) repr&#233;sente le nombre d'occurrences observ&#233; pour le mot 'i' tandis que E(i) repr&#233;sente le nombre d'occurrences attendu pour ce mot.</li>
</ul>
<figure><desc>Figure 6: Formule de calcul du khi carr&#233;.</desc><graphic url="stylometry-python-6.jpg"/></figure>
<p>Plus la valeur du khi carr&#233; est basse, plus les deux corpus sont similaires. Nous allons donc calculer un khi carr&#233; pour mesurer la diff&#233;rence entre les articles contest&#233;s et le corpus de Madison, puis un autre pour la diff&#233;rence entre les articles contest&#233;s et le corpus de Hamilton. La plus petite des deux valeurs nous indiquera lequel des deux individus est l'auteur le plus probable des articles contest&#233;s.</p>
<p>Notons en passant que, quelle que soit la m&#233;thode stylom&#233;trique employ&#233;e, le choix de <code type="inline">n</code>, le nombre de mots &#224; consid&#233;rer, rel&#232;ve de l'art autant que de la science. Dans la litt&#233;rature scientifique r&#233;sum&#233;e par Stamatatos<ref type="footnotemark" target="#2"/>, des chercheurs ont sugg&#233;r&#233; pour <code type="inline">n</code> des valeurs allant de 100 &#224; 1000; un projet a m&#234;me conserv&#233; tous les mots qui sont apparus dans le corpus &#224; au moins deux reprises. En r&#232;gle g&#233;n&#233;rale, plus le corpus est vaste, plus il est possible d'utiliser un grand nombre de mots comme traits caract&#233;ristiques sans risquer d'accorder une importance injustifi&#233;e &#224; un mot qui n'appara&#238;t qu'&#224; quelques reprises. Dans le cadre de ce tutoriel, nous utiliserons une valeur de <code type="inline">n</code> relativement &#233;lev&#233;e pour la m&#233;thode du khi carr&#233; et une valeur plus faible pour la m&#233;thode suivante. Changer la valeur de <code type="inline">n</code> influencera certainement les r&#233;sultats des calculs; cependant, si ces changements sont si consid&#233;rables qu'ils en viennent &#224; renverser l'identification de l'auteur, c'est que le test est incapable de fournir des preuves significatives au sujet du texte &#224; l'&#233;tude.</p>
<p>Le segment de code suivant implante la m&#233;thode du khi carr&#233; de Kilgariff, en utilisant les 500 mots les plus fr&#233;quents dans le corpus pour r&#233;aliser les calculs:</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_5" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_5.txt"></code></pre>
<p>Les r&#233;sultats devraient ressembler &#224; ceci:</p>
<pre><code xml:id="code_introduction-a-la-stylometrie-avec-python_6" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_6.txt"></code></pre>
<div class="alert alert-warning">
Note: dans le segment de code ci-dessus, tout le texte est converti en minuscules pour &#233;viter de compter s&#233;par&#233;ment les occurrences d'un m&#234;me mot qui commencent par une majuscule parce qu'ils apparaissent au d&#233;but d'une phrase et celles qui commencent par une minuscule. Cette technique occasionne parfois quelques erreurs, par exemple lorsqu'un nom commun et un nom propre s'&#233;crivent de la m&#234;me fa&#231;on &#224; l'exception de la majuscule initiale, mais en r&#232;gle g&#233;n&#233;rale elle augmente la pr&#233;cision du calcul.
</div>
<p>Comme nous pouvons le constater &#224; la lecture des r&#233;sultats ci-dessus, la valeur du khi carr&#233; s&#233;parant le corpus de Hamilton des articles contest&#233;s est consid&#233;rablement sup&#233;rieure &#224; celle entre les articles contest&#233;s et le corpus de Madison. Il s'agit d'une preuve relativement convaincante du fait que, si un seul auteur est responsable de tous les articles contest&#233;s, cet auteur est Madison plut&#244;t que Hamilton.</p>
<p>Cependant, le khi carr&#233; constitue toujours une m&#233;thode approximative. Par exemple, les mots qui apparaissent fr&#233;quemment dans un corpus ont tendance &#224; occuper une place d&#233;mesur&#233;e dans le calcul. Parfois, ce comportement est appropri&#233;; dans d'autres cas, les diff&#233;rences subtiles qui n'apparaissent que lorsque l'on observe les fr&#233;quences d'utilisation de certains mots rares passent inaper&#231;ues.</p>
<div n="3"><head>Une note au sujet de l'&#233;tiquetage grammatical</head>
<p>Dans certaines langues, il peut &#234;tre utile d'&#233;tiqueter grammaticalement les occurrences de mots avant de les compter, pour que les occurrences de certains mots polys&#233;miques puissent &#234;tre divis&#233;es entre deux traits distincts. Par exemple, en fran&#231;ais, les mots "le" et "la" servent &#224; la fois d'articles et de pronoms. Ce tutoriel n'applique pas l'&#233;tiquetage grammatical puisqu'il est rarement utile pour l'analyse stylom&#233;trique de textes en anglais contemporain et parce que l'analyseur syntaxique de <code type="inline">nltk</code> ne g&#232;re pas tr&#232;s bien les autres langues.</p>
<p>Si vous avez besoin d'&#233;tiqueter les occurrences pour vos propres projets, il est possible de t&#233;l&#233;charger des analyseurs ext&#233;rieurs, d'obtenir des outils s&#233;par&#233;s comme <link target="http://www.cis.uni-muenchen.de/~schmid/tools/TreeTagger/">Tree Tagger</link>, ou m&#234;me d'entra&#238;ner vos propres mod&#232;les d'&#233;tiquetage, mais ces techniques sont hors du cadre de ce tutoriel.</p>
</div></div>
      <div n="2"><head>Troisi&#232;me test stylom&#233;trique : la m&#233;thode du Delta de John Burrows (Concepts avanc&#233;s)</head>
<p>Les deux m&#233;thodes stylom&#233;triques que nous avons employ&#233;es jusqu'ici sont faciles &#224; implanter. La prochaine, bas&#233;e sur la statistique <emph>Delta</emph> de John Burrows<ref type="footnotemark" target="#16"/>, est plus complexe tant au point de vue conceptuel (les calculs math&#233;matiques sont plus nombreux) qu'au point de vue computationnel (nous aurons besoin de beaucoup plus de code). Il s'agit cependant de l'une des m&#233;thodes stylom&#233;triques les plus populaires en recherche.</p>
<p>Comme la m&#233;thode du khi carr&#233; de Kilgariff, le Delta de Burrows mesure la "distance" entre un texte dont nous souhaitons d&#233;terminer l'auteur et un corpus quelconque. Mais contrairement au khi carr&#233;, Delta est con&#231;u pour comparer un texte (ou un ensemble de textes) anonyme aux signatures stylistiques de plusieurs auteurs en m&#234;me temps. Plus pr&#233;cis&#233;ment, Delta mesure comment le texte anonyme <emph>et des ensembles de textes r&#233;dig&#233;s par un nombre arbitraire d'auteurs connus</emph> divergent tous d'une norme &#233;tablie en rassemblant tous ces textes dans un seul et m&#234;me corpus. De plus, Delta accorde le m&#234;me poids &#224; chacun des traits caract&#233;ristiques mesur&#233;s, ce qui &#233;vite que les mots tr&#232;s fr&#233;quents dominent compl&#232;tement les calculs comme dans le cas du khi carr&#233;. Pour toutes ces raisons, Delta constitue habituellement une solution plus efficace au probl&#232;me de l'identification de l'auteur d'un texte anonyme.</p>
<p>L'algorithme original de Burrows peut &#234;tre r&#233;sum&#233; ainsi:</p>
<ul>
<li>Assembler un grand corpus form&#233; de textes r&#233;dig&#233;s par un nombre arbitraire d'auteurs. Disons que ce nombre d'auteurs est <code type="inline">x</code>.</li>
<li>Trouver les <code type="inline">n</code> mots les plus fr&#233;quents dans ce grand corpus; ce seront nos traits &#224; &#233;tudier.</li>
<li>Pour chacun des <code type="inline">n</code> traits, calculer la proportion du sous-corpus de chacun des <code type="inline">x</code> auteurs repr&#233;sent&#233;e par ce trait, en pourcentage du total de mots. Par exemple, le mot "the" pourrait repr&#233;senter 4,72% de toutes les occurrences dans les textes de l'auteur A.</li>
<li>Calculer la moyenne et l'&#233;cart-type de ces <code type="inline">x</code> mesures de pr&#233;sence. Celles-ci serviront de moyenne et d'&#233;cart-type officiels pour le corpus entier. En d'autres mots, nous utiliserons une <emph>moyenne de moyennes</emph> plut&#244;t que de calculer une seule valeur repr&#233;sentant la proportion du corpus entier repr&#233;sent&#233;e par chaque mot. Il s'agit d'un choix strat&#233;gique qui emp&#234;che qu'un sous-corpus d'auteur beaucoup plus &#233;tendu que les autres, comme celui de Hamilton dans le <emph>F&#233;d&#233;raliste</emph>, n'exerce une influence exag&#233;r&#233;e de telle sorte que l'algorithme s'attende &#224; ce que tout ce qu'il observe lui ressemble.</li>
<li>Pour chacun des <code type="inline">n</code> traits et des <code type="inline">x</code> sous-corpus d'auteurs, calculer une <link target="https://fr.wikipedia.org/wiki/Cote_Z_(statistiques)">cote Z</link> qui d&#233;crit l'&#233;cart entre la pr&#233;sence de ce trait dans ce sous-corpus et la norme du corpus. Pour ce faire, il faut soustraire la "moyenne de moyennes" du corpus pour le trait de la pr&#233;sence de ce trait observ&#233;e dans le sous-corpus, puis diviser le r&#233;sultat par l'&#233;cart-type du trait. La figure 7 pr&#233;sente la formule de calcul de la cote Z pour le trait 'i', o&#249; C(i) repr&#233;sente la fr&#233;quence observ&#233;e, la lettre grecque mu repr&#233;sente la moyenne des moyennes, et la lettre grecque sigma repr&#233;sente l'&#233;cart-type.</li>
</ul>
<figure><desc>Figure 7: Formule de calcul de la cote Z.</desc><graphic url="stylometry-python-7.jpg"/></figure>
<ul>
<li>Puis, calculer de la m&#234;me fa&#231;on des cotes Z pour chacun des traits dans le texte dont il faut d&#233;terminer l'auteur.</li>
<li>Enfin, calculer une <emph>cote Delta</emph> qui compare le texte anonyme avec les sous-corpus de chacun des auteurs connus. Pour ce faire, il faut calculer <emph>la moyenne des valeurs absolues des diff&#233;rences entre les cotes Z de chacun des traits pour le texte anonyme et pour le sous-corpus de l'auteur.</emph> (Lisez cette phrase deux fois!) Ce calcul accorde le m&#234;me poids &#224; chaque trait, peu importe les nombres d'occurrences des diff&#233;rents mots; autrement, les trois ou quatre mots les plus fr&#233;quents domineraient le calcul. La figure 8 montre la formule de calcul de Delta, o&#249; Z(c,i) est la cote Z pour le trait 'i' dans le sous-corpus de l'auteur 'c' et Z(t,i) est la cote Z pour le trait 'i' dans le texte soumis au test.</li>
</ul>
<figure><desc>Figure 8: Formule de calcul du Delta de John Burrows.</desc><graphic url="stylometry-python-8.jpg"/></figure>
<ul>
<li>Le "vainqueur" est l'auteur pour lequel la cote Delta est le plus bas.</li>
</ul>
<p>Stefan Evert <emph>et al</emph><ref type="footnotemark" target="#18"/> pr&#233;sentent une discussion d&#233;taill&#233;e des variantes, complexit&#233;s et raffinements de la m&#233;thode, mais nous nous en tiendrons &#224; l'algorithme de base pour les besoins de ce tutoriel. Si vous lisez l'espagnol, une autre explication de la m&#233;thode Delta et une application de celle-ci &#224; un corpus de romans se retrouvent dans un r&#233;cent article de Jos&#233; Calvo Tello.<ref type="footnotemark" target="#17"/></p>
<div n="3"><head>Notre cas de test</head>
<p>Nous allons tester la m&#233;thode &#224; l'aide de l'article <emph>F&#233;d&#233;raliste 64</emph>. Dans la lettre mentionn&#233;e au d&#233;but de ce tutoriel, Alexander Hamilton affirmait en &#234;tre l'auteur. Un brouillon du <emph>F&#233;d&#233;raliste 64</emph> a cependant &#233;t&#233; retrouv&#233; plus tard dans les papiers personnels de John Jay et le consensus scientifique lui reconna&#238;t la paternit&#233; du texte. On ne soup&#231;onne pas Hamilton d'avoir eu de mauvaises intentions. En effet, dans la m&#234;me lettre, Hamilton attribuait &#224; Jay un autre article, dont le num&#233;ro est similaire, qu'il avait pourtant clairement r&#233;dig&#233; lui-m&#234;me. Hamilton, distrait par la perspective de se battre en duel, a peut-&#234;tre &#233;t&#233; victime d'un trou de m&#233;moire.</p>
<p>Puisque la m&#233;thode Delta fonctionne peu importe le nombre de candidats au titre d'auteur du texte anonyme (l'article original de Burrows en utilise environ 25), nous comparerons la signature stylistique de <emph>F&#233;d&#233;raliste 64</emph> &#224; celles de cinq corpus : les textes de Hamilton, ceux de Madison, ceux de Jay, ceux qui ont &#233;t&#233; co-r&#233;dig&#233;s par Hamilton et Madison et ceux qui sont revendiqu&#233;s par ces deux derniers. Nous nous attendons &#224; ce que la m&#233;thode Delta affirme que Jay est l'auteur le plus probable. Tout autre r&#233;sultat remettrait en question soit la m&#233;thode, soit l'historiographie, soit les deux.</p>
</div><div n="3"><head>S&#233;lection des traits &#224; &#233;tudier</head>
<p>Combinons les cinq sous-corpus en un seul corpus pour que Delta puisse calculer un "standard" auquel tout comparer par la suite. Choisissons ensuite un nombre de mots &#224; utiliser comme traits distinctifs. Rappelons que nous avons utilis&#233; 500 mots dans le calcul du khi carr&#233; de Kilgariff. Cette fois-ci, nous allons nous limiter &#224; 30 traits, tous ou presque des mots-outils et des verbes auxiliaires.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_7" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_7.txt"></code></pre>
<p>Un &#233;chantillon des mots les plus fr&#233;quents et de leurs nombres d'occurrences ressemble &#224; ceci:</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_8" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_8.txt"></code></pre>
</div><div n="3"><head>Calcul des traits de chaque sous-corpus</head>
<p>Calculons les pr&#233;sences de chacun des traits dans chacun des sous-corpus, en terme de pourcentages du nombre total d'occurrences dans ce sous-corpus. Nous enregistrerons les r&#233;sultats de ces calculs dans un dictionnaire de dictionnaires, une structure de donn&#233;es commode pour repr&#233;senter un <link target="https://fr.wikipedia.org/wiki/Tableau_(structure_de_donn%C3%A9es)">tableau de donn&#233;es &#224; deux dimensions</link> en Python.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_9" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_9.txt"></code></pre>
</div><div n="3"><head>Calcul des moyennes et des &#233;carts-types pour chacun des traits</head>
<p>&#201;tant donn&#233;es les pr&#233;sences des traits dans tous les sous-corpus que nous venons de calculer, nous pouvons d&#233;terminer une "moyenne de moyennes" et un &#233;cart-type pour chaque trait. Nous enregistrerons ces valeurs dans un autre dictionnaire de dictionnaires.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_10" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_10.txt"></code></pre>
</div><div n="3"><head>Calcul des cotes Z</head>
<p>Nous allons maintenant transformer les pr&#233;sences observ&#233;es de chaque trait dans chaque sous-corpus en cotes Z qui d&#233;crivent la distance entre ces observations et la "norme" du corpus. Il suffit d'appliquer la d&#233;finition de la cote Z &#224; chaque trait et d'enregistrer les r&#233;sultats dans un autre tableau &#224; deux dimensions.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_11" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_11.txt"></code></pre>
</div><div n="3"><head>Calcul des traits et des cotes Z du cas de test</head>
<p>Il faut maintenant comparer <emph>F&#233;d&#233;raliste 64</emph> &#224; la norme du corpus. Le segment de code ci-dessous, qui r&#233;capitule en quelque sorte tout ce que nous avons fait jusqu'ici, calcule les pr&#233;sences de chacun des 30 traits dans <emph>F&#233;d&#233;raliste 64</emph> et transforme celles-ci en cotes Z:</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_12" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_12.txt"></code></pre>
<p>Les r&#233;sultats du calcul des cotes Z pour quelques traits du <emph>Federalist 64</emph> ressemblent &#224; ceci:</p>
<pre><code xml:id="code_introduction-a-la-stylometrie-avec-python_13" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_13.txt"></code></pre>
</div><div n="3"><head>Calculs de Delta</head>
<p>Enfin, nous appliquerons la formule du Delta d&#233;finie par Burrows pour obtenir des cotes comparant <emph>F&#233;d&#233;raliste 64</emph> avec chacun des cinq sous-corpus. Rappelons que plus une cote Delta est basse, plus la signature stylistique de <emph>F&#233;d&#233;raliste 64</emph> ressemble &#224; celle du corpus auquel il est compar&#233; dans le calcul de cett cote.</p>
<pre><code class="language-python" xml:id="code_introduction-a-la-stylometrie-avec-python_14" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_14.txt"></code></pre>
<p>Le r&#233;sultat? Delta estime que <emph>Federalist 64</emph> a bel et bien &#233;t&#233; r&#233;dig&#233; par John Jay:</p>
<pre><code xml:id="code_introduction-a-la-stylometrie-avec-python_15" type="block" corresp="code_introduction-a-la-stylometrie-avec-python_15.txt"></code></pre>
<p>Comme pr&#233;vu, le Delta parmet d'identifier John Jay comme l'auteur le plus probable de <emph>F&#233;d&#233;raliste 64</emph>. Il est int&#233;ressant de noter que, selon le Delta, <emph>F&#233;d&#233;raliste 64</emph> est cependant plus proche des articles contest&#233;s par Hamilton et Madison que de ceux qui ont clairement &#233;t&#233; &#233;crits par l'un ou par l'autre. L'explication de ce ph&#233;nom&#232;ne devra cependant attendre une autre occasion.</p>
</div></div>
      <div n="2"><head>Lectures et ressources additionnelles</head>
<div n="3"><head>&#201;tudes de cas int&#233;ressantes</head>
<p>La stylom&#233;trie et/ou l'identification des auteurs de textes anonymes, &#224; l'aide de plusieurs techniques diff&#233;rentes, ont &#233;t&#233; utilis&#233;es dans de multiples contextes. Voici quelques &#233;tudes de cas int&#233;ressantes:</p>
<ul>
<li>Javier de la Rosa et Juan Luis Su&#225;rez tentent de d&#233;terminer l'auteur d'un c&#233;l&#232;bre roman espagnol du XVIe si&#232;cle, &#224; partir d'une liste de candidats d'une taille consid&#233;rable.<ref type="footnotemark" target="#19"/></li>
<li>Maria Slautina et Mikhail Marusenko appliquent la reconnaissance des motifs &#224; un ensemble de traits lexicom&#233;triques, grammaticaux et syntactiques, allant des simples d&#233;comptes de mots &#233;tiquet&#233;s grammaticalement jusqu'&#224; diff&#233;rentes phrases complexes, pour &#233;tablir la similarit&#233; stylistique entre des textes m&#233;di&#233;vaux.<ref type="footnotemark" target="#20"/></li>
<li>Ellen Jordan, Hugh Craig et Alexis Antonia examinent des p&#233;riodiques britanniques du XIXe si&#232;cle, dans lesquels les articles &#233;taient habituellement anonymes, pour d&#233;terminer l'auteur de quatre critiques d'oeuvres &#233;crites par les soeurs Bront&#235; ou qui parlent de ces derni&#232;res.<ref type="footnotemark" target="#21"/> Cette &#233;tude applique une version pr&#233;liminaire d'une autre technique d&#233;velopp&#233;e par John Burrows, celle du Zeta, qui se concentre sur les mots favoris d'un auteur plut&#244;t que sur les mots-outils.<ref type="footnotemark" target="#22"/></li>
<li>Val&#233;rie Beaudoin et Fran&#231;ois Yvon &#233;tudient 58 pi&#232;ces en vers de Corneille, de Racine et de Moli&#232;re, pour conclure que la structure des oeuvres des deux premiers &#233;tait beaucoup plus pr&#233;visible.<ref type="footnotemark" target="#23"/></li>
<li>Marcelo Luiz Brocardo, Issa Traore, Sherif Saad et Isaac Woungang appliquent des techniques <link target="https://fr.wikipedia.org/wiki/Apprentissage_supervis%C3%A9">d'apprentissage automatique supervis&#233;</link> et d&#233;veloppent des mod&#232;les de <link target="https://fr.wikipedia.org/wiki/N-gramme">n-grammes</link> pour d&#233;terminer les auteurs de courts messages pour lesquels de grands nombres de candidats existent, comme le courrier &#233;lectronique et les tweets.<ref type="footnotemark" target="#24"/></li>
<li>Moshe Koppel et Winter Yaron ont propos&#233; la "m&#233;thode de l'imposteur", qui tente de d&#233;terminer si deux textes ont &#233;t&#233; &#233;crits par la m&#234;me personne en les ins&#233;rant dans un ensemble de textes r&#233;dig&#233;s par de faux candidats.<ref type="footnotemark" target="#25"/> Justin Anthony Stover <emph>et al.</emph> ont appliqu&#233; la m&#234;me technique pour d&#233;terminer l'auteur d'un manuscrit du IIe si&#232;cle r&#233;cemment d&#233;couvert.<ref type="footnotemark" target="#26"/></li>
<li>Enfin, une &#233;quipe dirig&#233;e par David I. Holmes &#233;tudie le curieux exemple de documents qui ont &#233;t&#233; &#233;crits soit par un soldat de la guerre de S&#233;cession am&#233;ricaine, soit par sa veuve qui aurait peut-&#234;tre copi&#233; intentionnellement le style d'&#233;criture de son d&#233;funt mari.<ref type="footnotemark" target="#27"/></li>
</ul>
</div><div n="3"><head>Autres r&#233;f&#233;rences sur la stylom&#233;trie</head>
<p>La r&#233;f&#233;rence la plus compl&#232;te en mati&#232;re d'identification d'auteurs, incluant l'histoire de la discipline, ses fondements math&#233;matiques et linguistiques et ses m&#233;thodes, a &#233;t&#233; &#233;crite par Patrick Juola en 2007.<ref type="footnotemark" target="#28"/> Le chapitre 7 d&#233;montre notamment comment appliquer les m&#233;thodes d'attribution pour relever des marqueurs d'identit&#233;s de genre, de nationalit&#233;, de dialecte, etc., pour suivre l'&#233;volution du langage dans le temps, et m&#234;me pour &#233;tudier la personnalit&#233; et la sant&#233; mentale des auteurs.</p>
<p>Un r&#233;sum&#233; plus concis se retrouve dans Moshe Koppel <emph>et al.</emph>, qui discute des cas o&#249; il n'y a qu'un seul candidat dont il faut confirmer le r&#244;le d'auteur, de grands nombres de candidats pour lesquels il n'existe que de petits &#233;chantillons d'&#233;criture, ou m&#234;me pas de candidat du tout.<ref type="footnotemark" target="#29"/></p>
<p>L'article de Stamatatos d&#233;j&#224; cit&#233;<ref type="footnotemark" target="#2"/> contient lui aussi un r&#233;sum&#233; de qualit&#233;.</p>
</div><div n="3"><head>Varia</head>
<p>Les historiens programmeurs qui d&#233;sirent explorer la stylom&#233;trie plus en profondeur pourraient &#234;tre int&#233;ress&#233;s par le t&#233;l&#233;chargement du module Stylo<ref type="footnotemark" target="#30"/>, qui s'est &#233;tabli comme un standard <emph>de facto</emph>. Stylo contient notamment une implantation de la m&#233;thode Delta, des outils d'extraction de traits caract&#233;ristiques et des interfaces graphiques pour la manipulation de donn&#233;es et pour la production de r&#233;sultats visuellement attrayants. Notez que Stylo est programm&#233; en <link target="https://www.r-project.org/">langage R</link>, ce qui signifie qu'il vous faudra avoir install&#233; R sur votre ordinateur pour vous en servir. Cependant, l'interface graphique et les tutoriels fournis avec Stylo sont suffisamment intuitifs pour que peu ou pas d'exp&#233;rience pr&#233;alable avec R ne soit n&#233;cessaire.</p>
<p>Cl&#233;mence Jacquot explore les implications <link target="https://fr.wikipedia.org/wiki/%C3%89pist%C3%A9mologie">&#233;pist&#233;miques</link> de l'interaction entre les m&#233;thodes qualitatives et quantitatives dans le cadre d'une analyse du style d'&#233;criture.<ref type="footnotemark" target="#31"/></p>
<p>&#201;tonnamment, il a &#233;t&#233; d&#233;montr&#233; qu'il est possible d'identifier l'auteur d'un texte m&#234;me lorsque l'on ne dispose pour celui-ci que de <link target="https://fr.wikipedia.org/wiki/Reconnaissance_optique_de_caract%C3%A8res">donn&#233;es d'oc&#233;risation</link> qui souffrent d'un taux d'erreurs &#233;lev&#233;.<ref type="footnotemark" target="#32"/></p>
<p>Les lecteurs qui souhaitent en savoir plus sur l'histoire du <emph>F&#233;d&#233;raliste</emph> et sur les diverses th&#233;ories qui ont &#233;t&#233; propos&#233;es &#224; son sujet sont invit&#233;s &#224; consulter en premier lieu les travaux d'Irving Brant<ref type="footnotemark" target="#33"/> et de Paul Ford et Edward Bourne<ref type="footnotemark" target="#34"/>. Le sujet est cependant presque in&#233;puisable.</p>
<p>Enfin, il existe un <link target="https://www.zotero.org/groups/643516/stylometry_bibliography/items">groupe Zotero</link> d&#233;di&#233; &#224; la stylom&#233;trie, o&#249; l'on peut trouver des r&#233;f&#233;rences &#224; de nombreuses &#233;tudes et m&#233;thodes suppl&#233;mentaires.</p>
</div></div>
      <div n="2"><head>Remerciements</head>
<p>La premi&#232;re it&#233;ration de ce projet a &#233;t&#233; d&#233;velopp&#233;e dans le cadre des s&#233;minaires de recherche de St&#233;fan Sinclair et d'Andrew Piper &#224; l'Universit&#233; McGill (Canada). Merci &#224; ma directrice de recherche doctorale, Susan Dalton, pour ses conseils toujours pr&#233;cieux.</p>
</div>
      <div n="2"><head>Notes</head>
<p><note id="1"> Voir, par exemple, Justin Rice, <link target="https://www.litcharts.com/analitics/hemingway">"What Makes Hemingway Hemingway? A statistical analysis of the data behind Hemingway's style"</link></note></p>
<p><note id="2"> Efstathios Stamatatos, &#8220;A Survey of Modern Authorship Attribution Method,&#8221; <emph>Journal of the American Society for Information Science and Technology</emph>, vol. 60, no. 3 (D&#233;cembre 2008), p. 538&#8211;56, citation &#224; la page 540, <link target="https://doi.org/10.1002/asi.21001">https://doi.org/10.1002/asi.21001</link>.</note></p>
<p><note id="3"> Jan Rybicki, &#8220;Vive La Diff&#233;rence: Tracing the (Authorial) Gender Signal by Multivariate Analysis of Word Frequencies,&#8221; <emph>Digital Scholarship in the Humanities</emph>, vol. 31, no. 4 (D&#233;cembre 2016), p. 746&#8211;61, <link target="https://doi.org/10.1093/llc/fqv023">https://doi.org/10.1093/llc/fqv023</link>. Sean G. Weidman et James O&#8217;Sullivan, &#8220;The Limits of Distinctive Words: Re-Evaluating Literature&#8217;s Gender Marker Debate,&#8221; <emph>Digital Scholarship in the Humanities</emph>, 2017, <link target="https://doi.org/10.1093/llc/fqx017">https://doi.org/10.1093/llc/fqx017</link>.</note></p>
<p><note id="4"> Ted Underwood, David Bamman, et Sabrina Lee, &#8220;The Transformation of Gender in English-Language Fiction&#8221;, <emph>Cultural Analytics</emph>, 13 f&#233;vrier 2018,&#160;DOI:&#160;10.7910/DVN/TEGMGI.</note></p>
<p><note id="5"> Sven Meyer zu Eissen et Benno Stein, &#8220;Intrinsic Plagiarism Detection,&#8221; dans <emph>ECIR 2006</emph>, &#233;dit&#233; par Mounia Lalmas, Andy MacFarlane, Stefan R&#252;ger, Anastasios Tombros, Theodora Tsikrika et Alexei Yavlinsky, Berlin, Heidelberg: Springer, 2006, p. 565&#8211;69, <link target="https://doi.org/10.1007/11735106_66">https://doi.org/10.1007/11735106_66</link>.</note></p>
<p><note id="6"> Cynthia Whissell, &#8220;Traditional and Emotional Stylometric Analysis of the Songs of Beatles Paul McCartney and John Lennon,&#8221; <emph>Computers and the Humanities</emph>, vol. 30, no. 3 (1996), p. 257&#8211;65.</note></p>
<p><note id="7"> Douglass Adair, "The Authorship of the Disputed Federalist Papers", <emph>The William and Mary Quarterly</emph>, vol. 1, no. 2 (Avril 1944), p. 97-122.</note></p>
<p><note id="8"> David I. Holmes et Richard S. Forsyth, "The Federalist Revisited: New Directions in Authorship Attribution", <emph>Literary and Linguisting Computing</emph>, vol. 10, no. 2 (1995), p. 111-127.</note></p>
<p><note id="9"> Frederick Mosteller, "A Statistical Study of the Writing Styles of the Authors of the Federalist Papers", <emph>Proceedings of the American Philosophical Society</emph>, vol. 131, no. 2 (1987), p. 132&#8209;40.</note></p>
<p><note id="10"> Frederick Mosteller et David Lee Wallace, <emph>Inference and Disputed Authorship: The Federalist</emph>, Addison-Wesley Series in Behavioral Science&#8239;: Quantitative Methods (Reading, Mass.: Addison-Wesley, 1964).</note></p>
<p><note id="11"> Voir par exemple Glenn Fung, "The disputed Federalist papers: SVM feature selection via concave minimization", <emph>TAPIA '03: Proceedings of the 2003 conference on Diversity in Computing</emph>, p. 42-46; et Robert A. Bosch et Jason A. Smith, &#8220;Separating Hyperplanes and the Authorship of the Disputed Federalist Papers,&#8221; <emph>The American Mathematical Monthly</emph>, vol. 105, no. 7 (1998), p. 601&#8211;8, <link target="https://doi.org/10.2307/2589242">https://doi.org/10.2307/2589242</link>.</note></p>
<p><note id="12"> Jeff Collins, David Kaufer, Pantelis Vlachos, Brian Butler et Suguru Ishizaki, "Detecting Collaborations in Text: Comparing the Authors' Rhetorical Language Choices in The Federalist Papers", <emph>Computers and the Humanities</emph>, vol. 38 (2004), p. 15-36.</note></p>
<p><note id="13"> Mosteller, "A Statistical Study...", p. 132-133.</note></p>
<p><note id="14"> T. C. Mendenhall, "The Characteristic Curves of Composition", <emph>Science</emph>, vol. 9, no. 214 (11 mars 1887), p. 237-249.</note></p>
<p><note id="15"> Adam Kilgarriff, "Comparing Corpora", <emph>International Journal of Corpus Linguistics</emph>, vol. 6, no. 1 (2001), p. 97-133.</note></p>
<p><note id="16"> John Burrows, "'Delta': a Measure of Stylistic Difference and a Guide to Likely Authorship", <emph>Literary and Linguistic Computing</emph>, vol. 17, no. 3 (2002), p. 267-287.</note></p>
<p><note id="17"> Jos&#233; Calvo Tello, &#8220;Entendiendo Delta desde las Humanidades,&#8221; <emph>Caracteres</emph>, 27 mai 2016, <link target="http://revistacaracteres.net/revista/vol5n1mayo2016/entendiendo-delta/">http://revistacaracteres.net/revista/vol5n1mayo2016/entendiendo-delta/</link>.</note></p>
<p><note id="18"> Stefan Evert et al., "Understanding and explaining Delta measures for authorship attribution", <emph>Digital Scholarship in the Humanities</emph>, vol. 32, no. suppl_2 (2017), p.  ii4-ii16.</note></p>
<p><note id="19"> Javier de la Rosa et Juan Luis Su&#225;rez, &#8220;The Life of Lazarillo de Tormes and of His Machine Learning Adversities,&#8221; <emph>Lemir</emph>, vol. 20 (2016), p. 373-438.</note></p>
<p><note id="20"> Maria Slautina et Mikha&#239;l Marusenko, &#8220;L&#8217;&#233;mergence du style, The emergence of style,&#8221; <emph>Les Cahiers du num&#233;rique</emph>, vol. 10, no. 4 (Novembre 2014), p. 179&#8211;215, <link target="https://doi.org/10.3166/LCN.10.4.179-215">https://doi.org/10.3166/LCN.10.4.179-215</link>.</note></p>
<p><note id="21"> Ellen Jordan, Hugh Craig, et Alexis Antonia, &#8220;The Bront&#235; Sisters and the &#8216;Christian Remembrancer&#8217;: A Pilot Study in the Use of the &#8216;Burrows Method&#8217; to Identify the Authorship of Unsigned Articles in the Nineteenth-Century Periodical Press,&#8221; <emph>Victorian Periodicals Review</emph>, vol. 39, no. 1 (2006), p. 21&#8211;45.</note></p>
<p><note id="22"> John Burrows, &#8220;All the Way Through: Testing for Authorship in Different Frequency Strata,&#8221; <emph>Literary and Linguistic Computing</emph>, vol. 22, no. 1 (Avril 2007), p. 27&#8211;47, <link target="https://doi.org/10.1093/llc/fqi067">https://doi.org/10.1093/llc/fqi067</link>.</note></p>
<p><note id="23"> Val&#233;rie Beaudoin et Fran&#231;ois Yvon, &#8220;Contribution de La M&#233;trique &#224; La Stylom&#233;trie,&#8221; <emph>JADT 2004: 7e Journ&#233;es internationales d'Analyse statistique des Donn&#233;es Textuelles</emph>, vol. 1, Louvain La Neuve, Presses Universitaires de Louvain, 2004, p. 107&#8211;18.</note></p>
<p><note id="24"> Marcelo Luiz Brocardo, Issa Traore, Sherif Saad et Isaac Woungang, &#8220;Authorship Verification for Short Messages Using Stylometry,&#8221; <emph>2013 International Conference on Computer, Information and Telecommunication Systems (CITS)</emph>, 2013, <link target="https://doi.org/10.1109/CITS.2013.6705711">https://doi.org/10.1109/CITS.2013.6705711</link>.</note></p>
<p><note id="25"> Moshe Koppel et Winter Yaron, &#8220;Determining If Two Documents Are Written by the Same Author,&#8221; <emph>Journal of the Association for Information Science and Technology</emph>, vol. 65, no. 1 (Octobre 2013), p. 178&#8211;87, <link target="https://doi.org/10.1002/asi.22954">https://doi.org/10.1002/asi.22954</link>.</note></p>
<p><note id="26"> Justin Anthony Stover et al., "Computational authorship verification method attributes a new work to a major 2nd century African author", <emph>Journal of the Association for Information Science and Technology</emph>, vol. 67, no. 1 (2016), p. 239&#8211;242.</note></p>
<p><note id="27"> David I. Holmes, Lesley J. Gordon et Christine Wilson, "A widow and her soldier: Stylometry and the American Civil War", <emph>Literary and Linguistic Computing</emph>, vol. 16, no 4 (2001), p. 403&#8211;420.</note></p>
<p><note id="28"> Patrick Juola, &#8220;Authorship Attribution,&#8221; <emph>Foundations and Trends in Information Retrieval</emph>, vol. 1, no. 3 (2007), p. 233&#8211;334, <link target="https://doi.org/10.1561/1500000005">https://doi.org/10.1561/1500000005</link>.</note></p>
<p><note id="29"> Moshe Koppel, Jonathan Schler et Shlomo Argamon, &#8220;Computational Methods in Authorship Attribution,&#8221; <emph>Journal of the Association for Information Science and Technology</emph>. vol. 60, no. 1 (Janvier 2009), p. 9&#8211;26, <link target="https://doi.org/10.1002/asi.v60:1">https://doi.org/10.1002/asi.v60:1</link>.</note></p>
<p><note id="30"> Maciej Eder, Jan Rybicki et Mike Kestemont, &#8220;Stylometry with R: A Package for Computational Text Analysis,&#8221; <emph>The R Journal</emph>, vol. 8, no. 1 (2016), p. 107&#8211;21.</note></p>
<p><note id="31"> Cl&#233;mence Jacquot, &#8220;R&#234;ve d'une &#233;piphanie du style: visibilit&#233; et saillance en stylistique et en stylom&#233;trie,&#8221; <emph>Revue d&#8217;Histoire Litt&#233;raire de la France</emph> , vol. 116, no. 3 (2016), p. 619&#8211;39.</note></p>
<p><note id="32"> Patrick Juola, John Noecker Jr et Michael Ryan, "Authorship Attribution and Optical Character Recognition Errors", <emph>TAL</emph>, vol. 53, no. 3 (2012), p. 101&#8211;127.</note></p>
<p><note id="33"> Irving Brant, "Settling the Authorship of the Federalist", <emph>The American Historical Review</emph>, vol. 67, no. 1 (Octobre 1961), p. 71-75.</note></p>
<p><note id="34"> Paul Leicester Ford et Edward Gaylord Bourne, "The Authorship of the Federalist", <emph>The American Historical Review</emph>, vol. 2, no. 4 (Juillet 1897), p. 675-687.</note></p>
</div>
    </body>
  </text>
</TEI>
