<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introduccion-a-imageplot-y-la-visualizacion-de-metadatos">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introducci&#243;n a ImagePlot y la visualizaci&#243;n de metadatos de colecciones de im&#225;genes
</title>
  <author type="original_author">Joshua G. Ortiz Baco</author><editor type="reviewers"><persName>Adriana C&#225;sarez</persName><persName>Jennifer Isasi</persName></editor><editor type="editors">Jennifer Isasi</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0046</idno><date type="published">05/12/2020</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. This lesson is original. Available translations are the following:<ref type="translations" target=""/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>En esta lecci&#243;n se ofrece una introducci&#243;n a ImagePlot, una herramienta para generar visualizaciones basadas en los datos de colecciones de im&#225;genes o videos.
</p></abstract><textClass><keyword xml:lang="en">distant-reading</keyword><keyword xml:lang="en">get-ready</keyword><keyword xml:lang="en">data-visualization</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Introducci&#243;n a ImagePlot y la visualizaci&#243;n de metadatos de colecciones de im&#225;genes</head>
<div type="3"><head>Qu&#233; aprender&#225;s en este tutorial</head>
<p>En esta lecci&#243;n se ofrece una introducci&#243;n a ImagePlot, una herramienta para generar visualizaciones basadas en los datos de colecciones de im&#225;genes o videos. Aprender&#225;s c&#243;mo utilizar la herramienta para:</p>
<ul>
<li>Extraer metadatos relacionados con las medidas de im&#225;genes</li>
<li>Entender caracter&#237;sticas b&#225;sicas de im&#225;genes</li>
<li>Crear representaciones gr&#225;ficas de colecciones visuales</li>
</ul>
<p>Como paso final, utilizar&#225;s las medidas generadas a trav&#233;s de ImagePlot para complementar los metadatos de una colecci&#243;n de afiches. Con estos realizar&#225;s una representaci&#243;n gr&#225;fica para aprender c&#243;mo este tipo de visualizaciones pueden ser &#250;tiles al explorar colecciones.</p>
</div><div type="3"><head>Informaci&#243;n de trasfondo</head>
<div type="4"><head>&#191;Qu&#233; es ImagePlot?</head>
<p>Esta herramienta fue creada por el equipo de <link target="http://lab.softwarestudies.com/search/label/espa%C3%B1ol">Software Studies Initiative</link> para realizar visualizaciones que puedan abarcar la totalidad de una colecci&#243;n de im&#225;genes y opera dentro de otro programa de libre acceso llamado <link target="https://imagej.nih.gov/ij/?">ImageJ</link>. Los creadores de ImagePlot utilizan el t&#233;rmino "vista a distancia", <emph>distant viewing</emph> en ingl&#233;s, para describir este tipo de visualizaci&#243;n y an&#225;lisis porque el punto de partida o enfoque principal es lo que se puede percibir de la totalidad de los elementos de la colecci&#243;n, en vez de uno o dos elementos a la vez.</p>
</div><div type="4"><head>Visualizaci&#243;n de metadatos</head>
<p>En este sentido, el uso de ImagePlot generalmente cae bajo la anal&#237;tica cultural ya que es capaz de procesar metadatos de colecciones de miles de millones de objetos. Las visualizaciones a esta escala pueden utilizarse para varios prop&#243;sitos como, por ejemplo: demostrar cambios a trav&#233;s del tiempo, encontrar im&#225;genes con caracter&#237;sticas at&#237;picas, detectar grupos de im&#225;genes similares o descubrir patrones en colecciones, entre otros. ImagePlot, al igual que programas similares, utiliza metadatos de los objetos expresados num&#233;ricamente para generar estas representaciones gr&#225;ficas.</p>
<p>No obstante, no necesitamos una colecci&#243;n inmensa para sacarle provecho a la visualizaci&#243;n de datos y a ImagePlot. En esta lecci&#243;n utilizaremos esta herramienta con el objetivo de familiarizarnos con algunos aspectos de una colecci&#243;n y el tipo de preguntas que se pueden hacer, tanto de esta colecci&#243;n en particular, como de materiales visuales en general.</p>
</div><div type="4"><head>La colecci&#243;n y los metadatos</head>
<p>Para esta lecci&#243;n utilizaremos una serie de im&#225;genes provenientes de una colecci&#243;n de afiches del <link target="https://web.archive.org/web/20201120143502/http://museo.com.sv/es/">Museo de la Palabra y la Im&#225;gen</link> en San Salvador, El Salvador. Los 394 afiches representados en los metadatos fueron creados durante los 12 a&#241;os de la Guerra Civil de El Salvador (1980&#8211;1992), por m&#225;s de 171 organizaciones de por lo menos 21 pa&#237;ses. Los metadatos fueron preparados por personal de MUPI junto con el equipo de <link target="http://ladi.lib.utexas.edu/">Iniciativas Digitales de Am&#233;rica Latina</link><ref type="footnotemark" target="#1"/> y la hoja de metadatos que utilizar&#225;s en esta lecci&#243;n es una versi&#243;n modificada de la original.</p>
</div></div></div>
      <div type="2"><head>Imageplot</head>
<p>ImagePlot se puede descargar desde el sitio web de <link target="http://lab.softwarestudies.com/p/imageplot.html#download">Software Studies Initiative</link>. Existen dos opciones, "ImagePlot_v1.1.zip" y "ImagePlot_v1.1-program-only.zip", pero utilizaremos la primera ya que tiene todo lo necesario para este tutorial e informaci&#243;n relacionada a la metodolog&#237;a de la herramienta. Luego puedes explorar los conjuntos de datos y art&#237;culos de teor&#237;a y metodolog&#237;a adicionales. Ver&#225;s que adem&#225;s contiene archivos extras (<code type="inline">theory</code> y <code type="inline">sample_files</code>) los cuales son &#250;tiles si deseas utilizar los tutoriales en el sitio web de ImagePlot, para conocer m&#225;s sobre <emph>distant viewing</emph> o para aprender del proceso de creaci&#243;n de la herramienta <ref type="footnotemark" target="#2"/>.</p>
<p>El archivo zip descomprimido tendr&#225; el nombre de <code type="inline">imageplot-master</code>. Puedes poner la carpeta en cualquier parte, pero las instrucciones del tutorial parten de que estar&#225; ubicada en el escritorio de tu computadora. Tambi&#233;n descarga las <link target="https://doi.org/10.18738/T8/AE3DP2">im&#225;genes de la colecci&#243;n</link><ref type="footnotemark" target="#3"/> a esta misma carpeta y crea una nueva carpeta, <code type="inline">imagenes_miniatura</code>, para las im&#225;genes procesadas que ImagePlot crea al hacer la visualizaci&#243;n. Cuando descargues las im&#225;genes de la colecci&#243;n estar&#225;n comprimidas bajo el nombre "dataverse_files.zip". Una vez descomprimido ver&#225;s un documento llamado "MANIFEST.TXT" enumerando todos los archivos descargados, una carpeta con el nombre <code type="inline">mupi_afiches_datos.txt</code> con un archivo de metadatos para las im&#225;genes y otra carpeta con el nombre <code type="inline">xs</code> que contiene las im&#225;genes. Mueve todos estos archivos a la carpeta de <code type="inline">imageplot-master</code>.</p>
<h4>Macros y medidas</h4>
<p>Dentro de <code type="inline">imageplot-master</code> est&#225; la carpeta <code type="inline">ImageJ</code> y dentro de la misma est&#225; el programa en <code type="inline">ij.jar</code>. En el men&#250; del programa navega a <code type="inline">Plugins -&gt; Macros -&gt; Run</code>. Abrir&#225; una caja para seleccionar la carpeta de <code type="inline">imageplot-master/extras</code> en la cual est&#225;n los tres macros o macroinstrucciones para hacer medidas en ImagePlot. Este tipo de recurso funciona como un conjunto de instrucciones para que los programas puedan realizar operaciones autom&#225;ticas, repetitivas y secuenciales. Esto nos ahorra tener que manualmente seleccionar una operaci&#243;n, como medir el tama&#241;o, para cada uno de los &#237;tems que estemos analizando.    </p>
<p><img src="/images/introduccion-a-imageplot-y-la-visualizacion-de-metadatos/carpeta_directorios.png" alt="captura de la carpeta de directorios dentro del men&#250; de ImagePlot mostrando d&#243;nde est&#225;n los macros"/></p>
<p>De los macros disponibles, selecciona <code type="inline">imageMeasure.txt</code>. Se abrir&#225; una caja nueva para seleccionar la carpeta de tus im&#225;genes (<code type="inline">xs</code>) y luego otra para seleccionar la carpeta en la que se guardar&#225; el archivo con las medidas. Puedes guardar este &#250;ltimo archivo en la carpeta de <code type="inline">imageplot-master</code> seleccionando tu escritorio en el men&#250; despegable.</p>
<p>Los resultados de este proceso van a proveer los valores de luminosidad (brightness), saturaci&#243;n (saturation) y tono (hue) de las im&#225;genes al igual que la desviaci&#243;n t&#237;pica de las medidas. La luminosidad corresponde a los valores promedios de la imagen en una escala de grises, la saturaci&#243;n es la intensidad de los colores y el tono es la diferencia en valores de RGB de los pixeles. Para m&#225;s informaci&#243;n sobre estos elementos consulta informaci&#243;n sobre la <link target="https://edu.gcfglobal.org/es/conceptos-basicos-de-diseno-grafico/teoria-del-color/1/">teor&#237;a del color</link>.</p>
<h4>Problemas con datos a gran escala</h4>
<p>Este proceso puede tomar mucho tiempo dependiendo del tama&#241;o de la colecci&#243;n y de la resoluci&#243;n de las im&#225;genes. Imageplot requiere un m&#237;nimo de de 2 GB de memoria RAM para funcionar correctamente pero se recomienda que sea m&#225;s de 4 GB. Tambi&#233;n, cabe la posibilidad de que si utilizas muchas im&#225;genes o im&#225;genes de alta resoluci&#243;n el programa agote el almacenamiento de memoria RAM que tiene disponible. Cuando &#233;sto sucede aparece este error:</p>
<pre><code xml:id="code_introduccion-a-imageplot-y-la-visualizacion-de-metadatos_0" type="block" corresp="code_introduccion-a-imageplot-y-la-visualizacion-de-metadatos_0.txt"/></pre>
<p><img src="/images/introduccion-a-imageplot-y-la-visualizacion-de-metadatos/memory_and_thread.png" alt="captura de men&#250; de ImagePlot para modificar la memoria RAM y el n&#250;mero de CPU"/></p>
<p>Para arreglar esto selecciona <code type="inline">Edit -&gt; Options -&gt; Memory and Thread</code> y cambia el n&#250;mero predeterminado, 658 MB o 0.6 GB, que aparece en <code type="inline">Maximum Memory</code>. Tendr&#225;s que reiniciar el programa para que el cambio haga efecto y recuerda no exceder los l&#237;mites de memoria RAM de tu computadora.</p>
</div>
      <div type="2"><head>Metadatos y visualizaciones</head>
<p>Al hacer clic derecho en la pantalla de <code type="inline">Results</code> aparece un men&#250; para guardar el archivo dentro de una carpeta. No es necesario guardar estos resultados en tu computadora porque el programa ya ha grabado las medidas en el paso anterior dentro del archivo <code type="inline">measurements.txt</code>. Si abres este archivo ver&#225;s que es un documento con la extensi&#243;n <code type="inline">.txt</code> pero los campos est&#225;n divididos por cuatro espacios consecutivos o <emph>tabs</emph>. Este tipo de estructura se llama <emph>tab separated values</emph> y es el &#250;nico formato que ImagePlot puede leer como datos al generar las visualizaciones.</p>
<p><img src="/images/introduccion-a-imageplot-y-la-visualizacion-de-metadatos/hoja_de_datos.png" alt="captura de fragmento de la hoja de datos ense&#241;ando las columnas y los campos divididos por tabs o cuatro espacios consecutivos"/></p>
<p>Es importante verificar que el programa que utilices para abrir el archivo <code type="inline">measurements.txt</code> importe correctamente las columnas y los diacr&#237;ticos o e&#241;es en los nombres de los archivos bajo la columna <code type="inline">filename</code>. Para que ImagePlot pueda identificar las medidas que corresponden a cada imagen, la informaci&#243;n de esta columna debe ser id&#233;ntica al nombre del archivo de la imagen, incluyendo la extensi&#243;n.</p>
<p>Toma un segundo para abrir la hoja y ver los campos que se han generado. Con esta informaci&#243;n ya es posible visualizar la colecci&#243;n en base a las medidas generadas. Esta visualizaci&#243;n, sin embargo, solamente ser&#237;a una representaci&#243;n gr&#225;fica de la luminosidad, saturaci&#243;n o tono y las posibles preguntas estar&#237;an limitadas a estas tres medidas. Para complementar estos datos miremos los valores que ya generamos junto con los metadatos recopilados por el personal de MUPI. Abre <code type="inline">mupi_afiches_datos.txt</code> de la carpeta <code type="inline">imageplot-master</code> y ver&#225;s los metadatos de las im&#225;genes combinados con las medidas. Para facilitar la lecci&#243;n las medidas de ImagePlot ya han sido incorporadas en esta hoja. Si estuvieses trabajando con tu propia colecci&#243;n incorporar&#237;as las medidas que generaste a tus metadatos.   </p>
<p>Vuelve a tomar unos minutos para familiarizarte con los campos de esta hoja. ImagePlot solamente procesa las primeras 16 columnas y por esto est&#225;n en este orden. La colecci&#243;n todav&#237;a est&#225; siendo procesada y por lo tanto hay algunos campos que no se han rellenado y otros que no contienen datos porque se desconocen debido a la naturaleza de la colecci&#243;n. Es importante reconocer cuales son las limitaciones de los metadatos porque estas pueden afectar c&#243;mo escoges abordar la colecci&#243;n y las precauciones que debes tomar al planificar su visualizaci&#243;n.</p>
<div type="3"><head>Visualizar la colecci&#243;n y ajustes opcionales</head>
<p>De aqu&#237; en adelante se escogen cuales caracter&#237;sticas queremos visualizar y los aspectos de esta que se pueden modificar. En la pr&#243;xima caja podr&#225;s seleccionar los campos representados en las coordenadas, es decir, las medidas que determinan la posici&#243;n en el gr&#225;fico de cada imagen. Estos valores provienen de nuestra hoja de metadatos. Adem&#225;s, abajo encontrar&#225;s los ajustes m&#237;nimos y explicaciones sobre sus efectos. Los valores son el resultado de experimentar con estos ajustes para esta colecci&#243;n y muy probablemente tengan que ser modificados al trabajar con otros materiales.</p>
<p>Nuevamente selecciona <code type="inline">Plugins -&gt; Macros -&gt; Run</code>, la carpeta de <code type="inline">imageplot-master</code> y ahora el macro necesario para hacer las visualizaciones, <code type="inline">ImagePlot.txt</code>. En la caja que aparece, deja las opciones de <code type="inline">Data</code> e <code type="inline">Images</code> en <code type="inline">Open...</code> para que la herramienta pida esa informaci&#243;n en el pr&#243;ximo paso. En la primera ocasi&#243;n que proceses las im&#225;genes marca la opci&#243;n de <code type="inline">Save thumbnail images</code>. Esto es porque ImagePlot genera las im&#225;genes en miniatura como parte de procesar la colecci&#243;n y guardarlas hace que realizar las visualizaciones posteriores sea mucho m&#225;s r&#225;pido. Finalmente, deshaz la selecci&#243;n de <code type="inline">Polar</code> para que la visualizaci&#243;n no sea circular - esto ayudar&#225; luego para la interpretaci&#243;n - y marca <code type="inline">Options</code> para que en el pr&#243;ximo paso puedas hacer ajustes a la visualizaci&#243;n final.</p>
<p><img src="/images/introduccion-a-imageplot-y-la-visualizacion-de-metadatos/opciones_adicionales.png" alt="captura de caja de ImagePlot para seleccionar opciones adicionales de visualizaci&#243;n"/></p>
<p>Al oprimir <code type="inline">ok</code> aparecer&#225; una caja para seleccionar la hoja de <code type="inline">mupi_afiches_datos</code>. Luego aparecer&#225; otra caja para seleccionar las im&#225;genes de la colecci&#243;n que descargamos anteriormente y entonces aparecer&#225; la opci&#243;n <code type="inline">Save thumbnail images</code> en la que seleccionar&#225;s la carpeta <code type="inline">imagenes_miniatura</code>.</p>
<div type="4"><head>Seleccionar los ejes</head>
<p>La opci&#243;n de <code type="inline">Image filename</code> debe reflejar <code type="inline">id(Column0)</code> en la que est&#225;n los nombres de los archivos de las im&#225;genes. Para el eje horizontal, <code type="inline">X axis</code>, selecciona la columna <code type="inline">country-id(Column7)</code> que corresponde a un n&#250;mero &#250;nico por cada pa&#237;s representado en la colecci&#243;n. Para la vertical, <code type="inline">Y axis</code>, <code type="inline">hue_stdev(Column6)</code>, que corresponde a la diferencia de la media de tonalidad. Esto mide, por ejemplo, cuan diferente es el rojo del rosado, o el azul del azul celeste. La visualizaci&#243;n de estos datos est&#225; dise&#241;ada para dar una idea de cu&#225;n similar o distinta es la tonalidad entre los afiches agrupados por pa&#237;ses.</p>
</div><div type="4"><head>Modificar lienzo, etiquetas, im&#225;genes y ejes</head>
<p>En la proxima caja est&#225;n los ajustes opcionales. Para la lecci&#243;n solamente estaremos modificando <code type="inline">Canvas, Lines, Labels, Images, Axis y Range</code>. El <code type="inline">Canvas</code> es el lienzo en el que aparecer&#225; el gr&#225;fico. Cambia el campo de <code type="inline">Border size</code> a 800 pixeles para que haya suficiente espacio entre el borde del lienzo y el gr&#225;fico. En la caja <code type="inline">Elements</code> est&#225;n las etiquetas que acompa&#241;ar&#225;n a cada imagen. Utiliza <code type="inline">cname1 (Column8)</code> la cual corresponde a la organizaci&#243;n que cre&#243; el afiche y mant&#233;n el tama&#241;o de la letra en <code type="inline">32pt</code>. En <code type="inline">Images</code> debes aumentar el tama&#241;o de las im&#225;genes en miniatura para que todav&#237;a sean distinguibles, <code type="inline">Thumbnail width</code>, a 400 pixeles.</p>
<p>En <code type="inline">Axes</code> cambia a 100 px los siguientes: <code type="inline">Axis line width</code>, <code type="inline">Font size</code>, y <code type="inline">Tick size</code> (grosor de la l&#237;nea del eje, tama&#241;o de letra y tama&#241;o de marcador). Ahora escoge <code type="inline">Mark by distance between labels</code> o a la cantidad de espacio entre cada valor y entonces pon las etiquetas de los ejes, <code type="inline">Axis labels</code>(etiquetas de los ejes) para tener <code type="inline">for X: 1</code> y <code type="inline">for Y: 10</code>. La diferencia entre estos valores corresponde a que hay un total de 22 identificadores &#250;nicos, 0-21, por pa&#237;s para el eje x, pero las variaciones de tonalidad en el eje y van desde .03 a 123.30. Si se utiliza un valor demasiado alto o bajo en <code type="inline">distance between labels</code> se corre el riesgo de que las im&#225;genes sean indistinguibles o que la separaci&#243;n dificulte ver la relaci&#243;n entre ellas. Esto tambi&#233;n se aplica al pr&#243;ximo paso en el que seleccionar&#225;s los rangos de los ejes en la caja de <code type="inline">Range</code>: <code type="inline">X start value: 0 units</code>, <code type="inline">X end value: 25 units</code>, <code type="inline">Y start value: -10 units</code> y <code type="inline">Y end value: 125 units</code>. Verifica que hayas marcado las casillas "X range specified?" y &#8220;Y range specified?&#8221; porque si no el programa ignorar&#225; los valores (especificas rangos para los ejes X y Y).</p>
</div><div type="4"><head>Analizar la visualizaci&#243;n de la colecci&#243;n</head>
<p>El canvas abrir&#225; y comenzar&#225;n a aparecer las im&#225;genes poco a poco. Nuevamente, el proceso puede tardar m&#225;s o menos tiempo dependiendo de la cantidad de im&#225;genes con las que est&#233;s trabajando. Guarda la visualizaci&#243;n para poder explorar en m&#225;s detalles yendo a <code type="inline">File -&gt; Save As</code> y escogiendo el formato de preferencia. Por alguna raz&#243;n, ImagePlot tiene problemas para guardar en otros formatos que no sean TIF.</p>
<p>Ahora podemos observar la visualizaci&#243;n en cualquier programa que pueda abrir este formato. Hay dos aspectos interesantes en esta primera visualizaci&#243;n que son evidentes a primera vista. Primero, tenemos bastantes im&#225;genes en la categor&#237;a de El Salvador que ser&#237;a la s&#233;ptima columna y la siguiente en cantidad es la &#250;ltima. Esta &#250;ltima est&#225; compuesta de im&#225;genes que tienen cero en la columna <code type="inline">country-id(Column7)</code>. Es decir, no tienen informaci&#243;n geogr&#225;fica que permita asignarle un pa&#237;s. Segundo, el l&#237;mite superior del valor del eje parece tener im&#225;genes en las que predomina el rojo y tenemos cinco columnas m&#225;s altas que el resto.</p>
<p><img src="/images/introduccion-a-imageplot-y-la-visualizacion-de-metadatos/visualizacion.jpg" alt="captura de visualizaci&#243;n final con las columnas correspondientes a los pa&#237;ses y las filas verticales de menor a mayor tonalidad de rojo seg&#250;n sube"/></p>
<p>De esta representaci&#243;n visual podemos formular una pregunta inicial, siempre consciente de la naturaleza de la colecci&#243;n y sus metadatos, sobre una posible similitud est&#233;tica entre los pa&#237;ses que se ven representados en los valores m&#225;s altos de tonalidad. &#191;En qu&#233; nos puede ayudar esta pregunta en la exploraci&#243;n de la colecci&#243;n? Si recuerdas la columna que aparece &#250;ltima del gr&#225;fico notar&#225;s que aparecen dos im&#225;genes que por su posici&#243;n tienen similitudes de tonalidad con las otras cuatro. Al hacer esta comparaci&#243;n podemos mirar tambi&#233;n el lenguaje que se utiliza en el afiche, franc&#233;s, y buscar si un pa&#237;s franc&#243;fono est&#225; representado en alguna de las otras cuatro columnas. En efecto, tenemos a Francia en la columna 10 y Suiza en la columna 19. Para confirmar la procedencia de los afiches no-identificados todav&#237;a tendr&#237;amos que encontrar m&#225;s informaci&#243;n, pero la visualizaci&#243;n a distancia con ImagePlot ya nos provee una pista por donde comenzar.</p>
<p><note id="1"> La digitalizaci&#243;n de esta colecci&#243;n fue hecha en parte gracias a una beca de la Fundaci&#243;n Andrew W. Mellon.</note>
<note id="2"> Aqu&#237; encontrar&#225;s <link target="http://lab.culturalanalytics.info/p/projects.html">m&#225;s proyectos</link> desarrollados por los creadores de Imageplot</note>
<note id="3"> Este enlace abrir&#225; una p&#225;gina en un repositorio externo. Antes de oprimir el bot&#243;n de download debes marcar la caja al lado izquierdo de la cantidad de archivos y luego oprimir la opci&#243;n <code type="inline">Select all 395 files in this dataset</code> para poder descargar todos los archivos. Luego aparecer&#225; otra pantalla solicitando informaci&#243;n sobre ti (nombre, correo, instituci&#243;n, cargo, uso principal del material y localizaci&#243;n). Esta informaci&#243;n ayuda a los administradores del repositorio a conocer el perfil de los usuarios.</note></p>
</div></div></div>
    </body>
  </text>
</TEI>
