<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introduction-et-installation">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introduction &#224; Python et installation</title>
  <author role="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor role="reviewers"><persName>Jim Clifford</persName><persName>Amanda Morton</persName></editor><author role="translators">Anastasiia Zadykhina</author><editor role="translation-reviewers"><persName>Marie Puren</persName><persName>Sofia Papastamkou</persName></editor><editor role="editors">Miriam Posner</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phfr0012</idno><date type="published">07/17/2012</date><date type="translated">07/30/2020</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#introduction-and-installation"/>.</p><p>There are other translations: <ref target="#introduccion-e-instalacion #introducao-instalacao-python"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Cette premi&#232;re le&#231;on de notre section traitant des sources en ligne a pour but de vous pr&#233;parer, vous et votre ordinateur, &#224; commencer &#224; programmer. Nous allons nous concentrer sur l'installation de l'environnement de d&#233;veloppement requis, qui est gratuit et fiable. Puis nous vous aiderons &#224; compl&#233;ter un premier essai avec un programme simple qui donnera des r&#233;sultats imm&#233;diats.</p></abstract><textClass><keywords><term xml:lang="en">python</term><term xml:lang="en">get-ready</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="fr">
    <body>
      <div type="2"><head>Objectifs de la le&#231;on</head>
<p>Cette premi&#232;re le&#231;on de notre section traitant des sources en ligne a pour but de vous pr&#233;parer, vous et votre ordinateur, &#224; commencer &#224; programmer. Nous allons nous concentrer sur l'installation de l'environnement de d&#233;veloppement requis. (Tout ce dont vous aurez besoin est gratuit et fiable.) Puis, &#224; la fin de cette le&#231;on, nous vous aiderons &#224; compl&#233;ter un premier essai avec un programme simple qui donnera des r&#233;sultats imm&#233;diats.</p>
<p>Dans cette le&#231;on d'introduction, vous allez installer le <ref target="http://www.python.org/">langage de programmation Python</ref>, <ref target="http://www.crummy.com/software/BeautifulSoup/">l'analyseur HTML / XML Beautiful Soup</ref> et un &#233;diteur de texte. Les captures d'&#233;cran fournies ici proviennent de <ref target="http://www.activestate.com/komodo-edit">Komodo Edit</ref>, mais vous pouvez utiliser n'importe quel &#233;diteur de texte capable de travailler avec Python. Voici une liste d'autres <ref target="http://wiki.python.org/moin/PythonEditors/">&#233;diteurs compatibles avec Python</ref>. Une fois que tout sera install&#233;, vous &#233;crirez votre premier programme: le classique &#171; Hello World   &#187;, en Python et HTML.</p>
</div>
      <div type="2"><head>Le langage de programmation Python</head>
<p>Dans le cadre de cette s&#233;rie de le&#231;ons, nous utiliserons Python, un langage de programmation gratuit et &#224; code ouvert. &#192; moins d'indications contraires, nous utiliserons la <hi rend="bold">version 3</hi> de Python, la version 2 n'&#233;tant plus soutenue. Il se pourrait cependant que vous rencontriez du code Python 2 dans des projets ou des tutoriels plus anciens. <ref target="http://sebastianraschka.com/Articles/2014_python_2_3_key_diff.html">Python 3 pr&#233;sente des diff&#233;rences avec ses pr&#233;d&#233;cesseurs</ref> - &#224; titre de comparaison, imaginez une langue dont les r&#232;gles de grammaire &#233;voluent avec le temps. M&#233;fiez-vous donc d'exemples que vous pourriez trouver en ligne utilisant Python 2, car il est possible qu'ils ne fonctionnent pas en Python 3.</p>
</div>
      <div type="2"><head>Sauvegardez votre travail!</head>
<p>Avant de t&#233;l&#233;charger ou d'installer un nouveau logiciel, il est primordial de faire une copie de sauvegarde de votre travail pass&#233;. D'ailleurs, vous devriez sauvegarder votre ordinateur au moins une fois par semaine, et de pr&#233;f&#233;rence plus fr&#233;quemment. C'est aussi une bonne id&#233;e de conserver des sauvegardes hors site de votre travail; de cette fa&#231;on, vous ne perdrez pas tout si quelque chose arrive &#224; votre ordinateur, &#224; votre domicile ou &#224; votre bureau. Des sites comme <ref target="https://www.jungledisk.com/">Jungle Disk</ref> et <ref target="https://www.dropbox.com/">Dropbox</ref> offrent des options de sauvegarde en ligne faciles &#224; utiliser et relativement bon march&#233;.</p>
<div type="3"><head>Choisissez votre syst&#232;me d'exploitation</head>
</div></div>
      <div type="2"><head>&#201;tape 1 - Installation et configuration du logiciel</head>
<p>Pour utiliser les techniques pr&#233;sent&#233;es ici, vous devrez d'abord t&#233;l&#233;charger et installer des logiciels disponibles gratuitement. Vous trouverez ci-dessous des instructions pour Mac, Windows et Linux. Une fois que vous aurez install&#233; les logiciels requis pour votre syst&#232;me d'exploitation, vous pourrez passer &#224; la le&#231;on &#171; <ref target="/fr/lecons/comprendre-les-pages-web">Comprendre les pages web et le HTML</ref>  &#187;. Si vous rencontrez des probl&#232;mes avec nos instructions, ou si vous trouvez quelque chose qui ne fonctionne pas sur votre plate-forme, nous vous demandons de bien vouloir nous le faire savoir.</p>
<list type="unordered">
<item><ref target="/en/lessons/mac-installation">Installation de Python pour Mac</ref></item>
<item><ref target="/fr/lecons/installation-windows-py">Installation de Python pour Windows</ref></item>
<item><ref target="/en/lessons/linux-installation">Installation de Python pour Linux</ref></item>
</list>
</div>
    </body>
  </text>
</TEI>
