<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Criar novas camadas vetoriais com o QGIS 2.0</title>
  <layout>lesson</layout>
  <slug>camadas-vetoriais-qgis</slug>
  <date>2013-12-13</date>
  <translation_date>2021-03-30</translation_date>
  <authors>Jim Clifford,Josh MacFadyen,Daniel Macfarlane</authors>
  <reviewers>Finn Arne J&#248;rgensen,Peter Webster,Abby Schreiber</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Rafael Laguardia</translator>
  <translation-editor>Joana Vieira Paulino</translation-editor>
  <translation-reviewer>Luis Ferla,Ana Alc&#226;ntara</translation-reviewer>
  <difficulty>2</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/365</review-ticket>
  <activity>presenting</activity>
  <topics>mapping,data-visualization</topics>
  <abstract>Nesta li&#231;&#227;o, aprender&#225; como criar camadas vetoriais com base em mapas hist&#243;ricos digitalizados.</abstract>
  <original>vector-layers-qgis</original>
  <avatar_alt>Mapa de ruas da cidade</avatar_alt>
  <doi>10.46430/phpt0009</doi>
</metadata>
  <text>
    <body>
      <div n="2"><head>Objetivos da li&#231;&#227;o</head>
<p>Nesta li&#231;&#227;o, aprender&#225; como criar camadas vetoriais com base em mapas hist&#243;ricos digitalizados. <link target="/en/lessons/googlemaps-googleearth">Na introdu&#231;&#227;o ao Google Maps e Google Earth</link> (em ingl&#234;s), usou camadas vetoriais e criou atributos no Google Earth. Faremos o mesmo nesta li&#231;&#227;o, embora num n&#237;vel mais avan&#231;ado, usando o software QGIS.</p>
<p>As camadas vetoriais (ou shapefiles) s&#227;o, junto com as camadas raster, um dos dois tipos b&#225;sicos de estruturas de armazenamento de dados. As camadas vetoriais usam as tr&#234;s fei&#231;&#245;es<sup>1</sup> b&#225;sicas do SIG (Sistema de Informa&#231;&#245;es Geogr&#225;ficas) - pontos, linhas e pol&#237;gonos - para representar aspectos do mundo real em formato digital. Pontos podem ser usados para representar locais espec&#237;ficos, como cidades, edif&#237;cios, eventos, etc. (a escala do seu mapa determinar&#225; o que voc&#234; representa como um ponto - no mapa de uma prov&#237;ncia, uma cidade seria um ponto, enquanto no mapa de uma cidade, um edif&#237;cio pode ser um ponto). Linhas podem representar estradas, rios, canais, ferrovias, etc. Pol&#237;gonos (formas fechadas) s&#227;o usados para representar objetos mais complexos, como os limites de um lago, pa&#237;s, divis&#227;o administrativa ou eleitoral, etc. (novamente, a escala afetar&#225; sua escolha - grandes edif&#237;cios num mapa de pormenor de uma cidade podem ser melhor representados como pol&#237;gonos do que como pontos).</p>
<p>Nesta li&#231;&#227;o, criar&#225; shapefiles (que s&#227;o um formato de armazenamento de dados vetoriais) para representar o desenvolvimento hist&#243;rico de comunidades e estradas na Ilha Prince Edward. Cada shapefile pode ser criado como um dos tr&#234;s tipos de fei&#231;&#245;es: ponto, linha, pol&#237;gono (embora essas fei&#231;&#245;es n&#227;o possam ser misturadas num shapefile). Cada fei&#231;&#227;o que cria num shapefile possui um conjunto correspondente de atributos, que s&#227;o armazenados numa tabela de atributos. Criar&#225; fei&#231;&#245;es e aprender&#225; como modific&#225;-las, o que envolve n&#227;o apenas a cria&#231;&#227;o visual dos tr&#234;s tipos de fei&#231;&#245;es, mas tamb&#233;m a modifica&#231;&#227;o de seus atributos. Para fazer isso, usaremos os ficheiros da li&#231;&#227;o <link target="/en/lessons/qgis-layers">instalar o QGIS 2.0 e adicionaremos camadas</link> (em ingl&#234;s) referentes &#224; Ilha Prince Edward.  </p>
</div>
      <div n="2"><head>Come&#231;ando</head>
<p>Comece por descarregar o <link target="/assets/PEI_HollandMap1798_compLZW.tif">mapa PEI_Holland</link> para a pasta do projeto.  </p>
<p>Abra o ficheiro que voc&#234; salvou no final da li&#231;&#227;o <link target="/en/lessons/qgis-layers">instalar o QGIS 2.0 e adicionar camadas</link> (em ingl&#234;s). Deve ter as seguintes camadas na aba Camadas:</p>
<ul>
<li>PEI_placenames</li>
<li>PEI_highway</li>
<li>PEI HYDRONETWORK</li>
<li>1935 inventory_region</li>
<li>coastline_polygon</li>
<li>PEI-CumminsMap1927</li>
</ul>
<p>Desmarque todas essas camadas, exceto 'PEI_placenames', 'coastline_polygon' e 'PEI_CumminsMap1927'. </p>
<figure><desc>Figura 1</desc><graphic url="pei1.png"/></figure>
<p>Agora vamos adicionar um segundo mapa hist&#243;rico como uma camada raster.</p>
<figure><desc>Figura 2</desc><graphic url="pei2.png"/></figure>
<ul>
<li>Em Camada na barra de ferramentas, escolha Adicionar Camada Raster (alternativamente, o mesmo &#237;cone que v&#234; ao lado de 'Adicionar Camada Raster' tamb&#233;m pode ser selecionado na barra de ferramentas)</li>
<li>Encontre o ficheiro que descarregou intitulado 'PEI_HollandMap1798'</li>
<li>Ser-lhe-&#225; solicitado que defina o sistema de coordenadas desta camada. Na caixa de filtro, pesquise por '2291' e, na caixa abaixo, selecione 'NAD83 (CSRS98) / Prince Edward Isl. Stereographic'</li>
<li>Se n&#227;o lhe for solicitado que defina o sistema de coordenadas da camada, ser&#225; necess&#225;rio alterar uma configura&#231;&#227;o. Clique em 'Configura&#231;&#245;es' e, em seguida, em 'Op&#231;&#245;es'. Clique em 'CRS' no menu &#224; direita e escolha 'Solicitar CRS' a partir das op&#231;&#245;es abaixo. 'Quando uma nova camada &#233; criada, ou quando uma camada &#233; carregada sem CRS'. Clique 'OK'. Remova a camada 'PEI_HollandMap1798' (clique com o bot&#227;o direito sobre ela e clique em Remover) e tente adicion&#225;-la novamente. Desta vez, deve-lhe ser solicitado que forne&#231;a um 'CRS' e pode selecionar a op&#231;&#227;o 'NAD83' (veja acima).</li>
</ul>
<figure><desc>Figura 3</desc><graphic url="Figura3.jpg"/></figure>
<p>Nas etapas anteriores, selecionou e desmarcou camadas na janela 'Camadas' marcando e desmarcando as caixas ao lado delas. Essas camadas s&#227;o organizadas em ordem decrescente de visibilidade. Ou seja, a camada superior &#233; a camada superior da janela do visualizador (desde que esteja selecionada). Pode arrastar as camadas para cima e para baixo na janela de camadas para alterar a ordem em que ficar&#227;o vis&#237;veis na janela de visualiza&#231;&#227;o. A camada raster 'litoral_polygon' n&#227;o est&#225; vis&#237;vel no momento porque est&#225; abaixo das camadas 'PEI_HollandMap1798' e 'PEI_Cummins1927'. Em geral, &#233; melhor manter as camadas vetoriais acima das camadas raster.</p>
<p>Desmarque 'PEI_Cummins1927' para que a &#250;nica camada restante seja 'PEI_HollandMap1798'. Observe que o mapa aparece torto na tela; isso ocorre porque j&#225; foi georreferenciado pelos redatores da li&#231;&#227;o para coincidir com as camadas vetoriais de SIG. Saiba mais sobre georreferenciamento em <link target="/en/lessons/georeferencing-qgis">georreferenciamento no QGIS 2.0</link> (em ingl&#234;s).</p>
<figure><desc>Figura 4</desc><graphic url="pei4.png"/></figure>
<p>Agora criaremos um shapefile de pontos, que &#233; uma camada vetorial. Clique em 'Camada' -&gt; 'Nova' -&gt; 'Nova Camada Shapefile'</p>
<ul>
<li>Alternativamente, pode selecionar o &#237;cone 'Nova camada Shapefile' no topo da janela da barra de ferramentas QGIS </li>
</ul>
<figure><desc>Figura 5</desc><graphic url="Figura5.jpg"/></figure>
<p>Depois de selecionar 'Nova Camada Shapefile', aparece uma janela intitulada 'Nova Camada Vetorial'</p>
<ul>
<li>Na categoria 'Tipo', 'ponto' j&#225; est&#225; selecionado. Clique no bot&#227;o 'Especificar CRS' e selecione 'NAD83 (CSRS98) / Prince Edward Isl. Estereogr&#225;fico (EPSG: 2291)' e, em seguida, clique em OK (para obter informa&#231;&#245;es sobre como entender e selecionar a zona UTM: <link target="https://lib.uwaterloo.ca/locations/umd/digital/clump_classes.html">https://lib.uwaterloo.ca/locations/umd/digital/clump_classes.html</link></li>
</ul>
<figure><desc>Figura 6</desc><graphic url="Figura6.jpg"/></figure>
<p>Retornando &#224; janela 'Nova Camada vetorial', iremos criar alguns atributos. Para criar o primeiro atributo:  </p>
<ul>
<li>Em 'Novo atributo', no campo ao lado de 'Nome', digite 'Nome_Assentamento' (observe que ao trabalhar em bancos de dados n&#227;o pode usar espa&#231;os vazios nos nomes, por isso a conven&#231;&#227;o &#233; usar sublinhados em seus lugares)</li>
<li>Clique em 'Adicionar' &#224; lista de atributos </li>
</ul>
<p>Agora vamos criar um segundo atributo:  </p>
<ul>
<li>Em 'Novo Atributo', no campo ao lado de 'Nome', digite 'Ano'</li>
<li>Desta vez, vamos mudar o 'Tipo' para 'N&#250;mero Inteiro'</li>
<li>Clique em 'Adicionar &#224; lista de atributos'</li>
</ul>
<p>Para o terceiro atributo:</p>
<ul>
<li>Sob Novo atributo, no campo ao lado de Nome, digite 'Ano_Final' (o SIG nem sempre &#233; ideal para lidar com mudan&#231;as ao longo do tempo, ent&#227;o em alguns casos &#233; importante ter um campo para identificar aproximadamente quando algo deixou de existir)</li>
<li>Mude o 'Tipo' novamente para 'N&#250;mero Inteiro'</li>
<li>Clique em Adicionar &#224; lista de atributos</li>
</ul>
<figure><desc>Figura 7</desc><graphic url="Figura7.jpg"/></figure>
<ul>
<li>Ao concluir essas tr&#234;s etapas, termine de criar esse shapefile clicando em OK na parte inferior direita da janela 'Nova Camada Vetorial'. Um 'pop-up' ir&#225; surgir, nomeie-o de 'Assentamentos' e salve-o com os seus outros ficheiros SIG.</li>
</ul>
<p>Observe que uma camada chamada 'Assentamentos' agora aparece na janela 'Camadas'. Reposicione-a acima das camadas raster.</p>
<figure><desc>Figura 8</desc><graphic url="Figura8.jpg"/></figure>
<p>Desmarque todas as camadas, exceto 'Assentamentos'. A janela de visualiza&#231;&#227;o agora est&#225; em branco, pois n&#227;o cria&#225;mos nenhum dado. Agora criaremos novos dados do 'PEI_CumminsMap1927' e do 'PEI_HollandMap 1798' para mostrar o aumento da ocupa&#231;&#227;o entre o final do s&#233;culo XVIII e o in&#237;cio do s&#233;culo XX. </p>
<ul>
<li>N&#243;s come&#231;aremos com o mapa mais recente e, portanto, geralmente mais preciso. Selecione novamente (ou seja,  marque as caixas ao lado) 'coast_polygon' e 'PEI_CumminsMap1927'.</li>
<li>Na janela de visualiza&#231;&#227;o, aumente o 'Zoom' em 'Charlottetown' (dica: 'Charlottetown' fica perto do meio da ilha no lado sul, na conflu&#234;ncia de tr&#234;s rios).</li>
<li>Selecione a camada de 'Assentamentos' na janela 'Camadas'.</li>
<li>Na barra de menu, selecione 'Alternar Edi&#231;&#227;o'.</li>
</ul>
<figure><desc>Figura 9</desc><graphic url="pei9.png"/></figure>
<ul>
<li>Depois de selecionar 'Alternar Edi&#231;&#227;o', os bot&#245;es de edi&#231;&#227;o ficar&#227;o dispon&#237;veis &#224; direita na barra de menus. Selecione o bot&#227;o de fei&#231;&#227;o com 'tr&#234;s pontos'.</li>
</ul>
<figure><desc>Figura 10</desc><graphic url="pei10.png"/></figure>
<ul>
<li>O cursor aparece agora como uma cruz - aponte a cruz para 'Charlottetown' (se por acaso n&#227;o conhecer a geografia do 'PEI', pode ter ajuda adicionando a camada 'PEI_nomes de local'), mantendo-a dentro da linha costeira atual e clique (a digitaliza&#231;&#227;o &#233; sempre um compromisso entre precis&#227;o e funcionalidade; dependendo da qualidade do mapa original e da digitaliza&#231;&#227;o, para a maioria das aplica&#231;&#245;es hist&#243;ricas, a precis&#227;o extrema n&#227;o &#233; necess&#225;ria).</li>
<li>Uma janela de atributos aparecer&#225;. Deixe o campo 'id' em branco (no momento da escrita, o QGIS criar&#225; dois campos 'id' e este &#233; desnecess&#225;rio). No campo 'Assentamento', digite 'Charlottetown'. No campo 'Ano', digite '1764'. Clique em 'OK'.
Vamos agora repetir as etapas que realiz&#225;mos com 'Charlottetown' para 'Montague', 'Summerside' e 'Cavendish' (novamente, pode encontrar esses locais adicionando as camadas 'PEI_nomes de local'). Encontre 'Montague' no mapa, selecione o bot&#227;o de fei&#231;&#227;o com 'tr&#234;s pontos' e clique em Montague no mapa. Quando a janela 'Atributos' aparecer, insira 'Montague' e '1732' nos campos apropriados. Repita para 'Summerside (1876)' e 'Cavendish (1790)'.</li>
</ul>
<figure><desc>Figura 11</desc><graphic url="Figura11.jpg"/></figure>
<p>Na janela 'Camadas', desmarque 'PEI_CumminsMap1927' e selecione 'PEI_HollandMap1798'. Agora vamos identificar dois assentamentos ('Princetown' e 'Havre-St-Pierre') que j&#225; n&#227;o existem.  </p>
<ul>
<li>
<p>Para localizar 'Princetown', procure 'Richmond Bay' e 'Cape Aylebsury' (na costa norte a oeste de 'Cavendish'), aqui voc&#234; encontrar&#225; 'Princetown' (sombreado) perto da fronteira entre o amarelo e o azul.</p>
</li>
<li>
<p>Se consultar a <link target="https://pt.wikipedia.org/wiki/Ilha_do_Pr%C3%ADncipe_Eduardo">entrada da Wikipedia</link> desta cidade, notar&#225; que por causa de um porto raso, 'Princetown' n&#227;o se tornou um assentamento importante. Foi renomeado em 1947 e, posteriormente, rebaixado para uma aldeia. Por esse motivo, incluiremos 1947 como a data final para este assentamento.</p>
</li>
<li>
<p>Com o cursor do mouse (em formato de cruz), clique em 'Princetown'. Na 'tabela de atributos' que aparece, coloque 'Princetown' no campo 'Assentamento', coloque '1764' no campo 'Ano' e coloque '1947' em 'Ano_Final'. Clique 'OK'.</p>
</li>
</ul>
<figure><desc>Figura 12</desc><graphic url="Figura12.jpg"/></figure>
<ul>
<li>
<p>Clique no &#237;cone 'Salvar edi&#231;&#245;es' na barra de menu (fica entre 'Alternar' e 'Adicione Fei&#231;&#227;o').</p>
</li>
<li>
<p>Clique duas vezes na camada de 'Assentamentos' na janela 'Camadas', escolha a guia 'Etiquetas' na parte superior da janela seguinte. Clique na caixa ao lado de 'Mostrar etiquetas'. Em Campo contendo r&#243;tulo, selecione 'Ano' (se necess&#225;rio), altere o tamanho da fonte para 18,0, altere 'Posicionamento para Acima &#224; esquerda' e clique em 'OK'.</p>
</li>
</ul>
<p>Na costa norte do 'lote 39', entre 'Britain's Pond' e 'St. Peters Bay', colocaremos agora um ponto para a localiza&#231;&#227;o de uma aldeia h&#225; muito perdida chamada 'Havre-St-Pierre'.</p>
<ul>
<li>
<p>'Havre-St-Pierre' foi o primeiro assentamento acadiano da ilha, mas est&#225; desabitado desde a deporta&#231;&#227;o dos acadianos em 1758.</p>
</li>
<li>
<p>Com o cursor do mouse (em formato de cruz), clique em 'Havre-St. Pierre'. Na 'tabela de Atributos' que aparece, coloque 'Havre-St-Pierre' no campo 'Assentamento', coloque '1720' no campo 'Ano' e '1758' em 'Ano_Final'. Clique 'OK'.</p>
</li>
</ul>
<figure><desc>Figura 13</desc><graphic url="pei13.png"/></figure>
<p>Agora vamos criar outra camada vetorial: um vetor linha. Clique em 'Camada' -&gt; 'Nova' -&gt; 'Nova Camada Shapefile'. A janela 'Nova Camada Vetorial' aparecer&#225; (na categoria 'Tipo', no topo, selecione 'Linha')  </p>
<ul>
<li>Clique no bot&#227;o 'Especificar CRS' e selecione 'NAD83 (CSRS98) / Prince Edward Isl. Estereogr&#225;fico (EPSG: 2291)' e clique em 'OK'.</li>
<li>Em 'Novo atributo', no campo ao lado de 'Nome', digite 'Nome_Estrada'.</li>
<li>Clique em 'Adicionar campos &#224; lista'.</li>
</ul>
<p>Crie um segundo atributo:</p>
<ul>
<li>Em 'Novo atributo', no campo ao lado de 'Nome', digite 'Ano'.</li>
<li>Mude o 'Tipo' para 'N&#250;mero Inteiro'.</li>
<li>Clique em 'Adicionar &#224; lista de Atributos'.</li>
<li>Para terminar de criar este ficheiro, clique em 'OK' na parte inferior direita da janela 'Nova Camada Vetorial'. Uma tela para 'salvar' aparece - chame-a de 'estradas' e salve-a com seus outros ficheiros SIG.</li>
</ul>
<p>Vamos agora tra&#231;ar as estradas do 'mapa de 1798' para que possamos compar&#225;-las com as estradas atuais. Certifique-se de ter as camadas 'PEI_Holland1798' e 'Assentamentos' marcadas na janela de 'Camadas'. Selecione a camada 'estradas' na janela de 'camadas', selecione 'Alternar Edi&#231;&#227;o' na barra de ferramentas superior e selecione 'Adicionar Fei&#231;&#227;o'.</p>
<figure><desc>Figura 14</desc><graphic url="pei14.png"/></figure>
<ul>
<li>Primeiro trace a estrada de 'Charlottetown' a 'Princetown'. Clique em 'Charlottetown' e depois clique repetidamente em pontos ao longo da estrada para 'Princetown' e ver&#225; a linha a ser criada. Repita at&#233; chegar a 'Princetown' e clique com o bot&#227;o direito. Na janela 'Atributos' - estrada que aparece, no campo 'Nome', insira 'para Princetown' e no campo 'Ano' insira '1798'. Clique em 'OK'.</li>
</ul>
<figure><desc>Figura 15</desc><graphic url="pei15.png"/></figure>
<ul>
<li>
<p>Repita esta etapa para mais 3 a 4 estradas encontradas no 'PEI_HollandMap1798'.</p>
</li>
<li>
<p>Clique em 'Salvar mudan&#231;as' e, em seguida, clique em 'Alternar Edi&#231;&#227;o' para deslig&#225;-lo.</p>
</li>
</ul>
<p>Desmarque 'PEI_HollandMap1798' na janela 'Camadas' e selecione o mapa 'PEI_highway'. Compare as estradas representadas no mapa 'PEI_highway' (as linhas vermelhas pontilhadas) com as estradas que voc&#234; acabou de tra&#231;ar.</p>
<figure><desc>Figura 16</desc><graphic url="pei16.png"/></figure>
<ul>
<li>Podemos ver que algumas dessas estradas correspondem exatamente &#224;s estradas atuais, enquanto outras n&#227;o correspondem de forma alguma. Seriam necess&#225;rias mais pesquisas hist&#243;ricas para determinar se isso ocorre simplesmente porque o mapa da Holanda n&#227;o representa suficientemente as estradas na &#233;poca, ou se as estradas mudaram consideravelmente desde ent&#227;o. </li>
</ul>
<p>Agora crie um terceiro tipo de camada vetorial: um vetor poligonal. Clique em 'Camada' -&gt; 'Nova' -&gt; 'Nova Camada Vetorial'. A janela 'Nova Camada Vetorial' aparecer&#225; - na categoria 'Tipo', no topo, selecione 'Pol&#237;gono'. </p>
<ul>
<li>Clique no bot&#227;o 'Selecione o SRC' e selecione 'NAD83 (CSRS98) / Prince Edward Isl. Estereogr&#225;fico (EPSG: 2291)' e clique em 'OK'.</li>
<li>Em 'Novo Atributo', no campo ao lado de 'Nome', digite 'nome_lote' no campo ao lado de 'Ano'.</li>
<li>Clique em 'Adicionar campos &#224; lista'.  </li>
</ul>
<p>Crie um segundo atributo:  </p>
<ul>
<li>Em 'Novo atributo', no campo ao lado de 'Nome', digite 'Ano'.</li>
<li>Mude o 'Tipo' para 'N&#250;mero Inteiro'.</li>
<li>Clique em 'Adicionar &#224; lista de Atributos'.</li>
</ul>
<figure><desc>Figura 17</desc><graphic url="Figura17.jpg"/></figure>
<p>Comece criando um pol&#237;gono para o 'Lote 66', que &#233; o &#250;nico lote retangular na ilha.</p>
<ul>
<li>Clique em 'Alternar Edi&#231;&#227;o' na barra de ferramentas superior e, em seguida, clique em 'Adicionar Fei&#231;&#227;o'.</li>
<li>Clique nos quatro cantos do 'lote 66' e voc&#234; ver&#225; um pol&#237;gono criado.</li>
<li>Clique com o bot&#227;o direito no canto final e uma janela de 'Atributos' aparecer&#225;. Adicione '66' ao campo 'nome_lote' e adicione '1764' (o ano em que esses lotes foram inventariados) ao campo 'Ano'.</li>
</ul>
<figure><desc>Figura 18</desc><graphic url="Figura18.jpg"/></figure>
<p>Agora vamos rastrear o 'Lote 38', que fica a oeste de 'Havre-St-Pierre'. Certifique-se de que h&#225; uma marca de sele&#231;&#227;o na caixa ao lado da camada 'PEI_HollandMap1798' na janela 'Camadas'.</p>
<p>Clique em 'Alternar Edi&#231;&#227;o' na barra de ferramentas superior e, em seguida, clique em 'Adicionar Fei&#231;&#227;o'.</p>
<p>Trace o contorno do 'Lote 38', que &#233; mais dif&#237;cil por causa da linha costeira, com a maior precis&#227;o poss&#237;vel. Para mostrar a fei&#231;&#227;o 'Ajuste', queremos que trace ao longo da costa atual (o 'ajuste' &#233; uma opera&#231;&#227;o de edi&#231;&#227;o autom&#225;tica que ajusta a fei&#231;&#227;o que voc&#234; desenhou para coincidir ou alinhar exatamente com as coordenadas e forma de outra fei&#231;&#227;o pr&#243;xima).</p>
<ul>
<li>Selecione 'Configura&#231;&#245;es'-&gt; 'Op&#231;&#245;es de Ajuste'.</li>
</ul>
<figure><desc>Figura 19</desc><graphic url="Figura19.jpg"/></figure>
<ul>
<li>Uma janela de 'op&#231;&#245;es de ajuste' ir&#225; abrir: clique na caixa ao lado de 'coast_polygon', para a categoria 'Modo' selecione 'v&#233;rtice e segmento', para 'Toler&#226;ncia' selecione '10.0', e para 'Unidades' selecione 'pixels'. Clique 'OK'.</li>
<li>
</li>
</ul>
<figure><desc>Figura 20</desc><graphic url="Figura20.jpg"/></figure>
<p>Certifique-se de que a camada de 'lotes' esteja selecionada na janela 'Camadas' e selecione 'Adicionar fei&#231;&#227;o' na barra de ferramentas. </p>
<ul>
<li>Com o cursor, clique nos dois cantos inferiores do pol&#237;gono, assim como fez com o 'lote 38'. Na linha costeira, voc&#234; notar&#225; que tem uma cole&#231;&#227;o de linhas para tra&#231;ar ao redor do 'Savage Harbour'. &#201; aqui que os recursos de ader&#234;ncia se tornam &#250;teis. Enquanto tra&#231;ar a linha ao longo da costa atual, sua precis&#227;o aumentar&#225; significativamente, encaixando os 'cliques' diretamente no topo da linha existente. Quanto mais 'cliques' voc&#234; fizer, mais preciso ser&#225;, mas tenha em mente que, para muitos fins de SIGH (SIG hist&#243;rico), obter extrema precis&#227;o &#224;s vezes produz retornos decrescentes.</li>
</ul>
<figure><desc>Figura 21</desc><graphic url="pei21.png"/></figure>
<p>Quando terminar de tra&#231;ar e criar o pol&#237;gono, selecione e desmarque as v&#225;rias 'camadas' que criou, comparando e vendo quais rela&#231;&#245;es pode deduzir.
No Google Earth, havia limita&#231;&#245;es nos tipos de 'fei&#231;&#245;es', 'atributos' e dados fornecidos, e o Google Earth fez grande parte do trabalho por si. Isso &#233; bom quando est&#225; aprendendo ou deseja criar mapas rapidamente. A vantagem de usar o software QGIS para criar novas camadas vetoriais &#233; a liberdade e controle sobre os tipos de dados que se pode usar e as 'fei&#231;&#245;es' e 'atributos' que se podem criar. Assim, &#233; poss&#237;vel criar mapas personalizados e ir muito al&#233;m do que pode ser alcan&#231;ado no Google Earth ou no Google Maps Engine Lite. Viu isso em primeira m&#227;o com as camadas vetoriais de pontos, linhas e pol&#237;gonos que aprendeu a criar nesta li&#231;&#227;o. Se tiver dados sobre, por exemplo, registros de sa&#250;de p&#250;blica no s&#233;culo XVIII, pode criar uma nova camada mostrando a distribui&#231;&#227;o de surtos de febre tifoide e ver se h&#225; correla&#231;&#245;es com estradas e assentamentos principais. Al&#233;m disso, o software SIG permite n&#227;o apenas representar e apresentar dados espaciais de maneiras mais sofisticadas, mas tamb&#233;m analisar e criar novos dados que n&#227;o seriam poss&#237;veis de outra forma. </p>
<p><hi rend="bold">Aprendeu como criar camadas vetoriais. Certifique-se de salvar seu trabalho!</hi></p>
<p>1 &#201; poss&#237;vel identificar a palavra 'fei&#231;&#227;o', em tradu&#231;&#245;es no QGIS BR, ao referir os tr&#234;s tipos de 'formas' ou 'geometrias' usadas nas camadas vetoriais dos SIG. Mas, isto cria uma diferen&#231;a entre as vers&#245;es do QGIS BR e QGIS PT.</p>
<p><emph>Esta li&#231;&#227;o &#233; parte do <link target="http://geospatialhistorian.wordpress.com/">Geospatial Historian</link>.</emph></p>
</div>
    </body>
  </text>
</TEI>
