<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="crear-y-ver-archivos-html-con-python">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Crear y ver archivos HTML con Python</title>
  <author type="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor type="reviewers"><persName>Miriam Posner</persName><persName>Jim Clifford</persName></editor><author type="translators">V&#237;ctor Gayol</author><editor type="translation-reviewers"><persName>Jairo A. Melo</persName><persName>Maria Jos&#233; Afanador-Llach</persName><persName>Antonio Rojas Castro</persName></editor><editor type="editors"><persName>M</persName><persName>i</persName><persName>r</persName><persName>i</persName><persName>a</persName><persName>m</persName><persName> </persName><persName>P</persName><persName>o</persName><persName>s</persName><persName>n</persName><persName>e</persName><persName>r</persName></editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0003</idno><date type="published">07/17/2012</date><date type="translated">03/15/2017</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#creating-and-viewing-html-files-with-python"/>.</p><p>There are other translations: <ref target="#criacao-visualizacao-ficheiros-html-python"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Aqu&#237; aprender&#225;s c&#243;mo crear archivos HTML con scripts de Python, y c&#243;mo utilizar Python para abrir un archivo HTML en Firefox.</p></abstract><textClass><keyword xml:lang="en">python</keyword><keyword xml:lang="en">website</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Objetivo de la lecci&#243;n</head>
<p>Esta lecci&#243;n utiliza Python para crear y ver un archivo HTML. Si escribes programas que tengan salida en HTML puedes utilizar cualquier navegador para ver tus resultados. Esto es especialmente conveniente si tu programa crea autom&#225;ticamente hiperv&#237;nculos o entidades gr&#225;ficas y diagramas.</p>
<p>Aqu&#237; aprender&#225;s c&#243;mo crear archivos HTML con <emph>scripts</emph> de Python, y c&#243;mo utilizar Python para abrir un archivo HTML en Firefox.</p>
</div>
      <div type="2"><head>Archivos necesarios para esta lecci&#243;n</head>
<ul>
<li><code type="inline">obo.py</code></li>
</ul>
<p>Si no tienes estos archivos de las lecciones anteriores, puedes descargar python-es-lecciones5, un <link target="/assets/python-es-lecciones5.zip">archivo zip de las lecciones anteriores</link>.</p>
</div>
      <div type="2"><head>Crear HTML con Python</head>
<p>En este punto hemos comenzado a aprender c&#243;mo utilizar Python para descargar fuentes documentales en l&#237;nea y extraer informaci&#243;n de ellas autom&#225;ticamente. Recuerda que nuestro objetivo final es incorporar f&#225;cilmente la programaci&#243;n a nuestra pr&#225;ctica de investigaci&#243;n. Acorde con este objetivo, en esta lecci&#243;n y la siguiente vamos a aprender c&#243;mo recuperar nuestros datos como HTML. Esto tiene algunas ventajas. Primero, al almacenar nuestra informaci&#243;n en nuestro disco duro como HTML podemos abrirla con Firefox y utilizar <link target="http://zotero.org">Zotero</link> para indexarla y anotarla despu&#233;s. Segundo, hay una amplia gama de visualizaciones para HTML que podemos aprovechar m&#225;s adelante.</p>
<p>Si no has hecho todav&#237;a el <link target="http://www.w3schools.com/html/default.asp">tutorial de HTML de W3 Schools</link>, invierte tiempo en ello antes de continuar. Buscamos crear un documento HTML con Python as&#237; que necesitas saber qu&#233; es un documento HTML.</p>
</div>
      <div type="2"><head>'Hola Mundo' en HTML usando Python</head>
<p>Una de las ideas m&#225;s poderosas en la inform&#225;tica es que un archivo que parece contener c&#243;digo desde una perspectiva puede ser visto como conjunto de datos desde otra. Es posible, en otras palabras, escribir programas que manipulen otros programas. Lo que vamos a hacer es crear un archivo HTML que diga "Hola Mundo" utilizando Python. Lo haremos almacenando <emph>etiquetas</emph> HTML en una cadena multilineal de Python y guardando el contenido en un nuevo archivo. Este archivo se guardar&#225; con una extensi&#243;n <code type="inline">.html</code> en vez de <code type="inline">.txt</code>.</p>
<p>Normalmente un archivo HTML comienza con una <link target="http://www.w3schools.com/tags/tag_doctype.asp">declaraci&#243;n doctype</link>. Viste esto cuando escribiste un programa "Hola Mundo" en HTML en una lecci&#243;n anterior. Para hacer que la lectura de nuestro c&#243;digo sea m&#225;s f&#225;cil, omitiremos el <emph>doctype</emph> en este ejemplo. Recuerda que una cadena multilineal se crea encerrando el texto en tres juegos de comillas (ver abajo).</p>
<pre><code class="language-python" xml:id="code_crear-y-ver-archivos-html-con-python_0" type="block" corresp="code_crear-y-ver-archivos-html-con-python_0.txt"/></pre>
<p>Guarda el programa anterior como <code type="inline">escribe-html.py</code> y ejec&#250;talo. Utiliza <emph>File -&gt; Open</emph> en tu editor seleccionado para abrir <code type="inline">holamundo.html</code> para verificar que tu programa en realidad cre&#243; el archivo. El contenido debe verse como esto:</p>
<figure><desc>Fuente HTML generada con Python</desc><graphic url="hello-world-html.png"/></figure>
<p>Ahora ve a tu navegador Firefox y elige <emph>Archivo-&gt; Nueva pesta&#241;a</emph>; ve a la pesta&#241;a y elige <emph>Archivo-&gt; Abrir archivo</emph> Selecciona <code type="inline">holamundo.html</code>. Ahora deber&#237;as ver el mensaje en el navegador. Detente un momento para pensar en esto: ahora tienes la habilidad de escribir un programa que crea autom&#225;ticamente una p&#225;gina Web. No hay ninguna raz&#243;n por la que no podr&#237;as escribir un programa para crear autom&#225;ticamente un sitio Web completo si lo quisieras.</p>
</div>
      <div type="2"><head>Utilizar Python para controlar Firefox</head>
<p>Creamos autom&#225;ticamente un archivo HTML, pero entonces tuvimos que dejar nuestro editor e ir a Firefox para abrir ese archivo en una nueva pesta&#241;a. &#191;No ser&#237;a genial que nuestro programa de Python incluya este paso final? Escribe o copia el c&#243;digo de abajo y gu&#225;rdalo como <code type="inline">escribe-html-2.py</code>. Cuando lo ejecutas debe crear y abrir autom&#225;ticamente tu archivo HTML en una nueva pesta&#241;a de Firefox. &#161;Genial!</p>
<div type="3"><head>Instrucciones para usuarios de Mac</head>
<p>Los usuarios de Mac deben especificar la localizaci&#243;n precisa del archivo <code type="inline">.html</code> en su computadora. Para hacerlo, localiza la carpeta <code type="inline">programming-historian</code>que creaste para hacer estos tutoriales, haz clic con el bot&#243;n derecho y selecciona "Obtener informaci&#243;n".</p>
<p>Puedes entonces copiar y pegar la localizaci&#243;n del archivo enlistado despu&#233;s de "Ubicaci&#243;n:" y aseg&#250;rate de incluir una diagonal (/) para permitirle a la computadora saber que quieres algo dentro del directorio (en vez del directorio en s&#237; mismo).</p>
<pre><code class="language-python" xml:id="code_crear-y-ver-archivos-html-con-python_1" type="block" corresp="code_crear-y-ver-archivos-html-con-python_1.txt"/></pre>
<p>Si recibes un error de "File not found" no has cambiado la ruta de nombre de archivo correctamente.</p>
</div><div type="3"><head>Instrucciones para Windows</head>
<pre><code class="language-python" xml:id="code_crear-y-ver-archivos-html-con-python_2" type="block" corresp="code_crear-y-ver-archivos-html-con-python_2.txt"/></pre>
<p>***</p>
<p>No solamente has escrito un programa en Python que puede escribir HTML simple, sino que tambi&#233;n has logrado controlar tu navegador de Firefox utilizando Python. En la siguiente lecci&#243;n regresaremos a la salida de datos que hemos recolectado como un archivo HTML.</p>
</div></div>
      <div type="2"><head>Lecturas sugeridas</head>
<ul>
<li>
Lutz, Learning Python<ul>
<li>Re-read and review Chs. 1-17</li>
</ul>
</li>
</ul>
<div type="3"><head>Sincronizaci&#243;n de c&#243;digo</head>
<p>Para seguir a lo largo de las lecciones futuras es importante que tengas los archivos correctos y programas en el directorio "programming-historian" de tu disco duro. Al final de cada lecci&#243;n puedes descargar el archivo zip "python-es-lecciones" para asegurarte que tienes el c&#243;digo correcto. Si est&#225;s trabajando con la versi&#243;n Mac o Linux de las lecciones deber&#225;s abrir el archivo <code type="inline">obo.py</code> y cambiar "file:///Users/username/Desktop/programming-historian/" a la ruta del directorio de tu propia computadora.</p>
<ul>
<li>python-es-lecciones6.zip <link target="/assets/python-es-lecciones6.zip">zip sync</link></li>
</ul>
</div></div>
    </body>
  </text>
</TEI>
