<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Poniendo Omeka a funcionar</title>
  <authors>Miriam Posner</authors>
  <date>2016-02-17</date>
  <translation_date>2017-04-26</translation_date>
  <reviewers>Sheila Brennan</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Maria Jos&#233; Afanador-Llach</translator>
  <translation-editor>Antonio Rojas Castro</translation-editor>
  <translation-reviewer>Antonio Rojas Castro,Alicia Calvo</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/61</review-ticket>
  <layout>lesson</layout>
  <original>up-and-running-with-omeka</original>
  <difficulty>1</difficulty>
  <activity>presenting</activity>
  <topics>website</topics>
  <abstract>Con Omeka.net es f&#225;cil crear sitios web que contengan colecciones de &#237;tems.</abstract>
  <avatar_alt>Ilustraci&#243;n del esqueleto de un mamut en la exhibici&#243;n de un museo, con gente a su alrededor.</avatar_alt>
  <doi>10.46430/phes0022</doi>
</metadata>
  <text>
    <body><p><link target="http://www.omeka.net">Omeka.net</link> facilita la creaci&#243;n de sitios web para mostrar colecciones de &#237;tems.</p>
<blockquote>
<p><emph>Nota de la traductora</emph>: Antes de empezar es importante aclarar las diferencias entre <hi rend="bold">Omeka.net</hi> y <hi rend="bold">Omeka.org</hi>. Este tutorial es sobre <hi rend="bold">Omeka.net</hi>, una plataforma de publicaci&#243;n en l&#237;nea que permite a cualquier persona con una cuenta de acceso crear o colaborar en un sitio web para exhibir colecciones y construir exposiciones digitales. <hi rend="bold">Omeka.net</hi> es una extensi&#243;n de <hi rend="bold">Omeka.org</hi> que est&#225; disponible para bajar e instalar en un servidor de tu propiedad. La traducci&#243;n al espa&#241;ol del tutorial de <emph>The Programming Historian</emph> sobre <link target="/lessons/installing-omeka">c&#243;mo instalar Omeka</link> en un servidor se encuentra en proceso.
al
Reg&#237;strate para abrir una cuenta en Omeka</p>
</blockquote>
<figure><desc>Reg&#237;strate para una cuenta de prueba</desc><graphic url="up-and-running-01.png"/></figure>
<p>Entra a <link target="http://www.omeka.net">www.omeka.net</link> y haz clic en <hi rend="bold">Sign Up</hi>. Elige el plan "Omeka trial" (Plan de prueba). Rellena el formulario de registro. Revisa tu correo electr&#243;nico y haz clic en el enlace para activar tu cuenta.</p>
<div n="2"><head>Crea tu nuevo sitio en Omeka</head>
<figure><desc>P&#225;gina de la cuenta de Omeka.net</desc><graphic url="up-and-running-02.png"/></figure>
<p>Tras hacer clic en el enlace en tu correo electr&#243;nico, haz clic en <hi rend="bold">Add a Site</hi> (A&#241;adir un sitio).</p>
<p>Llena la informaci&#243;n sobre el URL de tu sitio, el t&#237;tulo que quieres usar y si quieres una descripci&#243;n. Haz clic en <hi rend="bold">Add Your Site</hi> (A&#241;ade tu sitio).</p>
</div><div n="2"><head>&#161;Ahora tienes un nuevo sitio en Omeka!</head>
<figure><desc>Ver sitio</desc><graphic url="up-and-running-03.png"/></figure>
<p>Para ver tu sitio, haz clic en <hi rend="bold">View Site</hi> (Ver sitio).</p>
</div><div n="2"><head>Un sitio vac&#237;o de Omeka</head>
<figure><desc>Vista p&#250;blica</desc><graphic url="up-and-running-04.png"/></figure>
Este es tu sitio vac&#237;o de Omeka esperando a ser llenado. Para regresar a tu panel de control (*dashboard*) haz clic en el bot&#243;n **Back** (Atr&#225;s) o escribe  **http://www.omeka.net/dashboard**. Esta vez haz clic en **Manage Site** (Administra el sitio).
</div><div n="2"><head>Cambia de plantilla</head>
<figure><desc>P&#225;gina de configuraci&#243;n de plantillas</desc><graphic url="up-and-running-05.png"/></figure>
<p>Omeka te permite cambiar la apariencia de tu sitio p&#250;blico por medio de las plantillas (<emph>themes</emph>). Para hacer esto, haz clic en <hi rend="bold">Appearance</hi> (Apariencia) (en la esquina superior derecha de tu panel de control / <emph>dashboard</emph>). Cambia de plantilla seleccionando una de las opciones en la p&#225;gina. Presiona el bot&#243;n verde <hi rend="bold">Use this theme</hi> (Usa esta plantilla) para activar la nueva plantilla. Despu&#233;s visita tu sitio p&#250;blico haciendo clic en el nombre de tu sitio en la esquina superior izquierda de la p&#225;gina.</p>
</div><div n="2"><head>&#161;Ahora tienes una nueva plantilla!</head>
<figure><desc>Vista p&#250;blica con la nueva plantilla</desc><graphic url="up-and-running-06.png"/></figure>
<p>Una vez hayas revisado tu nueva plantilla, regresa al tu panel de control (<emph>dashboard</emph>). Puedes regresar a tu plantilla antigua, quedarte con este o seleccionar una de las otras opciones.</p>
</div><div n="2"><head>Instala algunos plugins</head>
<figure><desc>P&#225;gina de plugins</desc><graphic url="up-and-running-07.png"/></figure>
<p>Tu sitio de Omeka viene con plugins que ofrecen funciones adicionales. Necesitamos habilitarlos. Para hacer esto, haz clic en el men&#250; <hi rend="bold">Plugins</hi> en la parte superior. En la siguiente p&#225;gina haz clic en el bot&#243;n <hi rend="bold">Install</hi> (Instalar) para <hi rend="bold">Exhibit Builder</hi> (Constructor de exposiciones) (deja las opciones como est&#225;n en la p&#225;gina siguiente ) y para <hi rend="bold">Simple Pages</hi> (P&#225;ginas simples).</p>
</div><div n="2"><head>A&#241;ade un &#237;tem a tu archivo</head>
<figure><desc>Add and Item (A&#241;ade un &#237;tem)</desc><graphic url="up-and-running-08.png"/></figure>
<p>Haz clic en <hi rend="bold">Items</hi> en el men&#250; del lado izquierdo y despu&#233;s (&#161;naturalmente!) haz clic en <hi rend="bold">Add an item</hi> (A&#241;ade un &#237;tem).</p>
</div><div n="2"><head>Describe tu nuevo &#237;tem</head>
<figure><desc>Haz tu &#237;tem p&#250;blico marcando la caja que est&#225; circulada ac&#225;</desc><graphic url="up-and-running-09.png"/></figure>
<p>Recuerda, <hi rend="bold">Dublin Core</hi> se refiere a la informaci&#243;n descriptiva que introducir&#225;s sobre tu &#237;tem. Toda esta informaci&#243;n es opcional y no hay forma de que lo hagas incorrectamente. Pero trata de ser consistente.</p>
<p>Aseg&#250;rate de marcar la caja de <hi rend="bold">Public</hi> para que tu &#237;tem sea visible por el p&#250;blico general. Si no marcas esa caja, solamente las personas que hayan iniciado sesi&#243;n en tu sitio podr&#225;n ver el &#237;tem.</p>
<p>Para a&#241;adir m&#250;ltiples campos &#8212;por ejemplo, si quieres a&#241;adirle m&#250;ltiples temas (<emph>subjects</emph>) a tu &#237;tem&#8212; usa el bot&#243;n verde <hi rend="bold">Add input</hi> situado a la izquierda de las cajas de texto.</p>
</div><div n="2"><head>Una cuesti&#243;n compleja</head>
<figure><desc>&#191;Qu&#233; es esto?</desc><graphic url="up-and-running-10.png"/></figure>
<p>Estoy creando un registro de un &#237;tem para mi perro Bertie. Pero, &#191;estoy describiendo al <emph>mismo</emph> Bertie o una <emph>fotograf&#237;a</emph> de Bertie? Si es lo primero, el <hi rend="bold">Creator</hi> ser&#237;a... bueno, supongo que eso depende de tus creencias religiosas. Si es lo segundo, el creador ser&#237;a Brad Wallace, quien tom&#243; la foto.</p>
<p>La decisi&#243;n de si vas a describir un objeto o la representaci&#243;n del objecto es tuya. Una vez hayas decidido s&#233; consistente.</p>
</div><div n="2"><head>Adjunta un archivo al registro de tu &#237;tem</head>
<figure><desc>Adjuntando archivos a un &#237;tem</desc><graphic url="up-and-running-11.png"/></figure>
<p>Una vez hayas terminado de a&#241;adir metadatos Dublin Core, puedes adjuntar un archivo a tu &#237;tem haciendo clic en <hi rend="bold">Files</hi> en la parte superior del formulario de Dublin Core. (No tienes que hacer clic en <hi rend="bold">Add Item</hi>, antes de hacer esto; Omeka guardar&#225; autom&#225;ticamente tu informaci&#243;n). Puedes adjuntar m&#250;ltiples archivos, pero ten encuenta que el plan b&#225;sico solo viene con 500 MB de espacio de almacenamiento.</p>
<p>Una vez hayas a&#241;adido un archivo o archivos, puedes a&#241;adir <hi rend="bold">Tags</hi> (Etiquetas) haciendo clic en el bot&#243;n. Tambi&#233;n puedes hacer clic en <hi rend="bold">Item Type Metadata</hi> (Tipos de metadatos del &#237;tem) para seleccionar el tipo de objeto &#8212;persona, lugar, animal, vegetal, mineral&#8212; que sea tu &#237;tem. Si no ves el tipo apropiado de &#237;tem para tu &#237;tem, no te preocupes. M&#225;s adelante podremos a&#241;adir un nuevo tipo de &#237;tem.</p>
<p>Cuando hayas acabado haz clic en el bot&#243;n verde <hi rend="bold">Add Item</hi> (A&#241;adir &#237;tem).</p>
</div><div n="2"><head>&#161;Ya tienes un &#237;tem!</head>
<figure><desc>Explora &#237;tems, vista de administrador</desc><graphic url="up-and-running-12.png"/></figure>
<p>Esta lista contiene todos los &#237;tems que has a&#241;adido. Si el &#237;tem no estuviera p&#250;blico, tendr&#237;a (Private) despu&#233;s del t&#237;tulo.  Para ver c&#243;mo se ve la p&#225;gina de tu nuevo &#237;tem haz clic en el nombre del &#237;tem.</p>
</div><div n="2"><head>Esta no es la p&#225;gina p&#250;blica de tu &#237;tem</head>
<figure><desc>Vista del &#237;tem, vista de administrador</desc><graphic url="up-and-running-13.png"/></figure>
<p>Podr&#237;a parecer que lo es, pero esta p&#225;gina no es lo que un usuario que no ha iniciado sesi&#243;n ver&#225; cuando navegue por la p&#225;gina de tu &#237;tem. Para ver lo que un usuar&#237;o ver&#237;a haz clic en el bot&#243;n azul <hi rend="bold">View Public Page</hi> (Ver P&#225;gina p&#250;blica) a la derecha. (O puedes editar el &#237;tem haciendo clic en <hi rend="bold">Edit this item</hi> (Editar este &#237;tem) arriba a la derecha).</p>
</div><div n="2"><head>Esta es la p&#225;gina p&#250;blica para tu &#237;tem</head>
<figure><desc>Vista del &#237;tem, vista p&#250;blica</desc><graphic url="up-and-running-14.png"/></figure>
<p>Esto es lo que un usuario general ver&#225; si navega por tu p&#225;gina.</p>
</div><div n="2"><head>Crea una colecci&#243;n</head>
<figure><desc>A&#241;ade una collecci&#243;n</desc><graphic url="up-and-running-15.png"/></figure>
<p>Puedes empezar a ordenar tu lista de &#237;tems al agruparlos en colecciones. Para hacer esto, regresa a tu panel de control (dashboard) y haz clic en la pesta&#241;a <hi rend="bold">Collections</hi> (Colecciones) y en <hi rend="bold">Add a Collection</hi> (A&#241;ade una colecci&#243;n).</p>
</div><div n="2"><head>Introduce informaci&#243;n sobre tu colecci&#243;n</head>
<figure><desc>A&#241;ade metadatos a tu colecci&#243;n</desc><graphic url="up-and-running-16.png"/></figure>
<p>&#161;En Omeka, los metadatos son clave! Introduce alguna informaci&#243;n sobre tu colecci&#243;n y acu&#233;rdate de hacer clic en el bot&#243;n <hi rend="bold">Public</hi> cerca a la parte inferior de la p&#225;gina. Despu&#233;s guarda tu colecci&#243;n.</p>
</div><div n="2"><head>A&#241;ade &#237;tems a tu colecci&#243;n</head>
<figure><desc>Haz clic en la caja al lado de cada &#237;tem para editar en grupo</desc><graphic url="up-and-running-17.png"/></figure>
<p>Para llenar la colecci&#243;n que acabas de crear haz clic en la pesta&#241;a de <hi rend="bold">Items</hi>. Desde tu lista de <hi rend="bold">Browse Items</hi>, haz clic en las cajas de los &#237;tems que pertenecen a tu nueva colecci&#243;n. Despu&#233;s haz clic en el bot&#243;n <hi rend="bold">Edit</hi> (Editar).</p>
</div><div n="2"><head>Escoge la colecci&#243;n</head>
<figure><desc>Selecciona una colecci&#243;n del men&#250; desplegable</desc><graphic url="up-and-running-18.png"/></figure>
<p>En la p&#225;gina de <hi rend="bold">Batch Edit Items</hi> (Editar &#237;tems en grupo), selecciona la colecci&#243;n a la que le quieres a&#241;adir tus &#237;tems. (Tambi&#233;n ten en cuenta todas las otras cosas que puedes hacer en esta p&#225;gina).</p>
</div><div n="2"><head>Revisa tu nueva colecci&#243;n</head>
<figure><desc>Navega colecciones (*Browse collections*), vista p&#250;blica</desc><graphic url="up-and-running-19.png"/></figure>
<p>Regresa a tu sitio p&#250;blico. Si haces clic en la pesta&#241;a <hi rend="bold">Browse Collections</hi> (Navega colecciones) en el sitio p&#250;blico, debes ahora poder ver la nueva colecci&#243;n que contiene los &#237;tems que identificaste en el paso anterior.</p>
<p>Ahora que has a&#241;adido algunos &#237;tems y los has agrupado en una colecci&#243;n, t&#243;mate un tiempo para jugar con tu sitio. Est&#225; empezando a tomar forma ahora que tienes &#237;tems individuales y unidades tem&#225;ticas. Pero Omeka puede hacer mucho m&#225;s. Hablaremos sobre esto en la siguiente lecci&#243;n.</p>
</div><div n="2"><head>Recursos adicionales</head>
<p>El equipo de Omeka ha compilado un conjunto de muy buenos recursos en las <link target="http://info.omeka.net">p&#225;ginas de ayuda</link> del software.
<link target="https://issuu.com/ralcaraz/docs/omeka-manual">Este manual en espa&#241;ol</link> contiene informaci&#243;n &#250;til para evaluar las ventajas y desventajas de usar <hi rend="bold">Omeka.net</hi> u <hi rend="bold">Omeka.org</hi>, al igual que instrucciones generales sobre c&#243;mo instalar Omeka en tu servidor.</p>
</div></body>
  </text>
</TEI>
