<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>An&#225;lisis de sentimientos en R con 'syuzhet'</title>
  <authors>Jennifer Isasi</authors>
  <date>2021-03-23</date>
  <editors>Maria Jos&#233; Afanador-Llach</editors>
  <reviewers>Riva Quiroga</reviewers>
  <layout>lesson</layout>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/286</review-ticket>
  <difficulty>2</difficulty>
  <activity>analyzing</activity>
  <topics>distant-reading,r,data-visualization</topics>
  <abstract>Esta lecci&#243;n te ense&#241;a una forma de obtener y analizar datos sobre las emociones y los sentimientos de una narraci&#243;n</abstract>
  <avatar_alt>Grabado de tres rostros expresando distintas emociones</avatar_alt>
  <doi>10.46430/phes0051</doi>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Objetivos</head>
<p>Esta lecci&#243;n utiliza la metodolog&#237;a de an&#225;lisis de sentimientos y emociones mediante el lenguaje de programaci&#243;n R, para investigar documentos de tipo textual de forma individual. Aunque la lecci&#243;n no est&#225; pensada para usuarios avanzados de R, es necesario que cuentes con ciertos conocimientos de dicho lenguaje; asumimos que tienes R instalado y sabes c&#243;mo cargar paquetes. Tambi&#233;n recomendamos la descarga de R Studio. Si no est&#225;s familiarizado con R, es mejor trabajar primero con las lecciones <link target="/es/lecciones/procesamiento-basico-de-textos-en-r">Procesamiento b&#225;sico de textos en R</link>, <link target="/es/lecciones/datos-tabulares-en-r">Datos tabulares en R</link> o <link target="/es/lecciones/administracion-de-datos-en-r">Administraci&#243;n de datos en R</link>. Al final de esta lecci&#243;n podr&#225;s:</p>
<ul>
<li>Plantear preguntas de investigaci&#243;n basadas en an&#225;lisis cuantitativo de sentimientos en textos de tipo ensay&#237;stico y/o narrativo</li>
<li>Usar el lenguaje de programaci&#243;n R, el entorno R Studio y el paquete <code type="inline">syuzhet  </code> con el diccionario NRC para generar el valor sentimental y emocional de un texto en diferentes idiomas</li>
<li>Analizar cr&#237;ticamente los resultados del procesamiento de texto</li>
<li>Visualizar los datos generales y su evoluci&#243;n a lo largo de un texto</li>
</ul>
<p>Esta lecci&#243;n fue construida con la versi&#243;n 4.0.2 de R, pero creemos que funcionar&#225; correctamente en versiones futuras del programa.</p>
<blockquote>
<p>La utilizaci&#243;n de R es, en general, la misma para Windows, Mac y Linux. Sin embargo, como vamos a trabajar con textos en espa&#241;ol, necesitaremos escribir algo de c&#243;digo extra para indicar el formato UTF-8 en m&#225;quinas Windows. En dichos casos, se despliega el c&#243;digo para el sistema operativo correspondiente.</p>
</blockquote>
</div>
      <div type="2"><head>Antes de empezar</head>
<div type="3"><head>An&#225;lisis de sentimientos</head>
<p>El <link target="https://es.wikipedia.org/wiki/An%C3%A1lisis_de_sentimiento">an&#225;lisis de sentimientos o la miner&#237;a de opini&#243;n</link> es utilizado para extraer de forma autom&#225;tica, informaci&#243;n sobre la connotaci&#243;n negativa o positiva del lenguaje de un documento. Aunque es una tarea que lleva tiempo siendo utilizada en el campo del marketing o la pol&#237;tica, en los estudios literarios es un acercamiento todav&#237;a reciente y sobre el que no hay un &#250;nico m&#233;todo. Adem&#225;s, existe la posibilidad de extraer la polaridad de los sentimientos pero tambi&#233;n de las emociones.</p>
<p>Conviene especificar qu&#233; se busca con los t&#233;rminos de sentimiento y de emociones, ya que se suelen utilizar indistintanmente de forma general pero son diferentes. Para Antonio R. Damasio, las emociones son reacciones corporales institivas de nuestro cuerpo, determinadas por est&#237;mulos medioambientales y derivadas del desarrollo de regulaci&#243;n biol&#243;gica (12). Estas pueden dividirse en primarias y secundarias. Aunque no hay un acuerdo final sobre el n&#250;mero de emociones b&#225;sicas, se suele hablar de seis, siendo estas el enfado o la ira,  la alegr&#237;a,  el disgusto o asco, el miedo, la tristeza y la sorpresa, aunque para Damasio esta &#250;ltima es secundaria. Adem&#225;s, en el caso del sistema autom&#225;tico que utilizaremos, tambi&#233;n se ofrece la aparici&#243;n de las emociones secundarias de la anticipaci&#243;n y la confianza.  </p>
<p>Por otro lado, podemos definir el sentimiento como la acci&#243;n y efecto de sentir una emoci&#243;n o, dicho de otro modo, es el resultado de que "cuando un objeto, una persona, una situaci&#243;n, o un pensamiento provoca en nosotros la emoci&#243;n de la alegr&#237;a, comienza un proceso que puede concluir en el sentimiento de estar alegres o felices"  (Pereira Zazo 32) por ser una emoci&#243;n positiva. Durante la lecci&#243;n haremos una distinci&#243;n entre ambos t&#233;rminos, ya que se utilizar&#225; el resultado del sentimiento para ver su evoluci&#243;n a lo largo del texto y las emociones para ver el uso de palabras en general.</p>
</div><div type="3"><head>Diccionario de l&#233;xico NRC</head>
<p>El paquete <code type="inline">syuzhet</code> trabaja con cuatro diccionarios de sentimientos: Bing, Afinn, Stanford y NRC. En esta lecci&#243;n trabajaremos con este &#250;ltimo puesto que es el &#250;nico disponible en varios idiomas, incluido el espa&#241;ol. Este vocabulario con valores de sentimiento negativo o positivo y ocho emociones ha sido desarrollado por Saif M. Mohammad, cient&#237;fico del Consejo de Investigaci&#243;n Nacional de Canad&#225; (NRC por sus siglas en ingl&#233;s). El conjunto de datos ha sido anotado manualmente mediante encuestas con la t&#233;cnica de Escalamiento por M&#225;xima Diferencia o MaxDiff, que eval&#250;a la preferencia en una serie de alternativas (Mohammad y Turney). As&#237;, el l&#233;xico cuenta con 14,182 unigramas (palabras) con las categor&#237;as de sentimientos positivo y negativo y las emociones de enfado, anticipaci&#243;n, disgusto, miedo, alegr&#237;a, tristeza, sorpresa y confianza. Adem&#225;s, est&#225; disponible en m&#225;s de cien idiomas (mediante traducci&#243;n autom&#225;tica).</p>
<p>Sus t&#233;rminos de uso indican que el vocabulario puede ser utilizado de forma gratuita con prop&#243;sitos de investigaci&#243;n, por lo que todos los datos est&#225;n disponible para su descarga.</p>
<p>Si sabes ingl&#233;s, puedes interactuar con las diferentes categor&#237;as en su p&#225;gina web <link target="http://saifmohammad.com/WebPages/NRC-Emotion-Lexicon.htm">NRC Word-Emotion Association Lexicon</link>. En ella tambi&#233;n puedes encontrar trabajos publicados sobre la obtenci&#243;n de los valores para el vocabulario, su organizaci&#243;n, ampliaci&#243;n, etc.</p>
</div><div type="3"><head>Paquete <code type="inline">syuzhet</code></head>
<p>El <link target="https://cran.r-project.org/web/packages/syuzhet/vignettes/syuzhet-vignette.html">paquete de R <code type="inline">syuzhet</code></link> fue desarrollado en 2015 por Matthew Jockers; continuamente introduce cambios y se encarga de mantenerlo (al momento de preparar esta lecci&#243;n se us&#243; la versi&#243;n de diciembre 2017). Una serie de entradas de blog acompa&#241;an el desarrollo del paquete, y pueden consultarse (en ingl&#233;s) en el blog del profesor desde el <link target="http://www.matthewjockers.net/page/2/">5 de junio de 2014.</link></p>
<p>Por descontado, el paquete ha sido desarrollado con pruebas en textos escritos o traducidos al ingl&#233;s y no sin debate sobre su utilidad, por asignar valores a textos literarios que suelen ser, por naturaleza, bastante subjetivos.  </p>
<blockquote>
<p>Advertencias: El listado de palabras en el diccionario est&#225; siendo preparado en ingl&#233;s como lenguaje principal y los datos cuantitativos asignados a cada unigrama es el resultado de una valoraci&#243;n humana por parte de participantes estadounidenses. Por tanto, debes tener en cuenta varios factores a la hora de usar esta metodolog&#237;a:</p>
<ul>
<li>El l&#233;xico en espa&#241;ol es una traducci&#243;n directa realizada por traducci&#243;n autom&#225;tica (estos sistemas son ya muy fiables entre ingl&#233;s y espa&#241;ol, pero no as&#237; en otras lenguas que NRC dice poder analizar como, por ejemplo, el euskera)</li>
<li>La puntuaci&#243;n de cada palabra, es decir, la valencia sentimental y emocional, tiene un sesgo cultural y temporal que debes tener en cuenta y un t&#233;rmino que a los participantes en la encuesta les pareciera positivo a ti puede parecerte negativo</li>
<li>No se recomienda el uso de esta metodolog&#237;a en textos con gran carga metaf&#243;rica y simb&#243;lica</li>
<li>El m&#233;todo no captar&#225; la negaci&#243;n de un sentimiento positivo como, por ejemplo, la frase "no estoy feliz"</li>
</ul>
<p>Siguiendo el esp&#237;ritu de adaptabilidad de las lecciones de <emph>Programming Historian</emph> a otros idiomas, se ha decidido utilizar <code type="inline">syuzhet</code> en su forma original, pero al final de la lecci&#243;n indicamos algunas funciones avanzadas para utilizar tu propio diccionario de sentimientos con el mismo paquete.</p>
</blockquote>
<p>Puesto que los resultados en los <emph>dataframes</emph> van a aparecer en ingl&#233;s, en caso que lo consideres necesario toma un momento para aprender esta traducci&#243;n:</p>
<table>
<thead>
<tr>
<th>anger</th>
<th>anticipation</th>
<th>disgust</th>
<th>fear</th>
<th>joy</th>
<th>sadness</th>
<th>surprise</th>
<th>trust</th>
<th>negative</th>
<th>positive</th>
</tr>
</thead>
<tbody>
<tr>
<td>enfado</td>
<td>anticipaci&#243;n</td>
<td>disgusto</td>
<td>miedo</td>
<td>alegr&#237;a</td>
<td>tristeza</td>
<td>sorpresa</td>
<td>confianza</td>
<td>negativo</td>
<td>positivo</td>
</tr>
</tbody></table></div><div type="3"><head>Un peque&#241;o ejemplo</head>
<p>Antes de empezar a realizar el an&#225;lisis en nuestros textos, conviene saber de forma general cu&#225;l es el proceso de an&#225;lisis llevado a cabo por la funci&#243;n de obtener sentimentos de <code type="inline">syuzhet</code>, con el diccionario NRC y los resultados obtenidos sobre los que trabajaremos.</p>
<p>El sistema procesar&#225; nuestro texto y lo transformar&#225; en un vector de caracteres (aqu&#237; palabras), para analizarlos de forma individual (tambi&#233;n es posible hacerlo por oraciones). Sin entrar todav&#237;a en el c&#243;digo para realizar el an&#225;lisis, observa este breve ejemplo:</p>
<blockquote>
<p>Retumb&#243; el disparo en la soledad de aquel abandonado y tenebroso lugar; Villaamil, dando terrible salto, hinc&#243; la cabeza en la movediza tierra, y rod&#243; seco hacia el abismo, sin que el conocimiento le durase m&#225;s que el tiempo necesario para poder decir: &#171;Pues... s&#237;...&#187;.</p>
<p><emph>Miau</emph> de Benito P&#233;rez Gald&#243;s.</p>
</blockquote>
<p>Dicho fragmento se transforma en un vector de caracteres:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_0" type="block" corresp="code_analisis-de-sentimientos-r_0.txt"></code></pre>
<p>Con la funci&#243;n de obtener sentimientos se obtiene la valencia positiva y negativa de cada unigrama, as&#237; como la valencia de las ocho emociones clasificadas por NRC. El resultado para este fragmento es el siguiente:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_1" type="block" corresp="code_analisis-de-sentimientos-r_1.txt"></code></pre>
<p>Como vemos en los resultados de este objeto de tipo <emph>data frame</emph> o tabla, cada palabra o <emph>token</emph> cuenta con valor 0 por defecto en las diez columnas. Si hay un valor mayor a 0 quiere decir, primero, que dicho t&#233;rmino existe en el diccionario NRC y, segundo, que tiene un valor asignado para alguna emoci&#243;n y/o sentimiento.  En este ejemplo podemos observar que las palabras "disparo", "soledad", "abandonado", "terrible", "abismo" y "necesario", tienen una carga negativa, mientras que "dando", "tierra" y "conocimiento", son consideradas palabras positivas. Tambi&#233;n podemos fijarnos en que la palabra "disparo" reporta emociones de enfado (<emph>anger</emph>), miedo (<emph>fear</emph>), tristeza (<emph>sadness</emph>) y sorpresa (<emph>surprise</emph>).</p>
<p>Las posibilidades de la exploraci&#243;n, el an&#225;lisis y la visualizaci&#243;n de estos resultados dependen en gran medida de tus habilidades de programaci&#243;n pero, sobre todo, de tu pregunta de investigaci&#243;n. Para ayudarte, en esta lecci&#243;n introductoria aprenderemos a analizar los datos mediante varias formas de visualizaci&#243;n.   </p>
</div><div type="3"><head>Pregunta de investigaci&#243;n</head>
<p>Para esta lecci&#243;n vamos a utilizar la novela <emph>Miau</emph> de <link target="https://es.wikipedia.org/wiki/Benito_P%C3%A9rez_Gald%C3%B3s">Benito P&#233;rez Gald&#243;s</link>, publicada en 1888. De g&#233;nero realista y enmarcada en sus <link target="https://es.wikipedia.org/wiki/Novelas_espa%C3%B1olas_contempor%C3%A1neas">Novelas espa&#241;olas contempor&#225;neas</link>, la novela transcurre en el Madrid de finales del siglo XIX y satiriza la administraci&#243;n del ministerio de la &#233;poca. En una especie de tragicomedia, asistimos a los &#250;ltimos d&#237;as de Ram&#243;n Villaamil tras quedar desempleado, mientras su familia estira el escaso presupuesto en pretender ser pudiente. La espiral de mala fortuna e imposibilidad de encontrar un nuevo empleo termina en tragedia.</p>
<p>&#191;Podemos observar la ca&#237;da emocional de esta trama al extraer de forma autom&#225;tica los valores de sentimientos de la novela? O, en otras palabras, &#191;coincide nuestra recepci&#243;n del transcurrir de Villaamil con los resultados de un c&#243;mputo autom&#225;tico? Adem&#225;s, &#191;qu&#233; palabras son m&#225;s utilizadas en la descripci&#243;n de las emociones del texto?  </p>
</div></div>
      <div type="2"><head>Obtener valores de sentimientos y emociones</head>
<div type="3"><head>Instalar y cargar paquetes</head>
<p>Lo primero que debemos hacer para poder llevar a cabo la obtenci&#243;n de los sentimientos de nuestro texto, es instalar y cargar el paquete de R correspondiente, en este caso, <code type="inline">syuzhet</code>. Adem&#225;s, para facilitar la visualizaci&#243;n de los datos vamos a utilizar los paquetes <code type="inline">RColorBrewer</code>, <code type="inline">wordcloud</code>, <code type="inline">tm</code> y <code type="inline">NLP</code>. Para ello escribe y ejecuta los siguientes dos comandos en tu consola; el primero para instalar el paquete y el segundo para cargarlo (si ya tienes alguno instalado, solo hace falta que lo cargues). Ten en cuenta que la instalaci&#243;n de estos paquetes puede tomar unos minutos.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_2" type="block" corresp="code_analisis-de-sentimientos-r_2.txt"></code></pre>
</div><div type="3"><head>Cargar y preparar el texto</head>
<p>Descarga el texto de la novela <link target="/assets/galdos_miau.txt"><emph>Miau</emph></link>. Como puedes ver, el documento est&#225; en formato de texto plano, al ser esto imprescindible para llevar a cabo su procesamiento y an&#225;lisis en R.</p>
<p>Con el texto a mano, lo primero que vamos a hacer es cargarlo como una cadena de caracteres en un objeto de tipo cadena (<emph>string</emph>). Aseg&#250;rate de cambiar la ruta al texto para que corresponda con tu computadora.  </p>
<p><hi rend="bold">En Mac y Linux</hi></p>
<p>En los sistemas Mac podemos usar la funci&#243;n <code type="inline">get_text_as_string</code> integrada en el paquete <code type="inline">syuzhet</code>:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_3" type="block" corresp="code_analisis-de-sentimientos-r_3.txt"></code></pre>
<p><hi rend="bold">En Windows</hi></p>
<p>Los sistemas Windows no leen directamente los caracteres con tildes u otras marcas propias del espa&#241;ol, el portugu&#233;s o el franc&#233;s, as&#237; que tenemos que indicarle al sistema que nuestro texto est&#225; en formato UTF-8 mediante la funci&#243;n <code type="inline">scan</code>.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_4" type="block" corresp="code_analisis-de-sentimientos-r_4.txt"></code></pre>
<p>Puesto que el an&#225;lisis que vamos a realizar necesita de un listado, ya sea de palabras u oraciones(aqu&#237; solo prestaremos atenci&#243;n a las palabras individuales), necesitamos un paso intermedio entre la carga del texto y la extracci&#243;n de los valores de sentimientos. As&#237;, vamos a dividir la cadena de caracteres en un listado de palabras o unigramas (<emph>tokens</emph>). Esto es algo muy habitual en el an&#225;lisis distante de textos.</p>
<p>Para esto utilizamos la funci&#243;n <code type="inline">get_tokens()</code> del paquete y generamos un nuevo objeto, en este caso un vector de unigramas. Como ver&#225;s, con esta funci&#243;n nos hemos deshecho de la puntuaci&#243;n en el texto y tenemos una lista de palabras.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_5" type="block" corresp="code_analisis-de-sentimientos-r_5.txt"></code></pre>
<p>Ahora podemos ver cu&#225;ntas palabras o <emph>tokens</emph> hay en este texto con la funci&#243;n <code type="inline">length()</code>:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_6" type="block" corresp="code_analisis-de-sentimientos-r_6.txt"></code></pre>
<p>Si quieres realizar el an&#225;lisis por oraciones, utiliza la funci&#243;n <code type="inline">get_sentences()</code> y sigue el mismo proceso excepto la creaci&#243;n de nube de palabras:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_7" type="block" corresp="code_analisis-de-sentimientos-r_7.txt"></code></pre>
</div><div type="3"><head>Extracci&#243;n de datos con el L&#233;xico de Sentimientos NRC</head>
<p>Ahora ya podemos ejecutar la funci&#243;n <code type="inline">get_nrc_sentiment</code> para obtener los sentimientos en la novela <emph>Miau</emph>. Ahora bien, puesto que la funci&#243;n ejecuta por defecto el vocabulario en ingl&#233;s, nosotros le indicamos con el argumento "lang" (de <emph>language</emph>) que utilice el vocabulario en espa&#241;ol ("spanish").  A su vez, creamos un nuevo objeto para almacenar los datos extraidos. Esto ser&#225; un objeto de tipo <emph>data frame</emph>.  Esta funci&#243;n busca la presencia de las ocho emociones y los dos sentimientos para cada palabra en nuestro vector, y asigna un n&#250;mero mayor a 0 en caso de existir. Dependiendo de las prestaciones de tu computadora y de acuerdo con las caracter&#237;sticas de nuestro texto, este proceso puede tardar entre 15 y 30 minutos.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_8" type="block" corresp="code_analisis-de-sentimientos-r_8.txt"></code></pre>
<p>Al terminarse de ejecutar el c&#243;digo, aparecer&#225; una advertencia debido a que <code type="inline">syuzhet</code> utiliza una funci&#243;n que est&#225; discontinuada dentro de su funci&#243;n <code type="inline">get_nrc_sentiment</code>.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_9" type="block" corresp="code_analisis-de-sentimientos-r_9.txt"></code></pre>
<p>Cuando el proceso termina, si lo deseas, puedes leer los resultados en el nuevo objeto simplemente seleccionando el objeto y ejecut&#225;ndolo. Pero para evitar "imprimir" miles de l&#237;neas en la consola, tambi&#233;n puedes usar la funci&#243;n <code type="inline">head()</code> para ver los primeros seis unigramas. En el caso del texto que estamos utilizando, al ejecutar dicha funci&#243;n deber&#237;as ver lo siguiente, lo cual no es nada interesante:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_10" type="block" corresp="code_analisis-de-sentimientos-r_10.txt"></code></pre>
</div><div type="3"><head>Resumen del texto</head>
<p>Lo que s&#237; es interesante, es ver un resumen de cada uno de los valores que hemos obtenido mediante la funci&#243;n general <code type="inline">summary()</code>. Esto puede ser muy &#250;til a la hora de comparar varios textos, pues te permite ver diferentes medidas, como es el caso de la media de los resultados de cada una de las emociones y los dos sentimientos. Por ejemplo, podemos ver que la novela <emph>Miau</emph> es, de <link target="https://es.wikipedia.org/wiki/Media_(matem%C3%A1ticas)">media</link> (<emph>mean</emph>), m&#225;s positiva (0.05153) que negativa (0.04658). Pero si nos fijamos, parece que en las emociones la tristeza (0.02564) aparece en m&#225;s momentos que la alegr&#237;a (0.01929). Como ves, varios de los valores proporcionados por la funci&#243;n de resumen del texto aparecen con un valor igual a 0, incluyendo <link target="https://es.wikipedia.org/wiki/Mediana_(estad%C3%ADstica)">la mediana</link> (<emph>median</emph>). Esto indica que en el diccionario que estamos utilizando (NRC) aparecen pocas de las palabras en la novela o, al rev&#233;s, que pocas de las palabras cuentan con una asignaci&#243;n de sentimiento o emoci&#243;n en el diccionario.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_11" type="block" corresp="code_analisis-de-sentimientos-r_11.txt"></code></pre>
<blockquote>
<p>&#161;Felicidades! Ya tienes los resultados del an&#225;lisis de sentimientos. Ahora, &#191;qu&#233; podemos hacer con estos n&#250;meros?</p>
</blockquote>
</div></div>
      <div type="2"><head>An&#225;lisis de las emociones de un texto</head>
<div type="3"><head>Gr&#225;fico de barras</head>
<p>Para ver cu&#225;les son las emociones con mayor presencia en el texto, lo m&#225;s simple es crear un gr&#225;fico de barras. Para ello utilizamos la funci&#243;n <code type="inline">barplot()</code> con el resumen de las columnas 1 a 8, es decir, las columnas de enfado (<emph>anger</emph>), anticipaci&#243;n (<emph>anticipation</emph>), disgusto (<emph>disgust</emph>), miedo (<emph>fear</emph>), alegr&#237;a (<emph>joy</emph>), tristeza (<emph>sadness</emph>), sorpresa (<emph>surprise</emph>) y confianza (<emph>trust</emph>). Los resultados obtenidos provienen del procesado que hace la funci&#243;n <code type="inline">prop.table()</code> con los resultados de las ocho columnas con cada una de las palabras en la tabla.</p>
<blockquote>
<p>Para cada barra se suman todos los valores de la columna de la emoci&#243;n correspondiente. A continuaci&#243;n, se suma el resultado de todas las emociones que a&#241;adamos en la salida del gr&#225;fico. Al final, se divide la suma de cada emoci&#243;n entre el total de todas las columnas o emociones. Esto no a&#241;ade las columnas de negativo y positivo. <ref type="footnotemark" target="#1"/></p>
</blockquote>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_12" type="block" corresp="code_analisis-de-sentimientos-r_12.txt"></code></pre>
<p>El resto de par&#225;metros que ves en el c&#243;digo son "extras", en tanto que son una forma de configurar el formato visual del gr&#225;fico. As&#237;, indicamos un espacio (<emph>space</emph>) de 0.2 entre las barras, que ir&#225;n en posici&#243;n vertical al indicar en falso (<emph>FALSE</emph>) su horizontalidad (<emph>horiz</emph>) y, al contrario, la horizontalidad para los valores en el eje Y con <code type="inline">las = 1</code>. Adem&#225;s, reducimos el tama&#241;o del nombre de cada barra (<emph>cex.names</emph>) a 0.7 para evitar que desaparezcan, por ejemplo, si hacemos un gr&#225;fico peque&#241;o. Gracias al paquete que hemos instalado al principio, <code type="inline">RColorBrewer</code>, podemos dar color a las columnas de forma autom&#225;tica, en este caso, con la paleta colores (<emph>brewer.pal</emph>) del set n&#250;mero 3 del paquete, con ocho colores, uno para cada columna. Finalmente, vamos a poner un t&#237;tulo y subt&#237;tulo a nuestro gr&#225;fico con los par&#225;metros <code type="inline">main</code>y <code type="inline">sub</code>, as&#237; como la palabra "emociones" en el eje X y nada en el Y.</p>
<img src="/images/analisis-de-sentimientos-r/miau_barplot.png" alt="Gr&#225;fico de barras con los valores de las seis emociones capturadas en Miau de P&#233;rez Gald&#243;s"/>
<p>Si no te interesan estos par&#225;metros, ser&#237;a suficiente ejecutar lo siguiente para obtener el gr&#225;fico por defecto:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_13" type="block" corresp="code_analisis-de-sentimientos-r_13.txt"></code></pre>
<blockquote>
<p>Aseg&#250;rate de tener suficiente espacio en el bloque de visualizaci&#243;n de gr&#225;ficos en R para poder ver los nombres de cada columna.</p>
</blockquote>
<p>Esta informaci&#243;n ya nos indica que las emociones de tristeza y miedo son m&#225;s prevalentes que la emoci&#243;n de asco o de sorpresa. Pero, &#191;qu&#233; palabras son utilizadas por Gald&#243;s en la expresi&#243;n de ese miedo? &#191;con qu&#233; frecuencia aparece cada una en el conjunto de la novela?</p>
</div><div type="3"><head>Recuento de palabras con cada emoci&#243;n</head>
<p>Para realizar un an&#225;lisis de texto, es muy interesante conocer qu&#233; palabras son usadas con mayor frecuencia en el texto en relaci&#243;n a su identidicaci&#243;n con cada emoci&#243;n. Para ello primero tenemos que crear un objecto de caracteres con todas las palabras que tengan un valor superior a 0 en la columna de "tristeza" (<emph>sadness</emph>). Para seleccionar solo esa columna usamos el s&#237;mbolo de d&#243;lar despu&#233;s del nombre del <emph>data frame:</emph></p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_14" type="block" corresp="code_analisis-de-sentimientos-r_14.txt"></code></pre>
<p>Como puedes observar por el contenido de <code type="inline">palabras_tristeza </code> este listado no nos dice mucho, pues solamente nos ofrece el listado de palabras sin mayor informaci&#243;n. Para obtener el recuento de veces que cada palabra relacionada con la tristeza aparece en la novela, generamos una tabla del primer conjunto de caracteres con las funciones <code type="inline">unlist</code> y <code type="inline">table</code>, que luego ordenamos en order decreciente (si se quiere un orden ascendiente cambiamos TRUE a FALSE); creamos un nuevo objeto de tipo tabla e imprimimos las 12 primeras palabras del listado con su frecuencia:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_15" type="block" corresp="code_analisis-de-sentimientos-r_15.txt"></code></pre>
<p>Si quisier&#225;mos conocer cu&#225;ntas palabras &#250;nicas han sido relacionadas con la tristeza, basta utilizar la funci&#243;n <code type="inline">length</code> sobre el objeto que ahora agrupa las palabras en orden:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_16" type="block" corresp="code_analisis-de-sentimientos-r_16.txt"></code></pre>
<p>Podemos repetir la misma operaci&#243;n con el resto de emociones o con la que nos interese, adem&#225;s de con los sentimientos positivos y negativos. Trata de obtener los resultados de la emoci&#243;n "alegr&#237;a" y compara los resultados.<ref type="footnotemark" target="#2"/></p>
<p>Dependiendo del tipo de an&#225;lisis que quieras hacer, dicho resultado es eficiente. Ahora, para el prop&#243;sito introductorio de la lecci&#243;n, vamos a generar una nube de palabras que ayuda a visualizar f&#225;cilmente los t&#233;rminos asociados con cada emoci&#243;n (aunque solo visualizaremos aqu&#237; cuatro para facilitar su lectura).</p>
</div><div type="3"><head>Nube de emociones</head>
<p>Para poder crear una nube con las palabras que corresponden a cada emoci&#243;n en <emph>Miau</emph> vamos a crear primero un vector en el que se guardan todas la palabras que, en las columnas que indicamos tras el s&#237;mbolo <code type="inline">$</code> tienen un valor mayor a 0. Se genera un nuevo objeto de tipo vector, que contiene un elemento para el listado de cada emoci&#243;n.</p>
<p>En este caso debemos indicar de nuevo a la funci&#243;n que tenemos caracteres acentuados si se trata de una m&#225;quina Windows.</p>
<p><hi rend="bold">En Mac y Linux</hi></p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_17" type="block" corresp="code_analisis-de-sentimientos-r_17.txt"></code></pre>
<p><hi rend="bold">En Windows</hi></p>
<p>Una vez generado el vector, debes convertirlo (<code type="inline">iconv</code>) en caracteres en UTF-8.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_18" type="block" corresp="code_analisis-de-sentimientos-r_18.txt"></code></pre>
<p>Una vez que tenemos el vector creamos un corpus de palabras con cuatro "documentos" para la nube:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_19" type="block" corresp="code_analisis-de-sentimientos-r_19.txt"></code></pre>
<p>A continuaci&#243;n, transformamos dicho corpus en una matriz t&#233;rmino-documento con la funci&#243;n <code type="inline">TermDocumentMatrix()</code>. Con ello, utilizamos ahora la funci&#243;n <code type="inline">as.matrix()</code> para convertir el TDM a una matriz que, como podemos ver, cuenta con el listado de los t&#233;rminos del texto con un valor mayor a cero para cada una de las cuatro emociones que aqu&#237; hemos extra&#237;do. Para ver el inicio de esta informaci&#243;n vuelve a utilizar la funci&#243;n <code type="inline">head</code>:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_20" type="block" corresp="code_analisis-de-sentimientos-r_20.txt"></code></pre>
<p>Ahora, asigna un nombre a cada uno de los grupos de palabras o documentos (<emph>Docs</emph>) en nuestra matriz. Aqu&#237; vamos a utilizar el t&#233;rmino en espa&#241;ol para las columnas que hemos seleccionado para visualizar en la nube. De nuevo, puedes ver el cambio realizado al ejecutar la funci&#243;n <code type="inline">head</code>.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_21" type="block" corresp="code_analisis-de-sentimientos-r_21.txt"></code></pre>
<p>Finalmente, podemos visualizar la nube de palabras a la que ya estamos acostumbrados a ver en los medios o en estudios acad&#233;micos. El tama&#241;o y localizaci&#243;n de la palabra corresponde a su mayor o menor aparici&#243;n con valor de emoci&#243;n asignado en el texto. Primero ejecutamos la funci&#243;n <code type="inline">set.seed()</code> para que al reproducir el resultado visual sea igual al nuestro (si no lo haces, saldr&#225; lo mismo pero aparecer&#225;n las palabras en diferentes posiciones). Y para generar la nube, vamos a utilizar la funci&#243;n <code type="inline">comparison.cloud</code> del paquete <code type="inline">wordcloud</code>. Se&#241;alamos el objeto a representar, aqu&#237; 'nube_tdm', indicamos un orden no aleatorio de las palabras, asignamos un color para cada grupo de palabras y damos tama&#241;os al t&#237;tulo, la escala general y asignamos un n&#250;mero m&#225;ximo de t&#233;rminos que ser&#225;n visualizados.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_22" type="block" corresp="code_analisis-de-sentimientos-r_22.txt"></code></pre>
<p>Deber&#237;as obtener una imagen similar a la siguiente, aunque con la localizaci&#243;n de las palabras alterada pues se genera seg&#250;n el tama&#241;o del canvas o lienzo.</p>
<img src="/images/analisis-de-sentimientos-r/miau_nube_emociones.png" alt="Nube de las palabras m&#225;s frecuentes correspondientes a las emociones de tristeza, felicidad, enfado y confianza en la novela Miau de P&#233;rez Gald&#243;s"/>
<p>&#191;Qu&#233; te sugiere el resultado de esta nube? Seguramente te llamar&#225; la atenci&#243;n la aparici&#243;n del adverbio "muy" en el conjunto de tristeza o el sustantivo "dinero" en el conjunto de enfado. Este "sinsentido" est&#225; relacionado con la advertencia ya anunciada al comienzo de la lecci&#243;n. El vocabulario para el an&#225;lisis de sentimientos que estamos utilizando aqu&#237; est&#225; traducido del ingl&#233;s mediante un traductor autom&#225;tico y no es "perfecto".</p>
</div></div>
      <div type="2"><head>Visualizar la evoluci&#243;n de sentimientos en el texto</head>
<p>Para complementar la lectura aislada de las emociones mediante el estudio de la fluctuaci&#243;n de los sentimientos positivos y negativos a lo largo de un texto, existe una manera de normalizar y visualizar dicha informaci&#243;n. Puesto que el an&#225;lisis de la funci&#243;n de extracci&#243;n de los sentimientos asigna un valor positivo tanto al sentimiento positivo como al negativo, necesitamos generar datos entre un rango de -1 para el momento m&#225;s negativo y 1 para el m&#225;s positivo, y donde 0 sea neutral. Para ello calculamos la valencia del texto multiplicando los valores de la columna de valores negativos de nuestro <emph>data frame</emph>, con los resultados por -1 y sumamos el valor de la columna de valores positivos.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_23" type="block" corresp="code_analisis-de-sentimientos-r_23.txt"></code></pre>
<p>Finalmente, podemos generar un gr&#225;fico con la funci&#243;n <code type="inline">simple_plot()</code> integrada en el paquete <code type="inline">syuzhet</code> que nos ofrecer&#225; dos im&#225;genes diferentes; la primera tiene todas las medidas que el algoritmo calcula y la segunda es una normalizaci&#243;n de las mismas. El eje horizontal presenta el texto en 100 fragmentos normalizados y el eje vertical nos informa de la valencia del sentimiento en el texto. Dependiendo de las caracter&#237;sticas de tu computadora, este gr&#225;fico puede tomar hasta 20-30 minutos en generarse.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_24" type="block" corresp="code_analisis-de-sentimientos-r_24.txt"></code></pre>
<blockquote>
<p>Aseg&#250;rate de tener suficiente espacio en el bloque de visualizaci&#243;n de gr&#225;ficos en R para que se genere el gr&#225;fico. De no hacerlo, ver&#225;s el error: Error in plot.new() : figure margins too large</p>
</blockquote>
<img src="/images/analisis-de-sentimientos-r/miau_sentimientos.png" alt="Evoluci&#243;n de las emociones a lo largo del texto"/>
<p>As&#237;, en este caso podemos interpretar que la novela <emph>Miau</emph> comienza de forma neutral, contin&#250;a con algunos momentos alegres durante la primera parte, nos encontramos con situaciones negativas en el resto de la novela, y finaliza de manera negativa, tal como lo indica la oraci&#243;n que utilizamos al comienzo de la lecci&#243;n. Cualquiera que haya le&#237;do la novela puede corroborar esta sensaci&#243;n de desesperaci&#243;n por parte del protagonista.</p>
<div type="3"><head>Guarda tus datos</head>
<p>Si quieres guardar los datos para volver a ellos m&#225;s adelante, puedes hacerlo en un archivo de valores separados por comas (CSV) con la funci&#243;n <code type="inline">write.csv()</code>. Aqu&#237; le indicamos que debe guardar el <emph>data frame</emph>, que contiene el resultado de las ocho emociones y los dos sentimientos del texto en un archivo con extensi&#243;n <code type="inline">.csv</code>. Adem&#225;s, podemos a&#241;adir la palabra a la que corresponde cada fila de resultados, en una columna a la izquierda utilizando el vector de palabras realizado al comienzo del an&#225;lisis.</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_25" type="block" corresp="code_analisis-de-sentimientos-r_25.txt"></code></pre>
<p>&#161;Ahora ya puedes empezar a analizar tus propios textos y compararlos entre ellos!</p>
</div></div>
      <div type="2"><head>Otras funcionalidades y sus limitaciones</head>
<p>A lo mejor est&#225;s trabajando en un proyecto en el que, tal vez ya tienes un diccionario de sentimientos creado, o bien, te es necesario personalizar el vocabulario y su valencia sentimental por motivos de cultura o temporalidad, o quiz&#225;s buscas mejorar los resultados traducidos autom&#225;ticamente del NRC aqu&#237; utilizado. En cualquiera de estos casos, desde finales de 2020 tambi&#233;n puedes cargar tu propio conjunto de datos en el <emph>script</emph> gracias a la funci&#243;n <code type="inline">custom</code> y realizar algunas de las operaciones que has aprendido en esta lecci&#243;n.</p>
<p>Para cargar tu propio "diccionario de sentimientos" tienes que, primero, crear (o modificar) un dataframe que contenga, como m&#237;nimo, una columna para las palabras y otra para su valencia, por ejemplo:</p>
<table>
<thead>
<tr>
<th>word</th>
<th>value</th>
</tr>
</thead>
<tbody>
<tr>
<td>amor</td>
<td>1</td>
</tr>
<tr>
<td>c&#243;lera</td>
<td>-1</td>
</tr>
<tr>
<td>alfombra</td>
<td>0</td>
</tr>
<tr>
<td>cat&#225;strofe</td>
<td>-2</td>
</tr>
</tbody></table><p>A continuaci&#243;n, carga tus datos guardados como CSV con la funci&#243;n <code type="inline">read.csv</code>, lo que crear&#225; un nuevo conjunto disponible como <code type="inline">"data.frame"</code>, sobre el que ahora podr&#225;s contrastar tu texto:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_26" type="block" corresp="code_analisis-de-sentimientos-r_26.txt"></code></pre>
<p>Si quieres visualizar el progreso de los sentimientos a lo largo de tu texto, puedes utilizar la funci&#243;n <code type="inline">plot</code> con otros par&#225;metros que ya has aprendido:</p>
<pre><code class="language-R" xml:id="code_analisis-de-sentimientos-r_27" type="block" corresp="code_analisis-de-sentimientos-r_27.txt"></code></pre>
<p>Ahora bien, ten en cuenta que esta forma de an&#225;lisis se ver&#225; limitada y no podr&#225;s realizar las mismas operaciones que explicamos m&#225;s arriba. Por ejemplo, siguiendo el modelo del ejemplo, no tendr&#237;as informaci&#243;n de las emociones, por lo que no podr&#225;s hacer una nube de palabras.</p>
</div>
      <div type="2"><head>Referencias</head>
<p>Jockers, Matthew L. <emph>Syuzhet: Extract Sentiment and Plot Arcs from Text</emph>, 2015. <link target="https://github.com/mjockers/syuzhet">https://github.com/mjockers/syuzhet</link></p>
<p>Jockers, Matthew L. "Introduction to the Syuzhet Package", CRAN R Project, 2017. <link target="https://mran.microsoft.com/snapshot/2017-12-31/web/packages/syuzhet/vignettes/syuzhet-vignette.html">https://mran.microsoft.com/snapshot/2017-12-31/web/packages/syuzhet/vignettes/syuzhet-vignette.html</link></p>
<p>Damasio, Antonio R. <emph>El error de Descartes: La raz&#243;n de las emociones</emph>. Barcelona: Andres Bello, 1999.</p>
<p>Mohammad, Saif, and Peter D. Turney. "Crowdsourcing a Word&#8211;Emotion Association Lexicon". <emph>Computational intelligence</emph> 29 (2013): 436-465, doi: 10.1111/j.1467-8640.2012.00460.x</p>
<p>P&#233;rez Gald&#243;s, Benito. <emph>Miau</emph>. Madrid: Sucesores de Hernando, 1907.  </p>
<p>Pereira Zazo, &#211;scar. <emph>El analisis de la comunicaci&#243;n en espa&#241;ol</emph>. Iowa: Kendal Hunt, 2015.</p>
<p>Rodr&#237;guez Aldape, Fernando Manuel. <emph>Cuantificaci&#243;n del Inter&#233;s de un usuario en un tema mediante miner&#237;a de texto y an&#225;lisis de sentimiento.</emph> Tesis de maestr&#237;a, Universidad Aut&#243;noma de Nuevo Le&#243;n, 2013.</p>
</div>
      <div type="2"><head>Notas</head>
<p><note id="1">Gracias a Mounika Puligurthi, estudiante en pr&#225;cticas en la oficina de Digital Scholarship de la Universidad de Texas (UT) (durante la primavera de 2019), por su ayuda a comprender este c&#225;lculo.</note>
<note id="2">Hay m&#225;s palabras asignadas a la emoci&#243;n de tristeza que de alegr&#237;a tanto en n&#250;mero de palabras totales (2061 frente a 1552) como a palabras &#250;nicas (349 frente a 263). F&#237;jate que la palabra "madre" aparece en ambas emociones con un valor de 33 puntos en ambos casos, &#191;qu&#233; crees que esto puede significar?</note></p>
</div>
    </body>
  </text>
</TEI>
