<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Editar audio con Audacity</title>
  <authors>Brandon Walsh</authors>
  <date>2016-08-05</date>
  <translation_date>2017-09-27</translation_date>
  <reviewers>Joanna Swafford,Celeste T&#432;&#7901;ng Vy Sharpe</reviewers>
  <editors>Jeri Wieringa</editors>
  <translator>Jos&#233; Antonio Motilla</translator>
  <translation-editor>Antonio Rojas Castro</translation-editor>
  <translation-reviewer>Jairo A. Melo,V&#237;ctor Gayol</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/134</review-ticket>
  <layout>lesson</layout>
  <original>editing-audio-with-audacity</original>
  <difficulty>1</difficulty>
  <activity>transforming</activity>
  <topics>data-manipulation</topics>
  <abstract>Con esta lecci&#243;n aprender&#225;s a utilizar Audacity para cargar, editar, mezclar y exportar archivos de audio.</abstract>
  <avatar_alt>Grabado de un fon&#243;grafo y un gram&#243;fono.</avatar_alt>
  <doi>10.46430/phes0007</doi>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Objetivos del m&#243;dulo</head>
<p>Para aquellos interesados en audio, las habilidades b&#225;sicas de edici&#243;n de sonido les ser&#225;n de mucha ayuda. Ser capaz de manipular los materiales puede ayudarte a dominar tu objeto de estudio: puedes ampliar y extraer momentos espec&#237;ficos para analizar, procesar el audio, y subir los materiales a un servidor para complementar la entrada de un blog en la materia. En un nivel m&#225;s pr&#225;ctico, estas habilidades te permitir&#225;n grabar y comprimir grabaciones, tuyas o de otros, para su distribuci&#243;n.  &#191;Esa conferencia de un profesor invitado a tu facultad? &#161;Gr&#225;bala y ed&#237;tala t&#250; mismo! Hacerlo as&#237; es una forma sencilla de distribuir recursos entre varias instituciones, y tambi&#233;n ayuda a hacer los materiales m&#225;s accesibles pera lectores y escuchas con una amplia variedad de necesidades de aprendizaje.</p>
<p>En esta lecci&#243;n aprender&#225;s a utilizar <link target="http://www.audacityteam.org/">Audacity</link> para cargar, grabar, editar, mezclar y exportar archivos de audio. Con frecuencia, las plataformas de edici&#243;n de audio son costosas y ofrecen numerosas funciones que pueden ser abrumadoras para el usuario que no tiene experiencia previa, al contrario, <emph>Audacity</emph> es una alternativa gratuita y de c&#243;digo abierto que ofrece gran funcionalidad y f&#225;cil acceso para editar archivos de audio.</p>
<p>Para esta lecci&#243;n vamos a trabajar con dos archivos de audio: una grabaci&#243;n de las <link target="/assets/editing-audio-with-audacity/bach-goldberg-variations.mp3">Variaciones Goldberg de Bach</link>, y otra grabaci&#243;n de tu propia voz que se har&#225; en el transcurso de la lecci&#243;n.</p>
<p>&#201;ste tutorial utiliza <emph>Audacity</emph> 2.1.2, lanzado en enero de 2016.</p>
</div>
      <div type="2"><head>Trabajar con Audacity</head>
<p>Primero, descarga los archivos necesarios.</p>
<p>Vas a necesitar el <link target="/assets/editing-audio-with-audacity/bach-goldberg-variations.mp3">archivo en .mp3 de las Variaciones Goldberg de Bach</link>. Para descargarlo, haz click con el bot&#243;n derecho <link target="/assets/editing-audio-with-audacity/bach-goldberg-variations.mp3">aqu&#237;</link> y selecciona "guardar como" para guardar el archivo en tu computadora como un MP3.</p>
<p>A continuaci&#243;n, descarga e instala <emph>Audacity</emph>, que est&#225; disponible en el <link target="http://www.audacityteam.org/">sitio del proyecto</link>. <emph>Audacity</emph> puede utilizarse en Mac OSX, Windows o Linux.</p>
<p>Descarga el programa y haz doble clic para instalar.</p>
<p>Para empezar, abre la grabaci&#243;n de Bach que reci&#233;n descargaste usando el men&#250; de archivo de <emph>Audacity</emph>.</p>
<p>La interfaz cargar&#225; y mostrar&#225; los archivos cargados:</p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-1.png" alt="Diagrama de onda de audio de Bach en Audacity"/></p>
<p><emph>Audacity</emph> convierte el sonido en un diagrama de onda, una forma frecuentemente utilizada para representar sonido. El eje horizontal representa el tiempo en forma de segundos (o minutos y segundos, dependiendo de la extensi&#243;n del clip). El inicio del sonido se visualiza del lado izquierdo de la interfaz y <emph>Audacity</emph> coloca marcadores a lo largo de la onda hacia la derecha. Si damos clic en el bot&#243;n de reproducir <emph>Audacity</emph> se mover&#225; sobre el sonido de izquierda a derecha, entre tanto una l&#237;nea vertical representar&#225; nuestra posici&#243;n en el clip de audio.</p>
<p>El eje vertical representa la amplitud, que experimentamos como intensidad sonora o volumen. De manera predeterminada, el eje vertical mide el volumen en una regla vertical de -1 a 1: los extremos de -1 y 1 representan la intensidad sonora posible de la grabaci&#243;n sin distorsi&#243;n, mientras que 0 representa silencio. As&#237;, el silencio comienza como una l&#237;nea plana desde la cual el sonido ser&#225; m&#225;s alto y m&#225;s profundo a medida que aumente su intensidad. Para mayor informaci&#243;n acerca del porqu&#233; algunos de los n&#250;meros son negativos, revisa la <link target="http://web.archive.org/web/20161119231053/http://www.indiana.edu:80/~emusic/acoustics/amplitude.htm"><hi rend="bold">introducci&#243;n a la ac&#250;stica</hi></link> de Jeffrey Hass (en ingl&#233;s).</p>
<p>La representaci&#243;n de tiempo y amplitud de <emph>Audacity</emph> es tu primer y m&#225;s f&#225;cil punto de referencia para la edici&#243;n de sonido, y la herramienta facilita la navegaci&#243;n por el mismo. Sigo llam&#225;ndole a esto una onda, pero a&#250;n no se parece mucho a una. Vamos a echar un vistazo m&#225;s de cerca al seleccionar una parte de la pieza de audio.</p>
<ul>
<li>Haz clic en alg&#250;n lugar de la onda para seleccionarla.</li>
<li>Arrastra para resaltar una parte de la onda (funciona en cualquier parte con sonido). Si no est&#225;s satisfecho con la selecci&#243;n, puedes arrastrar las orillas de tu selecci&#243;n para ajustar los l&#237;mites.</li>
<li>Una vez que est&#233;s conforme con la pieza de audio, selecciona &#8220;Ampliar&#8221; en el men&#250; &#8220;Ver&#8221;.</li>
</ul>
<p>Si ampl&#237;as seis o siete veces, ver&#225;s algo que puede parecerse m&#225;s a una onda:</p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-2.png" alt="Vista amplificada del diagrama de Bach"/></p>
<p>Observa que el incremento de tiempo en <emph>Audacity</emph> se ajusta conforme amplas la selecci&#243;n. Las frecuencias de tono se miden en ondas por segundo, y el programa tiene que fusionar las partes para lograr que el clip de sonido encaje en una ventana. El resultado es una forma de onda que nosotros vemos cuando reducimos la selecci&#243;n, al seleccionar &#8220;Normal&#8221;, desde el men&#250; Ver. Cada vista &#8211;la micro y la macro- tiene sus usos particulares. Volveremos a ellas m&#225;s adelante.</p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-3.png" alt="Paleta de reproducci&#243;n de Audacity"/></p>
<p>Antes de proceder, vale la pena observar las diversas paletas que proporciona <emph>Audacity</emph> para sus funciones m&#225;s comunes. La paleta de reproducci&#243;n ofrece s&#237;mbolos que seguramente son familiares: los botones que te permiten pausar, reproducir, detener, avanzar al principio o al final de un clip, y grabar.</p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-4.png" alt="Paleta de herramientas de Audacity"/></p>
<p>Por otro lado, la paleta de herramientas probablemente parece nueva. No discutiremos todas las funciones que ofrece <emph>Audacity</emph>, as&#237; que no usaremos algunos de estos botones. Pero toma nota: las herramientas de &#8220;selecci&#243;n&#8221; superior izquierda y el &#8220;cambio de tiempo&#8221;, inferior medio, ser&#225;n las dos que usaremos en esta lecci&#243;n. De forma predeterminada, cuando abres <emph>Audacity</emph>, tu estar&#225;s utilizando la herramienta de selecci&#243;n.</p>
</div>
      <div type="2"><head>Grabar audio</head>
<p>Hemos cargado la introducci&#243;n musical para nuestro podcast. Continuemos grabando nuestra propia voz.</p>
<ul>
<li>
<p>De forma predeterminada, <emph>Audacity</emph> reproducir&#225; y volver&#225; a grabar tu pista original cuando intentes grabar una nueva. Para evitar esto, puedes silenciar temporalmente la pista de Bach cuando grabes tu voz. Para silenciar la pista, da clic en el bot&#243;n &#8220;Silencio&#8221;, a la izquierda de la forma de onda de Bach. La pista de Bach se volver&#225; gris para mostrar que no se est&#225; reproduciendo.</p>
</li>
<li>
<p>Para empezar a grabar en <emph>Audacity</emph>, presiona el c&#237;rculo rojo en la parte superior izquierda de la venta de <emph>Audacity</emph>. No te preocupes demasiado en conseguir la calidad adecuada; a continuaci&#243;n, trabajaremos en la edici&#243;n del archivo sonoro.</p>
</li>
<li>
<p>Haz tu mejor voz de radio-locutor en direcci&#243;n de tu computadora, y cuando est&#233;s listo, da clic en el rect&#225;ngulo para detener la grabaci&#243;n.</p>
</li>
</ul>
<p>Se mostrar&#225; algo parecido a esto:</p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-5.png" alt="Dos pistas cargadas en Audacity"/></p>
<p>Nuestra grabaci&#243;n original de &#8220;Bach&#8221; se mantiene en la parte superior de la interface, mientras que nuestra nueva grabaci&#243;n est&#225; por debajo de ella. De forma predeterminada, <emph>Audacity</emph> no sobreescribir&#225; una grabaci&#243;n anterior. Por el contrario, a&#237;sla ambos sonidos o pistas, permiti&#233;ndonos manipular componentes separados antes de mezclarlos en una grabaci&#243;n final. Podemos hacer cambios a uno sin afectar al otro. Observa c&#243;mo, con respecto al tiempo, la nueva pista se grab&#243; de manera predeterminada al principio del proyecto de Audacity. Por ahora, las pistas de &#8220;Bach&#8221; y la vocal comienzan al mismo tiempo. Existen otras imperfecciones potenciales en tu grabaci&#243;n &#250;nica, algunas de las cuales podemos corregir.</p>
<p>Finalmente, observa c&#243;mo en mi ejemplo existen dos formas de onda para la grabaci&#243;n de Bach, pero solo una para la grabaci&#243;n de mi voz. La grabaci&#243;n de Bach fue hecha en est&#233;reo, lo que significa que hab&#237;a dos canales de entrada, mientras que la grabaci&#243;n de mi voz fue hecha en <emph>monoauraL</emph>. <emph>Audacity</emph> permite grabar en ambos, y cualquiera de las dos funcionar&#225; para esta lecci&#243;n, as&#237; que no te preocupes si tu grabaci&#243;n aparece en est&#233;reo. Puedes cambiar de mono a est&#233;reo y viceversa desde &#8220;Editar&#8221;, disponible en la secci&#243;n &#8220;Barra de herramientas&#8221; del men&#250; &#8220;ver&#8221;. Para m&#225;s informaci&#243;n sobre mono contra est&#233;reo, revista esta <link target="http://www.diffen.com/difference/Mono_vs_Stereo/"><emph>lectura</emph></link> (en ingl&#233;s).</p>
<p>Aparte: a menudo puede ser de utilidad convertir la salida de sonido de tu laptop en entrada, para que puedas grabar los sonidos que se reproducen en tu computadora sin preocuparte del ruido externo o volver a grabar audio digital. Para obtener informaci&#243;n sobre c&#243;mo llevar a cabo &#233;ste proceso, consulta <link target="https://github.com/mattingalls/Soundflower/"><emph>Soundflower</emph></link>.</p>
</div>
      <div type="2"><head>Editar audio</head>
<p>El tema de la ingenier&#237;a de audio es amplio y puede ser parte de una larga y fruct&#237;fera carrera &#8211;no esperamos agotar todos los t&#243;picos potenciales en este tutorial&#8211;, pero podemos ofrecer s&#243;lo algunas t&#233;cnicas b&#225;sicas &#250;tiles para trabajar con audio digital. Sus experiencias pueden variar en funci&#243;n del car&#225;cter &#250;nico de su propia grabaci&#243;n.</p>
<p>Para utilizar la pista grabada, vamos a necesitar limpiarla un poco, aislar y refinar las piezas que queremos. Nuestro primer paso consistir&#225; en remover el silencio no deseado creado durante el retraso entre el comienzo de la grabaci&#243;n y cuando comenc&#233; a hablar.</p>
<ul>
<li>Ampliar el comienzo de la pista nos dar&#225; una vista del silencio, y al hacer clic y arrastrar las secciones del diagrama de ondas, podemos eliminarlos al pulsar la tecla suprimir (en la mayor&#237;a de los teclados).</li>
</ul>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-6.png" alt="Principio de la pista vocal, listo para ser eliminado"/></p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-7.png" alt="Principio de la pista despu&#233;s de haber eliminado el silencio"/></p>
<p>Esas peque&#241;as pausas pueden pasar pr&#225;cticamente inadvertidas, pero son elementos importantes dentro de cualquier pista de audio,adem&#225;s, queremos que los l&#237;mites de la nueva pista vocal no contengan datos extra&#241;os. Despu&#233;s de eliminar, debes de tener un clip de audio agradable y compacto, con tan solo una peque&#241;a fracci&#243;n de silencio en cada extremo.</p>
<p>Para asegurar transiciones suaves entre las pistas, debemos introducir efectos de fundido o transiciones graduales en amplitud. Es  buena idea incluir un peque&#241;o fundido de entrada (fade in) al comienzo de la pista y un fundido de salida (fade out) al final que lleve al silencio. Hacerlo puede prevenir fallos y ruidos al evitar que el sonido aparezca y desaparezca s&#250;bitamente.</p>
<ul>
<li>Amplifica el principio de la pista, resalta el inicio de la onda, incluyendo s&#243;lo una fracci&#243;n del sonido de destino, y selecciona &#8220;Aparecer progresivamente&#8221; del men&#250; &#8220;Efecto&#8221;.</li>
</ul>
<p>Si s&#243;lo seleccionaste una peque&#241;a porci&#243;n de audio, es posible que no puedas ver los cambios que causaron los desvanecimientos. Estas capturas de gran aumento ayudar&#225;n:</p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-8.png" alt="Pista antes del desvanecimiento inicial"/></p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-9.png" alt="Pista despu&#233;s del desvanecimiento inicial"/></p>
<p>El fundido de entrada disminuy&#243; dram&#225;ticamente la amplitud inicial e introdujo cambios graduales de amplitud a lo largo de las secciones destacadas de la pista, suavizando y creando la percepci&#243;n de un incremento en el volumen.</p>
<ul>
<li>Repite esto al final de la pista, pero ahora con &#8220;desvanecer progresivamente&#8221;</li>
</ul>
<p>Tu pista estar&#225; configurada para ser insertada suavemente en cualquier parte del archivo.</p>
<p>La eliminaci&#243;n del silencio y del sonido no deseado prepar&#243; el clip, pero a&#250;n tenemos que moverlo hacia la marca de tiempo que queremos. Queremos ubicarlo en la parte apropiada del podcast, despu&#233;s de que la m&#250;sica introductoria se haya reproducido un poco. Para mover una pista horizontalmente en el eje de las X del diagrama de onda y re-asignarle una nueva posici&#243;n en el tiempo, usa la herramienta de cambio de tiempo. Con esta herramienta seleccionada, al hacer clic en una pista de sonido te permite moverla horizontalmente en el tiempo, en relaci&#243;n con las otras pistas.</p>
<ul>
<li>Mueve nuestro clip vocal hacia la derecha, para que comience despu&#233;s de que la m&#250;sica introductoria se haya reproducido durante algunos segundos.</li>
</ul>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-10.png" alt="Reposicionamiento del clip de audio en el tiempo"/></p>
<p>Si el volumen de tu voz, en relaci&#243;n con la m&#250;sica introductoria, te parece desequilibrado, puedes reorganizarlos para que est&#233;n m&#225;s equilibrados. El volumen de una pista en particular se puede ajustar utilizando el control deslizante de volumen de la pista, ubicado a la izquierda del panel de la pista. &#201;ste parece una peque&#241;a escala -/+:</p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-11.png" alt="Barra de desplazamiento de volumen"/></p>
<p>Pero eventualmente vamos a querer cambiar el enfoque de la pista por completo de la m&#250;sica de introducci&#243;n y dar nuevo &#233;nfasis a la grabaci&#243;n de nuestra voz. Un &#8220;<emph>crossfade</emph>&#8221; como este, es f&#225;cil de realizar en <emph>Audacity</emph>.</p>
<ul>
<li>
<p>Primero, elimina los cinco segundos iniciales de la introducci&#243;n de Bach. Sit&#250;a el cursor en el lugar de la pista donde deseas comenzar a borrar y despu&#233;s presione &#8220;Control +Shift+ K&#8221; o selecciona en el men&#250; &#8220;Editar&#8221;, &#8220;Seleccionar/Desde el cursor hasta el final&#8221;. Esto seleccionar&#225; todo desde la ubicaci&#243;n del cursor hasta el final de la pista.</p>
</li>
<li>
<p>Alinea lo que queda con tu pista de voz usando la barra de desplazamiento de control de tiempo, para que las dos pistas se sobrepongan ligeramente.</p>
</li>
<li>
<p>Despu&#233;s usa la herramienta de selecci&#243;n para hacer clic y arrastrar la secci&#243;n en la que se sobrepondr&#225;n, comenzando con la pista superior y terminando con la inferior. Ambas pistas deben de estar destacadas.</p>
</li>
</ul>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-12.png" alt="Resaltado sobre las pistas para la transici&#243;n"/></p>
<ul>
<li>Seleccionar &#8220;Crossfade Tracks&#8221;, del men&#250; Efecto, esto le indicar&#225; a Audacity que realice el desvanecimiento de salida de la pista superior mientras hace el desvanecimiento de entrada de la pista inferior; en este caso, el posicionamiento de las pistas es importante.</li>
</ul>
<p><emph>Audacity</emph> te ofrecer&#225; opciones para el <emph>crossfade</emph> de la pista, pero por ahora est&#225; bien mantener la configuraci&#243;n preestablecida en &#8220;Fade type:constant gain&#8221;. &#201;sta configuraci&#243;n garantiza que ambas pistas se desvanecer&#225;n o alinear&#225;n (para mayor informaci&#243;n, revisa la documentaci&#243;n de <emph><link target="http://manual.audacityteam.org/man/crossfade_clips.html">"crossfades&#8221; de Audacity</link></emph></p>
<p><img src="/images/editing-audio-with-audacity/editing-audio-with-audacity-13.png" alt="Post-crossfade"/></p>
<p>Cuando el producto final est&#225; mezclado, el resultado ser&#225; una transici&#243;n fluida entre los dos elementos.</p>
</div>
      <div type="2"><head>Exportar</head>
<p>De forma predeterminada, todo lo que hagas en <emph>Audacity</emph> es guardado en el formato de archivo propio de la herramienta, ".aup" . Para completar este peque&#241;o proyecto, necesitamos exportarlo a un formato que pueda ser reproducido por la mayor&#237;a de los programas de audio.</p>
<ul>
<li>Selecciona &#8220;Exportar audio&#8221; del men&#250; archivo.</li>
</ul>
<p>Al hacer esto, mezclar&#225;s las m&#250;ltiples pistas en un solo archivo de audio, y te dar&#225; la oportunidad de proporcionar metadatos a tu trabajo.</p>
<p>Existe un rango de diferentes opciones para refinar el proceso de exportaci&#243;n, pero el m&#225;s importante es &#8220;tipo de archivo&#8221;. MP3 y Ogg son buenas opciones para el audio destinado a ser mostrado en la web, ya que ambos comprimen los archivos para que sean r&#225;pidos de cargar. Para mejores resultados, puedes incluir ambos formatos y s&#243;lo mostrar uno como una alternativa cuando alguno no sea compatible con el navegador web del usuario.  Para mayor informaci&#243;n, <emph>NCH Software</emph> ofrece un <link target="http://www.nch.com.au/acm/formats.html">buen desglose t&#233;cnico para sus diferentes opciones</link>, mientras que Jonathan Sterne ha hecho un <link target="https://www.dukeupress.edu/MP3/">trabajo fascinante</link> sobre las implicaciones culturales de tales decisiones de formato. Y la W3Schools ofrece una <link target="https://www.w3schools.com/html/html5_audio.asp">buena comparaci&#243;n</link> de estos formatos usados en el desarrollo web.</p>
<p>&#161;Felicidades! Has producido exitosamente un peque&#241;o podcast. Puede que no parezca mucho, pero con frecuencia yo uso estas mismas recomendaciones para presentaciones, sitios web y cuestiones acad&#233;micas. De ninguna manera esta lecci&#243;n pretende agotar los m&#250;ltiples temas al respecto, pero debe haberte proporcionado algunas herramientas b&#225;sicas para trabajar con sonido en proyectos de humanidades digitales.</p>
</div>
    </body>
  </text>
</TEI>
