<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="criar-exposicao-omeka">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Criar uma Exposi&#231;&#227;o Omeka</title>
  <author type="original_author"><persName>Miriam Posner</persName><persName>Megan R. Brett</persName></author><editor type="reviewers">Sheila Brennan</editor><author type="translators">Gabriela Kucuruza</author><editor type="translation-reviewers"><persName>Danielle Sanches</persName><persName>Joana Vieira Paulino</persName></editor><editor type="editors">Adam Crymble</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0012</idno><date type="published">02/24/2016</date><date type="translated">07/02/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#creating-an-omeka-exhibit"/>.</p><p>There are other translations: <ref target="#crear-exposicion-con-omeka"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Agora que n&#243;s adicionamos itens no seu site do Omeka e agrupamos os itens em cole&#231;&#245;es, estamos prontos para o pr&#243;ximo passo: levar os seus usu&#225;rios a explorar os itens recolhidos.</p></abstract><textClass><keyword xml:lang="en">website</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body><p>Agora que <link target="/en/lessons/up-and-running-with-omeka">adicionamos itens no seu site do Omeka</link> (em ingl&#234;s) e agrupamos os itens em cole&#231;&#245;es, estamos prontos para o pr&#243;ximo passo: levar os seus usu&#225;rios a explorar os itens recolhidos. </p>
<div type="2"><head>Antes de come&#231;ar: mapeie a sua exposi&#231;&#227;o</head>
<p>&#201; importante pensar na exposi&#231;&#227;o antes de come&#231;ar a cri&#225;-la. Como iremos criar se&#231;&#245;es e p&#225;ginas, &#233; necess&#225;rio planejar os argumentos que queremos fazer, e como pretendemos faz&#234;-los. Na presente li&#231;&#227;o, usei o exemplo dos meus cachorros. Mas e se eu estivesse discutindo, por exemplo, filmes mudos? As minhas se&#231;&#245;es poderiam ser tem&#225;ticas (com&#233;dias, romances, dramas), cronol&#243;gicas (primeiros filmes do cinema mudo, per&#237;odo transicional, era cl&#225;ssica) ou estil&#237;sticas (modernista, impressionista, narrativa). Tudo depende da mensagem que eu quero transmitir para quem visitar o site. Podemos fazer um esquema da exposi&#231;&#227;o, mostrando onde queremos colocar cada recurso digital. </p>
</div><div type="2"><head>Adicionar uma exposi&#231;&#227;o</head>
<figure><desc>Criar uma p&#225;gina de exposi&#231;&#227;o</desc><graphic url="criar-exposicao-omeka_01.png"/></figure>
<p>A cole&#231;&#227;o &#233; uma lista de objetos. Uma exposi&#231;&#227;o &#233; um <emph>tour</emph> guiado pelos seus itens com textos descritivos e <emph>layouts</emph> customizados. Para criar uma, clique na aba <hi rend="bold">Exposi&#231;&#245;es</hi> e depois em <hi rend="bold">Adicionar uma exposi&#231;&#227;o</hi>. Preencha o formul&#225;rio na parte superior da p&#225;gina. Um <hi rend="bold">slug</hi> &#233; um nome da sua exposi&#231;&#227;o, leg&#237;vel por uma m&#225;quina, que far&#225; parte do seu URL. </p>
<p>Nota da tradu&#231;&#227;o: para configurar o Omeka.net internamente para a l&#237;ngua portuguesa, siga as instru&#231;&#245;es dispon&#237;veis neste <link target="/pt/licoes/introducao-omeka-net#configurar-o-seu-site-para--portugu%C3%AAs-nota-da-tradu%C3%A7%C3%A3o">tutorial.</link></p>
</div><div type="2"><head>Adicionar uma p&#225;gina</head>
<p>P&#225;ginas s&#227;o onde inserimos os itens na exposi&#231;&#227;o. Uma exposi&#231;&#227;o pode ter m&#250;ltiplas p&#225;ginas e &#233; poss&#237;vel arrastar e soltar para reorganizar a sua ordem, at&#233; mesmo transformando algumas p&#225;ginas em subse&#231;&#245;es de outras.</p>
<p>Clique no bot&#227;o verde "Adicionar P&#225;gina". Na pr&#243;xima janela, preencheremos algumas informa&#231;&#245;es e escolheremos um <emph>layout</emph> para a p&#225;gina da exposi&#231;&#227;o. </p>
</div><div type="2"><head>Adicione um bloco de conte&#250;do na p&#225;gina</head>
<figure><desc>Adicione os campos da p&#225;gina</desc><graphic url="criar-exposicao-omeka_02.png"/></figure>
<p>Na janela seguinte, h&#225; a op&#231;&#227;o para  <hi rend="bold">T&#237;tulo da p&#225;gina</hi> e <hi rend="bold">Slug</hi>. Preencha ambos. </p>
<p>H&#225; tamb&#233;m a op&#231;&#227;o de <hi rend="bold">Novo Bloco</hi>. P&#225;ginas s&#227;o feitas de blocos, que podem ser arquivos e texto, ou apenas arquivos, ou apenas texto. </p>
<p>Clique na op&#231;&#227;o <hi rend="bold">Arquivo com Texto</hi> e ent&#227;o em <hi rend="bold">Adicionar um novo bloco de conte&#250;do</hi></p>
</div><div type="2"><head>Adicione conte&#250;do ao seu bloco de conte&#250;do</head>
<figure><desc>Adicione um item e um arquivo no seu bloco de conte&#250;do</desc><graphic url="criar-exposicao-omeka_03.png"/></figure>
<p>Em <hi rend="bold">Bloco 1 (Arquivo com Texto)</hi> clique no bot&#227;o <hi rend="bold">Adicionar Item</hi>.</p>
<p>Na janela que aparecer&#225;, clique no seu item e ent&#227;o clique em <hi rend="bold">Selecione um Item</hi>. &#201; poss&#237;vel adicionar uma legenda se quiser. Clique no bot&#227;o verde <hi rend="bold">Aplicar</hi>.</p>
<p>Eu tamb&#233;m adicionei algum texto no campo <hi rend="bold">Texto</hi>.</p>
<p>Quando voc&#234; terminar, clique no bot&#227;o <hi rend="bold">Ver P&#225;gina P&#250;blica</hi> para ver como o seu site do Omeka est&#225;.</p>
</div><div type="2"><head>Temos um site do Omeka!</head>
<figure><desc>Boris, o cachorro &#233; um item da exposi&#231;&#227;o</desc><graphic url="criar-exposicao-omeka_04.png"/></figure>
<p>Agora o seu site tem itens, cole&#231;&#245;es e uma exposi&#231;&#227;o - todas as unidades b&#225;sicas de um site do Omeka! </p>
</div></body>
  </text>
</TEI>
