<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Preservar tus datos de investigaci&#243;n</title>
  <authors>James Baker</authors>
  <date>2014-04-30</date>
  <translation_date>2017-03-20</translation_date>
  <editors>Adam Crymble</editors>
  <reviewers>Jane Winters,Sharon Howard,William J. Turkel</reviewers>
  <translator>V&#237;ctor Gayol</translator>
  <translation-editor>Maria Jos&#233; Afanador-Llach</translation-editor>
  <translation-reviewer>Antonio Rojas Castro,Maria Jos&#233; Afanador-Llach</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/55</review-ticket>
  <layout>lesson</layout>
  <difficulty>1</difficulty>
  <original>preserving-your-research-data</original>
  <activity>sustaining</activity>
  <topics>data-management</topics>
  <abstract>Esta lecci&#243;n te sugerir&#225; formas en las que los historiadores pueden documentar y estructurar sus datos de investigaci&#243;n con el fin de asegurar que permanecer&#225;n &#250;tiles en el futuro.</abstract>
  <avatar_alt>Grabado de un barril abierto y lleno de dinamita con un cartel.</avatar_alt>
  <doi>10.46430/phes0023</doi>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="2"><head>La cuesti&#243;n de fondo</head>
<p>En su ensayo de 2003, "Scarcity or Abundance?", Roy Rosenzweig trat&#243; de alertar a los historiadores contra lo que llam&#243; "la fragilidad de las pruebas en la era digital" (Rosenzweig, 736). Y aunque sus preocupaciones se centraron en los recursos disponibles en la web abierta, f&#225;cilmente pueden extenderse a los materiales de origen digital -o datos- que los historiadores crean a lo largo de su investigaci&#243;n.</p>
<p>Esta gu&#237;a se va a dedicar a la preservaci&#243;n de los datos de investigaci&#243;n. &#191;Por qu&#233; es esto necesario?</p>
<p>Los historiadores usan las computadoras cada vez m&#225;s como medios predeterminados para almacenar todos sus datos de investigaci&#243;n. Desde hace alg&#250;n tiempo, sus manuscritos se han convertido en objetos digitales y en consecuencia su investigaci&#243;n ha cambiado -ya sea como notas, fotograf&#237;as de archivos o tablas de datos. Adem&#225;s, tener los datos de investigaci&#243;n en formato digital tiene una clara ventaja sobre sus antecedentes f&#237;sicos: pueden ser navegables y buscables, alojados de manera que puedan ser accesibles en muchos lugares y fusionados o consultados con otros datos de investigaci&#243;n.</p>
<p>Pero el hecho de poner todos los datos de investigaci&#243;n en formato digital no garantiza su supervivencia. Y cuando digo <emph>sobrevivir</emph> no me refiero a su permanencia en un sentido literal o en el sentido de ser capaz de permanecer legible en la pr&#243;xima versi&#243;n de Microsoft Word; sino m&#225;s bien en el sentido de que un archivo pueda ser utilizado por la gente. Los apectos pr&#225;cticos de c&#243;mo conservar los datos de investigaci&#243;n para el futuro es un problema cuya soluci&#243;n ha sido abordada en detalle con y sin los historiadores en mente. Asimismo, los expertos en gesti&#243;n de datos, servicios y similares han hablado al igual acerca de las mejores pr&#225;cticas acad&#233;micas en lo que respecta a la documentaci&#243;n, estructuraci&#243;n y organizaci&#243;n de los datos de investigaci&#243;n. A pesar de todo esto, los datos de investigaci&#243;n generados por un historiador individual est&#225;n en riesgo de perderse si ese historiador no es capaz de generarlos y preservarlos en una forma en que los pueda entender, as&#237; como encontrarlos significativos a&#241;os o d&#233;cadas m&#225;s tarde, por no hablar de cualquier otra persona vadeando a trav&#233;s de las idiosincrasias de su proceso de investigaci&#243;n. En resumen, hay un riesgo de p&#233;rdida de los datos cuando se separan de su contexto de creaci&#243;n y del conocimiento t&#225;cito de que fueron &#250;tiles para la preparaci&#243;n de la conferencia X o el manuscrito Y. Como dijo William Stafford Noble:</p>
<blockquote>
<p>El principio gu&#237;a b&#225;sico es simple: alguien no familiarizado con tu
proyecto debe ser capaz de ver los archivos de tu computadora y entender
en detalle qu&#233; es lo que hiciste y por qu&#233; [...]. Pero por lo com&#250;n resulta que ese "alguien" eres t&#250;. En unos meses a partir de ahora, podr&#225;s no recordar lo que estabas haciendo cuando creaste un conjunto de archivos en particular, o podr&#225;s olvidar qu&#233; conclusiones esbozaste. Tendr&#225;s entonces que pasar tiempo reconstruyendo tus experimentos anteriores y percepciones adquiridas a partir de esos experimentos.</p>
<p>William Stafford Noble (2009) A Quick Guide to Organizing
Computational Biology Projects. PLoSComputBiol 5(7): e1000424.
doi:10.1371/journal.pcbi.1000424</p>
</blockquote>
<p>Teniendo en cuenta las lecciones y la experiencia de los expertos en datos de investigaci&#243;n, esta gu&#237;a te sugerir&#225; formas en las que los historiadores pueden documentar y estructurar sus datos de investigaci&#243;n con el fin de asegurar que permanecer&#225;n &#250;tiles en el futuro. La gu&#237;a no pretende ser prescriptiva pues se espera que los lectores repitan, cambien y adapten las ideas que se presentan de acuerdo con sus investigaciones.</p>
</div>
      <div type="2"><head>Documentar los datos de investigaci&#243;n</head>
<blockquote>
<p>Birkwood, Katie (girlinthe). &#8220;Victory is mine: while ago I worked out
some Clever Stuff &#8482; in Excel. And I MADE NOTES ON IT. And those notes
ENABLED ME TO DO IT AGAIN.&#8221; 7 October 2013, 3:46 a.m.. Tweet.</p>
<p><link target="https://twitter.com/Girlinthe/status/387166944094199809">https://twitter.com/Girlinthe/status/387166944094199809</link></p>
</blockquote>
<p>El prop&#243;sito de documentar es capturar el proceso de creaci&#243;n de datos, los cambios hechos a los datos y el conocimiento t&#225;cito asociado con los datos. Las metodolog&#237;as de gesti&#243;n de proyectos, como <link target="https://es.wikipedia.org/wiki/PRINCE2">PRINCE2</link>, pone un gran &#233;nfasis en una documentaci&#243;n precisa, estructurada y detallada. Mientras que este enfoque beneficia especialmente a proyectos grandes y complejos, con m&#250;ltiples asociados, el historiador promedio probablemente pueda beneficiarse de un enfoque m&#225;s flexible y que se nutra, pero no se ate, a los principios de la gesti&#243;n de proyectos. En el caso de la investigaci&#243;n hist&#243;rica, el tipo de documentaci&#243;n que podr&#237;a producirse para preservar la utilidad de los datos de investigaci&#243;n incluye:</p>
<ul>
<li>Documentaci&#243;n que describa las notas tomadas durante el examen de un documento de archivo, como la referencia del archivo para el documento original, la representatividad de las notas (por ejemplo, transcipciones completas, transcripciones parciales o res&#250;menes), cu&#225;nto del documento fue examinado o las decisiones tomadas para excluir secciones del documento del proceso de investigaci&#243;n.</li>
<li>Documentaci&#243;n que describa los datos tabulares, como la forma en que fueron generados (por ejemplo, a mano o de forma automatizada), referencias de archivo para las fuentes originales de donde provienen los datos, qu&#233; atributos de las fuentes originales fueron conservados y el porqu&#233;.</li>
<li>Documentaci&#243;n que describa un directorio de im&#225;genes digitales, c&#243;mo se cre&#243; cada imagen, de d&#243;nde fueron descargadas esas im&#225;genes o notas de investigaci&#243;n que se refieran a ellas.</li>
</ul>
<p>Como sugiere el &#250;ltimo ejemplo, uno de los prop&#243;sitos principales de la documentaci&#243;n es describir los v&#237;nculos significativos que existen entre los datos de la investigaci&#243;n, v&#237;nculos que pueden dejar de ser evidentes con el tiempo.</p>
<p>El momento de documentar depende en gran medida de la persona y del ritmo de la investigaci&#243;n. La regla general es adquirir un h&#225;bito de escritura y actualizar la documentaci&#243;n a intervalos regulares, idealmente cada vez que se termina un lote de trabajo por la ma&#241;ana, la tarde o d&#237;a. Al mismo tiempo es importante no preocuparse por la perfecci&#243;n sino aspirar a escribir documentaci&#243;n consistente y eficiente que ser&#225; &#250;til para ti y es de esperarse tambi&#233;n que para otras personas puedan utilizar tus datos de investigaci&#243;n a&#241;os despu&#233;s de realizados.</p>
</div>
      <div type="2"><head>Formatos de archivo</head>
<p>Idealmente, los datos de investigaci&#243;n y la documentaci&#243;n deben ser guardados en archivos <link target="https://es.wikipedia.org/wiki/Multiplataforma#Programaci.C3.B3n_multiplataforma">independientes de plataforma</link> como .txt para notas y .csv (valores separados por comas) o .tsv (valores separados por tabuladores) para los datos en tablas. Estos formatos de texto plano son preferibles a los formatos propietarios utilizados por defecto por Microsoft Office o iWork porque pueden abrirse con muchos paquetes de programas y tienen una gran probabilidad de permanecer visibles o editables en el futuro. Muchas <emph>suites</emph> de ofim&#225;tica (o paquetes de <emph>software</emph> para oficina) incluyen la opci&#243;n de guardar archivos en formatos .txt, .csv y .tsv, lo que significa que se puede continuar trabajando con programas familiares y a&#250;n as&#237; tomar las acciones apropiadas para hacer accesible tu trabajo. Comparados con .doc o .xls, estos formatos tienen el beneficio adicional, desde una perspectiva de preservaci&#243;n, de contener solamente elementos legibles por la computadora. Mientras que es una pr&#225;ctica com&#250;n el uso de negritas, it&#225;licas o colores para indicar encabezados o para establecer una conexi&#243;n visual entre elementos de los datos, estas anotaciones orientadas a la visualizaci&#243;n no son legibles por la computadora y, por lo tanto, no puede ser consultadas ni buscadas, ni son adecuadas para grandes cantidades de informaci&#243;n. Son preferibles los esquemas simples de anotaci&#243;n como el uso de un doble asterisco o tres signos de almohadilla para representar una caracter&#237;stica de los datos; en mis propias notas, por ejemplo, tres signos de interrogaci&#243;n indica algo a lo que necesito dar seguimiento, y lo eleg&#237; porque "???" se puede encontrar f&#225;cilmente con una b&#250;squeda mediante CTRL + F.</p>
<p>Es probable que en muchas ocasiones estos esquemas de anotaci&#243;n se desprendan de la pr&#225;ctica individual (y en consecuencia deban ser documentados), aunque hay sintaxis disponibles como <link target="https://es.wikipedia.org/wiki/Markdown">Markdown</link> (los archivos Markdown se guardan como .md). En GitHub  <link target="https://github.com/adam-p/markdown-here">https://github.com/adam-p/markdown-here</link> se pueden encontrar estos excelentes apuntes para quien quiera seguir -o adaptar- esta sintaxis. Se recomienda el uso de Notepad++ <link target="http://notepad-plus-plus.org/">http://notepad-plus-plus.org/</link> a los usuarios de Windows, aunque de ninguna manera es esencial para trabajar con archivos .md. Los usuarios de Mac o Unix pueden encontrar &#250;til <link target="http://komodoide.com/komodo-edit/">Komodo Edit</link> o <link target="https://www.barebones.com/products/textwrangler/">Text Wrangler</link>.</p>
</div>
      <div type="2"><head>Resumen 1</head>
<p>Recapitulando, los puntos clave acerca de la documentaci&#243;n y los formatos de archivo son:</p>
<ul>
<li>Intenta que la documentaci&#243;n capture de una manera precisa y consistente el conocimiento t&#225;cito que rodea al proceso de investigaci&#243;n, ya sea en relaci&#243;n con las notas tomadas, la generaci&#243;n de datos en tablas o la acumulaci&#243;n de pruebas visuales.</li>
<li>Mant&#233;n una documentaci&#243;n sencilla utilizando formatos y pr&#225;cticas de anotaci&#243;n independientes de la plataforma y legibles por la computadora.</li>
<li>Haz espacio para actualizar y crear documentaci&#243;n en tu flujo de trabajo sin permitir que el proceso de documentaci&#243;n se convierta en una carga.</li>
<li>Invierte en dejar un registro en papel ahora para ahorrar tiempo intentando reconstruirlo en el futuro.</li>
</ul>
</div>
      <div type="2"><head>Estructuraci&#243;n de los datos de investigaci&#243;n</head>
<p>Documentar tu investigaci&#243;n se torna m&#225;s f&#225;cil estructurando los datos de investigaci&#243;n de una manera consistente y predecible.</p>
<p>&#191;Por qu&#233;?</p>
<p>La respuesta es que cada vez que usamos una biblioteca o un cat&#225;logo de archivo dependemos de la informaci&#243;n estructurada para ayudarnos a navegar por los datos (tanto f&#237;sicos como digitales) que contiene el repositorio. Sin esta informaci&#243;n estructurada, nuestra investigaci&#243;n ser&#237;a muy pobre.</p>
<p>Examinar los URLs es una buena forma de pensar una estructura de datos de investigaci&#243;n, consistente y predecible, que puede ser &#250;til para tu investigaci&#243;n. Las URL malas no son reproducibles y, por tanto, en un contexto acad&#233;mico no son citables. Por el contrario, las buenas URL representan con claridad el contenido de la p&#225;gina que identifican, ya sea porque contienen elementos sem&#225;nticos o porque utilizan un elemento &#250;nico encontrado en un conjunto o en la mayor&#237;a de las p&#225;ginas.</p>
<p>Un buen ejemplo de los primeros son los URLs utilizados por los sitios web de noticias o los servicios de <emph>blogging</emph>. Los URLs de WordPress utilizan el siguiente formato:</p>
<ul>
<li><emph>Nombre del sitio web</emph>/<emph>a&#241;o (4 d&#237;gitos)</emph>/<emph>mes (2 d&#237;gitos)</emph>/<emph>d&#237;a (2 d&#237;gitos)</emph>/<emph>palabras-del-titulo-separadas-por-guiones</emph></li>
<li><link target="http://cradledincaricature.com/2014/02/06/comic-art-beyond-the-print-shop/">http://cradledincaricature.com/2014/02/06/comic-art-beyond-the-print-shop/</link></li>
</ul>
<p>Un estilo similar es utilizado por las agencias de noticias como el peri&#243;dico <emph>The Guardian</emph>:</p>
<ul>
<li><emph>Nombre del sitio web</emph>/<emph>subdivisi&#243;n de seccci&#243;n</emph>/<emph>a&#241;o (4 d&#237;gitos)</emph>/<emph>mes (3 caracteres)</emph>/<emph>d&#237;a (2 d&#237;gitos)</emph>/<emph>palabras-que-describen-contenido-separadas-por-guiones</emph></li>
<li><link target="http://www.theguardian.com/uk-news/2014/feb/20/rebekah-brooks-rupert-murdoch-phone-hacking-trial">http://www.theguardian.com/uk-news/2014/feb/20/rebekah-brooks-rupert-murdoch-phone-hacking-trial</link></li>
</ul>
<p>En los cat&#225;logos de archivo, se suelen utilizar URLs estructurados por un elemento de datos. <emph>The British Cartoon Archive</emph> estructura su archivo en l&#237;nea utilizando el formato:</p>
<ul>
<li><emph>nombre del sitio web</emph>/<emph>registro</emph>/<emph>n&#250;mero de referencia</emph></li>
<li><link target="http://www.cartoons.ac.uk/record/SBD0931">http://www.cartoons.ac.uk/record/SBD0931</link></li>
</ul>
<p>Y el sitio Old Bailey Online usa este formato:</p>
<ul>
<li><emph>nombre del sitio web</emph>/browse.jsp?ref=<emph>n&#250;mero de referencia</emph></li>
<li><link target="http://www.oldbaileyonline.org/browse.jsp?ref=OA16780417">http://www.oldbaileyonline.org/browse.jsp?ref=OA16780417</link></li>
</ul>
<p>Lo que aprendemos de estos ejemplos es que la combinaci&#243;n de descripciones sem&#225;nticas con elementos de datos hacen consistente y predecible la lectura de los datos estructurados tanto por m&#225;quinas como por seres humanos. Transferir esto a los datos digitales acumulados durante el curso de la investigaci&#243;n hist&#243;rica hace que los datos de investigaci&#243;n sean m&#225;s f&#225;cilmente navegables, as&#237; como buscar y consultar utilizando las herramientas est&#225;ndar provistas por nuestros sistemas operativos (y, como veremos en pr&#243;ximas lecciones, por herramientas m&#225;s avanzadas).</p>
<p>En la pr&#225;ctica, la estructura de un buen archivo de datos de investigaci&#243;n puede verse como sigue (para los usuarios de OS X y Linux, reemplaza las barras invertidas por diagonales).</p>
<p>Un directorio ra&#237;z o base quiz&#225; llamado 'trabajo'.</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_0" type="block" corresp="code_preservar-datos-de-investigacion_0.txt"></code></pre>
<p>Una serie de subdirectorios.</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_1" type="block" corresp="code_preservar-datos-de-investigacion_1.txt"></code></pre>
<p>Dentro de estos directorios habr&#225; una serie de subdirectorios para cada evento, proyecto de investigaci&#243;n, m&#243;dulo o escrito. La introducci&#243;n de una nomenclatura convencional que incluya elementos de fecha permite tener la informaci&#243;n organizada sin la necesidad de organizar los subdirectorios, digamos, por a&#241;o o mes.</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_2" type="block" corresp="code_preservar-datos-de-investigacion_2.txt"></code></pre>
<p>Por &#250;ltimo, se pueden utilizar m&#225;s subdirectorios para separar la informaci&#243;n a la vez que crece el proyecto.</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_3" type="block" corresp="code_preservar-datos-de-investigacion_3.txt"></code></pre>
<p>Por supuesto, no toda la informaci&#243;n encajar&#225; perfectamente en una estructura predeterminada y, a medida que surjan nuevos proyectos, tendr&#225;n que revisarse las taxonom&#237;as. De cualquier manera, el sistema resulta correcto siempre y cuando la estructura global del directorio sea consistente y predecible. No ser&#225; as&#237; cuando el historiador no encuentre claramente el documento. Por ejemplo, el subdirectorio 'escritos' de la estructura anterior podr&#237;a incluir un archivo .txt que indique lo que contiene (borradores, la versi&#243;n final del trabajo) y lo que no contiene (investigaci&#243;n relativa a lo escrito).</p>
<p>Debe tenerse presente que el nombre de este archivo de texto, as&#237; como los de toda la documentaci&#243;n y datos de investigaci&#243;n, deber&#237;a servir para identificar el mismo archivo y su contenido. "Notas sobre esta carpeta.docx" no es un nombre que cumpla con este prop&#243;sito, mientras que "2014-01-31\escritura\leeme.txt" reproduce el t&#237;tulo del directorio e introduce alguna informaci&#243;n de fecha. <link target="/assets/preserving-your-research-data/network_analysis_of_Isaac_Cruikshank_and_his_publishers_readme.txt">Un archivo 'leeme' que hice para un proyecto reciente</link>, contiene el tipo de informaci&#243;n que t&#250; y otros usuarios de tus datos pueden encontrar &#250;til.</p>
<p>Para confirmar el valor de este enfoque quiz&#225; valga la pena explicar una breve experiencia personal. Durante el curso de un proyecto de investigaci&#243;n anterior, recolect&#233; unas 2.000 im&#225;genes digitales de grabados sat&#237;ricos sobre Georgia de una serie de recursos en l&#237;nea, conservando los nombres de los archivos en el momento de la descarga. Si en un primer momento yo hubiese establecido una convenci&#243;n para nombrar estos archivos (por ejemplo, 'A&#209;O DE PUBLICACI&#211;N\NOMBRE DEL ARTISTA\T&#205;TULO DEL TRABAJO\FORMATO') hoy yo ser&#237;a capaz de buscar y consultar estas im&#225;genes. De hecho, comenzar cada nombre de archivo con alguna versi&#243;n para indicar la fecha (YYYYMMDD) habr&#237;a significado poder organizarlas de manera cronol&#243;gica en Window, OS X o Linux. Y de haber retirado todos los espacios o signos de puntuaci&#243;n (salvo guiones, puntos, o guiones bajos) de los nombres de los archivos, podr&#237;a haberlos hecho consistentes y predecibles. Esta sencilla medida habr&#237;a hecho posible la gesti&#243;n de esos archivos mediante la interfaz de l&#237;nea de comandos. Pero no lo hice y, tal y como est&#225;n ahora, yo tendr&#237;a que perder mucho tiempo en modificar cada nombre de archivo individualmente a fin de que los datos puedan utilizarse de esta forma.</p>
<p>La aplicaci&#243;n de estas convenciones de nombre a todos los datos de investigaci&#243;n de manera consistente y predecible ayuda a la legibilidad y comprensi&#243;n de la estructura de datos. Por ejemplo, para un proyecto sobre art&#237;culos de revistas pueden elegir el directorio:</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_4" type="block" corresp="code_preservar-datos-de-investigacion_4.txt"></code></pre>
<p>En el ejemplo mostrado, los elementos de fecha 'a&#241;o-mes' indican c&#250;ando se inici&#243; el proyecto.</p>
<p>Dentro de este directorio se puede incluir un directorio de \datos\ para guardar los datos originales utilizados en el proyecto.</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_5" type="block" corresp="code_preservar-datos-de-investigacion_5.txt"></code></pre>
<p>Junto con estos datos habr&#225; una documentaci&#243;n que describa el archivo 2014-01-31_articulos_revistas.tsv</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_6" type="block" corresp="code_preservar-datos-de-investigacion_6.txt"></code></pre>
<p>Subiendo un nivel de directorio a \2014-01_articulos_revistas\ creamos un directorio \analisis\ en el cual colocamos:</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_7" type="block" corresp="code_preservar-datos-de-investigacion_7.txt"></code></pre>
<p>Observa los diferentes atributos de fechas. Estos reflejan el momento en que se hizo el an&#225;lisis de datos que se describir&#225; brevemente de manera convencional en:</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_8" type="block" corresp="code_preservar-datos-de-investigacion_8.txt"></code></pre>
<p>Finalmente, podemos crear un directorio dentro de la carpeta \datos\ que contenga los datos derivados de 2014-01-31_articulos_revistas.tsv, que llamaremos \datos_derivados\. En este caso, cada archivo .tsv derivado contiene l&#237;neas que incluyen palabras clave como 'africa', 'america', 'arte', etc&#233;tera, y se nombran de acuerdo a ello [<emph>Nota del traductor</emph>: las palabras clave se escriben a prop&#243;sito sin acentos para facilitar la estructura de datos en los directorios y su b&#250;squeda independiente de plataforma].</p>
<pre><code xml:id="code_preservar-datos-de-investigacion_9" type="block" corresp="code_preservar-datos-de-investigacion_9.txt"></code></pre>
</div>
      <div type="2"><head>Resumen 2</head>
<p>Recapitulando, los puntos clave sobre la creaci&#243;n de una estructura de datos de investigaci&#243;n son:</p>
<ul>
<li>La estructura de datos debe ser consistente y predecible.</li>
<li>Considera la utilizaci&#243;n de elementos sem&#225;nticos o identificacores de datos para estructurar los directorios de investigaci&#243;n.</li>
<li>Ajusta y adapta la estructura de datos de investigaci&#243;n a tus necesidades.</li>
<li>Establece convenciones de nomenclatura en los directorios y archivos para identificarlos, crear asociaciones entre elementos de datos, y para ayudar a una lectura y comprensi&#243;n a largo plazo de tu estructura de datos.</li>
</ul>
<p>Esta lecci&#243;n ha sugerido maneras para documentar y estructurar datos de investigaci&#243;n. El objetivo ha sido asegurar que tus datos se conserven mediante la captura del conocimiento t&#225;cito adquirido en tu proceso de investigaci&#243;n y, por lo tanto, haciendo dicha informaci&#243;n asequible y f&#225;cil de utilizar en el futuro. Se ha recomendado el uso de formatos independientes de plataforma y legibles por computadoras. Tambi&#233;n se han analizado las URLs como un ejemplo de buenas (y malas) pr&#225;cticas de estructuraci&#243;n de datos que se puede replicar para organizar los datos de investigaci&#243;n de un historiador.</p>
<p>Estas sugerencias son solamente gu&#237;as pues se espera que los investigadores las adapten para satisfacer sus propias necesidades. Al hacerlo, se recomienda que cada investigador mantenga sus estrategias de conservaci&#243;n digital, pero que tenga en mente las mejores pr&#225;cticas de gesti&#243;n de proyectos. De esta manera, nos aseguramos que el tiempo que pasamos en documentar y estructurar los datos de investigaci&#243;n no sea un lastre. Despu&#233;s de todo, el prop&#243;sito de esta gu&#237;a es hacer eficiente la investigaci&#243;n hist&#243;rica que genera datos. Es decir: tu investigaci&#243;n.</p>
</div>
      <div type="2"><head>Lecturas recomendadas</head>
<p>Ashton, Neil, 'Seven deadly sins of data publication', School of Data
blog (17 October 2013)
<link target="http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/">http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/</link></p>
<p>Hitchcock, Tim, 'Judging a book by its URLs', Historyonics blog (3
January 2014)
<link target="http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html">http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html</link></p>
<p>Howard, Sharon, 'Unclean, unclean! What historians can do about sharing
our messy research data', Early Modern Notes blog (18 May 2013)
<link target="http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/">http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/</link></p>
<p>Noble, William Stafford, A Quick Guide to Organizing Computational
Biology Projects.PLoSComputBiol 5(7): e1000424 (2009)
<link target="https://doi.org/10.1371/journal.pcbi.1000424">https://doi.org/10.1371/journal.pcbi.1000424</link></p>
<p>Oxford University Computing Services, 'Sudamih Project. Research
Information Management: Organising Humanities Material' (2011)
<link target="https://doi.org/10.5281/zenodo.28329">https://doi.org/10.5281/zenodo.28329</link></p>
<p>Pennock, Maureen, 'The Twelve Principles of Digital Preservation (and a
cartridge in a repository&#8230;)', British Library Collection Care blog (3
September 2013)
<link target="http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html">http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html</link></p>
<p>Pritchard, Adam, 'Markdown Cheatsheet' (2013)
<link target="https://github.com/adam-p/markdown-here">https://github.com/adam-p/markdown-here</link></p>
<p>Rosenzweig, Roy, 'Scarcity or Abundance? Preserving the Past in a
Digital Era', The American Historical Review 108:3 (2003), 735-762.</p>
<p>UK Data Archive, 'Documenting your Data'
<link target="http://data-archive.ac.uk/create-manage/document">http://data-archive.ac.uk/create-manage/document</link></p>
</div>
    </body>
  </text>
</TEI>
