<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Preservar os seus dados de investiga&#231;&#227;o</title>
  <layout>lesson</layout>
  <slug>preservar-os-seus-dados-de-investigacao</slug>
  <date>2014-04-30</date>
  <translation_date>2021-01-29</translation_date>
  <authors>James Baker</authors>
  <reviewers>Jane Winters,Sharon Howard,William J. Turkel</reviewers>
  <editors>Adam Crymble</editors>
  <translator>M&#225;rcia T. Cavalcanti</translator>
  <translation-editor>Joana Vieira Paulino</translation-editor>
  <translation-reviewer>Maria Guedes,Elizabeth Freire</translation-reviewer>
  <difficulty>1</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/319</review-ticket>
  <activity>sustaining</activity>
  <topics>data-management</topics>
  <abstract>Esta li&#231;&#227;o ir&#225; sugerir maneiras pelas quais os historiadores podem documentar e estruturar os seus dados de pesquisa, a fim de garantir que continuem sendo acess&#237;veis no futuro.</abstract>
  <original>preserving-your-research-data</original>
  <avatar_alt>Um barril grande</avatar_alt>
  <doi>10.46430/phpt0001</doi>
</metadata>
  <text xml:lang="pt">
    <body>
      <div type="2"><head>Hist&#243;rico</head>
<p>No ensaio de 2003 "Escassez ou abund&#226;ncia", Roy Rosenzweig procurou alertar os
historiadores para o que ele chamou de "fragilidade das evid&#234;ncias na era
digital" (Rosenzweig, 736). E, embora as suas preocupa&#231;&#245;es estivessem focadas em fontes
dispon&#237;veis na Web aberta, podem ser facilmente estendidas aos
materiais digitais - ou dados - que os historiadores criam durante as suas
pesquisas.</p>
<p>&#201; nesses dados de pesquisa que o presente guia se focar&#225;. Mas
por qu&#234;?</p>
<p>Bem, os historiadores est&#227;o adotando computadores como ferramenta base para
armazenar todos os dados de suas pesquisas, seus materiais de pesquisa. Seus manuscritos
s&#227;o objetos digitais h&#225; algum tempo e suas pesquisas est&#227;o se encaminhando
para isso - seja na forma de notas digitadas, fotografias de
arquivos ou dados. Al&#233;m disso, os dados de pesquisa mantidos em formato digital
apresentam vantagens claras sobre seus antecedentes f&#237;sicos: podem ser
navegados e pesquisados, hospedados de maneira a permitir o acesso em muitos locais,
podem ainda ser mesclados ou confrontados com outros dados de pesquisa.</p>
<p>Apenas colocar os dados da pesquisa em formato digital n&#227;o garante que
eles sobrevivem. Aqui, por sobreviv&#234;ncia, n&#227;o queremos dizer sobreviver no sentido literal,
nem no sentido de ser leg&#237;vel pela pr&#243;xima vers&#227;o do Microsoft Word,
mas sim de poder ser utilizado pelas pessoas. Pois se n&#227;o for um problema
resolvido, os aspectos pr&#225;ticos de como preservar os dados de pesquisa para o
futuro e potenciais solu&#231;&#245;es j&#225; foram
extensivamente abordadas, com e sem historiadores em mente. Especialistas
em gerenciamento de dados, servi&#231;os e afins j&#225; falaram sobre
as melhores pr&#225;ticas acad&#233;micas no que diz respeito &#224; documenta&#231;&#227;o, estrutura&#231;&#227;o e
organiza&#231;&#227;o de dados de pesquisa. Mesmo assim, os dados de pesquisa gerados
por um historiador individual correm o risco de se perder se esse historiador n&#227;o for
capaz de ger&#225;-los ou preserv&#225;-los de uma forma em que esses dados possam ser entendidos e terem sentido,
para ele ou para algu&#233;m esquadrinhando as idiossincrasias do seu processo de pesquisa,
anos ou d&#233;cadas depois. Em suma,
existe o risco de perda quando os dados perdem o
contexto da sua cria&#231;&#227;o, do conhecimento t&#225;cito que os tornaram &#250;teis no
momento da prepara&#231;&#227;o da palestra X ou do manuscrito Y. Como William Stafford Noble
coloca:</p>
<blockquote>
<p>O principal princ&#237;pio norteador &#233; simples: algu&#233;m n&#227;o familiarizado com o seu
projeto deve ser capaz de examinar os ficheiros do seu computador e entender
em detalhe o que voc&#234; fez e por qu&#234; [...] No entanto, o mais comum &#233; que esse
&#8220;algu&#233;m&#8221; seja voc&#234;. Daqui a alguns meses, talvez voc&#234; n&#227;o se lembre do que
estava a fazer quando criou um conjunto espec&#237;fico de ficheiros ou talvez n&#227;o
se lembre das conclus&#245;es que tirou. Voc&#234; precisar&#225; dedicar
algum tempo reconstruindo as experi&#234;ncias anteriores ou perder as
ideias que obteve dessas mesmas esperi&#234;ncias.</p>
<p>William Stafford Noble (2009) A Quick Guide to Organizing
Computational Biology Projects. PLoSComputBiol 5(7): e1000424.
doi:10.1371/journal.pcbi.1000424</p>
</blockquote>
<p>Com base nas li&#231;&#245;es e conhecimentos dos especialistas em dados de pesquisa, o
presente guia ir&#225; sugerir maneiras pelas quais os historiadores podem documentar e
estruturar os dados de pesquisa, a fim de garantir que continuem &#250;teis no
futuro. O guia n&#227;o pretende ser prescritivo, ao contr&#225;rio,
sup&#245;e-se que os leitores ir&#227;o iterar, mudar e adaptar as ideias apresentadas para
melhor se ajustarem &#224; sua pr&#243;pria pesquisa.</p>
</div>
      <div type="2"><head>Documentando os dados de pesquisa</head>
<blockquote>
<p>Birkwood, Katie (girlinthe). &#8220;Victory is mine: while ago I worked out
some Clever Stuff &#8482; in Excel. And I MADE NOTES ON IT. And those notes
ENABLED ME TO DO IT AGAIN.&#8221; 7 October 2013, 3:46 a.m.. Tweet.</p>
<p><link target="https://twitter.com/Girlinthe/status/387166944094199809">https://twitter.com/Girlinthe/status/387166944094199809</link></p>
</blockquote>
<p>O prop&#243;sito da documenta&#231;&#227;o &#233; capturar o processo da cria&#231;&#227;o de dados,
as altera&#231;&#245;es ocorridas e o conhecimento t&#225;cito associado.
As metodologias de gest&#227;o de projetos, como o <link target="https://pt.wikipedia.org/wiki/PRINCE2">PRINCE2</link>, enfatizam muito
a documenta&#231;&#227;o precisa, estruturada e detalhada. Embora haja
benef&#237;cios na abordagem, especialmente para projetos grandes, complexos e com m&#250;ltiplos parceiros,
&#233; mais prov&#225;vel que o historiador no trabalho rotineiro beneficie de
uma abordagem flex&#237;vel e personalizada da documenta&#231;&#227;o que se baseia nos princ&#237;pios de gest&#227;o de projetos, mas n&#227;o est&#225;
presa a eles. No caso da pesquisa
hist&#243;rica, o tipo de documenta&#231;&#227;o que pode ser produzida para preservar
a utilidade dos dados da pesquisa inclui:</p>
<ul>
<li>Documenta&#231;&#227;o descrevendo as anota&#231;&#245;es feitas ao examinar um documento
de arquivo, como a refer&#234;ncia de arquivamento do documento original,
qu&#227;o representativas s&#227;o as anota&#231;&#245;es (por exemplo, transcri&#231;&#245;es completas,
transcri&#231;&#245;es parciais ou resumos), quanto do
documento foi examinado ou as decis&#245;es tomadas para excluir se&#231;&#245;es
do documento do processo de pesquisa.</li>
<li>Documenta&#231;&#227;o descrevendo os dados tabulados, como foram
gerados (por exemplo, &#224; m&#227;o ou de maneira automatizada),
refer&#234;ncia de arquivo da fonte original, de onde vieram alguns ou quais
atributos das fontes originais foram mantidos (e porqu&#234;).</li>
<li>Documenta&#231;&#227;o que descreve um diret&#243;rio de imagens digitais, como
cada imagem foi criada, de onde essas imagens foram obtidas ou
notas de pesquisa que se referem a elas.</li>
</ul>
<p>Como o &#250;ltimo exemplo sugere, um dos principais objetivos da documenta&#231;&#227;o
&#233; descrever as liga&#231;&#245;es significativas que existem entre os dados da pesquisa,
e que podem n&#227;o permanecer &#243;bvias ao longo do tempo. </p>
<p>Documentar depende muito do indiv&#237;duo e do ritmo de
pesquisa. A regra principal &#233; adquirir o h&#225;bito de escrever e
atualizar a documenta&#231;&#227;o em intervalos regulares, sendo o ideal sempre que um lote
de trabalho for conclu&#237;do ao final da manh&#227;, da tarde ou do dia. Ao mesmo tempo,
&#233; importante n&#227;o se preocupar com a perfei&#231;&#227;o, e sim procurar escrever
documenta&#231;&#227;o consistente e eficiente que seja &#250;til no momento e
tamb&#233;m para outra pessoa que venha a utilizar os dados de pesquisa, anos ap&#243;s o fato.</p>
</div>
      <div type="2"><head>Formatos de ficheiros</head>
<p>Idealmente, os dados e a documenta&#231;&#227;o da pesquisa devem ser salvos em formatos
<link target="https://pt.wikipedia.org/wiki/Multiplataforma">multiplataforma</link> como .txt para notas e .csv (valores separados por
v&#237;rgula) ou .tsv (valores separados por tabula&#231;&#227;o) para dados tabulados. Esses formatos
de texto simples s&#227;o prefer&#237;veis aos formatos propriet&#225;rios usados como padr&#245;es
pelo Microsoft Office ou iWork, porque podem ser abertos por muitos pacotes
de software e t&#234;m uma grande chance de permanecerem vis&#237;veis e edit&#225;veis
no futuro. A maioria dos pacotes Office padr&#227;o inclui a op&#231;&#227;o de salvar ficheiros
nos formatos .txt, .csv e .tsv, o que significa que voc&#234; pode continuar com
um software familiar e ainda tomar as medidas necess&#225;rias para tornar o trabalho
acess&#237;vel. Em compara&#231;&#227;o com .doc ou .xls, estes formatos t&#234;m o benef&#237;cio
adicional, numa perspectiva de preserva&#231;&#227;o, de conter apenas
elementos leg&#237;veis por m&#225;quina. Embora seja uma pr&#225;tica comum usar negrito, it&#225;lico e cores nos
t&#237;tulos para destacar a import&#226;ncia ou fazer uma conex&#227;o visual entre elementos
de dados, estas anota&#231;&#245;es orientadas &#224; exibi&#231;&#227;o n&#227;o s&#227;o
leg&#237;veis por m&#225;quina e, portanto, n&#227;o podem ser consultadas e pesquisadas e nem s&#227;o
apropriadas para grandes quantidades de informa&#231;&#227;o. D&#234; prefer&#234;ncia a esquemas
de nota&#231;&#227;o simples, como o uso de um asterisco duplo ou tr&#234;s hashtags
para representar um recurso de dados: nas anota&#231;&#245;es, por exemplo, podem ser inclu&#237;dos tr&#234;s pontos de
interroga&#231;&#227;o indicando algo que &#233; preciso acompanhar, sendo escolhido "???" porque
pode facilmente ser encontrado com uma pesquisa CTRL+F.</p>
<p>&#201; prov&#225;vel que em muitas ocasi&#245;es estes esquemas de nota&#231;&#227;o surjam
da pr&#225;tica individual (e, como consequ&#234;ncia, precise ser
documentada), embora esquemas existentes, como o <link target="https://pt.wikipedia.org/wiki/Markdown">Markdown</link> estejam dispon&#237;veis
(os ficheiros do Markdown s&#227;o salvos como .md). Uma excelente p&#225;gina
de dicas do Markdown est&#225; dispon&#237;vel no GitHub <link target="https://github.com/adam-p/markdown-here">https://github.com/adam-p/markdown-here</link>) para aqueles
que desejam seguir - ou adaptar - este esquema existente. O Notepad++
<link target="http://notepad-plus-plus.org/">http://notepad-plus-plus.org/</link> &#233; recomendado para usu&#225;rios do Windows, embora
de modo algum seja essencial para trabalhar com ficheiros .md. Usu&#225;rios de Mac ou Unix podem
achar &#250;til o <link target="http://komodoide.com/komodo-edit/">Komodo Edit</link> ou o <link target="https://www.barebones.com/products/textwrangler/">Text Wrangler</link>.</p>
</div>
      <div type="2"><head>Recapitula&#231;&#227;o 1</head>
<p>Recapitulando, os pontos chave sobre documenta&#231;&#227;o e formato de ficheiros s&#227;o:</p>
<ul>
<li>Fazer documenta&#231;&#227;o que capture de maneira
precisa e consistente o conhecimento t&#225;cito em torno do processo de pesquisa, seja em
rela&#231;&#227;o &#224;s notas, gera&#231;&#227;o de dados ou acumula&#231;&#227;o
de evid&#234;ncias visuais.</li>
<li>Simplificar o processo de documentar, usando formatos de ficheiro e pr&#225;ticas de nota&#231;&#227;o
independentes da plataforma e leg&#237;veis por m&#225;quina.</li>
<li>Criar tempo para atualizar e documentar o
fluxo de trabalho sem permitir que o trabalho de documenta&#231;&#227;o se torne um fardo.</li>
<li>Investir para deixar um rasto de papel agora e economizar
tempo na tentativa de reconstru&#237;-lo no futuro.</li>
</ul>
</div>
      <div type="2"><head>Estruturar dados de pesquisa</head>
<p>A documenta&#231;&#227;o da pesquisa &#233; facilitada pela estrutura&#231;&#227;o dos dados de
pesquisa de maneira consistente e previs&#237;vel.</p>
<p>Porqu&#234;?</p>
<p>Bem, sempre que usamos um cat&#225;logo de biblioteca ou arquivo, confiamos em
informa&#231;&#245;es estruturadas para navegar pelos dados (f&#237;sicos
ou digitais) que a biblioteca ou arquivo cont&#233;m. Sem essa informa&#231;&#227;o
estruturada, a pesquisa seria muito mais pobre.</p>
<p>Examinar URLs &#233; uma boa forma de pensar sobre porqu&#234; pode ser &#250;til estruturar dados de pesquisa
de maneira consistente e previs&#237;vel.
URLs incorretas n&#227;o s&#227;o reproduz&#237;veis e, portanto, em contexto acad&#233;mico,
n&#227;o podem ser citadas. Pelo contr&#225;rio, bons URLs representam com clareza
o conte&#250;do da p&#225;gina que identificam, contendo elementos sem&#226;nticos
ou usando um &#250;nico elemento de dados encontrado transversalmente num conjunto ou
na maioria das p&#225;ginas.</p>
<p>Um exemplo t&#237;pico s&#227;o as URLs usadas por sites de not&#237;cias ou
servi&#231;os de blog. As URLs do jornal "P&#250;blico" seguem o formato:</p>
<ul>
<li><emph>nome do site</emph>/<emph>ano(4 d&#237;gitos)</emph>/<emph>m&#234;s (2 d&#237;gitos)</emph>/<emph>dia (2
d&#237;gitos)</emph>/<emph>palavras-do-t&#237;tulo-separadas-por-hifens</emph></li>
<li><link target="https://www.publico.pt/2020/07/13/culturaipsilon/noticia/academicos-querem-juntar-memorias-documentos-pandemia-portugal-1924223">https://www.publico.pt/2020/07/13/culturaipsilon/noticia/academicos-querem-juntar-memorias-documentos-pandemia-portugal-1924223</link></li>
</ul>
<p>Um estilo semelhante &#233; usado por ag&#234;ncias de not&#237;cias como o
Nexo Jornal:</p>
<ul>
<li><emph>nome do site</emph>/<emph>subdivis&#227;o da se&#231;&#227;o</emph>/<emph>ano (4 d&#237;gitos)</emph>/<emph>m&#234;s (3
caracteres)</emph>/<emph>dia (2
d&#237;gitos)</emph>/<emph>palavras-que-descrevem-o-conte&#250;do-separadas-por-hifens</emph></li>
<li><link target="https://www.nexojornal.com.br/expresso/2020/12/21/O-que-se-sabe-sobre-a-nova-variante-do-coronav%C3%ADrus">https://www.nexojornal.com.br/expresso/2020/12/21/O-que-se-sabe-sobre-a-nova-variante-do-coronav%C3%ADrus</link>
.</li>
</ul>
<p>Nos cat&#225;logos de arquivo, URLs estruturadas por um &#250;nico elemento de dados s&#227;o
frequentemente usadas. O site Homens e Navios do Bacalhau estrutura seu arquivo on-line
usando o formato:</p>
<ul>
<li><emph>nome do site</emph>/registo/<emph>n&#250;mero de refer&#234;ncia</emph></li>
<li><link target="http://homensenaviosdobacalhau.cm-ilhavo.pt/header/diretorio/showppl/17606">http://homensenaviosdobacalhau.cm-ilhavo.pt/header/diretorio/showppl/17606</link></li>
</ul>
<p>E o Arquivo Hist&#243;rico Ultramarino usa o formato:</p>
<ul>
<li><emph>Nome do site</emph>/details?id=<emph>n&#250;mero de refer&#234;ncia</emph></li>
<li><link target="https://digitarq.ahu.arquivos.pt/details?id=1119374">https://digitarq.ahu.arquivos.pt/details?id=1119374</link></li>
</ul>
<p>O que aprendemos com esses exemplos &#233; que uma combina&#231;&#227;o de descri&#231;&#227;o
sem&#226;ntica e elementos de dados torna as estruturas de dados
consistentes e previs&#237;veis leg&#237;veis tanto por humanos quanto por m&#225;quinas. Transferir isso para
dados digitais acumulados durante o curso da pesquisa hist&#243;rica
facilita sua navega&#231;&#227;o, pesquisa e consulta com
as ferramentas padr&#227;o fornecidas pelos sistemas operacionais (e, como veremos
numa outra li&#231;&#227;o, at&#233; por ferramentas mais avan&#231;adas).</p>
<p>Na pr&#225;tica (para usu&#225;rios do OS X e Linux, substitua todas as
barras invertidas daqui por diante por uma barra), a estrutura de um bom ficheiro de dados de pesquisa
pode ser algo assim:</p>
<p>Um diret&#243;rio base ou raiz, talvez chamado de "trabalho".</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_0" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_0.txt"></code></pre>
<p>Uma s&#233;rie de sub-diret&#243;rios.</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_1" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_1.txt"></code></pre>
<p>Dentro desses diret&#243;rios h&#225; uma s&#233;rie de diret&#243;rios para cada evento,
projeto de pesquisa, m&#243;dulo ou parte da escrita. A introdu&#231;&#227;o de uma conven&#231;&#227;o
de nomenclatura que inclui elementos da data mant&#233;m as informa&#231;&#245;es organizadas
sem a necessidade de subdiret&#243;rios por, por exemplo, ano ou m&#234;s.</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_2" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_2.txt"></code></pre>
<p>Finalmente, outros subdiret&#243;rios podem ser usados para separar as informa&#231;&#245;es
&#224; medida que o projeto cresce.</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_3" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_3.txt"></code></pre>
<p>Obviamente, nem todas as informa&#231;&#245;es se encaixar&#227;o perfeitamente em qualquer estrutura
e, &#224; medida que surgem novos projetos, as taxonomias precisam de ser revisadas. De qualquer
maneira, a idiossincrasia n&#227;o tem problema, desde que a estrutura geral do diret&#243;rio seja
consistente e previs&#237;vel, e desde que se documente tudo que n&#227;o esteja
claramente documentado: por exemplo, o subdiret&#243;rio 'escrita'
na estrutura acima pode incluir um ficheiro .txt declarando o que ele cont&#233;m
(rascunhos e vers&#227;o final do trabalho escrito) e o que n&#227;o cont&#233;m
(pesquisa referente a esse trabalho escrito).</p>
<p>O nome desse ficheiro .txt, na verdade qualquer documenta&#231;&#227;o e dados de pesquisa,
&#233; importante para garantir que ele e seu conte&#250;do sejam f&#225;ceis de identificar.
'Notas sobre esta pasta.docx' n&#227;o &#233; um nome que cumpra esse objetivo,
enquanto '2014-01-31_Escrita_Leia-me.txt' &#233; como o nome replica o t&#237;tulo do
diret&#243;rio e inclui algumas informa&#231;&#245;es de data. Um
<link target="/assets/preserving-your-research-data/network_analysis_of_Isaac_Cruikshank_and_his_publishers_readme.txt">ficheiro readme feito para um projeto recente (em ingl&#234;s)</link>
cont&#233;m o tipo de informa&#231;&#227;o que qualquer usu&#225;rio de dados
pode achar &#250;teis.</p>
<p>Uma hist&#243;ria de advert&#234;ncia deve ser suficiente para confirmar o valor desta
abordagem. Durante a realiza&#231;&#227;o de um projeto de pesquisa anterior, James Baker coletou
cerca de 2.000 imagens digitais de impress&#245;es sat&#237;ricas da Ge&#243;rgia de v&#225;rias
fontes on-line, mantendo os nomes dos ficheiros no download. Se eu tivesse aplicado
uma conven&#231;&#227;o de nomenclatura a essas imagens desde o in&#237;cio (por exemplo, "ANO
DE PUBLICA&#199;&#195;O_SOBRENOME DO ARTISTA_T&#205;TULO DO TRABALHO.FORMATO"), seria poss&#237;vel pesquisar
e consultar essas imagens. De fato, iniciar cada nome de ficheiro com alguma vers&#227;o
do AAAAMMDD significaria que os ficheiros poderiam ser colocados em
ordem cronol&#243;gica no Windows, OS X e Linux. E garantir que todos os
espa&#231;os ou pontua&#231;&#227;o (exceto tra&#231;o, ponto e sublinhado) fossem removidos
dos nomes dos ficheiros no processo de torn&#225;-los consistentes e
previs&#237;veis, tornaria poss&#237;vel a linha de comando trabalhar com esses ficheiros.
Mas n&#227;o foi feito e, como est&#225;, seria preciso reservar muito
tempo para alterar cada nome individualmente, a fim de tornar os dados
utiliz&#225;veis dessa maneira.</p>
<p>Al&#233;m disso, a aplica&#231;&#227;o dessas conven&#231;&#245;es de nomenclatura a todos os dados de pesquisa de maneira
consistente e previs&#237;vel auxilia na legibilidade e
compreens&#227;o da estrutura de dados. Por exemplo, para um projeto em
artigos de peri&#243;dicos, podemos escolher o diret&#243;rio&#8230;</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_4" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_4.txt"></code></pre>
<p>&#8230;onde os elementos ano-m&#234;s capturam quando o projeto come&#231;ou. </p>
<p>Nesse diret&#243;rio inclu&#237;mos um diret&#243;rio \dados\ no qual os dados originais
usados no projeto s&#227;o mantidos.</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_5" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_5.txt"></code></pre>
<p>Junto com esses dados, est&#225; a documenta&#231;&#227;o que descreve
2014-01-31_Peri&#243;dico_Artigos.tsv.</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_6" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_6.txt"></code></pre>
<p>Voltando para o n&#237;vel de diret&#243;rio \2014-01_Peri&#243;dico_Artigos, criamos
o diret&#243;rio \an&#225;lises\ no qual colocamos:</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_7" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_7.txt"></code></pre>
<p>Observem-se os diferentes atributos de m&#234;s e data aqui. Eles refletem as
datas em que a an&#225;lise dos dados ocorreu, uma conven&#231;&#227;o descrita brevemente
em 02-02-2014_Peri&#243;dico_Artigos_an&#225;lise_leia-me.txt.</p>
<p>Por fim, um diret&#243;rio dentro de \dados\ chamado \dados derivados\ cont&#233;m
dados derivados do original 2014-01-31_Peri&#243;dico_Artigos.tsv. Nesse
caso, cada ficheiro .tsv derivado cont&#233;m linhas que incluem as palavras-chave
'africa', 'america', 'arte' etc., e &#233; nomeado de acordo.</p>
<pre><code xml:id="code_preservar-os-seus-dados-de-investigacao_8" type="block" corresp="code_preservar-os-seus-dados-de-investigacao_8.txt"></code></pre>
</div>
      <div type="2"><head>Recapitula&#231;&#227;o 2</head>
<p>Recapitulando, os pontos chave sobre estruturar dados de pesquisa s&#227;o:</p>
<ul>
<li>As estruturas de dados devem ser consistentes e previs&#237;veis.</li>
<li>Considerar usar elementos sem&#226;nticos ou identificadores de dados para estruturar
diret&#243;rios de dados de pesquisa.</li>
<li>Ajustar e adaptar a estrutura de dados de pesquisa &#224; pesquisa em m&#227;os.</li>
<li>Aplicar conven&#231;&#245;es de nomenclatura para diret&#243;rios e nomes de ficheiros para identific&#225;-los,
criar associa&#231;&#245;es entre elementos de dados e ajudar na legibilidade e compreens&#227;o a longo prazo na estrutura
de dados.</li>
</ul>
</div>
      <div type="2"><head>Sum&#225;rio</head>
<p>Esta li&#231;&#227;o sugere maneiras de documentar e estruturar dados de
pesquisa, com o objetivo de garantir que os dados sejam preservados,
capturando o conhecimento t&#225;cito adquirido durante o processo de pesquisa e
facilitando o uso das informa&#231;&#245;es no futuro. Recomenda o
uso de plataformas de formatos independentes e leg&#237;veis por m&#225;quina para documenta&#231;&#227;o
e dados de pesquisa. Sugere como os URLs oferecem um exemplo pr&#225;tico
de estruturas de dados boas e ruins, que podem ser replicadas para os
prop&#243;sitos dos dados de pesquisa de um historiador.</p>
<p>Estas sugest&#245;es t&#234;m a inten&#231;&#227;o de servirem apenas como guias; espera-se que
os pesquisadores adaptem de acordo com os seus prop&#243;sitos. Ao fazer isso, &#233;
recomend&#225;vel que os pesquisadores mantenham em mente as estrat&#233;gias de preserva&#231;&#227;o digital e
as melhores pr&#225;ticas de gest&#227;o de projetos, garantindo que o tempo
gasto documentando e estruturando a pesquisa n&#227;o se torne um fardo.
Afinal, o objetivo deste guia &#233; fazer pesquisas hist&#243;ricas que geram dados mais eficientes, n&#227;o menos. Ou seja, a sua pesquisa.</p>
</div>
      <div type="2"><head>Leituras adicionais</head>
<p>Ashton, Neil, 'Seven deadly sins of data publication', School of Data
blog (17 outubro 2013)
<link target="http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/">http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/</link></p>
<p>Hitchcock, Tim, 'Judging a book by its URLs', Historyonics blog (3
janeiro 2014)
<link target="http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html">http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html</link></p>
<p>Howard, Sharon, 'Unclean, unclean! What historians can do about sharing
our messy research data', Early Modern Notes blog (18 maio 2013)
<link target="http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/">http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/</link></p>
<p>Noble, William Stafford, A Quick Guide to Organizing Computational
Biology Projects.PLoSComputBiol 5(7): e1000424 (2009)
<link target="https://doi.org/10.1371/journal.pcbi.1000424">https://doi.org/10.1371/journal.pcbi.1000424</link></p>
<p>Oxford University Computing Services, 'Sudamih Project. Research
Information Management: Organising Humanities Material' (2011)
<link target="https://zenodo.org/record/28329">https://zenodo.org/record/28329</link></p>
<p>Pennock, Maureen, 'The Twelve Principles of Digital Preservation (and a
cartridge in a repository&#8230;)', British Library Collection Care blog (3
setembro 2013)
<link target="http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html">http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html</link></p>
<p>Pritchard, Adam, 'Markdown Cheatsheet' (2013)
<link target="https://github.com/adam-p/markdown-here">https://github.com/adam-p/markdown-here</link></p>
<p>Rosenzweig, Roy, 'Scarcity or Abundance? Preserving the Past in a
Digital Era', The American Historical Review 108:3 (2003), 735-762.</p>
<p>UK Data Archive, 'Documenting your Data'
<link target="http://data-archive.ac.uk/create-manage/document">http://data-archive.ac.uk/create-manage/document</link></p>
</div>
    </body>
  </text>
</TEI>
