<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>R&#233;daction durable avec Pandoc et Markdown</title>
  <collection>lecons</collection>
  <layout>lesson</layout>
  <slug>redaction-durable-avec-pandoc-et-markdown</slug>
  <date>2014-03-19</date>
  <authors>Dennis Tenen,Grant Wythoff</authors>
  <editors>Fred Gibbs</editors>
  <translation_date>2020-09-09</translation_date>
  <translator>Marie-Christine Boucher</translator>
  <translation-editor>Sofia Papastamkou</translation-editor>
  <translation-reviewer>Arthur Perret</translation-reviewer>
  <original>sustainable-authorship-in-plain-text-using-pandoc-and-markdown</original>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/307</review-ticket>
  <difficulty>2</difficulty>
  <activity>sustaining</activity>
  <topics>website,data-management</topics>
  <exclude_from_check>reviewers</exclude_from_check>
  <abstract>Cette le&#231;on vous apprendra les notions de base de Markdown, une syntaxe de balisage facile &#224; lire et &#233;crire, ainsi que Pandoc, un outil en ligne de commande qui permet de convertir du texte brut en diff&#233;rents types de fichiers bien format&#233;s: PDF, .docx, HTML, LaTeX, diaporama, et plus encore.</abstract>
  <avatar_alt>Homme assis devant une table &#224; dessin</avatar_alt>
  <doi>10.46430/phfr0013</doi>
</metadata>
  <text xml:lang="fr">
    <body><figure><desc/><graphic url="lexoriter.jpg"/></figure>
<div type="2"><head>Objectifs</head>
<p>Cette le&#231;on vous apprendra d'abord les notions de base de Markdown &#8212; une syntaxe de balisage facile &#224; lire et &#233;crire &#8212; ainsi que <link target="http://johnmacfarlane.net/pandoc/">Pandoc</link>, un outil en ligne de commande qui permet de convertir du texte brut en diff&#233;rents types de fichiers bien format&#233;s : PDF, .docx, HTML, LaTeX, diaporama, et plus encore.<ref type="footnotemark" target="#1"/> &#192; l'aide de Pandoc comme outil de composition num&#233;rique, vous pouvez utiliser la syntaxe Markdown pour ajouter des figures ou une bibliographie, et changer facilement de style de citation, par exemple de Chicago &#224; MLA, le tout en utilisant du texte brut.</p>
<p>Cette le&#231;on ne requiert pas de connaissances techniques avanc&#233;es, mais elle s'adapte &#224; votre niveau d'exp&#233;rience, puisque nous sugg&#233;rons souvent des m&#233;thodes plus pouss&#233;es vers la fin d'une section. Celles-ci sont clairement indiqu&#233;es, et peuvent &#234;tre revues apr&#232;s avoir exp&#233;riment&#233; et acquis un peu d'exp&#233;rience.</p>
<p>Au lieu de suivre cette le&#231;on de fa&#231;on m&#233;canique, nous vous recommandons de chercher &#224; comprendre les solutions qui vous sont offertes ici comme une <emph>m&#233;thodologie</emph> qui devra probablement &#234;tre ajust&#233;e &#224; votre environnement et &#224; votre processus de travail. L'installation des outils n&#233;cessaires repr&#233;sentera probablement le plus grand obstacle &#224; la r&#233;alisation de ce tutoriel. Armez-vous de sufisamment de temps et de patience afin de tout installer comme il se doit, ou faites-le avec un ou une coll&#232;gue qui a une configuration semblable afin de vous aider mutuellement. Consultez les <link target="#ressources-utiles">Ressources utiles</link> au bas de cette page si vous avez des difficult&#233;s.<ref type="footnotemark" target="#2"/></p>
</div><div type="2"><head>Philosophie</head>
<p>La r&#233;daction, le stockage et la consultation de documents sont des &#233;tapes cruciales du processus de recherche dans le domaine des humanit&#233;s. Et pourtant, le travail de nombre d'auteur(e)s repose sur des outils et des formats propri&#233;taires qui n'arrivent parfois m&#234;me pas &#224; satisfaire aux exigences de base de la r&#233;daction scientifique. Vous connaissez s&#251;rement l'exasp&#233;ration que peut engendrer la fragilit&#233; des notes de bas de page, bibliographies, figures et brouillons de livres r&#233;dig&#233;s dans Microsoft Word ou Google Docs. Et pourtant, la plupart des revues scientifiques insistent encore &#224; ce que les contributions soient soumises en format .docx.</p>
<p>Plus qu'une simple frustration personnelle, cette d&#233;pendance aux outils et formats propri&#233;taires a des implications n&#233;gatives &#224; long terme pour la communaut&#233; scientifique. Dans un tel environnement, les revues doivent sous-traiter la mise en page, &#233;loignant par le fait m&#234;me les auteur(e)s du contexte mat&#233;riel de la publication et ajoutant d'avantage d'obstacles inutiles &#224; la circulation sans entraves du savoir.<ref type="footnotemark" target="#3"/></p>
<p>Quand vous utilisez MS Word, Google Docs ou Open Office pour &#233;crire des textes, vous ne voyez pas ce qui se passe en coulisses. Sous une surface de mots, phrases et paragraphes visibles &#224; l'&#233;cran se cache une autre couche, de code celle-l&#224;, que seule la machine peut comprendre. &#192; cause de cette couche de code dissimul&#233;e, vos documents en format .docx et .pdf d&#233;pendent de logiciels propri&#233;taires pour &#234;tre affich&#233;s correctement. Il est donc diffile d'effectuer des recherches dans ces documents, de les imprimer et de les convertir en d'autre formats.</p>
<p>De plus, le temps que vous passez &#224; formater votre document dans MS Word ou Open Office est du temps perdu, puisque ce formatage sera retir&#233; par l'&#233;diteur au moment de la publication. Autant les auteur(e)s que les &#233;diteurs et &#233;ditrices gagneraient &#224; s'&#233;changer des fichiers contenant un minimum de formatage, en r&#233;servant la mise en page pour l'&#233;tape finale du processus de publication.</p>
<p>C'est ici qu'excelle Markdown. Markdown est une syntaxe qui permet le marquage s&#233;mantique des &#233;l&#233;ments &#224; l'int&#233;rieur du document de mani&#232;re explicite, et non dans une couche dissimul&#233;e sous la surface. Il s'agit d'identifier les unit&#233;s porteuses de sens pour les humains, comme les titres, sections, sous-sections, notes de bas de page et illustrations. Ainsi, vos fichiers resteront &#224; tout le moins lisibles pour vous, m&#234;me si le logiciel que vous utilisez actuellement cesse de fonctionner ou "met la cl&#233; sous la porte".</p>
<p>&#201;crire ce cette fa&#231;on lib&#232;re l'auteur(e) de son outil. Vous pouvez &#233;crire en Markdown dans n'importe quel &#233;diteur de texte brut, et la syntaxe dispose d'un riche &#233;cosyst&#232;me de logiciels qui peuvent transformer ces textes en de magnifiques documents. C'est pour cette raison que Markdown conna&#238;t actuellement une hausse de popularit&#233;, non seulement comme outil de r&#233;daction d'articles scientifiques, mais aussi comme norme pour l'&#233;dition en g&#233;n&#233;ral.</p>
<p><link target="https://atom.io/">Atom</link> (disponible sur toutes les plateformes) et <link target="http://notepad-plus-plus.org">Notepad++</link> (Windows seulement) sont parmi les &#233;diteurs de texte brut tout usage les plus populaires.</p>
<p>Il est important de comprendre que Markdown n'est qu'une convention d'&#233;criture. Les fichiers Markdown sont enregistr&#233;s en texte brut, ce qui contribue d'autant plus &#224; la flexibilit&#233; de ce format. Les fichiers en texte brut existent depuis l'apparition des machines &#224; &#233;crire &#233;lectroniques. La long&#233;vit&#233; de cette norme fait du texte brut un format intrins&#232;quement plus durable et plus stable que les formats propri&#233;taires. Alors que des fichiers cr&#233;&#233;s avec Microsoft Word et Apple Pages il y a &#224; peine dix ans peuvent provoquer des difficult&#233;s importantes lorsqu'ils sont affich&#233;s dans une version plus r&#233;cente de ces logiciels, il est encore possible aujourd'hui d'afficher sans probl&#232;me un fichier cr&#233;&#233; avec l'un des nombreux &#233;diteurs de texte brut "disparus" depuis quelques d&#233;cennies : AlphaPlus, Perfect Writer, Text Wizard, Spellbinder, WordStar, ou le pr&#233;f&#233;r&#233; d'Isaac Asimov, SCRIPSIT 2.0, cr&#233;&#233; par la cha&#238;ne de magasins d'&#233;lectronique Radio Shack. &#201;crire en texte brut permettra &#224; vos fichiers d'&#234;tre encore lisibles dans 10, 15 ou 20 ans. Cette le&#231;on propose un processus de r&#233;daction qui lib&#232;re les chercheurs et chercheuses des logiciels de traitement de texte propri&#233;taires et des formats non durables.</p>
<p>Il est maintenant possible d'&#233;crire tout un &#233;ventail de documents en un m&#234;me format &#8211; qu'il s'agisse d'articles, de billets de blogue, de wikis, de plans de cours ou de lettres de recommandation &#8211; et d'utiliser un seul et m&#234;me ensemble d'outils et de techniques afin de rechercher, d&#233;couvrir, sauvegarder et distribuer nos mat&#233;riaux. Vos notes, billets de blogue, documentations de code et wikis peuvent tous &#234;tre r&#233;dig&#233;s en Markdown. Un nombre croissant de plateformes, dont WordPress, Reddit et GitHub supportent l'&#233;criture en Markdown. Sur le long terme, votre recherche b&#233;n&#233;ficiera d'une organisation du travail uniformis&#233;e qui vous permettra d'enregistrer, rechercher, et organiser vos documents plus facilement.</p>
</div><div type="2"><head>Principes</head>
<p>Influenc&#233;s par diverses disciplines, nous avons &#233;t&#233; guid&#233;s par les principes suivants:</p>
<ol>
<li>
<p><emph>P&#233;rennit&#233;</emph>. Le texte brut permet d'assurer la transparence et r&#233;pond aux normes de pr&#233;servation &#224; long terme. MS Word pourrait dispara&#238;tre comme l'a d&#233;j&#224; fait Word Perfect, mais le texte brut restera toujours facile &#224; lire, cataloguer, explorer et transformer. De plus, le texte brut facilite une gestion des versions du document simple et puissante, ce qui profite &#224; la collaboration et &#224; l'organisation des brouillons. Vos fichiers en texte brut seront accessibles sur t&#233;l&#233;phones, tablettes et possiblement m&#234;me sur un ordinateur peu puissant dans une biblioth&#232;que isol&#233;e. Le texte brut est &#224; compatibilit&#233; descendante et &#224; l'&#233;preuve du temps. Peu importe quels logiciels et mat&#233;riel informatique le futur nous r&#233;serve, ils seront en mesure de comprendre le texte brut.</p>
</li>
<li>
<p><emph>Priorit&#233; &#224; la lisibilit&#233; humaine</emph>. Ce que vous &#233;crivez dans Word ou Google Docs n'est pas tel-tel. Le format .doc cache des caract&#232;res de formatage g&#233;n&#233;r&#233;s automatiquement cr&#233;ant une couche de formatage obscure qui rend le d&#233;pannage difficile pour les novices. Une t&#226;che pourtant simple, comme coller une image ou du texte copi&#233;s d'un navigateur Web peuvent avoir des effets inattendus sur la mise en page du document.</p>
</li>
<li>
<p><emph>S&#233;paration de la forme et du contenu</emph>. Formater en &#233;crivant est une source de distraction. L'id&#233;e est donc d'&#233;crire d'abord, et de formater plus tard, le plus pr&#232;s possible du moment de la publication. Devoir passer de Chicago &#224; MLA devrait se faire sans heurts. Les &#233;diteurs de revues scientifiques qui ne veulent pas perdre de temps en formatage et corrections inutiles devraient pouvoir fournir &#224; leurs auteurs un mod&#232;le de formatage qui prendrait en charge les d&#233;tails de la mise en page.</p>
</li>
<li>
<p><emph>Compatibilit&#233; avec la recherche universitaire</emph>. Le processus de travail doit &#234;tre en mesure de g&#233;rer les notes de bas de pages, figures, caract&#232;res internationaux et bibliographies avec &#233;l&#233;gance.</p>
</li>
<li>
<p><emph>Ind&#233;pendance vis-&#224;-vis des plateformes</emph>. Avec la multiplication des moyens de publication, nous devons &#234;tre en mesure de g&#233;n&#233;rer une multitude de formats pour, entre autres, les diaporamas, l'imprim&#233;, le web et les appareils mobiles. Id&#233;alement, nous voulons pouvoir g&#233;n&#233;rer les formats les plus communs sans briser les d&#233;pendances bibliographiques. Notre processus de travail se doit aussi d'&#234;tre portable &#8211; l'id&#233;al serait de pouvoir copier un seul dossier sur une cl&#233; USB en sachant qu'il contient tout les &#233;l&#233;ments n&#233;cessaires &#224; la publication. Par exemple, un plan de cours &#233;crit en Markdown peut &#234;tre enregistr&#233; en PDF, imprim&#233; sur papier, et converti en HTML pour le web, le tout &#224; partir d'un seul et m&#234;me format. Les documents web et imprim&#233;s devraient &#234;tre publi&#233;s &#224; partir du m&#234;me document source et se ressembler, pr&#233;servant ainsi la disposition logique des mat&#233;riaux.</p>
</li>
</ol>
<p>Markdown et LaTeX r&#233;pondent &#224; tous ces crit&#232;res. Nous avons choisi Markdown (et non LaTeX) parce qu'il offre la syntaxe la plus simple et l&#233;g&#232;re (d'o&#249; le nom, mark <emph>down</emph>), et parce qu'il assure, en combinaison avec Pandoc, la plus grande flexibilit&#233; au niveau des formats d'exportation (incluant les fichiers .docx et .tex).<ref type="footnotemark" target="#4"/></p>
</div><div type="2"><head>Pr&#233;-requis logiciels</head>
<p>Nous omettons d&#233;lib&#233;r&#233;ment certains d&#233;tails pr&#233;cis du processus d'installation, qui d&#233;pendent des diff&#233;rentes plateformes ou syst&#232;mes d'exploitation. Il nous est inutile de fournir des instructions d'installation pour LaTeX, alors que les instructions en ligne standard pour votre syst&#232;me d'exploitation resteront toujours plus actuelles et plus compl&#232;tes. De m&#234;me, il est pr&#233;f&#233;rable que vous exploriez les m&#233;canismes d'installation de Pandoc en cherchant "installer Pandoc" sur Google, puisque le premier r&#233;sultat g&#233;n&#233;r&#233; sera probablement la page d'accueil de Pandoc.</p>
<ul>
<li>
<p><hi rend="bold">&#201;diteur de texte brut</hi>. Faire incursion dans le monde des &#233;diteurs de texte brut augmente consid&#233;rablement la gamme d'outils de cr&#233;ation innovants qui vous sont accessibles. Cherchez "&#233;diteur texte markdown" sur le Web et testez diff&#233;rentes options. Peu importe l'&#233;diteur que vous choisirez, assurez-vous seulement qu'il s'agisse d'un &#233;diteur de texte brut, comme Atom ou Notepad++. Souvenez-vous que puisque vous n'&#234;tes plus d&#233;pendant &#224; un outil particulier, vous pouvez changer d'&#233;diteur &#224; tout moment.</p>
</li>
<li>
<p><hi rend="bold">Interface en ligne de commande</hi>. Travailler "en ligne de commande" consiste &#224; saisir des commandes dans une interface d&#233;di&#233;e. Sur un Mac, vous n'avez qu'&#224; chercher "Terminal" dans les applications. Sur Windows, utilisez PowerShell. Les utilisateurs Linux ont probablement d&#233;j&#224; l'habitude d'utiliser de leur terminal. Nous allons expliquer les fonctions et l'utilisation de base de la ligne de commande plus bas dans le texte.</p>
</li>
<li>
<p><hi rend="bold">Pandoc</hi>. Des instructions d'installation d&#233;taill&#233;es sp&#233;cifiques &#224; chaque plateforme sont disponibles en anglais sur le <link target="https://pandoc.org/installing.html">site web de Pandoc</link>. <emph>L'installation de Pandoc sur votre machine est une &#233;tape cruciale &#224; la r&#233;alisation de cette le&#231;on</emph>, veuillez-donc vous assurer de prendre le temps de bien lire les instructions. Pandoc a &#233;t&#233; cr&#233;&#233; et est maintenu par John MacFarlane, professeur de philosophie &#224; l'Universit&#233; de Californie &#224; Berkeley. Ce projet d'humanit&#233;s num&#233;riques par excellence servira de moteur &#224; notre processus de travail. Avec Pandoc, vous pourrez transformer des textes et des bibliographies en documents flexibles et magnifiquement format&#233;s. Lorsque vous aurez proc&#233;d&#233; &#224; l'installation, assurez-vous que Pandoc est bien install&#233; en saisissant <code type="inline">pandoc --version</code> dans votre terminal. Nous prenons pour acquis que vous disposez au moins de la version 2.0, sortie en octobre 2017.</p>
</li>
</ul>
<p>Les deux logiciels suivants sont recommand&#233;s, mais ne sont pas requis pour compl&#233;ter ce tutoriel.</p>
<ul>
<li>
<p><hi rend="bold">Zotero ou Endnote</hi>. Les logiciels de gestion bibliographique sont des outils indispensables &#224; l'organisation et au formatage des citations d'un article scientifique. Ces programmes vous permettent d'exporter vos biblioth&#232;ques en fichiers BibTeX (vous en apprendrez plus l&#224;-dessus plus tard dans cette le&#231;on). Ce fichier contenant toutes vos r&#233;f&#233;rences en format texte brut vous permettra de citer rapidement et facilement en utilisant des cl&#233;s de citation <code type="inline">@key</code>. Notez qu'il est aussi possible de saisir toutes vos r&#233;f&#233;rences bibliographiques &#224; la main en vous servant de <link target="https://github.com/dhcolumbia/pandoc-workflow/blob/master/pandoctut.bib">notre bibliographie</link> comme mod&#232;le.</p>
</li>
<li>
<p><hi rend="bold">LaTeX</hi>. Des instructions d'installation d&#233;taill&#233;es sp&#233;cifiques &#224; chaque plateforme sont disponibles sur le <link target="https://pandoc.org/installing.html">site web de Pandoc</link>. Ce tutoriel n'aborde pas le sujet, mais Pandoc se sert de LaTeX pour cr&#233;er des PDF. Les utilisateurs avanc&#233;s convertissent souvent les documents directement en LaTeX pour avoir un contr&#244;le plus pr&#233;cis sur la mise en page du fichier .pdf. Les d&#233;butants peuvent choisir de sauter cette &#233;tape. Sinon, tapez <code type="inline">latex -v</code> pour voir si LaTeX est install&#233; correctement (vous obtiendrez une erreur s'il ne l'est pas, et des informations sur la version s'il est bel et bien install&#233;).</p>
</li>
</ul>
</div><div type="2"><head>Les rudiments de Markdown</head>
<p>Markdown est une convention de structuration s&#233;mantique des documents en texte brut. L'id&#233;e est d'identifier les structures logiques de votre document (un titre, des sections, sous-sections, notes de bas de page, etc.) et de les d&#233;limiter avec des caract&#232;res relativement discrets, pour ensuite "compiler" le document qui en r&#233;sulte avec un interpr&#233;teur qui le formatera de mani&#232;re coh&#233;rente, selon un style d&#233;termin&#233;.</p>
<p>Il existe diff&#233;rentes variantes du langage Markdown con&#231;ues pour diff&#233;rents contextes sp&#233;cifiques, comme les blogues, les wikis et les d&#233;p&#244;ts de code. La sp&#233;cification de Markdown qu'utilise Pandoc est con&#231;ue pour un usage universitaire. Ses r&#232;gles d'utilisation se trouvent dans la <link target="http://pandoc.org/README.html#pandocs-markdown">section d&#233;di&#233;e</link> du manuel utilisateur de Pandoc. Ses ajouts comprennent notamment le <link target="http://johnmacfarlane.net/pandoc/README.html#yaml-metadata-block">bloc YAML</link>, qui sert &#224; exprimer des m&#233;tadonn&#233;es utiles.<ref type="footnotemark" target="#5"/></p>
<p>Cr&#233;ons maintenant un document Markdown simple. Ouvrez d'abord l'&#233;diteur de texte brut de votre choix et commencez &#224; &#233;crire. Votre texte devrait ressembler &#224; ceci :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_0" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_0.txt"></code></pre>
<p>Pandoc reconna&#238;t chacune des valeurs ci-dessus et les "imprime" &#224; l'emplacement appropri&#233; dans le document g&#233;n&#233;r&#233; lorsque vous arriverez &#224; l'&#233;tape de la mise en page. Nous apprendrons plus tard &#224; ajouter des champs plus pouss&#233;s au bloc YAML. Pour l'instant, supposons que nous &#233;crivons un article qui contient trois sections, chacune &#233;tant divis&#233;e en deux sous-sections. Laissez une ligne vide apr&#232;s les trois derniers tirets du bloc YAML et collez-y le texte suivant :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_1" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_1.txt"></code></pre>
<p>Ins&#233;rez du faux-texte pour les besoins de l'essai. Les espaces sont interpr&#233;t&#233;es par Markdown, il ne faut donc pas mettre d'alin&#233;a au d&#233;but des paragraphes. Divisez-les plut&#244;t en laissant une ligne vide. Les en-t&#234;tes de sections doivent aussi &#234;tre pr&#233;c&#233;d&#233;es d'une ligne vide.</p>
<p>Vous pouvez vous servir des ast&#233;risques pour mettre vos mots en gras ou en italique, comme suit : <code type="inline">*italique*</code> et <code type="inline">**gras**</code>. Ajoutons aussi un lien et une note de bas de page, pour faire le tour des &#233;l&#233;ments de base d'un article moyen. &#201;crivez:</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_2" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_2.txt"></code></pre>
<p>Si le texte du lien et l'URL sont &#233;quivalents, il est possible et plus rapide d'&#233;crire <code type="inline">&lt;www.eff.org&gt;</code> que <code type="inline">[www.eff.org](www.eff.org)</code>.</p>
<p>Enregistrons maintenant notre document avant d'aller plus loin. Cr&#233;ez un nouveau dossier qui contiendra votre projet. Vous avez s&#251;rement un syst&#232;me d'organisation pour vos documents, projets, illustrations et bibliographies. Mais souvent, vos documents, illustrations et bibliographies se trouvent dans diff&#233;rents dossiers, ce qui les rend difficiles &#224; rep&#233;rer. Notre objectif est de cr&#233;er un seul dossier pour chaque projet, qui contiendra tout le mat&#233;riel pertinent. La r&#232;gle g&#233;n&#233;rale est d'un projet, un article, un dossier. Nommez votre fichier quelque chose comme 'projet.md', o&#249; 'md' signifie markdown.</p>
<p>Une fois le fichier enregistr&#233;, ajoutons-y une illustration. Copiez n'importe quelle image de petite taille dans votre dossier, et ajoutez ceci au corps du texte: <code type="inline">![L&#233;gende de l'image](votre_image.jpg)</code>.</p>
<p>&#192; ce stade, le fichier 'projet.md' devrait ressembler au texte ci-dessous. Vous pouvez t&#233;l&#233;charger cet exemple de fichier .md <link target="https://raw.githubusercontent.com/programminghistorian/jekyll/gh-pages/assets/sample.md">ici</link>.</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_3" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_3.txt"></code></pre>
<p>Comme nous le verrons bient&#244;t, ce fichier en texte brut peut &#234;tre utilis&#233; pour g&#233;n&#233;rer un PDF plut&#244;t &#233;l&#233;gant :</p>
<figure><desc>Capture d'&#233;cran d'un PDF g&#233;n&#233;r&#233; par Pandoc</desc><graphic url="Screen-Shot-2014-11-06.png"/></figure>
<p>Si vous voulez avoir une id&#233;e de la fa&#231;on dont ce type de balisage sera interpr&#233;t&#233; en format HTML, utilisez <link target="https://pandoc.org/try/">cette application en ligne</link> pour tester diff&#233;rents types de syntaxe. Certains &#233;l&#233;ments du Markdown de Pandoc (comme le bloc de titre) ne fonctionneront que si vous cochez la case "G&#233;n&#233;rer un document autonome (<emph>standalone</emph>)".</p>
<p>Prenez maintenant un peu de temps pour explorer d'autres fonctionnalit&#233;s du Markdown de Pandoc, comme les blocs de citation (d&#233;sign&#233;s par ce symbole : <code type="inline">&gt;</code>), les listes &#224; puces, qui d&#233;butent par <code type="inline">*</code> ou <code type="inline">-</code>, les retours &#224; la ligne manuels (tr&#232;s utile pour la po&#233;sie), les tableaux ainsi que quelques autres fonctions mentionn&#233;es dans la section Markdown du manuel de Pandoc.</p>
<p>Portez une attention particuli&#232;re aux espaces vides et au d&#233;coupage des paragraphes. La documentation d&#233;finit un paragraphe de mani&#232;re succincte comme &#233;tant "une ou plusieurs lignes de texte suivies d'une ou plusieurs lignes vides". Notez que "les retours chariots sont trait&#233;s comme des espaces" et que "si vous avez besoin d'un saut de ligne, mettez deux espaces ou plus &#224; la fin d'une ligne". La meilleure fa&#231;on de comprendre ce que cela signifie est d'exp&#233;rimenter sur le tas. Utilisez le mode de pr&#233;visualisation de votre &#233;diteur ou lancez simplement Pandoc pour voir les r&#233;sultats de vos exp&#233;riences.</p>
<p>Avant tout, r&#233;sistez &#224; la tentation de mettre en forme le document. Souvenez-vous que vous identifiez des unit&#233;s <emph>s&#233;mantiques</emph> : sections, sous-sections, emphase, notes de bas de page et figures. En Markdown, m&#234;me les <code type="inline">*italiques*</code> et les <code type="inline">**caract&#232;res gras**</code> ne sont pas vraiment des marques de formatage ; ils indiquent plut&#244;t diff&#233;rents niveaux d'emphase. La mise en page interviendra plus tard, lorsque vous conna&#238;trez le lieu et les conditions de publication.</p>
<p>Certains programmes vous permettent de voir un aper&#231;u en direct du formatage de votre fichier Markdown pendant que vous &#233;crivez. Vous en trouverez des exemples dans la section <link target="#ressources-utiles">Ressources utiles</link> &#224; la fin de cette le&#231;on. Cependant, peu d'entre eux supportent les notes de bas de page, les illustrations et les bibliographies. Pour profiter pleinement de Pandoc, nous vous recommandons de conserver de simples fichiers en texte brut, stock&#233;s localement, sur votre ordinateur.</p>
</div><div type="2"><head>D&#233;couvrez votre terminal int&#233;rieur</head>
<p>Avant de publier notre fichier <code type="inline">projet.md</code> en d'autres formats, nous devons nous familiariser avec la ligne de commande en utilisant le terminal de notre ordinateur, la seule (et meilleure) fa&#231;on d'utiliser Pandoc.</p>
<p>La ligne de commande est un environnement agr&#233;able, une fois qu'on s'y est habitu&#233;. Si vous &#234;tes d&#233;j&#224; familiaris&#233; avec l'utilisation de la ligne de commande, n'h&#233;sitez pas &#224; sauter cette section. Pour les autres, il est important de comprendre que le fait de pouvoir utiliser directement votre terminal vous permettra de recourir &#224; un large &#233;ventail d'outils de recherche puissants que vous ne pourriez pas utiliser autrement, et qui peuvent servir de base &#224; des t&#226;ches plus avanc&#233;es. Pour les besoins de ce tutoriel, vous n'avez besoin d'apprendre que quelques commandes tr&#232;s simples.</p>
<p>Commencez par ouvrir une fen&#234;tre de terminal. Si vous utilisez macOS, ouvrez l'application Terminal dans le r&#233;pertoire "Applications/Utilitaires". Sous Windows, nous vous recommandons d'utiliser PowerShell ou, pour une solution plus robuste, d'installer le sous-syst&#232;me Windows pour Linux et d'utiliser le terminal fourni avec la distribution Linux de votre choix. Pour une excellente introduction &#224; la ligne de commande, vous pouvez consulter cette le&#231;on (en anglais) de Ian Milligan et James Baker : "<link target="/en/lessons/intro-to-bash">Introduction to the Bash Command Line</link>"</p>
<p>Dans le terminal, vous devriez voir une fen&#234;tre de texte et une invite qui ressemble &#224; ceci: <code type="inline">nom_de_l'ordinateur:~nom_de_l'utilisateur$</code>. Le tilde indique votre r&#233;pertoire de base, et vous pouvez en effet taper <code type="inline">$ cd ~</code> &#224; n'importe quel moment pour revenir &#224; celui-ci. Ne saisissez pas le symbole <code type="inline">$</code>, il repr&#233;sente simplement l'invite de commande de votre terminal, qui vous invite &#224; taper quelque chose dans celui-ci (au lieu de le saisir dans un document) ; n'oubliez pas d'appuyer sur la touche d'entr&#233;e apr&#232;s chaque commande.</p>
<p>Il est tr&#232;s probable que votre dossier "Documents" se trouve ici. Tapez <code type="inline">$ pwd</code> (= <emph>print working directory</emph>, imprimer le r&#233;pertoire de travail) et appuyez sur la touche d'entr&#233;e pour afficher le nom du r&#233;pertoire actuel. Utilisez <code type="inline">$ pwd</code> chaque fois que vous vous avez l'impression de perdre le nord.</p>
<p>La commande <code type="inline">$ ls</code> (= <emph>list</emph>, lister) liste simplement les fichiers qui se trouvent dans le r&#233;pertoire courant. Enfin, vous pouvez utiliser <code type="inline">$ cd</code> (= <emph>change directory</emph>, changer de r&#233;pertoire) comme suit : <code type="inline">$ cd NOM_DU_R&#201;PERTOIRE</code> (o&#249; <code type="inline">NOM_DU_R&#201;PERTOIRE</code> est le nom du r&#233;pertoire que vous aimeriez consulter). Vous pouvez utiliser <code type="inline">$ cd ..</code> pour remonter automatiquement d'un niveau dans la structure des r&#233;pertoires (le parent du r&#233;pertoire dans lequel vous &#234;tes actuellement). Une fois que vous avez commenc&#233; &#224; taper le nom du r&#233;pertoire, utilisez la touche de tabulation pour compl&#233;ter automatiquement le texte, une fonction particuli&#232;rement utile pour les noms de r&#233;pertoires particuli&#232;rement longs, ou pour ceux qui contiennent des espaces<ref type="footnotemark" target="#6"/>.</p>
<p>Ces trois commandes de terminal, <code type="inline">pwd</code>, <code type="inline">ls</code> et <code type="inline">cd</code>, sont tout ce dont vous avez besoin pour cette le&#231;on. Pratiquez-les pendant quelques minutes pour apprendre vous d&#233;placer dans votre fichier et r&#233;fl&#233;chissez &#224; la fa&#231;on dont vous avez organis&#233; vos dossiers. Si vous le souhaitez, suivez chaque &#233;tape avec l'explorateur de fichiers normal (avec interface graphique) en parall&#232;le afin de ne pas perdre vos rep&#232;res.</p>
</div><div type="2"><head>Utilisation de Pandoc pour convertir le Markdown en document MS Word</head>
<p>Nous voil&#224; maintenant pr&#234;ts &#224; faire la mise en page ! Ouvrez une fen&#234;tre de terminal, utilisez <code type="inline">$ cd NOM-DU-R&#201;PERTOIRE</code> pour naviguer vers le dossier qui contient votre projet. Une fois que vous y &#234;tes, tapez <code type="inline">$ ls</code> dans le terminal pour lister les fichiers. Si vous voyez votre fichier .md et vos images, vous &#234;tes au bon endroit. Pour convertir le fichier .md en .docx, tapez :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_4" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_4.txt"></code></pre>
<p>Ouvrez le fichier avec MS Word pour v&#233;rifier vos r&#233;sultats. Si vous utilisez LibreOffice, vous pouvez taper :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_5" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_5.txt"></code></pre>
<p>Si vous &#234;tes d&#233;butant(e) en mati&#232;re de ligne de commande, imaginez que vous interpr&#233;tez la commande ci-dessus de cette fa&#231;on : "Pandoc, cr&#233;e un fichier MS Word &#224; partir de mon fichier Markdown." Le <code type="inline">-o</code>, pour "output" (sortie), est une option qui, dans ce cas-ci, signifie quelque chose comme : "Au lieu d'avoir &#224; te nommer explicitement le format du fichier cible, devine-le &#224; l'aide de l'extension du nom de fichier". De nombreuses options sont disponibles de cette mani&#232;re dans Pandoc. Vous pouvez en voir la liste compl&#232;te sur le <link target="https://pandoc.org/MANUAL.html#options">site web de Pandoc</link> ou en tapant <code type="inline">$ man pandoc</code> dans le terminal.</p>
<p>Tentez maintenant d'ex&#233;cuter la commande suivante :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_6" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_6.txt"></code></pre>
<p>Retournez ensuite dans le r&#233;pertoire de votre projet. Pouvez-vous expliquer ce qui s'est pass&#233; ?</p>
<p>Les utilisateurs plus avanc&#233;s qui ont install&#233; LaTeX voudront peut-&#234;tre exp&#233;rimenter en convertissant leur Markdown en fichiers .tex ou en fichiers .pdf sp&#233;cialement mis en page. Une fois LaTeX install&#233;, un fichier PDF &#233;l&#233;gamment format&#233; peut &#234;tre cr&#233;&#233; en utilisant la m&#234;me structure de commande :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_7" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_7.txt"></code></pre>
<p>Si votre document est r&#233;dig&#233; dans une autre langue que l'anglais, vous devrez probablement utiliser le moteur <link target="https://fr.wikipedia.org/wiki/XeTeX">XeLaTeX</link> au lieu du moteur LaTeX ordinaire pour la conversion en .pdf :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_8" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_8.txt"></code></pre>
<p>Assurez-vous que votre &#233;diteur de texte prend en charge le codage UTF-8. Lorsque vous utilisez XeLaTeX pour la conversion en .pdf, au lieu de l'attribut <code type="inline">fontfamily</code> en YAML pour changer de police, sp&#233;cifiez l'attribut <code type="inline">mainfont</code>, ce qui donnera quelque chose comme suit :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_9" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_9.txt"></code></pre>
</div><div type="2"><head>Gestion des bibliographies</head>
<p>Dans la section qui suit, nous ajouterons une bibliographie &#224; notre document, puis nous convertirons celle-ci du format Chicago au format MLA.</p>
<p>Si vous n'utilisez pas encore de gestionnaire de r&#233;f&#233;rences comme Endnote ou Zotero, vous devriez vous y mettre. Nous pr&#233;f&#233;rons Zotero, car, comme Pandoc, il a &#233;t&#233; cr&#233;&#233; par la communaut&#233; universitaire et, comme d'autres projets en source libre, il est publi&#233; sous la licence <link target="https://fr.wikipedia.org/wiki/Licence_publique_g%C3%A9n%C3%A9rale_GNU">GNU-GPL</link>. Le plus important ici est la capacit&#233; de votre gestionnaire de r&#233;f&#233;rence &#224; g&#233;n&#233;rer des bibliographies en format texte brut, pour rester fid&#232;le &#224; notre principe du "tout en texte brut". Ouvrez le gestionnaire de r&#233;f&#233;rences de votre choix et ajoutez quelques titres pour les besoins de la le&#231;on. Lorsque vous &#234;tes pr&#234;t(e), trouvez l'option qui permet d'exporter votre bibliographie au format BibTeX (.bib). Enregistrez votre fichier .bib dans votre r&#233;pertoire de projet, et donnez-lui un titre parlant comme "projet.bib".</p>
<p>Il est pr&#233;f&#233;rable de conserver vos sources organis&#233;es dans une base de donn&#233;es bibliographiques centralis&#233;e, tout en g&#233;n&#233;rant des fichiers .bib sp&#233;cifiques et beaucoup plus petits qui se trouveront dans le m&#234;me r&#233;pertoire que votre projet. Ouvrez votre fichier .bib avec l'&#233;diteur de texte de votre choix.<ref type="footnotemark" target="#7"/></p>
<p>Votre fichier .bib devrait contenir plusieurs entr&#233;es qui ressemblent &#224; ceci :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_10" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_10.txt"></code></pre>
<p>Vous devrez rarement les modifier &#224; la main (bien que vous puissiez le faire). Dans la plupart des cas, vous "exporterez" simplement le fichier .bib &#224; partir de Zotero ou d'un gestionnaire de r&#233;f&#233;rences similaire. Prenez un moment pour vous orienter ici. Chaque entr&#233;e consiste en un type de document, "article" dans notre cas, un identifiant unique (fyfe_digital_2011), et les m&#233;tadonn&#233;es pertinentes sur le titre, volume, auteur, etc. Ce qui nous importe le plus, c'est l'identification unique qui suit imm&#233;diatement l'accolade sur la premi&#232;re ligne de chaque entr&#233;e. L'identifiant unique est ce qui nous permet de relier la bibliographie au reste du document. Laissez ce fichier ouvert pour l'instant et retournez &#224; votre fichier <code type="inline">projet.md</code>.</p>
<p>Modifiez la note de bas de page de la premi&#232;re ligne de votre fichier <code type="inline">projet.md</code> pour qu'elle ressemble aux exemples suivants, o&#249; <code type="inline">@nom_titre_date</code> peut &#234;tre remplac&#233; par l'un des les identifiants uniques de votre fichier <code type="inline">projet.bib</code> :</p>
<ul>
<li><code type="inline">Une r&#233;f&#233;rence format&#233;e de cette mani&#232;re sera affich&#233;e correctement sous forme de citation dans le corps du texte ou de note de bas de page [@name_title_date, 67].</code><ref type="footnotemark" target="#8"/></li>
<li><code type="inline">"Pour les citations entre guillemets, indiquez la citation &#224; l'int&#233;rieur des guillemets [@name_title_2011, 67]".</code></li>
</ul>
<p>Une fois que nous aurons pass&#233; le fichier Markdown dans Pandoc, "@fyfe_digital_2011" deviendra une citation compl&#232;te dans le style de votre choix. Vous pouvez utiliser la syntaxe <code type="inline">@citation</code> comme bon vous semble : dans le corps du texte ou en notes de bas de page. Par d&#233;faut, la bibliographie sera g&#233;n&#233;r&#233;e &#224; la fin du document. On peut inclure un titre de section comme <code type="inline"># Bibliographie</code> &#224; la fin du document pour anticiper cela.</p>
<p>Retournez maintenant &#224; l'en-t&#234;te de vos m&#233;tadonn&#233;es en haut de votre document .md, et pr&#233;ciser le fichier bibliographique &#224; utiliser, comme ceci:</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_11" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_11.txt"></code></pre>
<p>Cela indique &#224; Pandoc de chercher votre bibliographie dans le fichier <code type="inline">projet.bib</code>, situ&#233; dans le m&#234;me r&#233;pertoire que votre fichier <code type="inline">projet.md</code>. Voyons si cela fonctionne. Sauvegardez votre fichier, passez &#224; la fen&#234;tre du terminal et ex&#233;cutez cette commande :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_12" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_12.txt"></code></pre>
<p>Le filtre "citeproc" analysera toutes les cl&#233;s de citation trouv&#233;es dans votre document. Le r&#233;sultat doit &#234;tre un fichier MS Word correctement format&#233;. Si vous avez install&#233; LaTeX, convertissez le fichier au format PDF en utilisant la m&#234;me syntaxe pour un r&#233;sultat plus &#233;l&#233;gant. Ne vous inqui&#233;tez pas si les choses ne sont pas encore tout &#224; fait &#224; votre go&#251;t - souvenez-vous que vous allez affiner le formatage d'un seul coup, plus tard dans le processus, au plus pr&#232;s possible du moment de la publication. Pour l'instant, nous ne faisons que cr&#233;er des brouillons bas&#233;s sur des valeurs par d&#233;fauts convenables.</p>
</div><div type="2"><head>Changer de style de citation</head>
<p>Le style de citation par d&#233;faut de Pandoc est le Chicago Auteur-Date. On peut sp&#233;cifier un style diff&#233;rent en utilisant une feuille de style &#233;crite en "Citation Style Language" (une autre convention au format texte, qui d&#233;crit les styles de citation) et d&#233;sign&#233;e par l'extension de fichier .csl. Heureusement, le projet CSL maintient un d&#233;p&#244;t de styles de citation communs, certains &#233;tant m&#234;me adapt&#233;s &#224; des revues sp&#233;cifiques. Visitez le site <link target="http://editor.citationstyles.org/about/">http://editor.citationstyles.org/about/</link> pour trouver le fichier .csl de la Modern Language Association (MLA), t&#233;l&#233;chargez <code type="inline">modern-language-association.csl</code>, et sauvegardez-le dans le r&#233;pertoire de votre projet sous le nom <code type="inline">mla.csl</code>. Maintenant, nous devons signaler &#224; Pandoc d'utiliser la feuille de style MLA au lieu du style par d&#233;faut, Chicago. Nous faisons ceci en mettant &#224; jour l'en-t&#234;te YAML :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_13" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_13.txt"></code></pre>
<p>R&#233;p&#233;tez ensuite la commande Pandoc pour lancer votre fichier Mardown dans le format cible d&#233;sir&#233; (.pdf ou .docx) :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_14" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_14.txt"></code></pre>
<p>Analysez la commande en anglais au fur et &#224; mesure que vous la tapez. Dans ma t&#234;te, je traduis ce qui pr&#233;c&#232;de par quelque chose comme "Pandoc, prends mon fichier Markdown, passe-le dans un filtre de citation, et g&#233;n&#232;re un fichier PDF." Lorsque vous vous familiariserez avec les feuilles de style de citation, pensez &#224; ajouter vos fichiers .csl personnalis&#233;s pour les revues de votre domaine &#224; l'archive du projet CSL, afin de rendre service &#224; la communaut&#233;.</p>
</div><div type="2"><head>R&#233;sum&#233;</head>
<p>Vous devriez maintenant &#234;tre en mesure de r&#233;diger des articles en Markdown, de cr&#233;er des brouillons en plusieurs formats, d'ajouter des bibliographies et de changer facilement de style de citation. Un dernier coup d'oeil au r&#233;pertoire du projet r&#233;v&#232;le un certain nombre de fichiers "sources" : votre fichier <code type="inline">projet.md</code>, votre fichier <code type="inline">projet.bib</code>, votre fichier <code type="inline">mla.csl</code> et quelques images. Outre les fichiers sources, vous devriez voir quelques fichiers "cibles" que nous avons cr&#233;&#233;s au cours du tutoriel : <code type="inline">projet.docx</code> ou <code type="inline">projet.pdf</code>. Le contenu de votre dossier devrait ressembler &#224; quelque chose comme ceci :</p>
<pre><code xml:id="code_redaction-durable-avec-pandoc-et-markdown_15" type="block" corresp="code_redaction-durable-avec-pandoc-et-markdown_15.txt"></code></pre>
<p>Consid&#233;rez vos fichiers sources comme une version faisant autorit&#233; de votre texte, et vos fichiers cibles comme des "impressions" jetables que vous pouvez facilement g&#233;n&#233;rer &#224; la vol&#233;e avec Pandoc. Toutes les r&#233;visions doivent aller dans le fichier <code type="inline">projet.md</code>. Le fichier <code type="inline">projet.docx</code> sert au nettoyage final et au formatage. Par exemple, si le journal n&#233;cessite des manuscrits &#224; double interligne, vous pouvez rapidement les mettre en double interligne dans Open Office ou Microsoft Word. Mais ne passez pas trop de temps &#224; formater. N'oubliez pas que tout est effac&#233; lorsque votre manuscrit part &#224; l'impression. Vous profiterez du temps gagn&#233; en &#233;vitant la mise en forme inutile pour peaufiner la prose de votre brouillon.</p>
</div><div type="2"><head>Ressources utiles</head>
<div type="3"><head>En anglais :</head>
<p>En cas de probl&#232;me, il n'y a pas de meilleur endroit pour commencer votre recherche que <link target="https://pandoc.org/">le site web de Pandoc</link> et sa <link target="https://groups.google.com/g/pandoc-discuss">liste de discussion</link>. Des sites de type "Questions-r&#233;ponses" peuvent r&#233;pertorier des questions sur Pandoc, tel <link target="http://stackoverflow.com/questions/tagged/pandoc">Stack Overflow</link>; vous pouvez aussi consulter les archives du site <link target="https://dhanswers.ach.org/">Digital Humanities Q&amp;A</link> qui &#233;tait actif de 2010 &#224; 2019. Les questions peuvent &#233;galement &#234;tre pos&#233;es en direct, sur la cha&#238;ne Pandoc de Freenode IRC, qui est fr&#233;quent&#233;e par un groupe d'habitu&#233;(e)s plut&#244;t sympathiques. Au fur et &#224; mesure que vous en apprendrez davantage sur Pandoc, vous pouvez &#233;galement explorer l'une de ses fonctionnalit&#233;s les plus puissantes : les <link target="https://github.com/jgm/pandoc/wiki/Pandoc-Filters">filtres</link>.</p>
<p>Bien que nous sugg&#233;rions de commencer avec un simple &#233;diteur de texte, nombre d'alternatives &#224; MS Word sp&#233;cifiques &#224; Markdown sont disponibles en ligne, et souvent sans frais (d'apr&#232;s <link target="http://web.archive.org/web/20140120195538/http://mashable.com/2013/06/24/markdown-tools/">cette entr&#233;e de blogue</link> qui date de 2013, il en existait alors plus de 70). Parmi les projets autonomes, nous appr&#233;cions particuli&#232;rement <link target="http://mouapp.com/">Mou</link>, <link target="http://writemonkey.com">Write Monkey</link>, et <link target="http://www.sublimetext.com/">Sublime Text</link>. Plusieurs plateformes sur le Web ont r&#233;cemment vu le jour et fournissent des interfaces graphiques &#233;l&#233;gantes pour l'&#233;criture collaborative et le suivi des versions &#224; l'aide de Markdown. Il s'agit entre autres de <link target="http://prose.io">prose.io</link>, <link target="http://www.authorea.com">Authorea</link>, <link target="http://www.draftin.com">Draft</link>, et <link target="https://stackedit.io">StackEdit</link>.</p>
<p>Cependant, l'&#233;cosyst&#232;me ne se limite pas aux &#233;diteurs de texte. <link target="https://github.com/jgm/gitit">Gitit</link> et <link target="https://github.com/dubiousjim/pandoc-iki">Ikiwiki</link> supportent la r&#233;daction en Markdown avec Pandoc comme analyseur de syntaxe. &#192; cette liste, nous pouvons ajouter une gamme d'outils qui g&#233;n&#232;rent des pages web rapides et statiques, <link target="https://github.com/jgm/yst">Yst</link>, <link target="http://github.com/fauno/jekyll-pandoc-multiple-formats">Jekyll</link>, <link target="http://jaspervdj.be/hakyll/">Hakyll</link>, et <link target="https://github.com/wcaleb/website">bash shell script</link>, un projet de l'historien Caleb McDaniel.</p>
<p>Enfin, des plates-formes d'&#233;dition enti&#232;res se d&#233;veloppent autour de l'utilisation de Markdown. Un march&#233; de l'&#233;dition en Markdown, comme le fait d&#233;j&#224; <link target="https://leanpub.com">Leanpub</link>, pourrait &#234;tre une alternative int&#233;ressante au mod&#232;le d'&#233;dition traditionnel. Nous-m&#234;mes exp&#233;rimentons avec la conception de revues universitaires bas&#233;es sur GitHub et <link target="http://readthedocs.org">readthedocs.org</link> (ces outils sont habituellement utilis&#233;s pour la documentation technique).</p>
</div><div type="3"><head>En fran&#231;ais (N.D.L.R. : il s&#8217;agit de notes ajout&#233;es &#224; la version traduite) :</head>
<p>Ce guide cr&#233;&#233; par l'&#201;cole polytechnique f&#233;d&#233;rale de Lausanne, <link target="https://enacit.epfl.ch/cours/markdown-pandoc/">&#201;laboration et conversion de documents avec Markdown et Pandoc</link>, peut servir de r&#233;f&#233;rence pour comprendre les subtilit&#233;s de la syntaxe Markdown et des extensions Pandoc.</p>
<p>Le blogue du <link target="https://www.arthurperret.fr/">site web d'Arthur Perret</link> offre plusiers entr&#233;es sur Pandoc. Le site en soi est un exemple de r&#233;alisation d'un site statique avec Pandoc. </p>
<p>Pour la gestion des bibliographies, consulter aussi: Rapha&#235;l Grolimund, Fr&#233;d&#233;rique Flamerie, Vincent Carlino, &#171; Markdown et Zotero &#187;, <emph>Le blog Zotero francophone</emph>, 14 novembre 2018, <link target="https://zotero.hypotheses.org/2258">https://zotero.hypotheses.org/2258</link> (consult&#233; le 1er novembre 2020).</p>
</div></div><div type="2"><head>Notes</head>
<p><note id="1"> Ne vous inqui&#233;tez pas si vous ne comprenez pas encore toute cette terminologie !</note></p>
<p><note id="2"> Les documents d'origine peuvent &#234;tre <link target="https://github.com/dhcolumbia/pandoc-workflow">t&#233;l&#233;charg&#233;s &#224; partir de GitHub</link>. Utilisez l'option "Raw" (brut) lors de la visualisation dans GitHub pour voir la source en Markdown. Les auteurs tiennent &#224; remercier Alex Gil et ses coll&#232;gues du Digital Humanities Center de Columbia, ainsi que les participants du studio openLab de la Biblioth&#232;que Butler, qui ont test&#233; le code de ce tutoriel sur diverses plateformes.</note></p>
<p><note id="3"> Voir l'excellente r&#233;flexion de Charlie Stross sur ce sujet: <link target="http://www.antipope.org/charlie/blog-static/2013/10/why-microsoft-word-must-die.html">Why Microsoft Word Must Die</link>.</note></p>
<p><note id="4"> Il n'y a pas de bonnes solutions pour passer directement de LaTeX &#224; MS Word.</note></p>
<p><note id="5"> Notez que le bloc YAML reproduit souvent une partie, mais pas la totalit&#233;, de l'argument ou des options en ligne de commande. Par exemple, les styles de police peuvent &#234;tre transmis &#224; Pandoc de la mani&#232;re suivante: <code type="inline">pandoc projet.md --mainfont=times -o target.pdf</code>. Cependant, nous pr&#233;f&#233;rons utiliser les options d'en-t&#234;te YAML dans la mesure du possible, puisque cela donne des incantations en ligne de commande plus faciles &#224; taper et &#224; se rappeler. L'utilisation d'un outil de contr&#244;le de versions tel que Git pr&#233;servera vos modifications YAML, alors que ce que vous tapez dans le terminal est plut&#244;t &#233;ph&#233;m&#232;re. Consultez la section "Templates" du manuel Pandoc (<code type="inline">man pandoc</code>) pour la liste des variables YAML disponibles.</note></p>
<p><note id="6"> C'est une bonne id&#233;e de prendre l'habitude de ne pas utiliser d'espaces dans les noms de dossiers ou de fichiers. Des tirets ou des traits de soulignement au lieu d'espaces dans vos noms de fichiers assurent une compatibilit&#233; durable entre les plateformes.</note></p>
<p><note id="7"> Notez que l'extension .bib peut &#234;tre "rattach&#233;e" automatiquement &#224; Zotero par votre syst&#232;me d'exploitation. Cela signifie que lorsque vous cliquez sur un fichier .bib, il est probable que Zotero sera appel&#233; pour l'ouvrir, alors que nous voulons l'ouvrir dans un &#233;diteur de texte. Il pourrait &#234;tre judicieux d'associer le format .bib &#224; votre &#233;diteur de texte.</note></p>
<p><note id="8"> Merci &#224; <link target="https://github.com/njbart">@njbart</link> pour la correction. En r&#233;ponse &#224; notre suggestion originale, <code type="inline">Une phrase qui requiert une citation.^[C'est aussi ce qu'affirme @fyfe_digital_2011.]</code>, <link target="https://github.com/programminghistorian/jekyll/issues/46#issuecomment-59219906">il &#233;crit</link> : "Ce format n'est pas recommand&#233; car cela vous emp&#234;che de passer facilement d'un style avec notes de bas de page &#224; un style auteur-date. Il est pr&#233;f&#233;rable d'utiliser la [version modifi&#233;e] (pas de circonflexe, pas de point final &#224; l'int&#233;rieur des crochets, et ponctuation finale de la phrase apr&#232;s les crochets ; pour les styles avec notes de bas de page, Pandoc ajuste automatiquement la position de la ponctuation finale)".</note></p>
</div></body>
  </text>
</TEI>
