<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="installation-windows-py">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Installer un environnement de d&#233;veloppement int&#233;gr&#233; pour Python (Windows)</title>
  <author role="original_author"><persName>William J. Turkel</persName><persName>Adam Crymble</persName></author><editor role="reviewers"><persName>Jim Clifford</persName><persName>Amanda Morton</persName></editor><author role="translators">Sofia Papastamkou</author><editor role="translation-reviewers">Marie-Christine Boucher</editor><editor role="editors">Miriam Posner</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phfr0011</idno><date type="published">07/17/2012</date><date type="translated">07/13/2020</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#windows-installation"/>.</p><p>There are other translations: <ref target="#instalacao-windows #instalacion-windows"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Cette le&#231;on vous montrera comment installer un environnement de d&#233;veloppement pour Python sur un ordinateur ex&#233;cutant le syst&#232;me d'exploitation Windows.</p></abstract><textClass><keywords><term xml:lang="en">get-ready</term><term xml:lang="en">python</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="fr">
    <body>
      <div type="2"><head>Sauvegarder son disque dur</head>
<p>Faites en sorte de toujours disposer de sauvegardes r&#233;guli&#232;res et r&#233;centes du contenu de votre disque dur. L'importance de cette pratique d&#233;passe largement le cadre de vos activit&#233;s de programmation, et il serait avis&#233; d&#8217;en faire une habitude.</p>
</div>
      <div type="2"><head>Installer Python (v.3)</head>
<p>Rendez-vous sur le <ref target="http://www.python.org/">site web de Python</ref>, t&#233;l&#233;chargez la derni&#232;re version stable du langage de programmation Python (version 3.8 au mois d'avril 2020) et proc&#233;dez &#224; l'installation selon les instructions fournies sur le site. <emph>N.D.L.R. Notez que les versions les plus r&#233;centes de Python, &#224; partir de la v. 3.5, ne sont pas compatibles avec Windows XP ni avec les versions ant&#233;rieures de Windows.</emph> </p>
</div>
      <div type="2"><head>Cr&#233;er un r&#233;pertoire d&#233;di&#233;</head>
<p>Pour mieux organiser votre travail, il est recommand&#233; de cr&#233;er un r&#233;pertoire (dossier) d&#233;di&#233; sur votre disque dur, &#224; l'emplacement de votre choix, pour y ranger vos fichiers de programmation (par exemple, <code rend="inline">programming-historian</code>).</p>
</div>
      <div type="2"><head>Installer Komodo Edit</head>
<p>Komodo Edit est un &#233;diteur de texte au code source ouvert et gratuit que vous pouvez t&#233;l&#233;charger depuis <ref target="http://www.activestate.com/komodo-edit">son site web "Komodo Edit"</ref>. Il existe n&#233;anmoins <ref target="http://wiki.python.org/moin/PythonEditors/">un vaste choix d'&#233;diteurs de texte</ref>, si vous souhaitez utiliser un autre programme.</p>
</div>
      <div type="2"><head>D&#233;marrer Komodo Edit</head>
<p>Ouvrez Komodo Edit; vous devriez obtenir quelque chose qui ressemble &#224; ceci:</p>
<figure><desc>Komodo Edit sur Windows</desc><graphic url="komodo-edit11-windows-main.png"/></figure>
<p>Si vous ne voyez pas le volet <code rend="inline">Toolbox</code> (<emph>Bo&#238;te &#224; outils</emph>) en haut &#224; droite, vous pouvez y acc&#233;der via le menu <code rend="inline">View -&gt; Tabs &amp; Sidebars -&gt; Toolbox</code> (<emph>Vue -&gt; Onglets &amp; Volets lat&#233;raux -&gt; Bo&#238;te &#224; outils</emph>). Peu importe pour le moment si le volet du projet est ouvert ou non. Prenez le temps d'explorer l'interface et de vous familiariser avec son agencement. Si besoin, le menu d'aide <code rend="inline">Help</code> offre une documentation d&#233;taill&#233;e.</p>
<div type="3"><head>Configurer Komodo Edit</head>
<p>Vous devez maintenant configurer l'&#233;diteur pour pouvoir ex&#233;cuter vos programmes en Python. </p>
<p>S&#233;lectionnez d'abord <code rend="inline">Edit -&gt; Preferences -&gt; Languages -&gt; Python 3</code> (<emph>Modifier -&gt; Pr&#233;f&#233;rences -&gt; Langages -&gt; Python 3</emph>) puis <code rend="inline">Browse</code> (<emph>Parcourir</emph>). Puis, s&#233;lectionnez le chemin du r&#233;pertoire d'installation de Python, qui ressemble &#224; ceci: <code rend="inline">C:\Utilisateurs\VotreNomUtilisateur\AppData\Local\Programs\Python\Python38-32</code>). Lorsque vous avez trouv&#233; le bon chemin, cliquez sur <code rend="inline">OK</code>:</p>
<p>{% include figure.html caption="D&#233;finissez l'interpr&#233;teur Python par d&#233;faut" filename="komodo-edit11-windows-interpreter.png" %}</p>
<p><emph>(N.D.L.R. En effectuant la manipulation d&#233;crite plus haut, apr&#232;s avoir cliqu&#233; sur <code rend="inline">Browse</code> pour parcourir votre disque dur et afficher la bo&#238;te de dialogue <code rend="inline">Open Executable File</code>, il se peut que vous n'arriviez pas &#224; localiser le dossier AppData pour r&#233;cup&#233;rer le chemin et d&#233;finir l'interpr&#233;teur par d&#233;faut. Dans ce cas, entrez <code rend="inline">%AppData%</code> dans la barre de recherche du menu <code rend="inline">D&#233;marrer</code> de Windows, puis cliquez sur l'emplacement pour l'ouvrir. Localisez le chemin sp&#233;cifi&#233; ci-haut (<code rend="inline">\AppData\Local\Programs\Python\Python38-32</code>) puis retournez &#224; la bo&#238;te de dialogue <code rend="inline">Open Executable File</code> (&#224; l'int&#233;rieur de Komodo Edit) et copiez-le dans la barre <code rend="inline">Nom du fichier</code>. Une fois le r&#233;pertoire ouvert, s&#233;lectionnez <code rend="inline">python.exe</code> (type de fichier: application) et cliquez sur <code rend="inline">Ouvrir</code>.</emph></p>
<p>Ensuite, depuis le menu <code rend="inline">Preferences</code> (<emph>Pr&#233;f&#233;rences</emph>) &#224; gauche s&#233;lectionnez <code rend="inline">Internationalization</code>. Maintenant, allez &#224; la section <code rend="inline">Language-specific Default Encoding</code> (<emph>Encodage par d&#233;faut selon le langage de programmation</emph>) et, dans le menu d&#233;roulant de <code rend="inline">Language-specific</code>, s&#233;lectionnez <code rend="inline">Python</code>. V&#233;rifiez que l'encodage <ref target="http://en.wikipedia.org/wiki/UTF-8">UTF-8</ref> est s&#233;lectionn&#233; en tant qu'encodage par d&#233;faut.</p>
<p>{% include figure.html caption="Param&#232;tre d'encodage du texte en format UTF-8" filename="komodo-edit11-windows-utf-set.png" %}</p>
<p>Ensuite s&#233;lectionnez <code rend="inline">Toolbox-&gt;Add-&gt;New Command</code> (<emph>Boite &#224; outils-&gt;Ajouter-&gt;Nouvelle commande</emph>). Vous ouvrirez ainsi une nouvelle fen&#234;tre de dialogue. Renommez votre commande <code rend="inline">&#8216;Run Python&#8217;</code> (<emph>Ex&#233;cuter Python</emph>). Dans la barre <code rend="inline">&#8216;Command&#8217;</code> (<emph>Commande</emph>), tapez:</p>
<ab><code xml:id="code_installation-windows-py_0" corresp="code_installation-windows-py_0.txt" lang="language-python" rend="block"/></ab>
<p>Si vous oubliez d'ex&#233;cuter cette commande, Python ne saura pas coment interpr&#233;ter les instructions envoy&#233;es.</p>
<p>Dans la barre <code rend="inline">&#8216;Start in&#8217;</code>, tapez:</p>
<p><code rend="inline">%D</code></p>
<p>Si vous obtenez ceci, cliquez sur <code rend="inline">OK</code>:</p>
<figure><desc>Commande &#171; Ex&#233;cuter Python3 &#187;</desc><graphic url="komodo-edit11-windows-python-command.png"/></figure>
<figure><desc>Configuration de la commande &#171; Run Python3 Start &#187; .</desc><graphic url="komodo-edit11-windows-python-start.png"/></figure>
<p>Votre nouvelle commande devrait appara&#238;tre dans le panneau de la boite &#224; outils <code rend="inline">Toolbox</code>. Apr&#232;s avoir compl&#233;t&#233; cette &#233;tape, vous devrez peut-&#234;tre red&#233;marrer votre ordinateur avant d&#8217;&#234;tre en mesure de travailler avec Python dans Komodo Edit.</p>
</div></div>
      <div type="2"><head>&#201;tape 2 &#8211; 'Hello World' en Python</head>
<p>Il est de coutume d'inaugurer l'utilisation d'un nouveau langage de programmation avec un script qui dit tout simplement <emph>"hello world"</emph> soit "bonjour le monde". Nous allons voir ensemble comment faire cela en Python et en HTML.</p>
<p>Python est un langage de tr&#232;s haut niveau, ce qui en fait un choix fr&#233;quemment recommand&#233; pour les personnes qui d&#233;butent en programmation. Autrement dit: il est possible d'&#233;crire en Python de courts programmes qui sont tr&#232;s performants. Plus un programme est court, plus il est susceptible de tenir sur la taille d'un &#233;cran et donc plus il a des chances de rester grav&#233; dans votre m&#233;moire.</p>
<p>Python est un langage de programmation interpr&#233;t&#233;. Cela signifie qu'il existe un programme informatique sp&#233;cifique, appel&#233; interpr&#233;teur, qui sait reconna&#238;tre les instructions &#233;crites dans ce langage. Une mani&#232;re d'utiliser un interpr&#233;teur consiste &#224; stocker toutes vos instructions Python dans un fichier puis &#224; soumettre ce fichier &#224; l'interpr&#233;teur. Un fichier contenant des instructions &#233;crites avec un langage de programmation s'appelle un programme (informatique). L'interpr&#233;teur ex&#233;cute chacune des instructions contenues dans le programme, puis il s'arr&#234;te. Voyons les &#233;tapes &#224; suivre pour y parvenir.</p>
<p>Dans votre &#233;diteur de texte, cr&#233;ez un nouveau fichier, entrez ce petit programme de deux lignes, puis sauvegardez-le dans votre r&#233;pertoire <code rend="inline">programming-historian</code> sous le nom
<code rend="inline">hello-world.py</code></p>
<ab><code xml:id="code_installation-windows-py_1" corresp="code_installation-windows-py_1.txt" lang="language-python" rend="block"/></ab>
<p>L'&#233;diteur de texte de votre choix doit avoir un bouton de menu &#8220;<code rend="inline">Run</code>&#8221; qui vous permet d'ex&#233;cuter votre programme. Si tout s'est bien pass&#233;, vous devriez obtenir un r&#233;sultat semblable &#224; celui pr&#233;sent&#233; dans la figure ci-dessous, que nous avons obtenue avec Komodo Edit:</p>
<figure><desc>'Hello World'</desc><graphic url="komodo-edit11-windows-hello.png"/></figure>
</div>
      <div type="2"><head>Interagir via une console Python (shell)</head>
<p>Une autre mani&#232;re d'interagir avec un interpr&#233;teur est d'utiliser ce que nous appelons une console. Dans ce cas, il suffit de taper une instruction au clavier et d'appuyer sur la touche Entr&#233;e pour que la console ex&#233;cute votre commande. La console est un moyen parfait pour tester votre code et avoir la certitude que vous allez obtenir le r&#233;sultat que vous recherchez. </p>
<p>Vous pouvez ex&#233;cuter une console Python en double-cliquant sur le fichier <code rend="inline">python.exe</code>. Si vous avez install&#233; la version 3.8 (la plus r&#233;cente au moment de cette traduction en avril 2020), ce fichier se trouve fort probablement dans votre r&#233;pertoire <code rend="inline">C:\Utilisateurs\VotreNomUtilisateur\AppData\Local\Programs\Python\Python38-32</code>. Lorsque la fen&#234;tre de la console s'affiche sur votre &#233;cran, tapez:</p>
<ab><code xml:id="code_installation-windows-py_2" corresp="code_installation-windows-py_2.txt" lang="language-python" rend="block"/></ab>
<p>puis appuyez sur la touche Entr&#233;e. Votre ordinateur va vous r&#233;pondre:</p>
<ab><code xml:id="code_installation-windows-py_3" corresp="code_installation-windows-py_3.txt" lang="language-python" rend="block"/></ab>
<p>Pour repr&#233;senter une interaction via la console, nous utilisons -&gt; pour indiquer la r&#233;ponse re&#231;ue dans celle-ci, comme suit: </p>
<ab><code xml:id="code_installation-windows-py_4" corresp="code_installation-windows-py_4.txt" lang="language-python" rend="block"/></ab>
<p>Sur votre &#233;cran, l'affichage ressemble plut&#244;t &#224; cela: </p>
<p>{% include figure.html caption="La console Python sous Windows" filename="windows-python3-cmd.png" %}</p>
<p>Maintenant, votre ordinateur est pr&#234;t et vous &#234;tes en mesure d'ex&#233;cuter des t&#226;ches plus int&#233;ressantes. Si vous travaillez avec nos tutoriels sur Python dans l'ordre, nous vous recommandons de consulter par la suite la le&#231;on &#171; <ref target="/fr/lecons/comprendre-les-pages-web">Comprendre les pages web et le HTML</ref> &#187; .</p>
</div>
    </body>
  </text>
</TEI>
