<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introducci&#243;n a Topic Modeling y MALLET</title>
  <date>2012-09-02</date>
  <translation_date>2018-10-31</translation_date>
  <authors>Shawn Graham,Scott Weingart,Ian Milligan</authors>
  <reviewers>John Fink,Alan MacEachern</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Ulrike Henny-Krahmer</translator>
  <translation-editor>Antonio Rojas Castro</translation-editor>
  <translation-reviewer>Joshua G. Ortiz Baco,Riva Quiroga</translation-reviewer>
  <layout>lesson</layout>
  <difficulty>2</difficulty>
  <activity>analyzing</activity>
  <topics>distant-reading</topics>
  <original>topic-modeling-and-mallet</original>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/191#issuecomment-432826840</review-ticket>
  <abstract>Esta lecci&#243;n explica qu&#233; es *topic modeling* y por qu&#233; podr&#237;as querer utilizarlo en tus investigaciones. Luego aprender&#225;s c&#243;mo instalar y trabajar con MALLET, una caja de herramientas para procesamiento de lenguajes naturales (PLN) con la que *topic modeling* se puede llevar a la pr&#225;ctica.</abstract>
  <avatar_alt>Ilustraci&#243;n de un herrero trabajando.</avatar_alt>
  <doi>10.46430/phes0040</doi>
</metadata>
  <text>
    <body>
      <div n="1"><head>Nota del editor</head>
<p>En esta lecci&#243;n es necesario utilizar la l&#237;nea de comandos. Si no tienes experiencia previa utiliz&#225;ndola, consulta la lecci&#243;n <link target="introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos en Bash</link> de <emph>Programming Historian</emph>.</p>
</div>
      <div n="1"><head>Objetivos de la lecci&#243;n</head>
<p>En esta lecci&#243;n, primero aprender&#225;s qu&#233; es <emph>topic modeling</emph><ref type="footnotemark" target="#1"/> y por qu&#233; podr&#237;as querer utilizarlo en tus investigaciones. Luego aprender&#225;s c&#243;mo instalar y trabajar con MALLET, una caja de herramientas para <emph>procesamiento de lenguajes naturales (PLN)</emph> que sirve para realizar este tipo de an&#225;lisis. MALLET requiere que se modifique una <emph>variable de entorno</emph> (esto es, configurar un atajo para que la computadora sepa en todo momento d&#243;nde encontrar el programa MALLET) y que se trabaje con la <emph>l&#237;nea de comandos</emph> (es decir, tecleando comandos manualmente en vez de hacer clic en &#237;conos o men&#250;s).</p>
<p>Aplicaremos el modelador de t&#243;picos a algunos archivos de ejemplo y veremos los tipos de <emph>output</emph> que genera MALLET. Esto nos dar&#225; una buena idea de c&#243;mo se puede aplicar <emph>topic modeling</emph> a un corpus de textos para identificar t&#243;picos o temas que se encuentran en los documentos, sin tener que leerlos individualmente.</p>
<p>Por favor, rem&#237;tete a la <link target="http://mallet.cs.umass.edu/mailinglist.php">lista de discusi&#243;n</link> de los usuarios de MALLET para aprender m&#225;s sobre todo lo que se pueda hacer con este programa.</p>
<p>(Queremos agradecer a Robert Nelson y Elijah Meeks por consejos y sugerencias sobre c&#243;mo empezar a utilizar MALLET por primera vez y por sus ejemplos de lo que se puede hacer con esta herramienta.)</p>
</div>
      <div n="1"><head>&#191;Qu&#233; es <emph>Topic Modeling</emph> y para qui&#233;n es &#250;til?</head>
<p>Una herramienta de <emph>topic modeling</emph> toma un texto individual (o un corpus) y busca patrones en el uso de las palabras; es un intento de encontrar significado sem&#225;ntico en el vocabulario de ese texto (o corpus). Antes de empezar con <emph>topic modeling</emph> deber&#237;as preguntarte si es o no &#250;til para tu proyecto. Para empezar a entender en qu&#233; circunstancias una t&#233;cnica como esta es la m&#225;s efectiva, te recomendamos <emph><link target="http://www.cs.umbc.edu/~hillol/NGDM07/abstracts/talks/MKirschenbaum.pdf">Distant Reading</link></emph> de Matthew Kirschenbaum (una charla dada en el simposio de la Fundaci&#243;n Nacional de Ciencias de los Estados Unidos en 2009, sobre la pr&#243;xima generaci&#243;n de extracci&#243;n de datos y descubrimiento cibern&#233;tico para la inovaci&#243;n) y <emph><link target="http://www.worldcat.org/title/reading-machines-toward-an-algorithmic-criticism/oclc/708761605&amp;referer=brief_results">Reading Machines</link></emph> de Stephen Ramsay.</p>
<p>Como toda herramienta, el hecho de que se pueda utilizar no significa que deber&#237;as hacerlo. Si trabajas con pocos documentos (o incluso con un solo documento) puede ser que c&#225;lculos de frecuencia sean suficientes, en cuyo caso algo como las <link target="http://voyant-tools.org/">herramientas Voyant</link> quiz&#225; ser&#237;an convenientes. Si, en cambio, tienes cientos de documentos procedentes de un archivo y quieres comprender qu&#233; contiene el archivo, pero sin necesariamente leer cada documento, entonces <emph>topic modeling</emph> podr&#237;a ser una buena opci&#243;n.</p>
<p>Los modelos de t&#243;picos son una familia de programas inform&#225;ticos que extraen <emph>t&#243;picos</emph> de <emph>textos</emph>. Para la computadora, un <emph>t&#243;pico</emph> es una lista de palabras que se presenta de manera que sea estad&#237;sticamente significativa. Un <emph>texto</emph> puede ser un email, una entrada de blog, un cap&#237;tulo de libro, un art&#237;culo period&#237;stico, una entrada de diario &#8211; es decir, todo tipo de texto no estructurado. No estructurado quiere decir que no haya anotaciones legibles por la computadora que indiquen el significado sem&#225;ntico de las palabras del texto.</p>
<p>Los programas de modelizaci&#243;n de t&#243;picos no saben nada sobre el significado de las palabras en un texto. En vez de eso, asumen que cada fragmento de texto est&#225; compuesto (por un autor(a)) a trav&#233;s de la selecci&#243;n de palabras desde posibles canastas de palabras, donde cada canasta corresponde a un t&#243;pico. Si eso es cierto, entonces es posible descomponer matem&#225;ticamente un texto  en las canastas desde las que con mayor probabilidad provienen las palabras que lo componen. La herramienta repite el proceso una y otra vez hasta que se establezca la distribuci&#243;n m&#225;s probable de las palabras dentro de las canastas, que es lo que llamamos t&#243;picos (o <emph>topics</emph>, en ingl&#233;s).</p>
<p>Hay muchos programas diferentes para <emph>topic modeling</emph>; esta lecci&#243;n utiliza uno que se llama MALLET. Si este m&#233;todo se aplicara, por ejemplo, a un conjunto de discursos pol&#237;ticos, se obtendr&#237;a una lista de t&#243;picos y las palabras clave que los constituyen. Cada una de esas listas es un t&#243;pico de acuerdo con el algoritmo. En el caso del ejemplo de discursos pol&#237;ticos, la lista podr&#237;a verse as&#237;:</p>
<ol>
<li>empleo empleos p&#233;rdida desempleo crecimiento</li>
<li>econom&#237;a sector bolsa bancos</li>
<li>Afganist&#225;n guerra tropa Medio_Oriente taliban terror</li>
<li>elecci&#243;n adversario futuro presidente</li>
<li><emph>etc.</emph></li>
</ol>
<p>Examinando las palabras clave podemos ver que el pol&#237;tico que dio los discursos se refiri&#243; a la econom&#237;a, los empleos, el Medio Oriente, las pr&#243;ximas elecciones, etc.</p>
<p>Como advierte Scott Weingart, quienes utilizan <emph>topic modeling</emph> sin entenderlo completamente enfrentan muchos <link target="http://www.scottbot.net/HIAL/?p=16713">peligros</link>. Por ejemplo, podr&#237;a interesarnos el uso de las palabras como un indicador para la ubicaci&#243;n en un espectro pol&#237;tico. <emph>Topic modeling</emph> sin duda podr&#237;a ayudar con eso, pero hay que recordar que el indicador no es en s&#237; lo que queremos comprender - como lo muestra Andrew Gelman en su <link target="http://arxiv.org/abs/1003.6087/">estudio de maqueta sobre zombis, utilizando Google Trends</link>. Ted Underwood y Lisa Rhody (v&#233;ase Lecturas adicionales) sostienen que para nosotros como historiadores ser&#237;a mejor considerar estas categor&#237;as como discursos; sin embargo, para nuestros objetivos, continuaremos utilizando la palabra: t&#243;pico.</p>
<p>Nota: En la bibliograf&#237;a sobre <emph>topic modeling</emph>, a veces encontrar&#225;s el t&#233;rmino "<emph>LDA</emph>". Muchas veces, LDA y <emph>topic modeling</emph> se usan como sin&#243;nimos, pero la t&#233;cnica LDA es, en realidad, un caso especial de <emph>topic modeling</emph> desarrollado por <link target="https://es.wikipedia.org/wiki/Latent_Dirichlet_Allocation">David Blei y amigos</link> en 2002. No fue la primera t&#233;cnica considerada como <emph>topic modeling</emph> pero es la m&#225;s popular. Las innumerables variaciones de <emph>topic modeling</emph> han resultado en una sopa de letras de t&#233;cnicas y programas para implementarlas, lo cual puede ser desconcertante o agobiante para los no iniciados en la materia y por esto no nos detendremos en ellos por ahora. Todos los algoritmos trabajan casi del mismo modo y MALLET en particular utiliza LDA.</p>
<div n="2"><head>Ejemplos de modelos de t&#243;picos usados por historiadores:</head>
<ul>
<li>Rob Nelson, <emph><link target="http://dsl.richmond.edu/dispatch/">Mining the Dispatch</link></emph></li>
<li>Cameron Blevins, "<link target="http://historying.org/2010/04/01/topic-modeling-martha-ballards-diary/">Topic Modeling Martha Ballard's Diary</link>" <emph>Historying</emph>, April 1, 2010.</li>
<li>David J Newman y Sharon Block, "Probabilistic topic decomposition of an eighteenth century American newspaper," <emph>Journal of the American Society for Information Science and Technology</emph> vol. 57, no. 6 (April 1, 2006): 753-767.<ref type="footnotemark" target="#2"/></li>
</ul>
</div></div>
      <div n="1"><head>Instalar MALLET</head>
<p>Hay muchas herramientas que se podr&#237;an utilizar para crear modelos de t&#243;picos, pero al momento de escribir estas l&#237;neas (en el verano de 2007) la herramienta m&#225;s sencilla es MALLET.<ref type="footnotemark" target="#3"/> <link target="http://mallet.cs.umass.edu/index.php">MALLET</link> utiliza una implementaci&#243;n del <link target="https://es.wikipedia.org/wiki/Muestreo_de_Gibbs"><emph>Muestreo de Gibbs</emph></link>, una t&#233;cnica estad&#237;stica destinada a construir r&#225;pidamente una distribuci&#243;n de muestras, para luego crear los modelos de t&#243;picos correspondientes. Para utilizar MALLET es necesario trabajar en la l&#237;nea de comandos &#8211; hablaremos m&#225;s de esto en un instante. Lo bueno es que normalmente los mismos comandos se usan repetidamente.</p>
<p>Las instrucciones de instalaci&#243;n son diferentes para Windows y Mac. Sigue las instrucciones apropiadadas para ti:</p>
<figure><desc/><graphic url="windows-150x150.png"/></figure>
<div n="2"><head>Instrucciones para Windows</head>
<ol>
<li>Ve a la p&#225;gina del proyecto <link target="http://mallet.cs.umass.edu/index.php">MALLET</link>. Puedes <link target="http://mallet.cs.umass.edu/download.php">descargar MALLET aqu&#237;</link>.</li>
<li>Tambi&#233;n necesitar&#225;s el <link target="http://www.oracle.com/technetwork/java/javase/downloads/index.html">Kit de desarrollo de Java (JDK)</link> - esto es, no el Java normal que se encuentra en cada computadora sino el que permite programar cosas. Instala este en tu computadora.</li>
<li>Descomprime MALLET en tu directorio <code type="inline">C:</code>. Esto es importante: no puede ser en ning&#250;n otro lugar. Tendr&#225;s un directorio llamado <code type="inline">C:\mallet-2.0.8</code> o parecido. Para simplificar, cambia el nombre simplemente a <code type="inline">mallet</code>.</li>
<li>MALLET utiliza una <emph>variable de entorno</emph> para indicar a la computadora donde encontrar todos los componentes necesarios para sus procesos en el momento de ejecutarse. Es como un atajo para el programa. Un(a) programador(a) no puede saber exactamente donde cada usuario instala un programa. Por eso, &#233;l o ella crea una variable en el c&#243;digo que representa el lugar de instalaci&#243;n en cada momento. Por medio de la variable de entorno indicamos a la computadora donde se encuentra ese lugar. Si mueves el programa a otro lugar tendr&#225;s que cambiar esa variable.</li>
</ol>
<p>Para crear una variable de entorno en Windows 10, ve a <code type="inline">Este equipo</code>. <code type="inline">Este equipo</code> se encuentra o como &#237;cono en el escritorio o en el explorador de archivos que se puede abrir haciendo clic en el men&#250; <code type="inline">Inicio -&gt; Explorador de archivos</code>. Haz clic derecho en <code type="inline">Este equipo</code> y selecciona <code type="inline">Propiedades</code>. Se abre una nueva ventana. Selecciona la opci&#243;n <code type="inline">Configuraci&#243;n avanzada del sistema</code> (figuras 1, 2, 3). Haz clic en <code type="inline">Nueva...</code> y escribe <code type="inline">MALLET_HOME</code> en la casilla <code type="inline">Nombre de la variable</code>. Tiene que ser as&#237; &#8211; todo en may&#250;sculas y con un gui&#243;n bajo &#8211; porque ese es el atajo que el o la programador(a) ha incluido en el programa y todos sus subprogramas. Entonces escribe la ruta exacta (ubicaci&#243;n) de donde descomprimiste MALLET en la casilla <code type="inline">Valor de la variable</code>, por ejemplo <code type="inline">C:\mallet\</code>.</p>
<p>Para ver si lo lograste, por favor contin&#250;a leyendo el pr&#243;ximo apartado.</p>
<figure><desc>Figura 1: Configuraci&#243;n avanzada del sistema en Windows</desc><graphic url="fig1-configuracion-avanzada-del-sistema.png"/></figure>
<figure><desc>Figura 2: Lugar de las variables de entorno</desc><graphic url="fig2-lugar-variables-de-entorno.png"/></figure>
<figure><desc>Figura 3: Variable de entorno</desc><graphic url="fig3-variable-de-entorno.png"/></figure>
<div n="3"><head>Ejecutar MALLET usando la l&#237;nea de comandos</head>
<p>MALLET se ejecuta desde la l&#237;nea de comandos, conocida tambi&#233;n como <emph>S&#237;mbolo del sistema</emph> (figura 4). Si recuerdas MS-DOS o alguna vez has experimentado con un terminal de computadora Unix, ya reconocer&#225;s esto. En la l&#237;nea de comandos puedes teclear comandos directamente en vez de hacer clic en &#237;conos o men&#250;s.</p>
<figure><desc>Figura 4: L&#237;nea de comandos en Windows</desc><graphic url="fig4-ventana-linea-de-comandos.png"/></figure>
<ol>
<li>Haz clic en tu men&#250; <code type="inline">Inicio -&gt; Sistema de Windows -&gt; S&#237;mbolo del sistema</code>. Se abre la ventana de la l&#237;nea de comandos que tendr&#225; el cursor en <code type="inline">C:\Users\User&gt;</code> (o parecido; v&#233;ase figura 4).<ref type="footnotemark" target="#4"/></li>
<li>Teclea <code type="inline">cd ..</code> (Es decir: cd-espacio-punto-punto) y presiona Entrar para <emph>cambiar directorio</emph>.<ref type="footnotemark" target="#5"/> Sigue haciendo esto hasta llegar a <code type="inline">C:\</code> (como en la figura 5).</li>
<li>Luego escribe <code type="inline">cd mallet</code> y estar&#225;s en el directorio de MALLET. Todo lo que escribas en la ventana de la l&#237;nea de comandos es un <emph>comando</emph>. Hay comandos como <code type="inline">cd</code> (cambiar directorio) o <code type="inline">dir</code> (listar los contenidos del directorio) que la computatora entiende. Si quieres utilizar MALLET tienes que decirle de manera expl&#237;cita 'esto es un comando de MALLET'. Para esto, se le especifica a la computadora que tiene que tomar sus instrucciones de la carpeta <emph>bin</emph>, un subdirectorio de MALLET que contiene las rutinas operacionales principales.</li>
<li>Teclea <code type="inline">bin\mallet</code> como en la figura 6. Si todo ha ido bien deber&#237;as ver una lista de comandos de MALLET &#8211; &#161;felicitaciones! Si recibes un mensaje de error comprueba lo que has escrito. &#191;Utilizaste un tipo de barra equivocado? &#191;Configuraste la variable de entorno correctamente?<ref type="footnotemark" target="#6"/> &#191;Se encuentra MALLET en <code type="inline">C:\mallet</code>?</li>
</ol>
<figure><desc>Figura 5: Navegar al directorio C:\ en la l&#237;nea de comandos</desc><graphic url="fig5-ventana-linea-de-comandos-llegar-a-c.png"/></figure>
<figure><desc>Figura 6: L&#237;nea de comandos: MALLET instalado</desc><graphic url="fig6-linea-de-comandos-mallet-instalado.png"/></figure>
<p>Ahora est&#225;s preparado para avanzar a la pr&#243;xima secci&#243;n.</p>
<figure><desc/><graphic url="apple-150x150.png"/></figure>
</div></div><div n="2"><head>Instrucciones para Mac</head>
<p>Muchas de las instrucciones para la instalaci&#243;n en OS X se parecen a las instrucciones para Windows, con pocas excepciones. En realidad, es un poco m&#225;s f&#225;cil ejecutar comandos de MALLET en Mac.</p>
<ol>
<li>Descarga e <link target="http://mallet.cs.umass.edu/download.php">instala MALLET</link>.</li>
<li>Descarga el <link target="http://www.oracle.com/technetwork/java/javase/downloads/index.html">Kit de desarrollo de Java (JDK)</link>.</li>
</ol>
<p>Descomprime MALLET en un directorio en tu sistema (para seguir esta lecci&#243;n con facilidad, escoge tu directorio <code type="inline">/User/</code>, aunque otro lugar funcionar&#225; igualmente). Cuando est&#233; descomprimido, abre tu ventana Terminal (dentro del directorio <code type="inline">Aplicaciones</code> en tu Finder). Usando la Terminal, navega al directorio donde descomprimiste MALLET (ser&#225; <code type="inline">mallet-2.0.8</code> o <code type="inline">mallet</code> si cambiaste el nombre de la carpeta para simplificarlo. Si descomprimiste MALLET en tu directorio <code type="inline">/User/</code> como se sugiere en esta lecci&#243;n, puedes navegar al directorio correcto tecleando <code type="inline">cd mallet-2.0.8</code> o bien <code type="inline">cd mallet</code>). <code type="inline">cd</code> es la abreviatura para "cambiar directorio" cuando se trabaja en la Terminal.</p>
<p>En adelante, los comandos de MALLET en Mac son casi id&#233;nticos a los de Windows, con excepci&#243;n de la direcci&#243;n de las barras (hay algunas otras diferencias menores que se se&#241;alar&#225;n cuando resulte necesario). Si el comando es <code type="inline">\bin\mallet</code> en Windows, en Mac ser&#237;a:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_0" type="block" corresp="code_topic-modeling-y-mallet_0.txt"></code></pre>
<p>Deber&#237;a aparecer una lista de comandos. De ser as&#237;, &#161;felicitaciones &#8211; has instalado MALLET correctamente!</p>
</div></div>
      <div n="1"><head>Ejecutar comandos de MALLET</head>
<p>Ahora que has instalado MALLET, es hora de aprender qu&#233; comandos se pueden ejecutar con el programa. Hay nueve comandos diferentes (v&#233;ase figura 6 arriba). A veces puedes combinar varias instrucciones. Seg&#250;n tu sistema operativo, teclea en el S&#237;mbolo del sistema o la Terminal:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_1" type="block" corresp="code_topic-modeling-y-mallet_1.txt"></code></pre>
<p>Se te presentar&#225; un mensaje de error indicando que <code type="inline">import-dir</code> no se reconoce como orden o comando. Eso es as&#237; porque olvidamos decir a la computadora que buscara el comando dentro de MALLET <code type="inline">bin</code>. Int&#233;ntalo otra vez con</p>
<pre><code xml:id="code_topic-modeling-y-mallet_2" type="block" corresp="code_topic-modeling-y-mallet_2.txt"></code></pre>
<p>Recuerda que la direcci&#243;n de las barras es importante (tal como se ve en la figura 7 que muestra una transcripci&#243;n completa de lo que hemos hecho en la lecci&#243;n hasta ahora). Al teclear <code type="inline">bin\mallet</code>, comprobamos que MALLET est&#225; instalado. Luego generamos el error con <code type="inline">import-dir</code> algunas l&#237;neas m&#225;s adelante. Despu&#233;s de esto, conseguimos llamar al archivo de ayuda correctamente, el cual nos dijo lo que hace el comando <code type="inline">import-dir</code> y qu&#233; tipo de <emph>par&#225;metros</emph> se pueden fijar para esta herramienta.</p>
<figure><desc>Figura 7: El men&#250; de ayuda en MALLET</desc><graphic url="fig7-linea-de-comandos-teclear-ayuda.png"/></figure>
<p>Nota: en los comandos de MALLET hay una diferencia entre un gui&#243;n simple y un gui&#243;n doble. El gui&#243;n simple es parte del nombre y sustituye un espacio (por ejemplo, <code type="inline">import-dir</code> en vez de <code type="inline">import dir</code>), porque los espacios tienen la funci&#243;n de separar diferentes comandos o par&#225;metros. Mediante estos par&#225;metros podemos ajustar el archivo que se crea cuando importamos nuestros textos a MALLET. Un gui&#243;n doble (como por ejemplo <code type="inline">--help</code> arriba) modifica o a&#241;ade un subcomando, o bien especifica alg&#250;n tipo de par&#225;metro para el comando.</p>
<p>Para usuarios de Windows, si recibes el mensaje de error <emph>'exception in thread "main"
java.lang.NoClassDefFoundError:'</emph> puede deberse a que instalaste MALLET en alg&#250;n otro lugar que no sea el directorio <code type="inline">C:\</code>. Por ejemplo, instalando MALLET en <code type="inline">C:\Archivos de programa\mallet</code> producir&#225; este mensaje de error. Lo segundo que se debe comprobar es si la variable de entorno est&#225; configurada correctamente. En cualquier caso, consulta las instrucciones de instalaci&#243;n en Windows y verifica que las seguiste correctamente.</p>
</div>
      <div n="1"><head>Trabajar con datos</head>
<p>MALLET exige datos en texto plano. Para ello, cada texto suele guardarse en un archivo <code type="inline">.txt</code>. El conjunto de esos archivos conformar&#225; el corpus. Puedes descargar un corpus de muestra con textos en espa&#241;ol <link target="https://github.com/programminghistorian/ph-submissions/raw/gh-pages/assets/ensayos-jose-marti.zip">aqu&#237;</link><ref type="footnotemark" target="#7"/>. Descomprime el archivo ZIP en alg&#250;n lugar de tu computadora y recuerda este lugar. En esta lecci&#243;n lo guardamos en el escritorio del usuario para poder encontrarlo f&#225;cilmente.</p>
<p>Para navegar al directorio del corpus teclea <code type="inline">cd C:\Users\User\Desktop\ensayos-de-jose-marti</code> en la l&#237;nea de comandos (o similar dependiendo de d&#243;nde guardaste la carpeta descomprimida en tu computadora). Escribe <code type="inline">dir</code> (<code type="inline">ls</code> para Mac) para que se te muestre la lista de los contenidos del directorio <code type="inline">ensayos-de-jose-marti</code> (v&#233;ase figura 8). Para abrir uno de los archivos de texto, escribe el nombre entero del archivo incluyendo la extensi&#243;n al final.</p>
<figure><desc>Figura 8: Navegar al corpus de textos</desc><graphic url="fig8-linea-de-comandos-corpus.png"/></figure>
<p>Ten en cuenta que ahora no puedes ejecutar ning&#250;n comando MALLET dentro de este directorio. Int&#233;ntalo:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_3" type="block" corresp="code_topic-modeling-y-mallet_3.txt"></code></pre>
<p>Si recibes un mensaje de error, tendr&#225;s que volver al directorio principal de MALLET para poder ejecutar los comandos (por ejemplo con <code type="inline">cd C:\mallet\</code>). Esto se debe a la manera como est&#225;n estructurados MALLET y sus componentes.</p>
</div>
      <div n="1"><head>Importar datos</head>
<p>En el directorio <code type="inline">ensayos-de-jose-marti</code> se encuentran varios archivos <code type="inline">.txt</code>. Cada uno de estos archivos es un documento individual, en este caso, el texto de un ensayo. El directorio entero se puede considerar un corpus de datos. Para trabajar con este corpus y descubrir cu&#225;les son los t&#243;picos (o temas) que componen los documentos individuales, necesitamos transformarlos desde varios archivos de texto individuales a un &#250;nico archivo en formato MALLET. MALLET puede importar m&#225;s de un archivo a la vez. Podemos importar todo el directorio de archivos de texto mediante el comando <code type="inline">import</code>. Los comandos de m&#225;s abajo importan el directorio, lo convierten a un archivo MALLET, mantienen los archivos originales en el orden en que estaban listados y eliminan <emph>stop words</emph> (esto es, palabras de funci&#243;n como <emph>y</emph>, <emph>el</emph>, <emph>la</emph>, <emph>pero</emph>, <emph>si</emph>, que ocurren en frecuencias tan altas que obstruyen el an&#225;lisis).</p>
<p>MALLET viene provisto de algunos diccionarios de palabras vac&#237;as, por ejemplo para ingl&#233;s. Si se quiere utilizar el diccionario predeterminado, el par&#225;metro <code type="inline">--remove-stopwords</code> es suficiente.<ref type="footnotemark" target="#8"/> Como no hay ning&#250;n diccionario predeterminado para espa&#241;ol, es necesario incluirlo a trav&#233;s del par&#225;metro <code type="inline">--stoplist-file</code>. Para la mayor&#237;a de los idiomas es f&#225;cil encontrar listas de <emph>stop words</emph> en la red. Por ejemplo, puedes descargar una <link target="https://raw.githubusercontent.com/stopwords-iso/stopwords-es/master/stopwords-es.txt">lista de palabras vac&#237;as en espa&#241;ol</link> en GitHub. Gu&#225;rdala en tu computadora e indica la ruta a este fichero en el comando tal como est&#225; arriba: <code type="inline">--stoplist-file C:\Users\User\Desktop\stopwords-es.txt</code> (nombre del par&#225;metro-espacio-ruta al fichero).</p>
<pre><code xml:id="code_topic-modeling-y-mallet_4" type="block" corresp="code_topic-modeling-y-mallet_4.txt"></code></pre>
<p>El par&#225;metro <code type="inline">--output</code> junto con una ruta de fichero indica donde se guarda el corpus importado en formato MALLET, en este caso en el escritorio: <code type="inline">C:\Users\User\Desktop\leccion.mallet</code>. (Si aparece un mensaje de error en el momento de ejecutar el comando, puedes usar la tecla de flecha arriba para recuperar el &#250;ltimo comando que escribiste y checar si hay erratas). Ahora el fichero <code type="inline">leccion.mallet</code> contiene todos los datos en un formato que MALLET reconoce.</p>
<p>Tambi&#233;n podr&#237;as utilizar tus propios datos. Cambia <code type="inline">C:\Users\User\Desktop\ensayos-jose-marti</code> a un directorio que contenga tus propios archivos de investigaci&#243;n. &#161;Buena suerte!</p>
<p>Si no est&#225;s seguro de c&#243;mo funcionan los directorios, te recomendamos la lecci&#243;n <link target="introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos en Bash</link> de <emph>Programming Historian</emph>.</p>
<div n="2"><head>Para Mac</head>
<p>Las instrucciones para Mac son parecidas a las de Windows, con algunas diferencias que puedes notar en el siguiente ejemplo:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_5" type="block" corresp="code_topic-modeling-y-mallet_5.txt"></code></pre>
</div></div>
      <div n="1"><head>Problemas con datos a gran escala</head>
<p>Si trabajas con colecciones grandes de archivos &#8211; o tambi&#233;n archivos muy grandes &#8211; puedes enfrentar problemas con tu <emph>heap space</emph>, la memoria de trabajo de tu computadora. Si es relevante, este asunto suele surgir al principo, durante el proceso de importaci&#243;n. Por defecto, MALLET permite trabajar con una memoria de 1 GB. Si recibes el siguiente mensaje de error, alcanzaste tu l&#237;mite:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_6" type="block" corresp="code_topic-modeling-y-mallet_6.txt"></code></pre>
<p>Si tu sistema tiene m&#225;s memoria, puedes tratar de aumentar la memoria asignada a tu <emph>m&#225;quina virtual Java</emph>. Para hacerlo, tienes que editar el c&#243;digo en el fichero <code type="inline">mallet</code> que se encuentra en el subdirectorio <code type="inline">bin</code> de tu carpeta MALLET. Abre el archivo <code type="inline">Mallet.bat</code> (<code type="inline">C:\Mallet\bin\mallet.bat</code>) si trabajas en Windows o el archivo <code type="inline">mallet</code> (<code type="inline">~/Mallet/bin/mallet</code>) si trabajas en Linux u OS X. &#193;brelo con el programa Komodo Edit (v&#233;ase <link target="/es/lecciones/instalacion-mac">Mac</link>, <link target="/es/lecciones/instalacion-windows">Windows</link>, <link target="/es/lecciones/instalacion-linux">Linux</link> para instrucciones de instalaci&#243;n).</p>
<p>Encuentra la l&#237;nea siguiente:</p>
<p><code type="inline">MEMORY=1g</code></p>
<p>Puedes aumentar el valor de 1g a 2g, 4g o aun m&#225;s seg&#250;n la memoria de trabajo (<emph>RAM</emph>) que tenga tu sistema. Puedes encontrar esa informaci&#243;n checando la informaci&#243;n del sistema.</p>
<p>Guarda los cambios. Ahora no deber&#237;a aparecer el error. Si no, aumenta el valor otra vez.</p>
</div>
      <div n="1"><head>Tu primer modelo de t&#243;picos</head>
<p>Escribe en la l&#237;nea de comandos en el directorio MALLET:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_7" type="block" corresp="code_topic-modeling-y-mallet_7.txt"></code></pre>
<p>Este comando abre tu archivo <code type="inline">leccion.mallet</code> y ejecuta la rutina de <emph>topic modeling</emph>, en este caso con la configuraci&#243;n predeterminada. La rutina se repite tratando de encontrar la mejor asignaci&#243;n de palabras a t&#243;picos. Tu l&#237;nea de comandos se llena con los resultados de cada iteraci&#243;n. Cuando concluya puedes desplazarte hacia arriba para ver lo que se imprimi&#243; (como en la figura 9).</p>
<figure><desc>Figura 9: Resultados de un modelo de t&#243;picos b&#225;sico</desc><graphic url="fig9-resultados-topic-model-basico.png"/></figure>
<p>La computadora imprime las palabras clave, es decir, las palabras que ayudan a definir un t&#243;pico estad&#237;sticamente significativo, seg&#250;n la rutina. En la figura 9, el primer t&#243;pico que se imprime podr&#237;a verse as&#237; (tus palabras clave podr&#237;an ser un poco diferentes):<ref type="footnotemark" target="#9"/></p>
<pre><code xml:id="code_topic-modeling-y-mallet_8" type="block" corresp="code_topic-modeling-y-mallet_8.txt"></code></pre>
<p>Reconocer&#225;s que muchas de las palabras se refieren a econom&#237;a y pol&#237;tica. De hecho, en el corpus hay un documento con el nombre <code type="inline">el-congreso-de-Washington.txt</code> que contiene un ensayo de Jos&#233; Mart&#237; sobre un congreso que se celebr&#243; en Washington en 1889 y que fue parte de la primera conferencia panamericana. Es de suponer que este y algunos otros documentos del corpus contribuyeron a la lista de palabras clave del primer t&#243;pico.<ref type="footnotemark" target="#10"/> M&#225;s adelante explicaremos qu&#233; significan los n&#250;meros 0 y 0,5. Observa que MALLET incluye elementos aleatorios, as&#237; que las listas de palabras clave ser&#225;n diferentes cada vez que el programa se ejecute, incluso cuando se utilice el mismo conjunto de datos.</p>
<p>Vuelve al escritorio y teclea <code type="inline">dir</code>. Ver&#225;s que no hay ning&#250;n <emph>output</emph> nuevo. &#161;Creamos un topic model con &#233;xito pero no guardamos los resultados! Vuelve al directorio de MALLET y escribe en la l&#237;nea de comandos:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_9" type="block" corresp="code_topic-modeling-y-mallet_9.txt"></code></pre>
<p>Aqu&#237;, le decimos a MALLET que cree un modelo de t&#243;picos (<code type="inline">train-topics</code>). Todo lo que empieza con gui&#243;n doble despu&#233;s del comando principal sirve para configurar par&#225;metros:</p>
<p>Este comando</p>
<ul>
<li>abre tu archivo <code type="inline">leccion.mallet</code></li>
<li>prepara MALLET a encontrar 10 t&#243;picos</li>
<li>imprime cada palabra de tu corpus y el t&#243;pico al que pertenece en un archivo comprimido (<code type="inline">.gz</code>; v&#233;ase <link target="https://www.gzip.org/">gzip</link> sobre c&#243;mo descomprimirlo)</li>
<li>produce un documento de texto que muestra cu&#225;les son las palabras clave principales para cada t&#243;pico (<code type="inline">leccion_topicos.txt</code>)</li>
<li>y produce un archivo de texto que indica el porcentaje de cada t&#243;pico en cada documento de texto que importaste (<code type="inline">leccion_topicos_en_docs.txt</code>). (Para ver todos los par&#225;metros del comando <code type="inline">train-topics</code> que se pueden ajustar, teclea <code type="inline">bin\mallet train-topics --help</code> en la l&#237;nea de comandos.)</li>
</ul>
<p>Teclea <code type="inline">dir C:\Users\User\Desktop</code>. Tus <emph>outputs</emph> aparecer&#225;n en la lista de archivos y directorios dentro del directorio del escritorio. Abre <code type="inline">leccion_topicos.txt</code> en un procesador de texto (figura 10). Puedes ver una serie de p&#225;rrafos. El primer p&#225;rrafo corresponde al t&#243;pico 0; el segundo p&#225;rrafo al t&#243;pico 1; el tercero al t&#243;pico 2, etc. (En el <emph>output</emph>, la cuenta comienza en 0 y no 1; as&#237; que con 10 t&#243;picos, la lista va desde 0 a 9). El segundo n&#250;mero en cada p&#225;rrafo es el <emph>par&#225;metro Dirichlet</emph> para el t&#243;pico. Ese par&#225;metro est&#225; relacionado con una opci&#243;n que no utilizamos, por lo que tiene el valor por defecto (por eso cada t&#243;pico en este fichero lleva el n&#250;mero 0,5).<ref type="footnotemark" target="#11"/></p>
<figure><desc>Figura 10: Palabras clave en un procesador de texto</desc><graphic url="fig10-palabras-clave-en-writer.png"/></figure>
<p>Si al ejecutar la rutina de <emph>topic modeling</emph> hubieras incluido</p>
<pre><code xml:id="code_topic-modeling-y-mallet_10" type="block" corresp="code_topic-modeling-y-mallet_10.txt"></code></pre>
<p>como abajo</p>
<pre><code xml:id="code_topic-modeling-y-mallet_11" type="block" corresp="code_topic-modeling-y-mallet_11.txt"></code></pre>
<p>la salida podr&#237;a haber sido:</p>
<pre><code xml:id="code_topic-modeling-y-mallet_12" type="block" corresp="code_topic-modeling-y-mallet_12.txt"></code></pre>
<p>El primer n&#250;mero es el t&#243;pico (topic 0) y el segundo n&#250;mero indica el <emph>peso</emph> de este t&#243;pico. Generalmente, los t&#243;picos resultan mejores si se incluye el par&#225;metro <code type="inline">--optimize-interval</code>.</p>
<div n="2"><head>La composici&#243;n de tus documentos</head>
<p>&#191;Qu&#233; t&#243;picos componen tus documentos? La respuesta est&#225; en el archivo <code type="inline">leccion_topicos_en_docs.txt</code>. Para mantener todo organizado, importa el archivo <code type="inline">leccion_topicos_en_docs.txt</code> a una hoja de c&#225;lculo (en Excel, Open Office, etc.). Tendr&#225;s una tabla con las columnas <emph>n&#250;mero de documento, fuente, proporci&#243;n del t&#243;pico</emph>. Todas las columnas subsiguientes son proporciones de los t&#243;picos, como en la figura 11.<ref type="footnotemark" target="#12"/></p>
<figure><desc>Figura 11: T&#243;picos en documentos</desc><graphic url="fig11-topicos-en-docs.png"/></figure>
<p>Puede resultar dif&#237;cil leer estos datos. Los t&#243;picos comienzan en la tercera columna, en este caso en la columna C, y contin&#250;an hasta el &#250;ltimo t&#243;pico en la columna L. Es as&#237; porque entrenamos 10 t&#243;picos &#8211; si hubi&#233;ramos entrenado 20, por ejemplo, llegar&#237;an hasta la columna V.</p>
<p>A partir de esto, se puede ver que en el documento n&#250;mero 0 (es decir, el primer documento cargado en MALLET), <code type="inline">a-aprender-en-las-haciendas.txt</code>, el t&#243;pico 0 tiene un porcentaje de 0.33% (columna C). Si buscamos el valor m&#225;s alto en esta fila, podemos ver que el t&#243;pico 3 es el m&#225;s importante en este documento, con un porcentaje de 69.24%. Dada la naturaleza de MALLET, tus propios t&#243;picos pueden tener valores diferentes.</p>
<p>Si tienes un corpus de archivos de texto que est&#225;n organizados en orden cronol&#243;gico (por ejemplo que <code type="inline">1.txt</code> sea anterior a <code type="inline">2.txt</code>), podr&#237;as generar un gr&#225;fico en tu programa de hoja de c&#225;lculo y empezar a ver cambios con el tiempo, tal como lo hizo Robert Nelson en <link target="http://dsl.richmond.edu/dispatch/">Mining the Dispatch</link>.</p>
<p>&#191;C&#243;mo puedes saber cu&#225;l es la cantidad adecuada de t&#243;picos? &#191;Hay una cantidad <emph>natural</emph> de t&#243;picos? Hemos descubierto que hay que ejecutar <code type="inline">train-topics</code> varias veces con distintas cantidades de t&#243;picos para ver c&#243;mo la distribuci&#243;n de los t&#243;picos en los documentos cambia. Si encontramos que la mayor&#237;a de los textos est&#225;n dominados por muy pocos t&#243;picos, lo interpretamos como una se&#241;al de necesitar aumentar la cantidad de t&#243;picos; las preferencias fueron demasiado amplias. Hay maneras de buscar la mejor configuraci&#243;n autom&#225;ticamente, por ejemplo mediante el comando <code type="inline">hlda</code> de MALLET, pero para los lectores de esta lecci&#243;n probablemente es m&#225;s r&#225;pido realizar algunas iteraciones (para m&#225;s informaci&#243;n consulta Griffiths, T. L., &amp; Steyvers, M. (2004). <emph>Finding scientific
topics.</emph> Proceedings of the National Academy of Science, 101, 5228-5235).</p>
</div><div n="2"><head>Analizar tus propios textos con MALLET</head>
<p>La carpeta <code type="inline">sample data</code> en el directorio de MALLET (<code type="inline">C:\mallet\sample-data</code>) te puede servir como gu&#237;a para saber c&#243;mo organizar tus textos. Pon todo lo que deseas en una sola carpeta, por ejemplo <code type="inline">C:\mis-datos</code>. Tus archivos deben contener texto llano y estar en el formato <code type="inline">.txt</code> (puedes crearlos en un procesador de textos como Notepad, <link target="https://www.sublimetext.com/">Sublime Text</link> o <link target="https://atom.io/">Atom</link>, por ejemplo, y guardarlos como <code type="inline">Texto (*.txt)</code> o <code type="inline">Texto sin formato</code>). Tienes que tomar algunas decisiones. &#191;Quieres explorar los t&#243;picos a nivel de p&#225;rrafos? Entonces cada archivo <code type="inline">.txt</code> deber&#237;a contener solo un p&#225;rrafo. En los nombres de los archivos puedes agregar informaci&#243;n como el n&#250;mero de la p&#225;gina u otros identificadores, por ejemplo: <code type="inline">pag32_parr1.txt</code>. Si trabajas con un diario, cada archivo de texto podr&#237;a ser una entrada de diario, por ejemplo: <code type="inline">abril_25_1887.txt</code>. (Nota que es importante no dejar espacios en los nombres de carpetas y archivos). Si los textos que te interesan est&#225;n en la red, podr&#237;as <link target="http://electricarchaeology.ca/2012/07/09/mining-a-day-of-archaeology/">automatizar</link> este proceso.</p>
</div><div n="2"><head>Lecturas adicionales sobre <emph>Topic Modeling</emph></head>
<p>Para ver un ejemplo desarrollado de <emph>topic modeling</emph> basado en materiales obtenidos de p&#225;ginas web, v&#233;ase <link target="http://electricarchaeology.ca/2012/06/08/mining-the-open-web-with-looted-heritage-draft/">Mining the Open Web with Looted
Heritage Draft</link>.</p>
<p>Puedes reutilizar los datos tom&#225;ndolos de <link target="https://ndownloader.figshare.com/files/90972">Figshare.com</link> donde est&#225;n incluidos algunos archivos <code type="inline">.txt</code>. Cada uno de los ficheros <code type="inline">.txt</code> contiene una noticia individual.</p>
<ul>
<li>Para amplia informaci&#243;n adicional y una bibliograf&#237;a sobre <emph>topic modeling</emph> podr&#237;as empezar con el <link target="http://www.scottbot.net/HIAL/?p=19113">Guided Tour to Topic Modeling</link> de Scott Weingart.</li>
<li>Una discusi&#243;n importante sobre la interpretaci&#243;n del significado de los t&#243;picos es '<link target="http://tedunderwood.wordpress.com/2012/04/07/topic-modeling-made-just-simple-enough/">Topic modeling made just simple enough</link>' de Ted Underwood.</li>
<li>El art&#237;culo de blog '<link target="http://web.archive.org/web/20160704150726/http://www.lisarhody.com:80/some-assembly-required/">Some Assembly Required</link>' <emph>Lisa @ Work</emph> 22 de agosto de 2012 escrito por Lisa Rhody tambi&#233;n es muy revelador.</li>
<li>Clay Templeton, '<link target="http://mith.umd.edu/topic-modeling-in-the-humanities-an-overview/">Topic Modeling in the Humanities: An Overview</link>', Maryland Institute for Technology in the Humanities, n.d.</li>
<li>David Blei, Andrew Ng, and Michael Jordan, '<link target="http://dl.acm.org/citation.cfm?id=944937">Latent dirichlet allocation</link>', The Journal of Machine Learning Research 3 (2003).</li>
<li>Finalmente, te recomendamos que consultes la <link target="http://mimno.infosci.cornell.edu/topics.html">bibliograf&#237;a de art&#237;culos sobre <emph>topic modeling</emph></link> de David Mimno. Est&#225;n clasificados por temas para facilitar encontrar el art&#237;culo m&#225;s adecuado para una aplicaci&#243;n determinada. Tambi&#233;n puedes echar un vistazo a su reciente art&#237;culo sobre <link target="http://www.perseus.tufts.edu/publications/02-jocch-mimno.pdf">Historiograf&#237;a Computacional</link> en la revista <emph>ACM Transactions on Computational Logic</emph> en el que analiza revistas cient&#237;ficas de los Cl&#225;sicos a lo largo de cien a&#241;os para aprender algo sobre este campo. Mientras el art&#237;culo debe leerse como un buen ejemplo de <emph>topic modeling</emph>, su secci&#243;n sobre 'm&#233;todos' es especialmente relevante porque incluye una discusi&#243;n sobre c&#243;mo preparar los textos para un an&#225;lisis de ese tipo.<ref type="footnotemark" target="#13"/></li>
</ul>
</div></div>
      <div n="1"><head>Notas de traducci&#243;n</head>
<p><note id="1"> En esta traducci&#243;n se utiliza la expresi&#243;n <emph>topic modeling</emph> en ingl&#233;s porque en la literatura publicada sobre el tema en espa&#241;ol es lo m&#225;s com&#250;n. Por supuesto ser&#237;a posible traducir <emph>topic modeling</emph> por modelaje de t&#243;picos o algo parecido, pero hasta ahora no es habitual. Por otro lado, se ha optado por traducir todas las dem&#225;s palabras relacionadas al m&#233;todo para estimular su uso en espa&#241;ol, por ejemplo <emph>topic</emph> por t&#243;pico o <emph>topic model</emph> por modelo de t&#243;picos.</note>
<note id="2"> Tambi&#233;n hay algunos ejemplos de modelos de t&#243;picos creados a partir de textos (literarios) en espa&#241;ol. Por ejemplo: Borja Navarro-Colorado, <emph><link target="https://www.frontiersin.org/articles/10.3389/fdigh.2018.00015/full">On Poetic Topic Modeling: Extracting Themes and Motifs From a Corpus of Spanish Poetry</link></emph>, frontiers in Digital Humanities, 20 de junio de 2018, <link target="https://doi.org/10.3389/fdigh.2018.00015">https://doi.org/10.3389/fdigh.2018.00015</link>; Borja Navarro-Colorado y David Tom&#225;s, <emph><link target="https://www.dlsi.ua.es//~borja/NavarroTomas_PosterSEPLN2015.pdf">A fully unsupervised Topic Modeling approach to metaphor identification / Una aproximaci&#243;n no supervisada a la detecci&#243;n de met&#225;foras basada en Topic Modeling</link></emph>, Actas del XXXI Congreso de la Sociedad Espa&#241;ola para el Procesamiento del Lenguaje Natural, 2015; Christof Sch&#246;ch, Ulrike Henny, Jos&#233; Calvo Tello, Daniel Schl&#246;r, Stefanie Popp, <emph><link target="https://web.archive.org/web/20180828160609/http://www.dhd2016.de/abstracts/vortr%C3%A4ge-055.html">Topic, Genre, Text. Topics im Textverlauf von Untergattungen des spanischen und hispanoamerikanischen Romans (1880-1930)</link></emph>, DHd 2016. Modellierung, Vernetzung, Visualisierung. Die Digital Humanities als f&#228;cher&#252;bergreifendes Forschungsparadigma. Universit&#228;t Leipzig, 7.-12. M&#228;rz 2016.</note>
<note id="3"> En esta traducci&#243;n, las instrucciones para la instalaci&#243;n de MALLET fueron actualizadas para ajustarse a Windows 10. En el original ingl&#233;s las instrucciones se refieren a Windows 7. Las capturas de pantalla fueron sustituidas para que el idioma de la pantalla sea espa&#241;ol.</note>
<note id="4"> En todos los ejemplos de esta lecci&#243;n en los que aparece la palabra <code type="inline">User</code>, deber&#225;s sustituirla con tu propio nombre de usuario.</note>
<note id="5"> Al final de un comando escrito en la l&#237;nea de comandos siempre se teclea Entrar para confirmar el comando y ejecutarlo. En adelante no lo mencionaremos m&#225;s.</note>
<note id="6"> Puede ser necesario reiniciar el sistema operativo para que se reconozca la nueva variable de entorno.</note>
<note id="7"> En la versi&#243;n inglesa de esta lecci&#243;n se utilizan datos de muestra incluidos en MALLET, pero actualmente, estos solo existen en ingl&#233;s y alem&#225;n. Por eso se trabaja con otros datos en esta versi&#243;n espa&#241;ola y el contenido de la lecci&#243;n difiere del original en este aspecto. Los datos de muestra consisten en 19 ensayos escritos por Jos&#233; Mart&#237;. La fuente de los textos es <link target="https://es.wikisource.org/wiki/Categor%C3%ADa:Ensayos_de_Jos%C3%A9_Mart%C3%AD">Wikisource</link>.</note>
<note id="8"> En la versi&#243;n original de esta lecci&#243;n se utiliz&#243; el diccionario por defecto que est&#225; en ingl&#233;s.</note>
<note id="9"> Si las palabras con acento o &#241; no salen correctamente en tu l&#237;nea de comandos es porque la codificaci&#243;n de caracteres no es la misma en los ficheros, en MALLET y en la l&#237;nea de comandos. Los ficheros de muestra incluidos en esta lecci&#243;n est&#225;n codificadas en UTF-8. La codificaci&#243;n en MALLET tambi&#233;n es UTF-8 por defecto. Entonces es necesario cambiar la codificaci&#243;n de caracteres de la l&#237;nea de comandos para evitar esos errores. Si utilizas Windows, teclea <code type="inline">chcp 65001</code> en la l&#237;nea de comandos  para definir la codificaci&#243;n como UTF-8 antes de ejecutar los comandos de MALLET. En Mac, la codificaci&#243;n por defecto suele ser UTF-8.</note>
<note id="10"> N&#243;tese que MALLET no reconoce palabras compuestas como <code type="inline">New York</code> y las trata como dos palabras separadas. Para evitar eso, ser&#237;a necesario preprocesar el texto y conectar las varias partes de la palabra compuesta con un s&#237;mbolo, por ejemplo una barra baja (<code type="inline">New_York</code>) para que MALLET las reconozca como tales.</note>
<note id="11"> Si comparas los t&#243;picos en la figura 10 con los de la figura 9, puedes ver el efecto del elemento aleatorio del <emph>topic modeling</emph>. Esas dos listas de t&#243;picos son los resultados de dos pasadas diferentes y aunque los t&#243;picos se parezcan no son exactamente iguales.</note>
<note id="12"> Como en la l&#237;nea de comandos, tambi&#233;n en el programa de hoja de c&#225;lculo puede ser necesario cambiar la codificaci&#243;n de caracteres a UTF-8 para que las letras con acento o &#241; salgan correctamente. Esto se puede hacer durante el proceso de importar los datos o ajustando las preferencias del programa.</note>
<note id="13"> Para introducciones a <emph>topic modeling</emph> escritas en espa&#241;ol, v&#233;anse la entrada de blog de Jos&#233; Calvo Tello <emph><link target="http://www.morethanbooks.eu/topic-modeling-introduccion/">Topic modeling: &#191;qu&#233;, c&#243;mo, cu&#225;ndo?</link></emph> y la presentaci&#243;n <emph><link target="https://web.archive.org/web/20180831094856/http://www.dlsi.ua.es/~borja/riilua/6.TopicModeling_v02.pdf">Text Mining con Topic Modeling</link></emph> de Borja Navarro-Colorado.</note></p>
</div>
    </body>
  </text>
</TEI>
