<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introdu&#231;&#227;o &#224; codifica&#231;&#227;o de textos em TEI (parte 1)</title>
  <layout>lesson</layout>
  <slug>introducao-codificacao-textos-tei-1</slug>
  <date>2021-07-27</date>
  <translation_date>2022-03-11</translation_date>
  <authors>Nicol&#225;s Vaughan</authors>
  <editors>Jennifer Isasi</editors>
  <reviewers>Roc&#237;o M&#233;ndez,I&#241;aki Cano</reviewers>
  <translator>Nicol&#225;s Llano</translator>
  <translation-editor>Eric Brasil</translation-editor>
  <translation-reviewer>Ana Salgado,Jorge Barbosa</translation-reviewer>
  <difficulty>2</difficulty>
  <activity>transforming</activity>
  <topics>data-manipulation,website</topics>
  <abstract>Com esta li&#231;&#227;o, (a primeira de duas partes) aprender&#225; as bases de TEI-XML para codificar textos</abstract>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/470</review-ticket>
  <original>introduccion-a-tei-1</original>
  <avatar_alt>Gravura de uma se&#231;&#227;o transversal do solo com as etiquetas correspondentes</avatar_alt>
  <doi>10.46430/phpt0026</doi>
</metadata>
  <text xml:lang="pt">
    <body>
      <div type="2"><head>Introdu&#231;&#227;o</head>
<p>Um dos problemas centrais das humanidades digitais tem sido o trabalho com e sobre textos: captura (digitaliza&#231;&#227;o), reconhecimento, transcri&#231;&#227;o, codifica&#231;&#227;o, processamento, transforma&#231;&#227;o e an&#225;lise.
Nesta li&#231;&#227;o nos centraremos exclusivamente na codifica&#231;&#227;o de textos, ou seja, na sua categoriza&#231;&#227;o por meio de etiquetas (<emph>tags</emph>).</p>
<p>Um exemplo pode ajudar a esclarecer esta ideia. Vamos supor que temos um documento impresso j&#225; digitalizado previamente.
Temos as imagens das p&#225;ginas digitalizadas e, com a ajuda de um software de reconhecimento &#243;ptico de caracteres (<link target="https://pt.wikipedia.org/wiki/Reconhecimento_%C3%B3tico_de_caracteres">OCR</link>, em ingl&#234;s), extra&#237;mos o texto contido nas p&#225;ginas. Este texto &#233; chamado <link target="https://www.ecured.cu/Texto_plano">texto simples</link> (ou texto digitalizado), isto &#233;, o texto sem nenhum formato (sem cursiva, negrito, etc.) nem nenhuma outra estrutura&#231;&#227;o sem&#226;ntica.</p>
<p>Embora pare&#231;a estranho, o texto simples carece completamente de conte&#250;do. Para um computador &#233; s&#243; uma longa cadeia de caracteres (incluindo pontua&#231;&#227;o, espa&#231;os em branco e saltos de linha, etc.) em uma <link target="https://pt.wikipedia.org/wiki/Codifica%C3%A7%C3%A3o_de_caracteres">codifica&#231;&#227;o</link> (por exemplo <link target="https://pt.wikipedia.org/wiki/UTF-8">UTF-8</link> ou <link target="https://pt.wikipedia.org/wiki/ASCII">ASCII</link>) de algum alfabeto (por exemplo, latino, grego ou cir&#237;lico). Somos n&#243;s quem, quando lemos, identificamos palavras (em uma ou v&#225;rias l&#237;nguas), linhas, par&#225;grafos, etc. Somos n&#243;s tamb&#233;m que identificamos nomes de pessoas e de lugares, t&#237;tulos de livros e artigos, datas, cita&#231;&#245;es, ep&#237;grafes, refer&#234;ncias cruzadas (internas e externas), notas de rodap&#233; e notas no final do texto. Mas, mais uma vez, o computador &#233; completamente 'ignorante' a respeito de tais estruturas textuais num texto simples sem processamento ou codifica&#231;&#227;o.</p>
<p>Sem assist&#234;ncia humana, por exemplo, atrav&#233;s da codifica&#231;&#227;o <link target="https://tei-c.org/">TEI</link> (Text Encoding Initiative), o computador n&#227;o pode &#8220;entender&#8221; ou detectar nenhum conte&#250;do no texto simples. Isto significa, entre outras coisas, que n&#227;o podemos fazer buscas estruturadas naquele texto (por exemplo, por nomes de pessoas, lugares e datas), nem podemos extrair e processar sistematicamente aquela informa&#231;&#227;o, sem antes indicar ao computador que cadeias de carateres correspondem a que estruturas sem&#226;nticas: por exemplo, que esse &#233; o nome pr&#243;prio de uma pessoa, que o nome de outra pessoa se refere &#224; mesma pessoa, que esse &#233; um nome de um lugar, que essa &#233; uma nota na margem feita por uma terceira pessoa, ou que este par&#225;grafo pertence a tal se&#231;&#227;o do texto. Codificar o texto &#233; indicar (por meio de etiquetas e outros recursos) que certas cadeias de texto simples t&#234;m um certo significado. E essa &#233; a diferen&#231;a entre texto simples e texto estruturado semanticamente.</p>
<p>H&#225; muitas maneiras de codificar um texto. Por exemplo, podemos incluir os nomes pr&#243;prios das pessoas entre asteriscos simples: <code type="inline">*Fernando Pessoa*</code>, <code type="inline">*Carolina Maria de Jesus*</code>, etc.; e, entre asteriscos duplos, os nomes de lugares: <code type="inline">**Salvador**</code>, <code type="inline">**Lisboa**</code>, etc. Tamb&#233;m podemos utilizar o sublinhado (<emph>underline</emph>) para indicar os nomes de obras e livros: <code type="inline">_A Divina Com&#233;dia_</code>, <code type="inline">_Mem&#243;rias P&#243;sthumas de Braz Cubas_</code>, etc. Estes signos servem para etiquetar ou marcar o texto incluido entre eles, de modo a identificar um determinado conte&#250;do. Como pode facilmente imaginar, as possibilidades de codifica&#231;&#227;o s&#227;o quase infinitas.</p>
<p>Nesta li&#231;&#227;o, aprender&#225; como codificar textos usando uma linguagem de computador especialmente desenhada para isso: TEI.</p>
<div type="3"><head>O software que usaremos</head>
<p>Qualquer editor de texto simples (em formato <code type="inline">.txt</code>) ser&#225; &#250;til para fazer tudo o que precisamos nesta li&#231;&#227;o: o <link target="https://pt.wikipedia.org/wiki/Bloco_de_Notas">Bloco de Notas (Notepad) do Windows</link>, por exemplo, &#233; perfeitamente adequado para isto. Entretanto, h&#225; outros editores de texto que oferecem ferramentas ou funcionalidades destinadas a facilitar o trabalho com XML (Extensible Markup Language) e at&#233; mesmo com TEI. Um dos mais recomendados atualmente &#233; o <link target="https://www.oxygenxml.com">Oxygen XML Editor</link>, dispon&#237;vel para Windows, MacOS e Linux. No entanto, n&#227;o &#233; um software gratuito (a licen&#231;a acad&#233;mica custa cerca de US$ 100 USD), nem de c&#243;digo aberto.</p>
<p>Para esta li&#231;&#227;o usaremos o editor <link target="https://code.visualstudio.com/">Visual Studio Code</link> (VS Code, resumidamente), criado pela Microsoft e atualmente mantido por uma grande comunidade de programadores de software livre. &#201; uma aplica&#231;&#227;o totalmente gratuita e de <link target="https://github.com/microsoft/vscode">c&#243;digo aberto</link>, dispon&#237;vel para Windows, MacOS e Linux.</p>
<p>Baixe a &#250;ltima vers&#227;o do VS Code no link <link target="https://code.visualstudio.com/">https://code.visualstudio.com/</link> e instale-a no seu computador. Agora abra o software e ver&#225; uma tela parecida com a seguinte imagem:</p>
<figure><desc>Vista inicial do VS Code</desc><graphic url="introduccion-a-tei-1-01.png"/></figure>
<p>Agora vamos instalar uma extens&#227;o do VS Code chamada <link target="https://marketplace.visualstudio.com/items?itemName=rogalmic.vscode-xml-complete">XML Complete</link>, para facilitar o trabalho com documentos XML. Para tal, clique no bot&#227;o de extens&#227;o na barra de ferramentas lateral do lado esquerdo da janela principal:</p>
<figure><desc>Extens&#245;es de VS Code</desc><graphic url="introduccion-a-tei-1-02.png"/></figure>
<p>Digite <code type="inline">Xml complete</code> no campo de busca:</p>
<figure><desc>Busca de extens&#245;es de VS Code</desc><graphic url="introduccion-a-tei-1-03.png"/></figure>
<p>Finalmente, clique em "Instalar":</p>
<figure><desc>Instalar \"XML Complete\" no VS Code</desc><graphic url="introduccion-a-tei-1-04.png"/></figure>
<p>A extens&#227;o XML Complete nos permite, entre outras coisas, validar formalmente documentos XML. Se houver um erro formal - por exemplo, se esquecemos de fechar uma etiqueta - o VS Code ir&#225; mostr&#225;-lo na barra inferior:</p>
<figure><desc>Identificar erros sint&#225;ticos no VS Code</desc><graphic url="introduccion-a-tei-1-05.png"/></figure>
<figure><desc>Identificar erros sint&#225;ticos no VS Code (detalhe)</desc><graphic url="introduccion-a-tei-1-06.png"/></figure>
<p>Esta extens&#227;o tamb&#233;m oferece outras ferramentas &#250;teis para autocompletar o c&#243;digo XML. Para mais detalhes, consulte a <link target="https://github.com/rogalmic/vscode-xml-complete">documenta&#231;&#227;o</link> (unicamente dispon&#237;vel em ingl&#234;s).</p>
</div><div type="3"><head>Visualiza&#231;&#227;o vs. categoriza&#231;&#227;o</head>
<p>Aqueles que estejam familiarizados com a linguagem de marca&#231;&#227;o <link target="/pt/licoes/introducao-ao-markdown">Markdown</link> - habitual na atualidade em f&#243;runs t&#233;cnicos na Internet, assim como no <link target="https://github.com">GitHub</link>, <link target="https://gitlab.com">GitLab</link> e outros reposit&#243;rios de c&#243;digo - certamente reconhecer&#227;o o uso de elementos como asteriscos (<code type="inline">*</code>), <emph>underscores</emph> (<code type="inline">_</code>) e <emph>hashtag</emph> (<code type="inline">#</code>) para fazer com que o texto apare&#231;a de certa forma no navegador. Por exemplo, o texto inclu&#237;do entre asteriscos simples ser&#225; mostrado em it&#225;lico e o texto inclu&#237;do entre asteriscos duplos ser&#225; mostrado em negrito. Inclusive, o texto desta li&#231;&#227;o est&#225; escrito em Markdown, seguindo estas conven&#231;&#245;es.</p>
<p>Este uso da marca&#231;&#227;o tem como objetivo principal visualizar o texto, n&#227;o a sua categoriza&#231;&#227;o. Em outras palavras, as marcas ou etiquetas de Markdown n&#227;o indicam que um texto seja de uma certa categoria (por exemplo, o nome de uma pessoa, de um lugar ou de uma obra), mas apenas que o texto deve ser exibido ou mostrado de certa forma num navegador ou outra m&#237;dia.</p>
<p>Compreender a diferen&#231;a entre a marca&#231;&#227;o de visualiza&#231;&#227;o (como a de Markdown) e a marca&#231;&#227;o sem&#226;ntica (ou estrutural, como veremos mais adiante em TEI) &#233; crucial para entender o prop&#243;sito da codifica&#231;&#227;o de textos. Quando fazemos a marca&#231;&#227;o de um fragmento de texto para o codificar, n&#227;o nos preocupamos &#224; partida como este foi representado originalmente nem t&#227;o-pouco como possa vir a ser eventualmente representado no futuro. Estamos apenas interessados na fun&#231;&#227;o sem&#226;ntica ou estrutural que um determinado texto possa ter. Sendo assim, devemos procurar identificar com precis&#227;o as fun&#231;&#245;es ou categorias dos textos, deixando de parte, na medida do poss&#237;vel, o modo como s&#227;o exibidos no papel ou no monitor.</p>
<p>Para que este ponto fique bem esclarecido, voltemos ao nosso exemplo inicial. Vamos supor que no texto digitalizado a partir do qual come&#231;amos aparecem nomes pr&#243;prios impressos, como no fragmento a seguir (nota de tradu&#231;&#227;o: na li&#231;&#227;o original em espanhol foi usado o texto <emph>D. Quixote</emph> de Cervantes; nesta li&#231;&#227;o traduzida iremos usar <emph>Mem&#243;rias P&#243;sthumas de Braz Cubas</emph> de Machado de Assis, bem como outros excertos de textos em portugu&#234;s em substitui&#231;&#227;o dos exemplos originais em espanhol):</p>
<figure><desc>Fragmento curto  de texto digitalizado de _Mem&#243;rias P&#243;sthumas de Braz Cubas_</desc><graphic url="introducao-codificacao-texto-tei-1-01.png"/></figure>
<p>Como veremos mais adiante, a TEI nos permite codificar, por meio de uma s&#233;rie de etiquetas, o texto que queremos categorizar. Por exemplo, podemos utilizar uma etiqueta como <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-name.html"><code type="inline">&lt;name&gt;</code></link> para demarcar os nomes pr&#243;prios contidos no texto, desta forma:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_0" type="block" corresp="code_introducao-codificacao-textos-tei-1_0.txt"></code></pre>
<p>Mais adiante veremos em detalhe o que &#233; uma etiqueta (ou mais precisamente um elemento) e como ela funciona em XML e TEI. Por enquanto, note-se que a etiqueta n&#227;o significa que o texto tenha sido originalmente representado em versaletes (ou de qualquer outra forma). Apenas significa que o texto contido tem o estatuto de um nome pr&#243;prio, independentemente de como este seja representado. De fato, podemos codificar exaustivamente um documento com centenas ou milhares de etiquetas, sem que nenhuma delas apare&#231;a no final numa eventual representa&#231;&#227;o.</p>
</div></div>
      <div type="2"><head>XML e TEI: rumo a um padr&#227;o de codifica&#231;&#227;o de textos</head>
<p>Desde o in&#237;cio das humanidades digitais nos anos 60, houve muitas abordagens &#224; codifica&#231;&#227;o de textos. Quase todos os projetos de codifica&#231;&#227;o tinham o seu pr&#243;prio padr&#227;o, o que levou &#224; exist&#234;ncia de projetos incompat&#237;veis e intraduz&#237;veis entre si, dificultando e, at&#233; mesmo, impossibilitando o trabalho colaborativo.</p>
<p>Para resolver este problema, quase vinte anos depois, foi estabelecido um novo padr&#227;o de codifica&#231;&#227;o de textos, concertado por um grande n&#250;mero de pesquisadores de todo o mundo, especialmente de universidades anglo-sax&#244;nicas: a <link target="https://es.wikipedia.org/wiki/Text_Encoding_Initiative">Text Encoding Initiative (TEI)</link>.</p>
<p>A pr&#243;pria TEI &#233; constru&#237;da sobre a linguagem de marca&#231;&#227;o <link target="https://pt.wikipedia.org/wiki/XML">XML</link> e &#233;, portanto, &#224;s vezes referida como "TEI-XML" (ou tamb&#233;m "XML/TEI"). XML (que significa "eXtensible Markup Language") &#233; uma linguagem computacional cujo objetivo &#233; descrever, por meio de uma s&#233;rie de marca&#231;&#245;es ou etiquetas (<emph>tags</emph> em ingl&#234;s), um determinado objeto de texto.
XML e TEI s&#227;o linguagens de marca&#231;&#227;o e nesse sentido se diferenciam das linguagens de programa&#231;&#227;o como C, Python ou Java, que descrevem objetos, fun&#231;&#245;es ou procedimentos a serem executados por um computador.</p>
<div type="3"><head>XML</head>
<p>Nesta li&#231;&#227;o, n&#227;o entraremos em pormenores sobre a sintaxe e o funcionamento do XML. Recomendamos, portanto, que o leitor consulte <link target="/en/lessons/transforming-xml-with-xsl">esta outra li&#231;&#227;o</link> (em ingl&#234;s) para mais informa&#231;&#245;es sobre XML, assim como a bibliografia e as refer&#234;ncias sugeridas no final desta li&#231;&#227;o.</p>
<p>Por enquanto, s&#243; precisamos de saber que cada documento XML deve obedecer a duas regras b&#225;sicas para ser v&#225;lido:</p>
<ol>
<li>Deve existir apenas um elemento raiz (que contenha todos os outros elementos, se houver).</li>
<li>Cada etiqueta de abertura deve ter uma etiqueta de fecho.</li>
</ol>
</div><div type="3"><head>Valida&#231;&#227;o sint&#225;tica de documentos XML</head>
<p>Podemos descobrir se um documento XML &#233; sintaticamente v&#225;lido com a ajuda do nosso editor de texto (VS Code com a extens&#227;o XML Complete). Tamb&#233;m &#233; poss&#237;vel encontrar aplica&#231;&#245;es de valida&#231;&#227;o gratuitas na Internet como, por exemplo, <link target="https://codebeautify.org/xmlvalidator">https://codebeautify.org/xmlvalidator</link> ou <link target="https://www.xmlvalidation.com">https://www.xmlvalidation.com</link>.</p>
<p>Se copiarmos e colarmos o &#250;ltimo exemplo neste &#250;ltimo link (ou se carregarmos o ficheiro correspondente), teremos o seguinte erro:</p>
<figure><desc>Valida&#231;&#227;o online do &#250;ltimo exemplo</desc><graphic url="introduccion-a-tei-1-08.png"/></figure>
</div><div type="3"><head>O que &#233; a TEI?</head>
<p>A XML &#233; uma linguagem t&#227;o geral e abstrata que &#233; totalmente indiferente ao seu conte&#250;do. Pode ser usada, por exemplo, para descrever coisas t&#227;o d&#237;spares quanto um texto grego cl&#225;ssico do s&#233;culo VIII a. C. ou a mensagem que um term&#243;stato inteligente envia para uma aplica&#231;&#227;o de um smartphone usado para o controlar.</p>
<p>A TEI &#233; uma implementa&#231;&#227;o particular da XML. Ou seja, &#233; uma s&#233;rie de regras que determinam quais os elementos e quais os atributos s&#227;o permitidos num documento de um determinado tipo. Mais precisamente, a TEI &#233; uma linguagem de marca&#231;&#227;o para codificar textos de todo o tipo, tendo como objetivo que estes  possam ser processados por um computador para que possam ser analisados, transformados, reproduzidos e armazenados, dependendo das necessidades e interesses dos usu&#225;rios (tanto os de carne e osso como os computacionais). &#201; por isso que podemos dizer que a TEI est&#225; no cora&#231;&#227;o das humanidades digitais (ou pelo menos num de seus cora&#231;&#245;es!). &#201; um padr&#227;o de trabalho computacional com uma classe de objetos tradicionalmente central para as humanidades: os textos. Assim, enquanto a XML n&#227;o se importa se os elementos nm documento descrevem textos (ou as propriedades do texto), a TEI foi desenhada exclusivamente para trabalhar com eles.</p>
<p>Os tipos de elementos e atributos permitidos na TEI, e as rela&#231;&#245;es existentes entre eles, s&#227;o especificados pelas <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/index.html">regras do TEI</link>. Por exemplo, se quisermos codificar um poema, podemos utilizar o elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-lg.html"><code type="inline">&lt;lg&gt;</code></link> (de <emph>line group</emph>, "grupo de linhas") da TEI. As regras da TEI determinam que tipos de atributos esse elemento pode ter e que elementos podem, por sua vez, conter ou ser contidos por ele. A TEI determina que cada elemento <code type="inline">&lt;lg&gt;</code> deve ter, pelo menos, um elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-l.html"><code type="inline">&lt;l&gt;</code></link> (de <emph>line</emph>, "linha").</p>
<p>Como ilustra&#231;&#227;o, examinemos as primeiras tr&#234;s linhas do soneto <emph>Hiato</emph> de Manuel Bandeira (abaixo em texto simples):</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_1" type="block" corresp="code_introducao-codificacao-textos-tei-1_1.txt"></code></pre>
<p>Podemos propor a seguinte codifica&#231;&#227;o na TEI:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_2" type="block" corresp="code_introducao-codificacao-textos-tei-1_2.txt"></code></pre>
<p>Neste caso, utilizamos o atributo <code type="inline">@rhyme</code> do elemento <code type="inline">&lt;lg&gt;</code> para codificar o tipo de rima do trecho; o atributo <code type="inline">@met</code> para indicar o tipo de m&#233;trica do primeiro verso (hendecass&#237;labo) (isto teria de ser feito em cada um dos versos, ainda que para clareza do c&#243;digo o tenhamos feito apenas no primeiro); e finalmente o atributo <code type="inline">@n</code> para indicar o n&#250;mero do verso dentro do grupo.</p>
<p>Comparar o texto simples do fragmento do soneto com a sua codifica&#231;&#227;o permite come&#231;ar a ver as vantagens da TEI como uma linguagem de marca&#231;&#227;o de textos. N&#227;o s&#243; fica explicitamente declarado que da segunda a quarta linha (no c&#243;digo acima) s&#227;o versos de um poema, mas que elas t&#234;m um tipo de rima e m&#233;trica. Uma vez codificado todo o poema, ou todos os poemas de uma cole&#231;&#227;o, podemos, por exemplo, usar um software para realizar buscas estruturadas, de modo que este devolva todos os poemas com um certo tipo de rima ou todas as linhas que t&#234;m um certo tipo de m&#233;trica. Ou podemos usar (ou criar) um aplicativo para determinar quantos versos dos sonetos de Bandeira - se houver - t&#234;m m&#233;trica imperfeita. Tamb&#233;m podemos comparar as diferentes vers&#245;es (os "testemunhadores" e as "testemunhas" manuscritas e impressas) dos sonetos, visando fazer uma edi&#231;&#227;o cr&#237;tica dos mesmos.</p>
<p>Agora, tudo isso e muito mais s&#243; &#233; poss&#237;vel em virtude do fato de termos explicitado, gra&#231;as &#224; TEI, o conte&#250;do desses sonetos. Se tiv&#233;ssemos apenas o texto simples deles, seria tecnicamente imposs&#237;vel tirar proveito das ferramentas computacionais projetadas para edit&#225;-los, transform&#225;-los, visualiz&#225;-los, analis&#225;-los ou public&#225;-los.</p>
</div></div>
      <div type="2"><head>Um documento m&#237;nimo de TEI</head>
<p>Examinemos agora o seguinte documento m&#237;nimo de TEI:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_3" type="block" corresp="code_introducao-codificacao-textos-tei-1_3.txt"></code></pre>
<p>A primeira linha &#233; a j&#225; tradicional declara&#231;&#227;o do documento XML.
A segunda linha cont&#233;m o elemento principal ou "raiz" deste documento: o elemento <code type="inline">&lt;TEI&gt;</code>. O atributo <code type="inline">@xmlns</code> com o valor <code type="inline">http://www.tei-c.org/ns/1.0</code> simplesmente declara que todos os elementos e atributos filhos do elemento <code type="inline">&lt;TEI&gt;</code> pertencem ao "namespace" do TEI (representado aqui pela URL). N&#227;o teremos de nos preocupar mais com isso a partir de agora.</p>
<p>O interessante vem a seguir nas linhas tr&#234;s e dezesseis que cont&#234;m, respectivamente, os dois filhos imediatos do elemento raiz:</p>
<ul>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-teiHeader.html"><code type="inline">&lt;teiHeader&gt;</code></link></li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-text.html"><code type="inline">&lt;text&gt;</code></link></li>
</ul>
<p>Vejamos agora em que consistem estes dois elementos.</p>
<div type="3"><head>O elemento <teiheader/></head>
<p>Todos os metadados do documento est&#227;o codificados no elemento <code type="inline">&lt;teiHeader&gt;</code>: o t&#237;tulo, autoras ou autores, onde, quando e como foi publicado, a sua fonte, de onde a fonte foi retirada, e assim por diante. &#201; comum que as pessoas que come&#231;am a codificar texto em TEI passem por cima destas informa&#231;&#245;es, preenchendo estes campos com dados gen&#233;ricos e incompletos. No entanto, as informa&#231;&#245;es no <code type="inline">&lt;teiHeader&gt;</code> s&#227;o essenciais para a tarefa do codificador, pois servem para identificar com precis&#227;o o texto codificado.</p>
<p>O <code type="inline">&lt;teiHeader&gt;</code> deve conter pelo menos um elemento chamado <code type="inline">&lt;fileDesc&gt;</code> (de <emph>file description</emph> ou descri&#231;&#227;o do arquivo) que, por sua vez, cont&#233;m tr&#234;s elementos filhos:</p>
<ul>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-titleStmt.html"><code type="inline">&lt;titleStmt&gt;</code></link> (de <emph>title statement</emph> ou enunciado de t&#237;tulo): a informa&#231;&#227;o sobre o t&#237;tulo do documento (dentro do elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-title.html"><code type="inline">&lt;title&gt;</code></link>); opcionalmente tamb&#233;m pode incluir dados sobre o autor ou autores (dentro do elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-author.html"><code type="inline">&lt;author&gt;</code></link>)</li>
<li>
<link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-publicationStmt.html"><code type="inline">&lt;publicationStmt&gt;</code></link> (de <emph>publication statement</emph> ou enunciado de publica&#231;&#227;o): a informa&#231;&#227;o sobre como o documento &#233; publicado ou disponibilizado (ou seja, o pr&#243;prio documento TEI, n&#227;o a sua fonte). Nesse sentido, &#233; an&#225;logo &#224;s informa&#231;&#245;es da editora/impressora na folha de rostro de um livro. Pode ser um par&#225;grafo descritivo (dentro do elemento de par&#225;grafo gen&#233;rico <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-p.html"><code type="inline">&lt;p&gt;</code></link>) ou pode estar estruturada em um ou v&#225;rios campos dentro dos seguintes elementos:<ul>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-address.html"><code type="inline">&lt;address&gt;</code></link>: o endere&#231;o postal de quem edita/codifica</li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-date.html"><code type="inline">&lt;date&gt;</code></link>: a data de publica&#231;&#227;o do documento</li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-pubPlace.html"><code type="inline">&lt;pubPlace&gt;</code></link>: o local de publica&#231;&#227;o do documento</li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-publisher.html"><code type="inline">&lt;publisher&gt;</code></link>: a pessoa que edita/codifica o documento</li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-ref.html"><code type="inline">&lt;ref&gt;</code></link> (ou tamb&#233;m <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-ptr.html"><code type="inline">&lt;ptr&gt;</code></link>): uma refer&#234;ncia externa (URL) onde fica dispon&#237;vel o documento</li>
</ul>
</li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-sourceDesc.html"><code type="inline">&lt;sourceDesc&gt;</code></link> (de <emph>source description</emph> ou descri&#231;&#227;o da fonte): a informa&#231;&#227;o sobre a fonte da qual &#233; tirado o texto a ser codificado. Pode ser um par&#225;grafo descritivo (dentro do elemento de par&#225;grafo gen&#233;rico, <code type="inline">&lt;p&gt;</code>). Tamb&#233;m pode estar estruturada de v&#225;rias maneiras. Por exemplo, pode ter um elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-bibl.html"><code type="inline">&lt;bibl&gt;</code></link>, que inclui uma refer&#234;ncia bibliogr&#225;fica n&#227;o-estruturada (p. ex. <code type="inline">&lt;bibl&gt;Machado de Assis, "Mem&#243;rias P&#243;sthumas de Braz Cubas", Rio de Janeiro: Typographia Nacional , 1881&lt;/bibl&gt;</code>); ou pode conter uma refer&#234;ncia estruturada do elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-biblStruct.html"><code type="inline">&lt;biblStruct&gt;</code></link> que, por sua vez, cont&#233;m outros elementos relevantes</li>
</ul>
<p>Suponha que queremos codificar as <emph>Mem&#243;rias P&#243;sthumas de Braz Cubas</emph> de Machado de Assis, a partir dessa <link target="https://www.gutenberg.org/ebooks/54829">edi&#231;&#227;o</link> dispon&#237;vel gratuitamente no <link target="https://www.gutenberg.org">Gutenberg Project</link>. O <code type="inline">&lt;teiHeader&gt;</code> do nosso documento TEI poderia muito bem ser o seguinte:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_4" type="block" corresp="code_introducao-codificacao-textos-tei-1_4.txt"></code></pre>
<p>Esta &#233; a informa&#231;&#227;o m&#237;nima para identificar o documento codificado. Informa sobre o t&#237;tulo e o autor do texto, a pessoa respons&#225;vel pela codifica&#231;&#227;o e a fonte da qual o texto foi tirado.</p>
<p>Entretanto, &#233; poss&#237;vel - e &#224;s vezes desej&#225;vel - especificar os metadados do documento com mais detalhes. Por exemplo, considere esta outra vers&#227;o do <code type="inline">&lt;teiHeader&gt;</code> para o mesmo texto:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_5" type="block" corresp="code_introducao-codificacao-textos-tei-1_5.txt"></code></pre>
<p>A decis&#227;o sobre a abrang&#234;ncia das informa&#231;&#245;es no <code type="inline">&lt;teiHeader&gt;</code> depende da sua disponibilidade, e atende os prop&#243;sitos de codifica&#231;&#227;o e os interesses do codificador/editor. Agora bem, mesmo que os metadados contidos no <code type="inline">&lt;teiHeader&gt;</code> de um documento TEI n&#227;o apare&#231;am literal e necessariamente no texto codificado, n&#227;o significa que sejam irrelevantes para o processo de codifica&#231;&#227;o, edi&#231;&#227;o e eventual transforma&#231;&#227;o. Na realidade, na medida em que um <code type="inline">&lt;teiHeader&gt;</code> seja seja codificado de forma correta e exaustiva, as informa&#231;&#245;es contidas no documento poder&#227;o ser extra&#237;das e transformadas.</p>
<p>Por exemplo, se fosse importante para n&#243;s distinguirmos entre as diferentes edi&#231;&#245;es e impress&#245;es de <emph>Mem&#243;rias P&#243;sthumas de Braz Cubas</emph>, as informa&#231;&#245;es dos diferentes documentos transcritos contidas no <code type="inline">&lt;teiHeader&gt;</code> seriam suficientes para discrimin&#225;-los automaticamente. Na realidade, poder&#237;amos aproveitar os elementos <code type="inline">&lt;edi&#231;&#227;o&gt;</code> e <code type="inline">&lt;impress&#227;o&gt;</code> para esse fim, e com a ajuda de tecnologias como <link target="https://www.w3.org/TR/xslt/">XSLT</link>, <link target="https://www.w3.org/TR/xpath/">XPath</link> e <link target="https://www.w3.org/TR/xquery/">XQuery</link> poder&#237;amos localizar, extrair e processar toda a informa&#231;&#227;o.</p>
<p>Em conclus&#227;o, quanto mais completa e minuciosamente os metadados dos textos forem codificados no <code type="inline">&lt;teiHeader&gt;</code> de nossos documentos TEI, mais controle teremos sobre sua identidade e natureza.</p>
</div><div type="3"><head>O elemento <text/></head>
<p>Como vimos acima no documento m&#237;nimo, <code type="inline">&lt;text&gt;</code> &#233; o segundo filho de <code type="inline">&lt;TEI&gt;</code>. Este cont&#233;m todo o texto do documento propriamente dito. Conforme a <link target="https://tei-c.org/guidelines/p5/">documenta&#231;&#227;o TEI</link>, o <code type="inline">&lt;text&gt;</code> pode conter v&#225;rios elementos nos quais o texto objeto vai ser estruturado:</p>
<figure><desc>Elementos poss&#237;veis de `<text>`</text></desc><graphic url="introduccion-a-tei-1-09.png"/></figure>
<p>O mais importante destes elementos &#233; <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-body.html"><code type="inline">&lt;body&gt;</code></link>, que cont&#233;m o corpo principal do texto. Entretanto, outros elementos importantes filhos de <code type="inline">&lt;text&gt;</code> s&#227;o <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-front.html"><code type="inline">&lt;front&gt;</code></link>, que cont&#233;m o <emph>frontmatter</emph> (p&#225;ginas preliminares) de um texto (introdu&#231;&#227;o, pref&#225;cio, etc.), e <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-back.html"><code type="inline">&lt;back&gt;</code></link>, que cont&#233;m o <emph>backmatter</emph> (p&#225;ginas finais, anexos, &#237;ndices, etc.).</p>
<p>O elemento <code type="inline">&lt;body&gt;</code> pode, por sua vez, conter muitos outros elementos:</p>
<figure><desc>Elementos poss&#237;veis de ``</desc><graphic url="introduccion-a-tei-1-10.png"/></figure>
<p>Embora todas estas possibilidades possam nos sobrecarregar &#224; primeira vista, devemos lembrar que normalmente um texto &#233; dividido naturalmente em sec&#231;&#245;es ou partes constitutivas. &#201; recomend&#225;vel, dessa maneira, usar o elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-div.html"><code type="inline">&lt;div&gt;</code></link> para cada uma das partes e usar atributos como <code type="inline">@type</code> ou <code type="inline">@n</code> para qualificar as suas diferentes classes e posi&#231;&#245;es no texto (p. ex. <code type="inline">&lt;div n="3" type="subsec&#231;&#227;o"&gt;...&lt;/div&gt;</code>).</p>
<p>Se o nosso texto for curto ou simples, podemos usar um <code type="inline">&lt;div&gt;</code> unicamente. Por exemplo:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_6" type="block" corresp="code_introducao-codificacao-textos-tei-1_6.txt"></code></pre>
<p>Mas se o nosso texto for mais complexo, utilizaremos v&#225;rios elementos <code type="inline">&lt;div&gt;</code>:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_7" type="block" corresp="code_introducao-codificacao-textos-tei-1_7.txt"></code></pre>
<p>A estrutura do nosso documento TEI deve, em princ&#237;pio, ter semelhan&#231;a com a estrutura do texto objeto, isto &#233;, o texto que queremos codificar. Dessa forma, se o nosso objeto est&#225; dividido em cap&#237;tulos, e estes se dividem em se&#231;&#245;es ou apartados e, por sua vez, estes em par&#225;grafos, o recomend&#225;vel &#233; que repliquemos essa mesma estrutura no documento TEI.</p>
<p>Para os cap&#237;tulos e sec&#231;&#245;es podemos usar o elemento <code type="inline">&lt;div&gt;</code> e para os par&#225;grafos o elemento <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-p.html"><code type="inline">&lt;p&gt;</code></link>.
Vejamos, por exemplo, o seguinte esquema:</p>
<pre><code class="language-XML" xml:id="code_introducao-codificacao-textos-tei-1_8" type="block" corresp="code_introducao-codificacao-textos-tei-1_8.txt"></code></pre>
<p>Embora a TEI nos permita codificar exaustivamente muitos dos aspectos e propriedades de um texto, &#224;s vezes n&#227;o estamos interessados em todos eles. Al&#233;m disso, o processo de codifica&#231;&#227;o pode ser desnecessariamente demorado se codificarmos elementos dos quais nunca tiraremos vantagem numa eventual transforma&#231;&#227;o. Por exemplo, se estamos codificando o texto de uma edi&#231;&#227;o impressa, pode acontecer que as divis&#245;es de linha nos par&#225;grafos n&#227;o sejam relevantes para nossa codifica&#231;&#227;o.</p>
<p>Nesse caso, podemos ignor&#225;-las e simplesmente ficar com as divis&#245;es de par&#225;grafos, sem ir al&#233;m delas. Ou podemos ser tentados a codificar sistematicamente todas as datas e nomes de lugares (com os elementos <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-date.html"><code type="inline">&lt;date&gt;</code></link> e <link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-placeName.html"><code type="inline">&lt;placeName&gt;</code></link>, respectivamente) que aparecem no nosso texto objeto, mesmo que nunca os utilizemos mais tarde. Fazer isso n&#227;o &#233; um erro, &#233; claro, mas podemos perder tempo valioso ao faz&#234;-lo.</p>
<p>Em resumo, poder&#237;amos formular a "regra de ouro" da codifica&#231;&#227;o da seguinte forma: codificar todos e somente aqueles elementos que possuem um certo significado para n&#243;s, considerando que eventualmente poderemos us&#225;-los para fins espec&#237;ficos.</p>
</div><div type="3"><head>Conclus&#245;es</head>
<p>Nesta primeira parte da li&#231;&#227;o, aprendeu:</p>
<ol>
<li>O que significa codificar um texto</li>
<li>O que s&#227;o documentos XML e XML-TEI</li>
</ol>
<p>Na segunda parte, a ser publicada em breve, ver&#225; em detalhe dois exemplos de codifica&#231;&#227;o de texto.</p>
<p>Nota de tradu&#231;&#227;o: para a vers&#227;o em portugu&#234;s foi usado o texto <emph>Mem&#243;rias P&#243;stumas de Br&#225;s Cubas</emph> de Machado de Assis e o poema <emph>Hiato</emph> de Manuel Bandeira, mantendo o tipo de exerc&#237;cios e o c&#243;digo da li&#231;&#227;o original.  </p>
</div><div type="3"><head>Refer&#234;ncias recomendadas</head>
<ul>
<li>
<p>A documenta&#231;&#227;o completa do TEI (as <emph>TEI Guidelines</emph>) est&#225; dispon&#237;vel em <link target="https://tei-c.org/guidelines/">o site do cons&#243;rcio</link>. Embora esteja dispon&#237;vel em v&#225;rios idiomas, s&#243; est&#225; completa em ingl&#234;s.</p>
</li>
<li>
<p>Uma boa introdu&#231;&#227;o ao TEI &#233; o livro <emph>What Is the Text Encoding Initiative</emph> de Lou Burnard, <link target="https://books.openedition.org/oep/426?lang=en">dispon&#237;vel gratuitamente online</link>.</p>
</li>
<li>
<p>Um bom tutorial para XML est&#225; dispon&#237;vel em: <link target="https://www.w3schools.com/xml/">https://www.w3schools.com/xml/</link> e em: <link target="https://www.tutorialspoint.com/xml/index.htm">https://www.tutorialspoint.com/xml/index.htm</link>.</p>
</li>
<li>
<p>O cons&#243;rcio TEI tamb&#233;m oferece <link target="https://www.tei-c.org/release/doc/tei-p5-doc/en/html/SG.html">uma boa introdu&#231;&#227;o ao XML</link>.</p>
</li>
<li>
<p>A documenta&#231;&#227;o XML oficial est&#225; dispon&#237;vel no <link target="https://www.w3.org/XML/">site do cons&#243;rcio W3C</link>. <link target="https://www.w3.org/Style/XSL/">Documenta&#231;&#227;o para toda a fam&#237;lia XSL</link> (incluindo XSLT) tamb&#233;m est&#225; dispon&#237;vel.</p>
</li>
<li>
<p>A Funda&#231;&#227;o Mozilla tamb&#233;m fornece uma boa p&#225;gina sobre XSLT e tecnologias relacionadas <link target="https://developer.mozilla.org/es/docs/Web/XSLT">(em espanhol)</link> e <link target="https://developer.mozilla.org/en-US/docs/Web/XSLT">(em ingl&#234;s)</link>.</p>
</li>
<li>
<p>A p&#225;gina <link target="https://tthub.io">TTHUB</link> cont&#233;m uma excelente <link target="https://tthub.io/aprende/introduccion-a-tei/">"Introducci&#243;n a la Text Encoding Initiative"</link> de Susanna All&#233;s Torrent (2019).</p>
</li>
<li>
<p>Uma li&#231;&#227;o introdut&#243;ria de Programming Historian sobre XML e as transforma&#231;&#245;es XSL &#233; <link target="/es/lecciones/transformacion-datos-xml-xsl"><emph>Transforma&#231;&#227;o de dados com XML e XSL para reutiliza&#231;&#227;o</emph></link>, de M. H. Beals.</p>
</li>
</ul>
</div></div>
    </body>
  </text>
</TEI>
