<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="construir-repositorio-de-fuentes">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Construir un repositorio de fuentes hist&#243;ricas con Omeka Classic
</title>
  <author role="original_author">Jairo Antonio Melo Fl&#243;rez</author><editor role="reviewers"><persName>Mar&#237;a Jos&#233; Afanador-Llach</persName><persName>Jos&#233; Antonio Motilla</persName></editor><editor role="editors">Jos&#233; Antonio Motilla</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0045</idno><date type="published">03/30/2020</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. This lesson is original.</p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Esta lecci&#243;n profundiza en algunos aspectos avanzados de Omeka Classic con los cuales se facilita el control, administraci&#243;n y personalizaci&#243;n del sistema para el desarrollo de repositorios de fuentes hist&#243;ricas.</p></abstract><textClass><keywords><term xml:lang="en">website</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="1"><head>Contenido</head>
</div>
      <div type="1"><head>Antes de empezar</head>
<p>Actualmente el <ref target="https://omeka.org">proyecto Omeka</ref> se encuentra dividido en tres productos: Omeka Classic, una plataforma de publicaci&#243;n Web para construir y compartir colecciones digitales; Omeka.net, un servicio de alojamiento web espec&#237;ficamente dise&#241;ado para Omeka; y Omeka Semantic o S, lanzada en 2017, enfocada en la conexi&#243;n de las colecciones con la Web sem&#225;ntica. Esta lecci&#243;n se basa en Omeka Classic<ref type="footnotemark" target="#note_version"/> por estar enfocada en proyectos particulares, de individuos o grupos medianos. Para construir grandes colecciones institucionales de documentos, bibliotecas o archivos, recomendamos usar Omeka S.</p>
<p style="alert alert-warning">
  Esta lecci&#243;n plantea modificaciones menores a la base de datos y archivos de la plataforma. Antes de iniciar realice una copia de seguridad de toda la instalaci&#243;n o haga las pruebas con una instalaci&#243;n nueva que no comprometa informaci&#243;n actualmente en uso.
</p>
<p>Algunos de los ejercicios planteados en esta lecci&#243;n requieren un repositorio con una cantidad de elementos (por lo menos una decena). Para facilitar el ejercicio puede descargar un dataset con elementos, colecciones y tipos de elementos desde <ref target="/assets/construir-repositorio-de-fuentes/tutorial.sql">este archivo</ref>.</p>
</div>
      <div type="1"><head>Introducci&#243;n</head>
<p>La abundancia de informaci&#243;n documental que tenemos a disposici&#243;n es cada vez mayor. Las fuentes primarias que se encuentran publicadas por archivos y bibliotecas han facilitado significativamente nuestro trabajo de recolecci&#243;n de informaci&#243;n hist&#243;rica. Sin embargo, esto ha conllevado un problema de abundancia de digitalizaciones y transcripciones de documentos que muchas veces quedan almacenadas an&#225;rquicamente en nuestros ordenadores. En esta lecci&#243;n aprovecharemos las capacidades de Omeka para desarrollar repositorios, individuales o colaborativos, para almacenar, analizar y exhibir fuentes primarias; con el prop&#243;sito de presentar una opci&#243;n para la sistematizaci&#243;n de documentaci&#243;n primaria que posteriormente podr&#225; ser utilizada en tareas de investigaci&#243;n o exhibiciones Web.</p>
<p>Para seguir esta lecci&#243;n requieres una instalaci&#243;n de Omeka. Puedes seguir la lecci&#243;n <ref target="/lessons/installing-omeka"><emph>Installing Omeka</emph></ref> disponible en el sitio en ingl&#233;s (la versi&#243;n en espa&#241;ol se encuentra en proceso de traducci&#243;n). En caso de que necesites conocer el funcionamiento b&#225;sico de la plataforma es importante que entiendas como <ref target="/es/lecciones/poniendo-omeka-a-funcionar">crear sitios, elementos, colecciones</ref> y <ref target="/es/lecciones/crear-exposicion-con-omeka">exhibiciones</ref>.</p>
<p>Asimismo es importante que en caso de querer ampliar la informaci&#243;n sobre el funcionamiento de Omeka recurras al <ref target="https://omeka.org/classic/docs/">manual de usuario</ref> de la versi&#243;n cl&#225;sica. Tambi&#233;n es posible que consultes o participes en el <ref target="https://forum.omeka.org/c/omeka-classic">foro</ref> para obtener informaci&#243;n adicional o respuesta a un problema espec&#237;fico.</p>
</div>
      <div type="1"><head>Instalaci&#243;n local de Omeka</head>
<p>Instalar un servidor Web en tu ordenador brinda la posibilidad de ejecutar aplicaciones como Omeka de manera privada y gratuita; lo que representa una ventaja significativa para experimentar con proyectos que a&#250;n se encuentren en desarrollo o para utilizar Omeka con informaci&#243;n privada que no se desea subir a un servidor Web accesible desde la Internet.</p>
<p>La arquitectura de Omeka est&#225; basada en PHP-MySQL, esto significa que la informaci&#243;n que se agrega, modifica y lee desde el entorno de la plataforma escrito en <ref target="https://es.wikipedia.org/wiki/PHP">PHP</ref>; queda almacenada en una base de datos <ref target="https://es.wikipedia.org/wiki/MySQL">MySQL</ref>; y se procesa mediante un servidor <ref target="https://en.wikipedia.org/wiki/Apache_HTTP_Server">Apache</ref>. No es necesario entender exactamente el funcionamiento de la tecnolog&#237;a de servidor (se requerir&#237;a de una especializaci&#243;n en inform&#225;tica para ello), pero es importante familiarizarse con los conceptos de servidor Web, plataforma y base de datos para los ejercicios posteriores.</p>
<p>El sentido b&#225;sico de este esquema puede resumirse con la siguiente imagen:</p>
<figure><desc>S&#237;ntesis de la tecnolog&#237;a de servidor</desc><graphic url="img_1.1.jpg"/></figure>
<p>Para realizar la instalaci&#243;n local y configurar Omeka en tu ordenador, te recomendamos seguir las instrucciones del paso 2A de la lecci&#243;n <ref target="/en/lessons/installing-omeka#step-2a-for-vps-hosting"><emph>Installing Omeka</emph></ref>. Tambi&#233;n es recomendable consultar el <ref target="http://www.rubenalcaraz.es/manual-omeka/">manual elaborado por Manuel Alcaraz</ref> (bibliotec&#243;nomo con grado en ingenier&#237;a inform&#225;tica), en el cual cubre los aspectos necesarios para gestionar una instalaci&#243;n en Omeka desde la interface de administraci&#243;n del sitio.</p>
<p>En este tutorial te ayudaremos a instalar una <ref target="https://es.wikipedia.org/wiki/M%C3%A1quina_virtual">m&#225;quina virtual</ref>, es decir, una serie de programas que permiten <ref target="https://es.wikipedia.org/wiki/Script_del_lado_del_servidor">ejecutar aplicaciones que requieren tecnolog&#237;a de servidor</ref> (como Omeka) sin necesidad de tener contratado un servidor Web. Tambi&#233;n te mostraremos una forma com&#250;n de gestionar la base de datos a trav&#233;s del aplicativo <ref target="https://es.wikipedia.org/wiki/PhpMyAdmin">phpMyAdmin</ref>, una herramienta ampliamente difundida para administrar MySQL.</p>
<div type="2"><head>Instalar la m&#225;quina virtual</head>
<p>Para los fines de esta lecci&#243;n usaremos el entorno <ref target="https://www.apachefriends.org/es/index.html">XAMPP</ref>, disponible para Windows, Linux y OS X. Despu&#233;s de descargar el paquete correspondiente a su sistema operativo instale el entorno siguiendo las instrucciones del instalador.<ref type="footnotemark" target="#note_xampp_instrucciones"/> A continuaci&#243;n le solicitar&#225; que escoja un directorio para albergar los archivos de la m&#225;quina virtual, en nuestro caso realizamos la instalaci&#243;n en Windows 10 y escogeremos la opci&#243;n predeterminada <code rend="inline">C:\xampp</code>; en el caso de Linux-Ubuntu ser&#225; obligatoriamente <code rend="inline">/opt/lampp</code> y en Mac OS X <code rend="inline">/aplications/XAMPP</code>.</p>
<p>Para ejecutar el instalador en Linux deber&#225;s iniciar la terminal y dirigirte al directorio donde lo descargarte y hacerlo ejecutable mediante el siguiente comando (recuerda cambiar el nombre del ejemplo por el del archivo que descargaste):</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_0" corresp="code_construir-repositorio-de-fuentes_0.txt" lang="language-terminal" rend="block"/></ab>
<p>Luego ejecuta el archivo mediante el comando:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_1" corresp="code_construir-repositorio-de-fuentes_1.txt" lang="language-terminal" rend="block"/></ab>
<p>A partir de all&#237; sigue las instrucciones del instalador.</p>
<p>Tras la instalaci&#243;n, la primera acci&#243;n que debemos realizar ser&#225; activar los m&#243;dulos "Apache" y "MySQL" para poner a funcionar nuestro servidor.<ref type="footnotemark" target="#note_advertencia_Ubuntu"/> Para eso s&#243;lo debes hacer click en los botones "Start" de la columna "Actions", tras lo cual los m&#243;dulos se pondr&#225;n de color verde.</p>
<figure><desc>M&#243;dulos XAMPP activados</desc><graphic url="img_1.1-modact.jpg"/></figure>
<p>Para probar que todo funciona correctamente, ingresa desde tu navegador a la direcci&#243;n <ref target="http://localhost/">http://localhost/</ref> o <ref target="http://127.0.0.1">http://127.0.0.1</ref>. Si la instalaci&#243;n es correcta te mostrar&#225; la pantalla de inicio:</p>
<figure><desc>Pantalla de inicio (dashboard) de XAMPP</desc><graphic url="img_1.1-xampp-dashboard.jpg"/></figure>
<p>Deber&#225;s tener en el men&#250; de inicio de Windows un men&#250; de XAMPP con tres opciones desplegables. Las m&#225;s &#250;tiles para nuestro trabajo ser&#225;n "XAMPP Control Panel", que abre el panel de control para activar o desactivar los m&#243;dulos, y "XAMPP htdocs folder", un enlace al directorio donde se guardar&#225;n los archivos de Omeka para realizar la instalaci&#243;n, por lo general es <code rend="inline">C:\xampp\htdocs</code> para Windows. En Linux este directorio se encuentra en la ruta <code rend="inline">/opt/lampp/htdocs</code>.</p>
<p>Errores comunes en Windows que pueden surgir de este proceso pueden derivarse de haber instalado la m&#225;quina virtual sin desactivar el antivirus, conflictos con otras m&#225;quinas virtuales previamente instaladas, o haber escogido un directorio, para el caso de Windows 10, en la carpeta <code rend="inline">C:\Program Files (x86)</code>. En todos estos casos la opci&#243;n m&#225;s sencilla consiste en reinstalar la m&#225;quina y evitar estas advertencias.</p>
<p>En el caso de Linux tal vez sea necesario instalar instancias adicionales como "net-tools". Si va a utilizar XAMPP de manera frecuente lo m&#225;s recomendable es crear un <emph>script</emph> para iniciar la aplicaci&#243;n autom&#225;ticamente en cada reinicio del ordenador.</p>
</div><div type="2"><head>Gestionar las bases de datos desde <emph>phpMyAdmin</emph></head>
<p>Para la instalaci&#243;n de Omeka es necesario crear una base de datos que albergar&#225; informaci&#243;n que permite relacionar elementos, tipos de elementos, colecciones, entre s&#237; y con otros objetos, como textos, documentos o im&#225;genes.</p>
<p>Para crear la base de datos es posible utilizar los m&#233;todos explicados en el paso 2 de <ref target="/en/lessons/installing-omeka#step-2-install-your-server-and-database"><emph>Installing Omeka</emph></ref>. Tambi&#233;n podemos utilizar <emph>phpMyAdmin</emph> para crear la base de datos de la instalaci&#243;n e incluso para editarla despu&#233;s.</p>
<p>El primer paso consiste en ingresar al entorno de <emph>phpMyAdmin</emph> a trav&#233;s de la direcci&#243;n <ref target="http://localhost/phpmyadmin/">http://localhost/phpmyadmin/</ref> XAMPP te dejar&#225; ingresar sin contrase&#241;a, pero otros servicios (como Bitnami) te exigir&#225;n permisos de usuario para ingresar.<ref type="footnotemark" target="#note_bitnami_ingreso"/> La p&#225;gina de inicio te mostrar&#225; una p&#225;gina con la configuraci&#243;n general del servidor de la base de datos, el servidor web y de la aplicaci&#243;n. Esta pantalla ser&#225; importante al momento de requerir la versi&#243;n de MySQL ("Servidor de base de datos &gt;&gt; Versi&#243;n del servidor"), la versi&#243;n de PHP ("Servidor web &gt;&gt; Versi&#243;n de PHP"), o incluso el nombre de usuario del servidor (por lo general "root@localhost"). Esta pantalla es &#250;til no s&#243;lo en instalaciones locales, servir&#225; tambi&#233;n para comprobar que alg&#250;n servicio de alojamiento web corresponda con la tecnolog&#237;a necesaria para ejecutar ciertas aplicaciones.</p>
<p>En <emph>phpMyAdmin</emph> seleccionaremos la pesta&#241;a "Bases de datos" donde veremos un peque&#241;o formulario para crear la base de datos, s&#243;lo tenemos que ingresar el <emph>nombre de la base de datos</emph> e indicar el <emph>cotejamiento</emph>. Seleccionaremos el cotejamiento <code rend="inline">utf8_spanish_ci</code> ya que representar&#225; una mayor precisi&#243;n al momento de ordenar los elementos (<emph>items</emph>) en Omeka.<ref type="footnotemark" target="#note_collate"/> Esto es particularmente relevante en las instalaciones en Linux que suelen seleccionar de manera predeterminada un cotejamiento <code rend="inline">latin1_</code>.</p>
<figure><desc>Crear base de datos en phpMyAdmin</desc><graphic url="img_1.2-crear-baseddatos.jpg"/></figure>
<p>Despu&#233;s de crear la base de datos la plataforma lo llevar&#225; al escritorio donde podr&#225; gestionar las tablas, ejecutar c&#243;digo SQL, importar y exportar tablas, gestionar los permisos de los usuarios, entre otras acciones. Por el momento la base de datos estar&#225; vac&#237;a puesto que no hemos creado ninguna tabla. Aseg&#250;rese de que haya un usuario vinculado a la base de datos (pesta&#241;a "Privilegios") y que tenga todos los privilegios. En caso contrario puede seleccionar "editar privilegios" y hacer clic en la casilla "Seleccionar todo". Tambi&#233;n puede crear y dar permisos a otros usuarios (s&#243;lo en caso de administrar colaborativamente la base de datos) desde el men&#250; "Agregar cuenta de usuario".</p>
<p>Antes de salir anota los siguientes datos que te servir&#225;n para <ref target="/en/lessons/installing-omeka#step-4-configure-omeka-to-use-your-database">configurar el archivo db.ini</ref>:</p>
<list type="unordered">
<item>Nombre del servidor</item>
<item>Nombre de la base de datos</item>
<item>Nombre de usuario</item>
<item>Contrase&#241;a del usuario</item>
</list>
<div type="3"><head>Cambiar el idioma a espa&#241;ol</head>
<p>La configuraci&#243;n predeterminada de Omeka hace que la interface del respositorio se muestre en ingl&#233;s. Lastimosamente, el panel de administraci&#243;n no tiene una opci&#243;n para seleccionar el idioma y hacer que el sitio se muestre en espa&#241;ol. Por lo tanto, debemos hacer este cambio de manera manual modificando el archivo <code rend="inline">config.ini</code> que se encuentra en el directorio <code rend="inline">application/config</code>. Desde un editor de texto o de c&#243;digo abre el archivo y busca la l&#237;nea que dice <code rend="inline">locale.name = ""</code> y entre par&#233;ntesis escribe la palabra "es", que corresponde al c&#243;digo de lenguaje ISO 639 para el castellano.</p>
<figure><desc>cambiar idioma a espa&#241;ol en la configuraci&#243;n</desc><graphic url="image_1.3-locale.png"/></figure>
</div><div type="3"><head>Paso extra en Linux</head>
<p>Aunque la instalaci&#243;n de Omeka no deber&#237;a representar un problema, es necesario tener en cuenta que para las instalaciones en Linux se deben asegurar los permisos de escritura de los directorios que almacenar&#225;n los archivos. Para ello, antes de iniciar la instalaci&#243;n ejecute el siguiente comando en la terminal:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_2" corresp="code_construir-repositorio-de-fuentes_2.txt" lang="language-terminal" rend="block"/></ab>
<p>Esto deber&#237;a permitir el inicio de la instalaci&#243;n.</p>
</div><div type="3"><head>Otro paso extra</head>
<p>Es opcional, aunque muy recomendable, que en tanto el repositorio se encuentre en desarrollo se activen los mensajes de error. Existen dos opciones, una p&#250;blica y una privada:</p>
<list type="unordered">
<item>Opci&#243;n p&#250;blica: En el archivo <code rend="inline">.htaccess</code> del directorio ra&#237;z, retira el signo de comentario (<code rend="inline">#</code>) en la l&#237;nea <code rend="inline">#SetEnv APPLICATION_ENV development</code>. Los mensajes de error se mostrar&#225;n en la p&#225;gina de inicio.</item>
<item>Opci&#243;n privada: Edita el archivo <code rend="inline">application/config/config.ini</code> y cambia el valor de la opci&#243;n 'logging' de falso a verdadero: <code rend="inline">log.errors = true</code>. Los errores se ver&#225;n en el archivo <code rend="inline">application/logs/errors.log</code>. Aseg&#250;rate que el archivo <code rend="inline">errors.log</code> tiene permisos de escritura, de otro modo no funcionar&#225;.</item>
</list>
</div></div></div>
      <div type="1"><head>Un vistazo al "esqueleto" de Omeka</head>
<p>Si vamos a <ref target="http://localhost/phpmyadmin">phpMyAdmin</ref> veremos que la base de datos vac&#237;a est&#225; ahora llena con 19 tablas interdependientes. La estructura de la base de datos (<emph>database schema</emph>) puede describirse de manera sint&#233;tica agrupando las tablas en cinco grupos de informaci&#243;n: datos para los elementos y colecciones, etiquetas, metatados de los tipos de elementos, informaci&#243;n de usuarios, texto para b&#250;squeda, y tablas para procesos del sistema. Un mapa resumido de las interdependencias entre las tablas se puede ver en la siguiente imagen:</p>
<figure><desc>Esquema de la interdependencia de la base de datos de Omeka</desc><graphic url="img_2.1-omeka_mysql_schema.png"/></figure>
<p>Como en un circuito el&#233;ctrico, cada tabla contiene informaci&#243;n necesaria para un conjunto de procesos, por ejemplo, cuando se muestra un elemento se toma informaci&#243;n de las tablas <code rend="inline">omeka_collections</code> y <code rend="inline">omeka_elements_text</code>, pero, para saber cu&#225;l texto corresponde a cual elemento y colecci&#243;n las interrelaciona en la tabla <code rend="inline">omeka_items</code> que cruza el n&#250;mero de identificaci&#243;n de la colecci&#243;n con el del elemento. A medida que vayamos progresando en esta lecci&#243;n se har&#225; m&#225;s claro el funcionamiento de la base de datos.</p>
<p>Adem&#225;s de la base de datos, Omeka funciona gracias a los archivos que permiten leer la informaci&#243;n para mostrarla en una p&#225;gina web y los formularios que hacen posible ingresar nueva informaci&#243;n en la base de datos sin necesidad de hacerlo directamente en las tablas, un proceso que ser&#237;a demasiado tedioso como para ser funcional.</p>
<p>Al instalar Omeka exploramos un poco el directorio ra&#237;z de la plataforma, espec&#237;ficamente la carpeta <code rend="inline">application\config</code>. No vamos a explorar a profundidad la estructura de archivos de Omeka, pero quisiera indicar algunos directorios claves para el manejo avanzado de la plataforma:</p>
<list type="ordered">
<item><code rend="inline">/plugins</code>: En esta direcci&#243;n se almacenan los paquetes de "plugins" o complementos que a&#241;aden capacidades adicionales a la plataforma. De manera predeterminada vienen incorporados "CoinS" (lectura de metadatos bibliogr&#225;ficos en HTML), "ExhibitBuilder" (crear presentaciones) y "SimplePages" (crear p&#225;ginas). Otros "plugins" pueden descargarse de <ref target="https://omeka.org/classic/plugins/">https://omeka.org/classic/plugins/</ref></item>
<item><code rend="inline">/themes</code>: El directorio de las plantillas de Omeka. Con la instalaci&#243;n se incluyen tres temas: "default" ("Thanks, Roy"), Berlin y Seasons. Estos tres temas presentan las configuraciones cl&#225;sicas de Omeka a partir de las cuales se desarrollan las plantillas disponibles en <ref target="https://omeka.org/classic/themes/">https://omeka.org/classic/themes/</ref>, que para instalarse deben subirse o copiarse a este directorio.</item>
<item><code rend="inline">/files</code>: En este directorio se guardan las im&#225;genes en sus diferentes tama&#241;os despu&#233;s de haberse subido y pasado por ImageMagick, tambi&#233;n los PDF y cualquier otro archivo que se haya subido por medio de la plataforma. Cada archivo es renombrado con una cadena alfanum&#233;rica aleatoria que asegura la identificaci&#243;n del objeto. El nombre original con el cual fue subido el archivo se almacena en la columna <code rend="inline">original_filename</code> de la tabla <code rend="inline">omeka_files</code>.</item>
<item><code rend="inline">/application</code>: Este directorio puede considerarse como el coraz&#243;n de la plataforma y contiene los archivos que hacen funcionar los complementos, los temas, las p&#225;ginas de b&#250;squeda, etc. S&#243;lo mencionar&#233; dos subcarpetas de cierta relevancia: <code rend="inline">\application\config</code> que ya conocemos, y <code rend="inline">application\languages</code>, que alberga los archivos de traducci&#243;n de la plataforma en formato <code rend="inline">.mo</code>. El archivo para el idioma espa&#241;ol se llama <code rend="inline">es.mo</code> y puede ser editado en caso de requerirse modificar alguna expresi&#243;n o palabra<ref type="footnotemark" target="#note_transifex"/>.</item>
</list>
<p>La mayor&#237;a de los proyectos que involucran Omeka tendr&#225;n que interactuar con los dos primeros directorios y, dependiendo de la complejidad del desarrollo, con los dem&#225;s.</p>
<p>Lo importante, tanto para la base de datos como para el directorio de archivos, consiste en familiarizarse con la plataforma y de esta manera responder ante una falla de manera m&#225;s r&#225;pida, lo cual es adem&#225;s de gran utilidad al momento de hacer una consulta en un <ref target="https://forum.omeka.org/">foro de soporte</ref> o buscar una posible soluci&#243;n en la web.</p>
</div>
      <div type="1"><head>Exportar e importar informaci&#243;n de la base de datos</head>
<h2>Crear una copia de seguridad de la base de datos</h2>
<p>Cuando vas a actualizar la plataforma, modificar un archivo de la instalaci&#243;n, editar la base de datos, o probar con un plugin experimental; siempre es recomendable realizar una copia de seguridad de la base de datos. De hecho, es una buena pr&#225;ctica hacerlo peri&#243;dicamente para as&#237; tener un respaldo de nuestra informaci&#243;n.</p>
<p>La manera m&#225;s recomendable para respaldar la base de datos consiste en exportarla a una direcci&#243;n local o remota. Para ello, solamente tenemos que seleccionar la opci&#243;n "Exportar" en phpMyAdmin. El m&#233;todo r&#225;pido de exportaci&#243;n es recomendado para realizar los respaldos ya que incluye todas las tablas y el contenido de estas. Si solamente deseas exportar una parte, renombrar la base de datos, tablas o columnas; agregar opciones para reescribir y crear tablas, o escoger un tipo de sintaxis; puedes escoger el modo perdonalizado de exportaci&#243;n.</p>
<figure><desc>Exportar tablas de la base de datos de Omeka</desc><graphic url="img_3.1-omeka_dump_mysql.png"/></figure>
<p>Tambi&#233;n puedes exportar la informaci&#243;n en formatos como <code rend="inline">csv</code>, <code rend="inline">JSON</code>, <code rend="inline">xml</code>, e incluso en <code rend="inline">YAML</code>. Sin embargo, las opciones personalizadas son mucho m&#225;s limitadas en estos formatos, por lo que no son ideales para realizar copias de seguridad.</p>
<p>Si realizas una exportaci&#243;n personalizada es recomendable que evites seleccionar la opci&#243;n <code rend="inline">CREATE DATABASE</code>, ya que esto podr&#237;a generar problemas de importaci&#243;n.</p>
<h2>Importar el dataset</h2>
<p>Para mayor comodidad en la experimentaci&#243;n, cre&#233; un peque&#241;o dataset con elementos, colecciones, etiquetas y tipos de elemento. Este contiene exclusivamente las tablas <code rend="inline">omeka_collections</code>, <code rend="inline">omeka_elements</code>, <code rend="inline">omeka_element_sets</code>, <code rend="inline">omeka_element_texts</code>, <code rend="inline">omeka_items</code>, <code rend="inline">omeka_item_types</code>, <code rend="inline">omeka_item_types_elements</code>, <code rend="inline">omeka_search_texts</code>, <code rend="inline">omeka_tags</code>.</p>
<p>A&#241;ad&#237; la opci&#243;n <code rend="inline">DROP TABLE</code>, de tal manera que al hacer la importaci&#243;n se reemplacen las tablas existentes. </p><p style="alert alert-warning">No importe este dataset en una instalaci&#243;n que tenga contenido o borrar&#225; la informaci&#243;n existente.</p>
<p>Para importar el dataset, lo haremos tambi&#233;n en phpMyAdmin desde la pesta&#241;a "Importar". Solamente deberemos seleccionar el archivo y comprobar que la opci&#243;n "Conjunto de caracteres del archivo" sea "utf-8" y que el "Formato" sea "SQL".</p>
<figure><desc>Importar tablas de la base de datos de Omeka</desc><graphic url="img_3.2-omeka_import_mysql.png"/></figure>
<p>Para comprobar que la instalaci&#243;n ha sido exitosa, solamente debe navegar a su p&#225;gina de Omeka y desde all&#237; revisar que los elementos hayan sido instalados.</p>
<h3>Soluci&#243;n de problemas</h3>
<p>Es probable que al importar una base de datos aparezca el mensaje de error #1050 <code rend="inline">la tabla 'xyz' ya existe</code>. En ese caso ser&#225; necesario eliminar las tablas o toda la base de datos desde la pesta&#241;a "Estructura" para poder proseguir con la importaci&#243;n.</p>
</div>
      <div type="1"><head>Metadatos en Omeka</head>
<p>Para muchos la palabra "Metadatos" suena oscura y "metaf&#237;sica", algo que est&#225; m&#225;s all&#225; de los datos. Sin embargo, el sentido de los <emph>metadata</emph> es mucho m&#225;s sencillo, signfica simplemente datos acerca de los datos (<emph>data about data</emph>) que tienen la funci&#243;n de indicarle a las computadoras d&#243;nde se encuentra un objeto digital. Por ejemplo, una fotograf&#237;a de la capilla sixtina es s&#243;lo un conjunto de bits compilados en un archivo de imagen, por ejemplo <code rend="inline">jpg</code> o <code rend="inline">png</code>; pero el nombre que le otorgamos al archivo (por ejemplo, "capilla_sixtina-jpg") ya es un metadato que ayuda a humanos y m&#225;quinas a encontrar la fotograf&#237;a de ese edificio. Ahora, si a ese archivo, adem&#225;s del nombre le asociamos otros indicadores como fecha, lugar, qui&#233;n tom&#243; la fotograf&#237;a, algunas palabras que describan el tipo de objeto de la imagen (por ejemplo: capilla cat&#243;lica, religi&#243;n, arquitectura del siglo XV), otros objetos con los que est&#225; relacionada, etc.; estamos hablando entonces de un "conjunto de metadatos" o <emph>metadata set</emph>.</p>
<p>Los metadatos son independientes del lenguaje de m&#225;quina o de programaci&#243;n, es decir, son categor&#237;as completamente personalizables que funcionan de manera independiente de la plataforma. Esta libertad conlleva una gran desventaja y es que si cada usuario creara sus elementos de manera arbitraria no habr&#237;a manera de intercambiar informaci&#243;n entre sistemas. Por esa raz&#243;n, se cre&#243; una estrategia de estandarizaci&#243;n de los conjuntos de metadatos de tal manera que facilite la interacci&#243;n entre plataformas, la actualizaci&#243;n del software y, sobre todo, el compartir y encontrar informaci&#243;n en grandes repositorios.</p>
<p>Omeka Classic se fundamenta en el est&#225;ndar <emph>Dublin Core</emph>, espec&#237;ficamente en el esquema b&#225;sico de 15 descriptores <a haref="http://dublincore.org/documents/dces/" target="_blank">Dublin Core Metadata Element Set Version 1.1</a>:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_3" corresp="code_construir-repositorio-de-fuentes_3.txt" rend="block"/></ab>
<p>Por medio de estos elementos es posible describir la mayor&#237;a de los objetos digitales: textos, im&#225;genes, audio, video y multimedia. Esto no implica que todo elemento tenga que tener un archivo adjunto para visualizar en la plataforma (aunque es lo ideal). Puede funcionar de modo similar a un cat&#225;logo de una biblioteca, archivo o museo.</p>
<p>Sin embargo, como habr&#225;s notado, este listado de descriptores es bastante limitado. &#191;D&#243;nde indicar&#237;as una direcci&#243;n Web, un nombre, un texto? Para eso, Omeka dise&#241;&#243; la opci&#243;n "tipos de elemento", en la cual se pueden agrupar los objetos por sus caracter&#237;sticas generales. De manera predeterminada se encuentran disponibles los tipos texto, imagen en movimiento, historia oral, sonido, im&#225;gen est&#225;tica, sitio Web, evento, correo electr&#243;nico, plan de curso, hiperenlace, entre otros. El usuario puede a&#241;adir otros tipos seg&#250;n sus necesidades a trav&#233;s del men&#250; "tipos de elemento" en el panel de administraci&#243;n (<code rend="inline">/admin/item-types</code>) o editar los tipos disponibles agregando descriptores disponibles de manera predeterminada o creando nuevos elementos.</p>
<p>Los tipos de metadatos son importantes porque nos ayudan a agrupar la informaci&#243;n. Por ejemplo, si tenemos varios tipos de texto en un mismo repositorio podr&#237;a se &#250;til crear una categor&#237;a para aquellos que tengan una estructura particular. Por ejemplo, si estamos guardando descripciones de cartas y expedientes judiciales en un mismo proyecto ser&#237;a recomendable separar ambos tipos para que no se agrupen todos como "texto". Para ello, crearemos un tipo de elemento con las siguientes categor&#237;as: delito, &#237;ndice, sindicado, juez, sentencia, y texto.</p>
<p>Desde el men&#250; "Agregar tipo de elemento" rellenamos el formulario con un nombre para el nuevo tipo de elemento y una descripci&#243;n opcional.</p>
<figure><desc>Agregar tipo de elemento</desc><graphic url="img_4.1-omeka_add_element_type.png"/></figure>
<p>Para incluir los descriptores debemos utilizar el men&#250; "Agregar elementos", ubicado al final del formulario. Si el elemento ya existe en el vocabulario predeterminado simplemente dejamos se&#241;alada la opci&#243;n "Existentes" y lo escogemos desde la lista desplegable.</p>
<figure><desc>Agregar elementos existentes</desc><graphic url="img_4.2-omeka_add_elements.png"/></figure>
<p>Para crear los descriptores personalizados simplemente marcamos la opci&#243;n "Nuevo" y rellenamos el formulario.</p>
<figure><desc>Agregar elementos nuevos</desc><graphic url="img_4.3-omeka_add_elementsnew.png"/></figure>
<p>Al finalizar debe aparecer un listado con los formularios diligenciados y los elementos existentes escogidos. Para completar el tipo pulsa el bot&#243;n "Agregar tipo de elemento", tras lo cual se mostrar&#225; una pantalla de confirmaci&#243;n, con la descripci&#243;n del tipo y los elementos asociados.</p>
<figure><desc>Agregar tipo de elemento</desc><graphic url="img_4.4-omeka_add_element_type.png"/></figure>
<p>Para utilizar el tipo de elemento, solamente debes seleccionar la pesta&#241;a "Metadatos de tipo de elemento" al momento de agregar un nuevo elemento, y en el men&#250; desplegable seleccionar el tipo que creaste.</p>
<figure><desc>Seleccionar tipo de elemento</desc><graphic url="img_4.5-omeka_metadata_type_element.png"/></figure>
<h3>Vocabulario controlado y ontolog&#237;as</h3>
<p>Para terminar con el tema de los metadatos, es importante entender que toda la informaci&#243;n que guardamos en las categor&#237;as son cadenas de texto, es decir, si en el elemento "Fuente" escribimos "Casa" no hay ninguna advertencia que indique que esa palabra no corresponde con el elemento. Para evitar lo anterior, se recomienda recurrir a vocabularios controlados, que no son otra cosa sino los t&#233;rminos que coinciden con cada elemento y que son consistentes a lo largo del repositorio. Para los proyectos institucionales se requiere de un esfuerzo importante en t&#233;rminos de interoperabilidad para que los objetos puedan ser recuperados de manera correcta. Tambi&#233;n es necesario en este sentido la adopci&#243;n o desarrollo de "ontolog&#237;as", es decir, de una organizaci&#243;n jer&#225;rquica de los componentes que representan un objeto de informaci&#243;n (tambi&#233;n denominada "taxonom&#237;a"). Al respecto, un buen punto de partida puede ser la lecci&#243;n de Jonathan Blaney <ref target="/es/lecciones/introduccion-datos-abiertos-enlazados">Introducci&#243;n a los Datos abiertos enlazados</ref>.</p>
<p>Si estamos construyendo un sitio personal no es necesario (aunque ser&#237;a lo ideal) recurrir a un vocabulario controlado o una ontolog&#237;a; sin embargo, es casi imprescindible ser consistentes con la forma de insertar la informaci&#243;n. Por ejemplo, si incluimos en el elemento Autor el nombre "P&#233;rez, Pedro" debemos tener la cautela de que todos los nombres que ingresemos posteriormente cumplan con el formato "Apellido, Nombre". De la misma manera, la gesti&#243;n de los metadatos debe evitar la ambig&#252;edad, de tal manera que si el nombre no es de un autor sino, por ejemplo, un juez, pueda hacer la b&#250;squeda en ese campo y no en otro. Por otra parte, como la informaci&#243;n se almancena en formato de texto las fechas se ordenan alfab&#233;ticamente, por ello es indispensable seguir la recomendaci&#243;n de Dublin Core que se&#241;ala el formato a&#241;o, mes, d&#237;a (AAAA/MM/DD) para los elementos temporales. Igualmente, es importante ser riguroso al ingresar la informaci&#243;n para evitar que la fecha de un evento se confunda con la fecha de publicaci&#243;n de la fuente, por ejemplo.</p>
</div>
      <div type="1"><head>Plugins o complementos</head>
<p>Un plugin es un peque&#241;o programa que a&#241;ade una funci&#243;n espec&#237;fica a otro programa, por ejemplo, un <ref target="https://es.wikipedia.org/wiki/Sistema_de_gesti%C3%B3n_de_contenidos">CMS</ref> tipo Wordpress o Joomla puede incorporar una casilla de comentarios, pero un plugin puede hacer que esta casilla se conecte con las redes sociales y comentar desde su perfil de Facebook o Twitter. En esta lecci&#243;n s&#243;lo veremos c&#243;mo a&#241;adir plugins a nuestra instalaci&#243;n de Omeka<ref type="footnotemark" target="#note_omeka.net"/>, si desea profundizar en la manera de desarrollar un complemento lo m&#225;s recomendable es consultar la documentaci&#243;n <ref target="http://omeka.org/codex/Plugin_Writing_Best_Practices#Plugin_Directory_Structure">disponible en la p&#225;gina de Omeka</ref>.</p>
<p>Las dos fuentes principales de plugins para Omeka son el repositorio oficial de complementos <ref target="https://omeka.org/classic/plugins/">https://omeka.org/classic/plugins/</ref> y <ref target="https://github.com/topics/omeka-plugin">Github</ref>. Ambos listados son din&#225;micos, por lo que recomendamos visitar peri&#243;dicamente estos lugares para conocer novedades y actualizaciones.</p>
<p>Para instalar un plugin s&#243;lo es necesario descargar el complemento de nuestro inter&#233;s, descomprimirlo (se encuentran almacenados en archivos *.zip) y copiarlo en el interior de la carpeta <code rend="inline">plugins</code> <ref type="footnotemark" target="#note_Escher"/>. Despu&#233;s ingresamos al panel de control de Omeka y a la administraci&#243;n de plugins (<code rend="inline">/admin/plugins</code>) donde aparecer&#225; el nombre de cada plugin que hayamos copiado en la carpeta, de manera similar a la siguiente imagen:</p>
<figure><desc>Panel de administraci&#243;n de plugins</desc><graphic url="img_5.1-plugins.png"/></figure>
<p>Para instalar un complemento desde Github necesitamos tener instalado <ref target="https://git-scm.com/"><code rend="inline">Git</code></ref> en el ordenador <ref type="footnotemark" target="#note_github_lecc"/>.
Como ejemplo, instalaremos el plugin "Csv Import+" desarrollado por Daniel Berthereau, el cual es una mejora del complemento oficial <ref target="https://omeka.org/classic/plugins/CsvImport">CSV Import</ref>. Para ello, iremos al repositorio del plugin que est&#225; ubicado en <ref target="https://github.com/Daniel-KM/Omeka-plugin-CsvImportPlus">Github</ref> y copiamos el enlace para clonarlo. Despu&#233;s, desde la carpeta <code rend="inline">plugins</code> ejecutamos el comando clonar, <code rend="inline">git clone</code> y le indicamos la ruta de descarga:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_4" corresp="code_construir-repositorio-de-fuentes_4.txt" lang="language-terminal" rend="block"/></ab>
<p>Al terminar de clonar veremos una carpeta con el nombre <code rend="inline">Omeka-plugin-CsvImportPlus</code>. Para que funcione correctamente debemos cambiar el nombre a <code rend="inline">CsvImportPlus</code>, tras lo cual ser&#225; posible ver activado el bot&#243;n <code rend="inline">Instalar</code>.</p>
<p>Desde el panel de administraci&#243;n de plugins es posible:</p>
<list type="unordered">
<item><hi rend="bold">Instalar</hi>: Con este bot&#243;n se ejecuta el script que instala el plugin.</item>
<item><hi rend="bold">Desinstalar</hi>: Desinstala el plugin y borra la informaci&#243;n de configuraci&#243;n del mismo.</item>
<item><hi rend="bold">Desactivar</hi>: Todos los plugins quedan activos despu&#233;s de instalados, si por alguna raz&#243;n no van a ser usados en el momento pero no quiere desinstalarlos puede aplicar esta opci&#243;n y dejar el contenido de configuraci&#243;n y los archivos intactos.</item>
<item><hi rend="bold">Activar:</hi> Revierte la anterior acci&#243;n.</item>
<item><hi rend="bold">Configurar</hi>: Enlaza con la p&#225;gina de configuraci&#243;n del plugin. Algunos complementos necesitan cierta informaci&#243;n para poder funcionar, otros pueden ser personalizados para que su funcionamiento o presentaci&#243;n se adapte a los requerimientos de los usuarios.</item>
</list>
<h3>Soluci&#243;n de problemas</h3>
<p>Cuando se descarga un plugin directamente de Github puede aparecer la advertencia "No es un plugin v&#225;lido." En ese caso, aseg&#250;rese de que el nombre del directorio no contenga la palabra <code rend="inline">-master</code> o <code rend="inline">-plugin</code>. Tambi&#233;n puede comprobar que el nombre del directorio corresponda con el archivo del plugin que obligatoriamente tiene esta forma: <code rend="inline">NombreComplementoPlugin.php</code>. Si estas opciones no funcionan lo m&#225;s probable es que el plugin simplemente no corresponda a la versi&#243;n o a&#250;n se encuentre en desarrollo, en cuyo caso no podr&#225; instalarse.</p>
<p>Tambi&#233;n puede suceder que un plugin se instale y genere conflictos en la plataforma que generar&#225;n un mensaje de error o incluso impedir&#225;n que se cargue el sitio. En este caso solamente deber&#225; borrar los archivos del plugin y el sitio regresar&#225; a la normalidad.</p>
<h2>Seleccionar los plugins</h2>
<p>Para usar Omeka no es realmente necesario ning&#250;n complemento, sin embargo, el crecimiento del repositorio hace necesario incorporar "plugins" que permitan ampliar las capacidades de la plataforma. Una buena pr&#225;ctica consiste en instalar solamente aquellos plugins que realmente utilizaremos y desintalar aquellos que no necesitamos, con ello evitamos conflictos entre complementos y posibles problemas de seguridad por utilizar plugins obsoletos.</p>
<p>La selecci&#243;n de plugins depender&#225; en buena medida de los objetivos del repositorio, para nuestro caso se requerir&#225;n complementos que permitan:</p>
<list type="ordered">
<item>Mostrar los documentos y hacerlos legibles a los usuarios, ya sean im&#225;genes, archivos PDF u otros. Por ejemplo, <ref target="https://omeka.org/classic/plugins/PdfEmbed">PDF Embed</ref> y <ref target="https://github.com/Daniel-KM/Omeka-plugin-UniversalViewer">Universal Viewer</ref>.</item>
<item>Gestionar los metadatos de cada documento: procedencia, cobertura, fechas, nombres, etc. Por ejemplo <ref target="http://omeka.org/codex/Plugins/DublinCoreExtended_2.0">Dublin Core Extended</ref> y <ref target="https://omeka.org/classic/plugins/HideElements">Hide Elements</ref>.</item>
<item>Buscar informaci&#243;n: complementos que contribuyan a ampliar las capacidades de las b&#250;squedas de Omeka. Por ejemplo <ref target="https://omeka.org/classic/plugins/SearchByMetadata">Search by Metadata</ref> y <ref target="https://omeka.org/classic/plugins/PdfText">PDF Text</ref>.</item>
<item>Interrelacionar elementos y colecciones. Por ejemplo <ref target="https://omeka.org/classic/plugins/ItemRelations">Item Relations</ref>, <ref target="https://omeka.org/classic/plugins/CollectionTree">Collection Tree</ref> y <ref target="https://omeka.org/classic/plugins/Geolocation">Geolocation</ref>, <ref target="https://github.com/Daniel-KM/Omeka-plugin-Reference">Reference</ref>.</item>
<item>Permitir la transcripci&#243;n de documentos. <ref target="https://omeka.org/classic/plugins/Scripto">Scripto</ref> es la opci&#243;n m&#225;s recomendada, pero tambi&#233;n es posible apoyar el proceso de transcripci&#243;n con el plugin <ref target="https://omeka.org/classic/plugins/Contribution">Contribution</ref></item>
<item>Analizar la informaci&#243;n disponible. Por ejemplo <ref target="https://omeka.org/classic/plugins/Ngram">Ngram</ref> y <ref target="https://omeka.org/classic/plugins/TextAnalysis">Text Analysis</ref>.</item>
<item>Exportar e importar informaci&#243;n. Las opciones pueden ser <ref target="https://omeka.org/classic/plugins/Export">Export</ref>, <ref target="https://omeka.org/classic/plugins/CsvExport">CSV Export Format</ref>, <ref target="https://omeka.org/classic/plugins/OmekaApiImport">Omeka API Import</ref>, <ref target="https://omeka.org/classic/plugins/CsvImport">CSV Import</ref>, <ref target="https://omeka.org/classic/plugins/Import">Import</ref>, o <ref target="https://omeka.org/classic/plugins/ZoteroImport">Zotero Import</ref>.</item>
</list>
<p>Explicar el funcionamiento de cada plugin extender&#237;a demasiado este tutorial. La estrategia recomendable consiste en instalar los complementos en la medida que vaya surgiendo la necesidad de cada proyecto.</p>
</div>
      <div type="1"><head>Temas o plantillas</head>
<p>Hasta el momento nos hemos enfocado en la manera de tratar la informaci&#243;n desde el plano de la administraci&#243;n del contenido. Los temas o plantillas comprenden los archivos que permiten mostrar de una manera din&#225;mica la informaci&#243;n contenida en la base de datos e interpretada con PHP, de tal manera que si se realizan cambios en la interface del sitio no afectan los archivos del lado del servidor. Sin los temas, la informaci&#243;n ser&#237;a presentada en forma de HTML simple, por lo que &#233;stos son necesarios para permitir que la presentaci&#243;n del sitio sea agradable a qui&#233;nes la consultan, sea posible presentar de manera correcta los contenidos, y</p>
<p>Instalar un tema en Omeka es muy similar a la instalaci&#243;n de plugins. Los temas oficiales de Omeka est&#225;n disponibles en <ref target="https://omeka.org/classic/themes/">el sitio del proyecto</ref>. A diferencia de otras plataformas, Omeka tiene una oferta vbastante limitada; aunque puede ampliarse si se explora <ref target="https://github.com/topics/omeka-theme">GitHub</ref>. Familiarizarse con los temas puede representar una ventaja para personalizar el sitio y a&#241;adir algunas funciones que no vienen incluidas de manera predeterminada.</p>
<h2>Instalar un tema</h2>
<p>Descarga desde la colecci&#243;n de <ref target="https://omeka.org/classic/themes/">temas de Omeka</ref>, o clona desde GitHub, el tema que quieras instalar en el directorio <code rend="inline">/themes</code> de la instalaci&#243;n de Omeka. Despu&#233;s de descomprimir el archivo <code rend="inline">tema.zip</code> ve a la pesta&#241;a <code rend="inline">Apariencia</code> del panel de administraci&#243;n o a la direcci&#243;n <code rend="inline">/admin/themes/browse</code>, podr&#225;s ver que el tema ya est&#225; listo para ser seleccionado. S&#243;lo debes hacer clic en el bot&#243;n "Hacer uso de esta plantilla" y el sitio cambiar&#225; de imagen.</p>
<figure><desc>Directorio de temas</desc><graphic url="img_6.0-apariencia.png"/></figure>
<figure><desc>Panel de administraci&#243;n de temas</desc><graphic url="img_6.1-apariencia.png"/></figure>
<p>Posteriormente, dependiendo del tema escogido, podr&#225;s ir al panel de configuraci&#243;n del tema haciendo clic en el bot&#243;n configurar plantilla. All&#237; tendr&#225;s la opci&#243;n de personalizar ciertos aspectos del tema como el logotipo, la cabecera y "footer" del sitio, la configuraci&#243;n de la p&#225;gina de inicio y algunas opciones para mostrar los elementos. Otras plantillas m&#225;s complejas pueden brindar opciones para la presentaci&#243;n de im&#225;genes o para agregar c&#243;digos de seguimiento.</p>
<h2>Edici&#243;n de la plantilla</h2>
<p style="alert alert-warning">Realice una copia de cada archivo que vaya a modificar como forma de revertir r&#225;pidamente cualquier error que se presente tras la edici&#243;n.</p>
<p>En este ejercicio vamos a crear una opci&#243;n en la plantilla "Berlin" que nos permitir&#225; ordenar los elementos por su fecha de creaci&#243;n. De manera predeterminada, Omeka ordena los elementos por la fecha en que fueron agregados a la plataforma, de tal manera que muestra de las entradas m&#225;s recientes a las m&#225;s antiguas. Cuando trabajamos con documentos hist&#243;ricos, por lo general, nos interesa poder ordenar por la fecha del documento, ya sea en orden ascendente o descendente.</p>
<p>Lo primero que podemos hacer ser&#225; editar la navegaci&#243;n de los elementos para que se muestren por fecha en orden ascendente <ref type="footnotemark" target="#note_DefaultSort"/>. Para ello debemos ir al panel de administraci&#243;n, de all&#237; a la ventana "Apariencia" y escoger la pesta&#241;a "Navegaci&#243;n". Retiramos la selecci&#243;n del enlace "elementos" y vamos al final de la p&#225;gina. En el formulario que dice "Agregar un v&#237;nculo a la navegaci&#243;n" pondremos como "Etiqueta" el nombre "Elementos" y en la "URL" la ruta <code rend="inline">/nombre_del_repositorio/items/browse/?sort_field=Dublin+Core%2CDate&amp;sort_dir=a</code>. Hacemos clic en el bot&#243;n "A&#241;ade un enlace" y arrastramos el nuevo v&#237;nculo hasta el inicio de la p&#225;gina. Finalmente damos "Guardar" y debe aparecer el mensaje de confirmaci&#243;n "La configuraci&#243;n sobre la navegaci&#243;n ha sido actualizada."</p>
<figure><desc>Agregar v&#237;nculo personalizado</desc><graphic url="img_7.0-plantilla.png"/></figure>
<figure><desc>Personalizar men&#250; de navegaci&#243;n</desc><graphic url="img_7.1-plantilla.png"/></figure>
<p>De esta manera le estamos diciendo a Omeka cada vez que entremos a la p&#225;gina "Navegar por los elementos" (<code rend="inline">/items/browse</code>) que ordene los elementos por un campo (<code rend="inline">?sort_field</code>), que en este caso ser&#225; la categor&#237;a "Fecha" (<code rend="inline">CDate</code>) de Dublin Core (<code rend="inline">Dublin+Core</code>), y que este orden sea ascendente (<code rend="inline">&amp;sort_dir=a</code>).</p>
<p>Siguiendo esta l&#243;gica podemos hacer otro tipo de ordenaci&#243;n, por ejemplo, por descripci&#243;n (<code rend="inline">?sort_field=Dublin+Core%2CDescription</code>), e incluso por categor&#237;as que no est&#233;n en el Dublin Core sino como tipos de metadatos del elemento, como el texto (<code rend="inline">?sort_field=Item+Type+Metadata%2CText</code>).</p>
<p>Esta opci&#243;n, sin embargo, no evitar&#225; que en los resultados de b&#250;squeda o en las colecciones se ordenen los elementos por fecha de agregaci&#243;n. Por esta raz&#243;n una buena estrategia consiste en habilitar la opci&#243;n general para ordenar por fecha del documento.</p>
<p>Sin importar lo compleja que sea una plantilla de Omeka, la estructura b&#225;sica de la plantilla exige cumplir con una estructura b&#225;sica que incluye una carpeta para los archivos de navegaci&#243;n de los elementos llamada <code rend="inline">items</code>. Dentro de ella, dependiendo de la plantilla, habr&#225; una serie de archivos <code rend="inline">php</code> y uno de ellos se llama <code rend="inline">browse.php</code>, responsable por mostrar los &#237;tems en la p&#225;gina "Navegar por los elementos". Como ver&#225;s, la ruta se asemeja a la del sitio p&#250;blico que es <code rend="inline">/items/browse</code>.</p>
<p>Abrimos el archivo <code rend="inline">browse.php</code> en nuestro editor de c&#243;digo. Si no est&#225;s muy familiarizado con <code rend="inline">php</code> este c&#243;digo parecer&#225; escrito en Klingon. No importa que no sepas <code rend="inline">php</code> (o Klingon), s&#243;lo nos vamos a concentrar en estas pocas l&#237;neas de c&#243;digo que se encuentran al inicio del c&#243;digo (aprox. despu&#233;s de la l&#237;nea 18):</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_5" corresp="code_construir-repositorio-de-fuentes_5.txt" lang="language-php" rend="block"/></ab>
<p>Para saber d&#243;nde empieza y termina cada <emph>script</emph> de <code rend="inline">php</code> s&#243;lo tienes que fijarte en las etiquetas de apertura <code rend="inline">&lt;?php</code> y de cierre <code rend="inline">?&gt;</code>. Todo lo que est&#233; entre esos s&#237;mbolos constituye un <emph>script</emph> de <code rend="inline">php</code>. Las tres opciones que vemos en la esquina derecha del listado de &#237;tems p&#225;gina "Navegar por los elementos" son "impresas" por el <emph>script</emph> <code rend="inline">&lt;?php echo browse_sort_links($sortLinks); ?&gt;</code>, que b&#225;sicamente le dice a <code rend="inline">php</code> que muestre (<code rend="inline">echo</code>) un grupo o array seg&#250;n la funci&#243;n <code rend="inline">browse_sort_links</code> que se encuentra almacenado en la variable <code rend="inline">$sortLinks</code>.</p>
<p>Para modificar las opciones de ordenaci&#243;n debemos editar la variable <code rend="inline">$sortLinks</code>, que es la que guarda las opciones de ordenaci&#243;n. Para a&#241;adir nuestra opci&#243;n de ordenar por fecha del documento vamos a crear un enlace que se llame "Fecha del documento" y un valor de ordenaci&#243;n que corresponda a la categor&#237;a Fecha del esquema Dublin Core.</p>
<p>En una l&#237;nea nueva antes del cierre del primer <emph>script</emph> vamos a escribir el siguiente c&#243;digo: <code rend="inline">$sortLinks[__('Fecha del documento')] = 'Dublin Core,Date';</code></p>
<p>El c&#243;digo deber&#225; quedar como sigue:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_6" corresp="code_construir-repositorio-de-fuentes_6.txt" lang="language-php" rend="block"/></ab>
<p>Guarda el archivo y carga nuevamente la p&#225;gina de navegaci&#243;n. Si todo sali&#243; seg&#250;n el plan, deber&#225; aparecer el enlace con la opci&#243;n "Fecha del documento". Haz clic y prueba que la ordenaci&#243;n sea correcta. En caso de no obtener los resultados deseados revisa que los metadatos hayan sido escritos correctamente (comprueba que no hay espacios en blanco antes del texto y que el formato de las fechas sea coherente en todos los elementos).</p>
<figure><desc>Ordenar por fecha del documento</desc><graphic url="img_7.2-plantilla_fecha.png"/></figure>
<p>Tambi&#233;n podemos hacer que sea posible ver la fecha del documento en la navegaci&#243;n. Para ello, agregaremos unas cuantas l&#237;neas al loop que est&#225; a continuaci&#243;n de la secci&#243;n que acabamos de editar. La secci&#243;n de c&#243;digo que editaremos ser&#225; la siguiente:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_7" corresp="code_construir-repositorio-de-fuentes_7.txt" lang="language-php" rend="block"/></ab>
<p>Despu&#233;s del segundo <code rend="inline">&lt;?php endif; ?&gt;</code> ingresa el siguiente c&#243;digo:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_8" corresp="code_construir-repositorio-de-fuentes_8.txt" lang="language-php" rend="block"/></ab>
<p>Lo &#250;nico que hacemos consiste en decirle a la plantilla que si el elemento tiene informaci&#243;n sobre la fecha en el Dublin Core la inserte dentro de la divisi&#243;n que tiene la clase "item-description".</p>
<figure><desc>Visualizar la fecha del documento en la navegaci&#243;n</desc><graphic url="img_7.3-plantilla_fecha_vis.png"/></figure>
<h3>Edici&#243;n de la plantilla "default"</h3>
<p>Si tienes instalada la plantilla predeterminada no encontrar&#225;s el archivo <code rend="inline">items\browse</code> en el fichero del tema. Para realizar la edici&#243;n deber&#225;s buscar el archivo <code rend="inline">\application\views\scripts\items\browse.php</code>. Sigue los pasos indicados anteriormente y tendr&#225;s los mismos resultados.</p>
</div>
      <div type="1"><head>Editar el <code rend="inline">Core</code> de Omeka</head>
<p>En ocasiones ser&#225; necesario modificar un poco m&#225;s que la plantilla de Omeka para adaptarla a las necesidades de nuestro proyecto.</p>
<h2>Cambiar entre tipos de elemento y colecciones</h2>
<p>Los tipos de elementos sirven para describir objetos diferenciables, en tanto las colecciones sirven para agrupar elementos sin importar el objeto asociado. As&#237;, una colecci&#243;n denominada "administraci&#243;n de justicia" puede agrupar textos, expedientes judiciales, cartas, fotograf&#237;as, personas, etc. Si hubiese un tipo de elemento que quisiera agrupar todos los documentos relacionados con la administraci&#243;n de justicia tendr&#237;a que crear demasiados descriptores como para que fuese funcional.</p>
<p>Por ejemplo, al construir el repositorio de fuentes para mi investigaci&#243;n doctoral, agrup&#233; bajo la categor&#237;a "Reales c&#233;dulas y &#243;rdenes" a este tipo de documentos. El problema es que constru&#237; con ello una colecci&#243;n que agrupa una variopinta cantidad de decisiones que afectaban el comercio, la administraci&#243;n de justicia, la polic&#237;a, la fiscalidad, etc.</p>
<p>Corregir este problema no es sencillo ya que la plataforma no tiene una opci&#243;n que convierta colecciones en tipos de elemento o viceversa. La opci&#243;n m&#225;s simple para solventar este problema consiste en "actualizar" la tabla que relaciona los elementos con sus colecciones y tipos: <code rend="inline">omeka_items</code>.</p>
<p>Para ello solamente necesitamos los identificadores de la colecci&#243;n y del tipo de elemento. Supongamos que la colecci&#243;n "reales c&#233;dulas" est&#225; identificada con el n&#250;mero 2 (<code rend="inline">/admin/collections/show/2</code>) y el tipo de elemento "legislaci&#243;n" con el n&#250;mero 18 (<code rend="inline">/admin/item-types/show/18</code>). Vamos a asociar todos los elementos de la colecci&#243;n 2 al tipo de elemento 18.</p>
<p>Vamos a <emph>phpMyAdmin</emph> y desde la base de datos de Omeka entramos a la tabla <code rend="inline">omeka_items</code>. Al entrar, encontraremos una tabla con ocho columnas, para este ejercicio s&#243;lo nos interesan las tres primeras. <code rend="inline">id</code> es el identificador de cada elemento, <code rend="inline">item_type_id</code> corresponde al tipo de elemento y <code rend="inline">collection_id</code> a la colecci&#243;n a la que est&#225; asociada dicha entrada. En nuestro ejemplo, el elemento 1 est&#225; asociado con el tipo de elemento 1, que corresponde a "texto" y a la colecci&#243;n 2, "reales c&#233;dulas".</p>
<figure><desc>tabla omeka_items</desc><graphic url="img_8.1-omeka_items.png"/></figure>
<p>Ahora, vamos a la pesta&#241;a SQL y desde all&#237; ejecutamos lo siguiente:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_9" corresp="code_construir-repositorio-de-fuentes_9.txt" lang="language-sql" rend="block"/></ab>
<p>Lo que le estamos diciendo a la consola es que queremos actualizar la columna <code rend="inline">item_type_id</code> con el valor 18 en la tabla <code rend="inline">omeka_items</code> en las filas donde el valor de la colecci&#243;n sea igual a 2. Si todo sali&#243; correctamente se imprimir&#225; un mensaje indicando cu&#225;ntas filas fueron afectadas y la tabla se habr&#225; actualizado.</p>
<figure><desc>resultado edici&#243;n tabla</desc><graphic url="img_8.2-omeka_items.png"/></figure>
<p>Si entendemos la l&#243;gica de este <emph>script</emph> podemos hacer la operaci&#243;n inversa. Digamos que ahora queremos que los elementos agrupados en "legislaci&#243;n" sean incluidos en la colecci&#243;n 3, que hemos denominado "Nueva colecci&#243;n". Solamente tendremos que modificar el orden de las variables as&#237;:</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_10" corresp="code_construir-repositorio-de-fuentes_10.txt" lang="language-sql" rend="block"/></ab>
<p>La tabla habr&#225; sido modificada, de tal manera que el elemento 1 ahora estar&#225; asociado al tipo de elemento 18 y la colecci&#243;n 3.</p>
<figure><desc>resultado edici&#243;n tabla</desc><graphic url="img_8.3-omeka_items.png"/></figure>
<p>Ten cuidado al actualizar los registros de no olvidar la cl&#225;usula <code rend="inline">WHERE</code>. Si lo olvidas se actualizar&#225;n TODOS los registros de esa columna.</p>
<p>En ciertas plataformas diferentes a <emph>phpMyAdmin</emph> puede requerirse el a&#241;adir un punto y coma (;) al final del c&#243;digo. Si marca un error de sint&#225;xis es posible que se deba a eso.</p>
<h2>Editar el "DublinCore"</h2>
<p>Aunque no se recomienda modificar el esquema de metadatos Dublin Core y sea preferible personalizar los tipos de elementos y sus descriptores, es posible que por las necesidades espec&#237;ficas del proyecto se quiera agregar un descriptor al formulario inicial de cada elemento. Para mi caso personal, quise ingresar un campo denominado "cap&#237;tulo" al formulario principal porque al agrupar la informaci&#243;n por colecciones s&#243;lo me permit&#237;a asociar un elemento a una colecci&#243;n. De esta manera, pod&#237;a crear un campo donde un elemento pudiera estar asociado a dos o m&#225;s secciones de mi proyecto doctoral.</p>
<p>El procedimiento en s&#237; es bastante sencillo. En primer lugar, hay que entender c&#243;mo se relacionan los elementos y los est&#225;ndares de metadatos. Como se muestra en la imagen, en la tabla <code rend="inline">omeka_elements_sets</code> se define el est&#225;ndar de metadatos, en este caso DublinCore, en tanto <code rend="inline">omeka_elements</code> incluye cada uno de los elementos del est&#225;ndar, por ejemplo &#8220;t&#237;tulo&#8221;, &#8220;descripci&#243;n&#8221;, &#8220;autor&#8221;, &#8220;contribuidor&#8221;, etc&#233;tera. Modificar cualquiera de estos elementos crear&#225; de inmediato un error al momento de desplegar el formulario para crear un nuevo &#237;tem por lo que la mejor estrategia es crear un nuevo elemento en el est&#225;ndar de metadatos.</p>
<figure><desc>relaci&#243;n de los datos del Dublin Core</desc><graphic url="img_9.1-omeka_elements_Set.jpg"/></figure>
<p>Para ingresar un nuevo elemento vamos a recurrir nuevamente a SQL y <emph>phpMyAdmin</emph>, pero esta vez utilizaremos la condici&#243;n <code rend="inline">INSERT INTO</code>.</p>
<ab><code xml:id="code_construir-repositorio-de-fuentes_11" corresp="code_construir-repositorio-de-fuentes_11.txt" lang="language-sql" rend="block"/></ab>
<p>De este modo, ya estar&#225; disponible la opci&#243;n "cap&#237;tulo" en el formulario principal.</p>
<figure><desc>Nueva opci&#243;n en el formulario principal</desc><graphic url="img_9.2-omeka_opcion-cap.png"/></figure>
</div>
      <div type="1"><head>A modo de cierre</head>
<p>En esta lecci&#243;n nos enfocamos en los requisitos b&#225;sicos para construir un repositorio de fuentes primarias con Omeka desde una instalaci&#243;n local. Aprendiste a instalar y desinstalar componentes, identificar los archivos del programa, y entender un poco m&#225;s la base de datos. Tambi&#233;n habr&#225;s tenido una probadita de c&#243;mo editar los archivos escritos en PHP y modificar la base de datos con SQL. Adem&#225;s de buenas pr&#225;cticas para el ingreso de la informaci&#243;n para que sea consistente y f&#225;cilmente recuperable.
Ahora la labor queda en tus manos, ingresa informaci&#243;n y experimenta con la plataforma para que descubras las potencialidades y limitaciones de Omeka.</p>
</div>
      <div type="1"><head>Notas</head>
<p><note xml:id="note_version"> Esta lecci&#243;n se prob&#243; en la versi&#243;n 2.6.1. (02/05/2018). En caso de tener una instalaci&#243;n anterior a Omeka 2.x se recomienda actualizar seg&#250;n las instrucciones del <ref target="https://omeka.org/classic/docs/Installation/Upgrading/">manual de usuario</ref>.</note>
<note xml:id="note_xampp_instrucciones"> Un video que explica la instalaci&#243;n del software puede consultarse en <ref target="https://www.youtube.com/watch?v=h6DEDm7C37A">https://www.youtube.com/watch?v=h6DEDm7C37A</ref>.</note>
<note xml:id="note_advertencia_Ubuntu"> La ventana de gesti&#243;n de servidores (<emph>manage servers</emph>) en Linux muestra la opci&#243;n de activar el servidor <code rend="inline">ProFTPD</code>. Como Omeka se ejecuta con Apache no es necesario iniciarlo.</note>
<note xml:id="note_bitnami_ingreso"> En Bitnami de manera predeterminada el usuario de phpMyAdmin ser&#225; "root" y la contrase&#241;a ser&#225; la que fue solicitada en la instalaci&#243;n de la m&#225;quina virtual.</note>
<note xml:id="note_transifex"> Es recomendable que antes de iniciar una tarea de traducci&#243;n completa de la plataforma se consulte el sitio oficial del proyecto de traducci&#243;n de omeka en <ref target="https://www.transifex.com/omeka/omeka/">Transifex</ref>.</note>
<note xml:id="note_omeka.net"> Para el servicio de Omeka.net puede consultar la lecci&#243;n <ref target="/es/lecciones/poniendo-omeka-a-funcionar#instala-algunos-plugins">poniendo Omeka a funcionar</ref>.</note>
<note xml:id="note_github_lecc"> En caso de no estar familiarizado con el uso de Git o Github te recomendamos revisar la lecci&#243;n <ref target="/es/lecciones/introduccion-control-versiones-github-desktop">Introducci&#243;n al control de versiones con GitHub Desktop</ref> de Daniel van Strien.</note>
<note xml:id="note_Escher"> Hasta enero de 2018 era com&#250;n utilizar el "Escher" como complemento para instalar "plugins" con un s&#243;lo clic en Omeka Classic, sin embargo, las modificaciones en el registro y publicaci&#243;n de plugins (adem&#225;s de algunos problemas de la versi&#243;n 1.0.1)  <ref target="https://forum.omeka.org/t/escher-not-working/3044/14">lo eliminaron del listado oficial de Omeka</ref>. En el momento su mantenimiento corre a cargo de Daniel Berthereau (<ref target="https://github.com/Daniel-KM">Daniel-KM</ref> en GitHub) y se puede clonar desde <ref target="https://github.com/Daniel-KM/Omeka-plugin-Escher.git">https://github.com/Daniel-KM/Omeka-plugin-Escher.git</ref>.</note>
<note xml:id="note_DefaultSort"> Tambi&#233;n es posible modificar el orden predeterminado con el plugin <ref target="https://github.com/anuragji/DefaultSort">DefaultSort</ref>. Cualquier m&#233;todo que se use no afecta el ejercicio aqu&#237; presentado.</note></p>
</div>
    </body>
  </text>
</TEI>
