<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>An&#225;lise de Correspond&#234;ncia para Pesquisa Hist&#243;rica com R</title>
  <slug>analise-correspondencia-pesquisa-historica-R</slug>
  <original>correspondence-analysis-in-R</original>
  <layout>lesson</layout>
  <collection>lessons</collection>
  <date>2017-09-13</date>
  <translation_date>2023-05-23</translation_date>
  <authors>Ryan Deschamps</authors>
  <reviewers>Sandra van Ginhoven,Taylor Arnold</reviewers>
  <editors>Matthew Lincoln</editors>
  <translator>Diana Rodriguez</translator>
  <translation-editor>Jimmy Medeiros</translation-editor>
  <translation-reviewer>Yuri Pires,Andr&#233; Salvo</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/422</review-ticket>
  <difficulty>3</difficulty>
  <activity>analyzing</activity>
  <topics>data-manipulation,network-analysis,r,data-visualization</topics>
  <abstract>Esta li&#231;&#227;o explica como realizar e interpretar uma an&#225;lise de correspond&#234;ncia com R, que pode ser usada para identificar relacionamentos dentro de dados categ&#243;ricos.</abstract>
  <avatar_alt>Diagrama de um cubo com arestas legendadas</avatar_alt>
  <mathjax>True</mathjax>
  <doi>10.46430/phpt0042</doi>
</metadata>
  <text>
    <body><p>A an&#225;lise de correspond&#234;ncia (<emph>correspondence analysis</emph> ou CA) produz um gr&#225;fico bidimensional ou tridimensional baseado nas rela&#231;&#245;es entre duas ou mais categorias de dados. Essas categorias poderiam ser "membros e clubes", "palavras e livros" ou "pa&#237;ses e acordos comerciais". Por exemplo, um membro do clube pode ser equivalente a outro membro com base nos clubes compartilhados aos quais ele pertence. Os membros que frequentam os mesmos clubes provavelmente t&#234;m mais em comum do que aqueles que frequentam clubes diferentes. Da mesma forma, os clubes que compartilham membros provavelmente ter&#227;o mais em comum do que aqueles que compartilham membros diferentes.<ref type="footnotemark" target="#1"/></p>
<p>Discernir essas correspond&#234;ncias significativas pode ser muito dif&#237;cil de fazer quando h&#225; muitos elementos em cada uma de suas categorias (por exemplo, se tivermos centenas de membros espalhados por dezenas de clubes.) A CA mede as correspond&#234;ncias mais fortes em um <emph>dataset</emph> e as projeta em um espa&#231;o multidimensional, possibilitando sua visualiza&#231;&#227;o e interpreta&#231;&#227;o. Normalmente, as duas principais dimens&#245;es s&#227;o mostradas de uma s&#243; vez, embora seja poss&#237;vel mostrar tr&#234;s dimens&#245;es em um display 3D.</p>
<p>Uma vez que a CA visualiza as rela&#231;&#245;es entre elementos de seus dados como dist&#226;ncias em um gr&#225;fico, muitas vezes &#233; poss&#237;vel descobrir padr&#245;es amplos com base em que elementos de uma categoria aparecem pr&#243;ximos a elementos da outra. Assim, a CA pode ser um bom primeiro passo para filtrar os principais padr&#245;es de um grande <emph>dataset</emph>. &#201; uma ferramenta particularmente poderosa para entender informa&#231;&#245;es hist&#243;ricas dentro de cole&#231;&#245;es digitais.</p>
<p>Depois de ler este tutorial, deve ser poss&#237;vel:</p>
<ul>
<li>Saber o que &#233; a CA e para que &#233; usada.</li>
<li>Saber como executar a CA usando o pacote FactoMineR do R.</li>
<li>Descrever com exatid&#227;o os resultados de uma CA.</li>
</ul>
<div n="1"><head>Pr&#233;-requisitos</head>
<p>Este tutorial &#233; para historiadores e pesquisadores com habilidades interm&#233;dias em programa&#231;&#227;o. Pressup&#245;e que j&#225; se tem um conhecimento b&#225;sico de R e alguns conhecimentos b&#225;sicos de estat&#237;stica.</p>
<p>O tutorial <link target="/pt/licoes/nocoes-basicas-R-dados-tabulares">No&#231;&#245;es b&#225;sicas de R com dados tabulares</link> tem informa&#231;&#245;es sobre como organizar e configurar o R e o tutorial <link target="/pt/licoes/processamento-basico-texto-r">Processamento B&#225;sico de Texto em R</link> tamb&#233;m pode ser &#250;til como treinamento.</p>
<p>Como a CA &#233; uma esp&#233;cie de <emph>social network analysis</emph> (an&#225;lise de redes sociais), pode ser interessante olhar a li&#231;&#227;o <link target="/en/lessons/creating-network-diagrams-from-historical-sources">From Hermeneutics to Data to Networks: Data Extraction and Network Visualization of Historical Sources</link> (em ingl&#234;s), que tamb&#233;m tem algumas informa&#231;&#245;es &#250;teis sobre a estrutura&#231;&#227;o de dados para an&#225;lise de redes.</p>
</div><div n="1"><head>O que &#233; a An&#225;lise de Correspond&#234;ncia?</head>
<p>A an&#225;lise de correspond&#234;ncia (CA), tamb&#233;m chamada "escala multidimensional" ou "an&#225;lise bivariada de rede", permite observar a inter-rela&#231;&#227;o de dois grupos em um gr&#225;fico de dispers&#227;o com dois eixos (<emph>two-way graph plot</emph>). Por exemplo, foi utilizada pelo soci&#243;logo franc&#234;s Pierre Bourdieu para mostrar como categorias sociais como a ocupa&#231;&#227;o influenciam a opini&#227;o pol&#237;tica.<ref type="footnotemark" target="#2"/> &#201; especialmente poderosa como ferramenta para encontrar padr&#245;es em grandes <emph>datasets</emph>.</p>
<p>A CA funciona com qualquer tipo de dados categ&#243;ricos (<emph>datasets</emph> que foram agrupados em categorias). Vamos come&#231;ar com um exemplo simples. Se quisesse entender o papel dos acordos internacionais de livre com&#233;rcio na interconex&#227;o das na&#231;&#245;es do G8, seria poss&#237;vel criar uma tabela para os pa&#237;ses e as rela&#231;&#245;es de livre com&#233;rcio que eles mantinham em um determinado momento.</p>
<p>Uma pequena sele&#231;&#227;o de acordos comerciais (em azul) incluindo o Espa&#231;o Econ&#243;mico Europeu (<emph>European Economic Area</emph> ou EEA), o Acordo Comercial Canad&#225;-UE (<emph>Canada-EU Trade Agreement</emph> ou CETA), o Acordo de Livre Com&#233;rcio Norte-Americano (<emph>North American Free Trade Agreement</emph> ou NAFTA), a Parceria Trans-Pac&#237;fico (<emph>Trans Pacific Partnership</emph> ou TPP) e a Associa&#231;&#227;o das Na&#231;&#245;es do Sudeste Asi&#225;tico (<emph>Association of Southeast Asian Nations</emph> ou ASEAN) corresponde aos pa&#237;ses do G8. Os pa&#237;ses (de cor vermelha) agrupam-se geograficamente, com pa&#237;ses do Pac&#237;fico &#224; direita, pa&#237;ses europeus &#224; esquerda e pa&#237;ses da Am&#233;rica do Norte ao centro. O Canad&#225; e os Estados Unidos, como previsto, est&#227;o juntos. Alemanha, It&#225;lia, Fran&#231;a e Reino Unido pertencem todos aos mesmos dois acordos (CETA e EEA), portanto todos caem exatamente no mesmo ponto.</p>
<figure><desc>Figura 1. An&#225;lise de correspond&#234;ncia de pa&#237;ses selecionados do G8 e seus acordos comerciais</desc><graphic url="tr-pt-analise-correspondenciaR-1.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncia sobre acordos comerciais"/></figure>
<p>Por outro lado, enquanto a R&#250;ssia e os Estados Unidos est&#227;o um pouco pr&#243;ximos no eixo horizontal, est&#227;o em polos opostos no eixo vertical. A R&#250;ssia s&#243; compartilha um acordo de com&#233;rcio com um outro pa&#237;s (Jap&#227;o) e os Estados Unidos com dois (Jap&#227;o e Canad&#225;). Em um gr&#225;fico de CA, unidades com poucas correla&#231;&#245;es ficar&#227;o nos arreadores, enquanto aquelas unidades com maior quantidade de correla&#231;&#245;es ficar&#227;o mais pr&#243;ximo do centro do gr&#225;fico. A conex&#227;o relativa ou falta de conex&#227;o de um <emph>datapoint</emph> &#233; quantificada como <emph>inertia</emph> (in&#233;rcia) na CA. A falta relativa de conex&#227;o produz uma in&#233;rcia maior.</p>
<p>Um ponto mais substancial sobre a R&#250;ssia e os Estados Unidos &#233; que a R&#250;ssia &#233; um pa&#237;s do Pac&#237;fico que n&#227;o pertence &#224; TPP. Observando esta rela&#231;&#227;o, um historiador poder-se-ia perguntar se isto ocorre por causa de uma rela&#231;&#227;o comercial tensa entre a R&#250;ssia e os Estados Unidos em compara&#231;&#227;o com outros pa&#237;ses do G8, ou por atitudes gerais em rela&#231;&#227;o a acordos comerciais para estes pa&#237;ses.<ref type="footnotemark" target="#3"/></p>
<p>Com mais dados, a CA pode descobrir distin&#231;&#245;es mais subtis entre grupos dentro de uma categoria particular. Neste tutorial, analisaremos a vida pol&#237;tica canadense - especificamente, como representantes pol&#237;ticos s&#227;o organizados em comit&#233;s durante um ou outro governo. Semelhante aos acordos comerciais, esperar&#237;amos que os comit&#233;s que t&#234;m membros semelhantes estivessem mais pr&#243;ximos uns dos outros. Al&#233;m disso, os comit&#233;s que t&#234;m poucos representantes em comum se encontrar&#227;o nos cantos do gr&#225;fico.</p>
</div><div n="1"><head>Comit&#233;s Parlamentares Canadenses (CPCs)</head>
<p>No sistema parlamentar canadense, os cidad&#227;os elegem representantes chamados membros do Parlamento, ou deputados, para a C&#226;mara dos Comuns. Os parlamentares s&#227;o respons&#225;veis por votar e propor altera&#231;&#245;es &#224; legisla&#231;&#227;o no Canad&#225;. Os <link target="https://perma.cc/3PT6-77DB">Comit&#233;s Parlamentares (CPCs)</link> (em ingl&#234;s) consistem de parlamentares que informam &#224; C&#226;mara sobre detalhes importantes da pol&#237;tica em uma &#225;rea tem&#225;tica. Exemplos de tais comit&#233;s incluem os CPCs sobre Finan&#231;as, Justi&#231;a e Sa&#250;de.</p>
<p>Usaremos abrevia&#231;&#245;es para os comit&#233;s parlamentares, porque os nomes podem ficar longos, tornando-os dif&#237;ceis de ler em um gr&#225;fico. &#201; poss&#237;vel usar esta tabela como um guia de refer&#234;ncia para as abrevia&#231;&#245;es e seus respectivos nomes de comit&#233;s:</p>
<table>
<thead>
<tr>
<th align="left">Abbreviation (Abrevia&#231;&#227;o)</th>
<th align="center">Committee Name (Tradu&#231;&#227;o do Nome do Comit&#233;)</th>
</tr>
</thead>
<tbody>
<tr>
<td align="left">INAN</td>
<td align="center">Indigenous and Northern Affairs (Assuntos Ind&#237;genas e do Norte)</td>
</tr>
<tr>
<td align="left">HUMA</td>
<td align="center">Human Resources, Skills and Social Development and the Status of Persons with Disabilities (Recursos Humanos, Habilidades e Desenvolvimento Social e o Status das Pessoas com Defici&#234;ncia)</td>
</tr>
<tr>
<td align="left">FINA</td>
<td align="center">Finance (Finan&#231;as)</td>
</tr>
<tr>
<td align="left">FAAE</td>
<td align="center">Foreign Affairs and International Development (Rela&#231;&#245;es Exteriores e Desenvolvimento Internacional)</td>
</tr>
<tr>
<td align="left">ETHI</td>
<td align="center">Access to Information, Privacy and Ethics (Acesso &#224; Informa&#231;&#227;o, Privacidade e &#201;tica)</td>
</tr>
<tr>
<td align="left">ENVI</td>
<td align="center">Environment and Sustainable Development (Meio Ambiente e Desenvolvimento Sustent&#225;vel)</td>
</tr>
<tr>
<td align="left">CHPC</td>
<td align="center">Canadian Heritage  (Heran&#231;a Canadense)</td>
</tr>
<tr>
<td align="left">CIMM</td>
<td align="center">Citizenship and Immigration (Cidadania e Imigra&#231;&#227;o)</td>
</tr>
<tr>
<td align="left">ACVA</td>
<td align="center">Veterans Affairs (Assuntos de Veteranos)</td>
</tr>
<tr>
<td align="left">HESA</td>
<td align="center">Health (Sa&#250;de)</td>
</tr>
<tr>
<td align="left">TRAN</td>
<td align="center">Transport, Infrastructure and Communities (Transporte, Infraestrutura e Comunidades)</td>
</tr>
<tr>
<td align="left">FOPO</td>
<td align="center">Fisheries and Oceans (Pesca e Oceanos)</td>
</tr>
<tr>
<td align="left">RNNR</td>
<td align="center">Natural Resources (Recursos Naturais)</td>
</tr>
<tr>
<td align="left">FEWO</td>
<td align="center">Status of Women (Status das Mulheres)</td>
</tr>
<tr>
<td align="left">ESPE</td>
<td align="center">Pay Equity (Igualdade de Remunera&#231;&#227;o)</td>
</tr>
<tr>
<td align="left">IWFA</td>
<td align="center">Violence against Indigenous Women (Viol&#234;ncia Contra as Mulheres Ind&#237;genas)</td>
</tr>
<tr>
<td align="left">BILI</td>
<td align="center">Library of Parliament (Biblioteca do Parlamento)</td>
</tr>
<tr>
<td align="left">AGRI</td>
<td align="center">Agriculture and Agri-food (Agricultura e Agroalimenta&#231;&#227;o)</td>
</tr>
<tr>
<td align="left">JUST</td>
<td align="center">Justice and Human Rights (Justi&#231;a e Direitos Humanos)</td>
</tr>
</tbody></table><p>O autor da li&#231;&#227;o, o historiador Ryan Deschamps, suspeitava que os deputados estariam organizados de acordo com os t&#243;picos do comit&#233; de forma diferente de governo para governo. Por exemplo, os comit&#233;s formados durante o primeiro gabinete do governo conservador de Stephen Harper podem ser organizados de forma diferente do gabinete inicial do Liberal de Justin Trudeau. H&#225; uma s&#233;rie de raz&#245;es para esta suspeita. Primeiro, os CPCs s&#227;o formados por lideran&#231;as partid&#225;rias e as decis&#245;es dos comit&#233;s precisam de coordena&#231;&#227;o entre os membros da C&#226;mara. Em outras palavras, os partidos pol&#237;ticos usar&#227;o os CPCs como ferramentas para marcar pontos pol&#237;ticos, e os governos devem garantir que as pessoas certas sejam membros dos comit&#233;s certos para proteger suas agendas pol&#237;ticas. Em segundo lugar, os dois governos t&#234;m um enfoque pol&#237;tico diferente. O governo conservador de Harper se concentrou mais em quest&#245;es de desenvolvimento econ&#243;mico, enquanto os Liberais de Trudeau enfatizaram, em primeiro lugar a igualdade social. Em resumo, pode haver algumas decis&#245;es calculadas sobre quem entra em que comit&#233;, fornecendo evid&#234;ncias sobre as atitudes do governo em rela&#231;&#227;o ou contra certos t&#243;picos.</p>
</div><div n="1"><head>Preparando o R para a CA</head>
<p>Para fazer uma CA, precisaremos de um pacote de &#225;lgebra linear. Para os mais inclinados &#224; matem&#225;tica, h&#225; um ap&#234;ndice com alguns detalhes sobre como isto &#233; feito. Em R, h&#225; v&#225;rias op&#231;&#245;es para CA, mas usaremos o <link target="http://factominer.free.fr/">pacote FactoMineR</link> (em ingl&#234;s), focado na "an&#225;lise de dados explorat&#243;rios multivariados".<ref type="footnotemark" target="#4"/> A FactoMineR pode ser usada para conduzir todos os tipos de an&#225;lises multivariadas diferentes, incluindo <emph>clusters</emph> hier&#225;rquicos, an&#225;lise fatorial e assim por diante.</p>
<p>Mas, primeiro, aqui est&#225; como instalar e puxar os pacotes, depois coloc&#225;-los em um objeto R para que possam ser discutidos.</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_0" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_0.txt"></code></pre>
</div><div n="1"><head>Os dados</head>
<p>Se quiser ver os dados brutos, os dados para este tutorial podem ser encontrados no <link target="https://doi.org/10.5281/zenodo.889846">Zenodo</link> (em ingl&#234;s). Foram convenientemente inclu&#237;dos tamb&#233;m no formato tabular (nota: n&#227;o &#233; necess&#225;rio baixar estes ficheiros manualmente. Usaremos o R para baix&#225;-los diretamente):</p>
<ol>
<li><link target="/assets/correspondence-analysis-in-R/HarperCPC.csv">CPCs do Harper</link>  </li>
<li><link target="/assets/correspondence-analysis-in-R/TrudeauCPC.csv">CPCs do Trudeau's</link></li>
</ol>
<p>Uma amostra dos dados para a primeira sess&#227;o do governo de Stephen Harper. As filas representam comit&#233;s e as colunas s&#227;o membros espec&#237;ficos. Se um membro pertence a um comit&#233;, a c&#233;lula ter&#225; um 1; se n&#227;o, ter&#225; um 0.</p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_1" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_1.txt"></code></pre>
<p>Estruturado de outra forma (atrav&#233;s de uma tabela R) podemos mostrar que os comit&#233;s t&#234;m muitos deputados e alguns deputados s&#227;o membros de v&#225;rios comit&#233;s. Por exemplo, a deputada liberal Carolyn Bennett era membro do "INAN" (Assuntos Ind&#237;genas e do Norte) e do "IWFA" (Viol&#234;ncia contra Mulheres Ind&#237;genas) e o "HESA" (Comit&#233; Parlamentar de Sa&#250;de) inclu&#237;a tanto o D Wilks como o K Block. Em geral, os comit&#233;s t&#234;m entre nove e doze membros. Alguns parlamentares s&#227;o membros de apenas um comit&#233;, enquanto outros podem pertencer a v&#225;rios comit&#233;s.</p>
</div><div n="1"><head>An&#225;lise de Correspond&#234;ncia dos Comit&#233;s Parlamentares Canadenses 2006 e 2016</head>
<p>O nosso <emph>data frame</emph> <code type="inline">harper_df</code> consiste em nomes completos de comit&#233;s e nomes de deputados, mas alguns dos nomes dos comit&#233;s (por exemplo, "Recursos Humanos, Habilidades e Desenvolvimento Social" e o "Status das Pessoas com Defici&#234;ncia") s&#227;o muito longos para serem bem mostrados em um gr&#225;fico: vamos usar as abrevia&#231;&#245;es.</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_2" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_2.txt"></code></pre>
<p>O comando <code type="inline">table</code> (tabela) faz um <emph>dataset</emph> de dados cruzados de duas categorias no <emph>data frame</emph>. As colunas s&#227;o MPs individuais e as linhas s&#227;o comit&#233;s. Cada c&#233;lula cont&#233;m um 0 ou um 1 baseado na exist&#234;ncia ou n&#227;o de uma conex&#227;o. Se olh&#225;ssemos a presen&#231;a real em cada reuni&#227;o, poder&#237;amos tamb&#233;m incluir valores ponderados (por exemplo, 5 para um membro do parlamento que participa de uma reuni&#227;o de comit&#233; 5 vezes). Como regra geral, usar valores ponderados quando as quantidades importam (quando as pessoas investem dinheiro, por exemplo), e usar 0s e 1s quando n&#227;o importam.</p>
<p>Infelizmente, temos mais um problema. Muitos deputados s&#227;o membros de apenas 1 comit&#233;. Isso far&#225; com que esses deputados se sobreponham quando criarmos o gr&#225;fico, tornando-o menos leg&#237;vel. Vamos exigir que os parlamentares perten&#231;am a pelo menos 2 comit&#233;s antes de executarmos o comando CA da FactoMineR.</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_3" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_3.txt"></code></pre>
<p>O comando <code type="inline">colSums</code> soma os valores para cada coluna da tabela. <code type="inline">rowSums</code> poderia ser usado para somar as linhas se isso fosse necess&#225;rio (n&#227;o &#233; para n&#243;s, porque todos os comit&#233;s t&#234;m mais de um deputado).</p>
<p>O comando <code type="inline">CA</code> tra&#231;a os resultados para as duas dimens&#245;es superiores e armazena o resumo dos dados em uma vari&#225;vel chamada <code type="inline">CA_harper</code>. Na maioria das vezes, <code type="inline">CA</code> faz a maior parte do trabalho. Como discutido, mais detalhes sobre a matem&#225;tica por tr&#225;s da CA s&#227;o fornecidos no <link target="#Ap%C3%AAndice:AMatem%C3%A1ticaportr%C3%A1sdaAn%C3%A1lisedeCorrespond%C3%AAncia">ap&#234;ndice</link>.</p>
<p>Deve-se obter um gr&#225;fico que se parece com isto:</p>
<figure><desc>Figura 2. An&#225;lise de correspond&#234;ncia dos Comit&#233;s Parlamentares para a 1&#170; Sess&#227;o do Governo Harper</desc><graphic url="tr-pt-analise-correspondenciaR-2.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncias sobre comit&#233;s parlamentares"/></figure>
<p>Vamos tratar os dados do governo Trudeau exatamente da mesma maneira.</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_4" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_4.txt"></code></pre>
<figure><desc>Figura 3. An&#225;lise de correspond&#234;ncia dos Comit&#233;s Parlamentares para a 1&#170; Sess&#227;o do Governo de Justin Trudeau</desc><graphic url="tr-pt-analise-correspondenciaR-3.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncias sobre comit&#233;s parlamentares"/></figure>
<p>As nossas etiquetas de dados n&#227;o s&#227;o muito leg&#237;veis no momento. Mesmo com a mudan&#231;a para abrevia&#231;&#245;es, as etiquetas est&#227;o sobrepostas. O pacote <link target="https://cran.r-project.org/web/packages/factoextra/index.html">factoextra</link> (em ingl&#234;s) tem uma caracter&#237;stica de repelir que ajuda a mostrar as coisas mais claramente.<ref type="footnotemark" target="#5"/></p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_5" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_5.txt"></code></pre>
<figure><desc>Figura 4. An&#225;lise de correspond&#234;ncia dos Comit&#233;s Parlamentares para a 1&#170; Sess&#227;o do Governo Harper</desc><graphic url="tr-pt-analise-correspondenciaR-4.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncias sobre comit&#233;s parlamentares"/></figure>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_6" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_6.txt"></code></pre>
<figure><desc>Figura 5. An&#225;lise de correspond&#234;ncia dos Comit&#233;s Parlamentares para a 1&#170; Sess&#227;o do Governo de Justin Trudeau</desc><graphic url="tr-pt-analise-correspondenciaR-5.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncias sobre comit&#233;s parlamentares"/></figure>
<p>Em vez de se sobrepor, as etiquetas agora usam setas para mostrar sua localiza&#231;&#227;o onde for apropriado.</p>
</div><div n="1"><head>Interpretando a An&#225;lise de Correspond&#234;ncia (CA)</head>
<p>Os gr&#225;ficos de dados parecem mais bonitos, mas qu&#227;o bem podemos confiar na validade desses dados? A nossa primeira dica &#233; olhar para as dimens&#245;es. Nos dados Harper, apenas onze e dez por cento de valor explicativo aparecem no eixo horizontal e vertical respectivamente para um total de 21%!<ref type="footnotemark" target="#6"/> Isso n&#227;o soa promissor para a nossa an&#225;lise. Lembrando que o n&#250;mero total de dimens&#245;es &#233; igual ao n&#250;mero de filas ou colunas (o que for menor), isto pode ser preocupante. Quando tais valores baixos ocorrem, geralmente significa que os pontos de dados s&#227;o distribu&#237;dos de forma bastante uniforme, e que os MPs s&#227;o distribu&#237;dos de forma uniforme nos CPCs &#233; uma conven&#231;&#227;o bastante bem estabelecida do parlamento.</p>
<p>Outra maneira de olhar para os dados &#233; atrav&#233;s de valores de in&#233;rcia.<ref type="footnotemark" target="#7"/> Mais detalhes sobre in&#233;rcia podem ser encontrados no <link target="#Ap%C3%AAndice:AMatem%C3%A1ticaportr%C3%A1sdaAn%C3%A1lisedeCorrespond%C3%AAncia">ap&#234;ndice</link> mas, no gr&#225;fico, os pontos de dados distantes da origem t&#234;m maior in&#233;rcia. Pontos de in&#233;rcia elevados sugerem <emph>outliers</emph> (valores at&#237;picos) - atores ou eventos que t&#234;m menos conex&#245;es do que aqueles pr&#243;ximos ao centro. Os baixos valores de in&#233;rcia sugerem pontos de dados que t&#234;m mais em comum com o grupo como um todo. Como uma ferramenta de an&#225;lise, pode ser &#250;til para encontrar atores ou subgrupos renegados no <emph>dataset</emph>. Se todos os pontos tiverem alta in&#233;rcia, pode ser um indicador de alta diversidade ou fragmenta&#231;&#227;o para as redes. A baixa in&#233;rcia geral pode ser um indicador de maior coes&#227;o ou converg&#234;ncia geral. O que isso significa depender&#225; do <emph>dataset</emph>. Para os nossos gr&#225;ficos, nenhum projeto de <emph>datapoint</emph> vai muito al&#233;m de 2 passos da m&#233;dia. Mais uma vez, este &#233; um indicador de que as rela&#231;&#245;es est&#227;o relativamente distribu&#237;das de maneira uniforme.</p>
<p>Vamos analisar os dados mais de perto:</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_7" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_7.txt"></code></pre>
<p>Isto nos retorna</p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_8" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_8.txt"></code></pre>
<p>O cabe&#231;alho <code type="inline">Eigenvalues</code> do resumo apresenta m&#233;tricas sobre as dimens&#245;es rec&#233;m computadas, listando a percentagem de vari&#226;ncia contida em cada uma delas. Infelizmente, a percentagem de vari&#226;ncia encontrada nas duas dimens&#245;es superiores &#233; muito baixa. Mesmo se consegu&#237;ssemos visualizar 7 ou 8 dimens&#245;es dos dados, capturar&#237;amos apenas uma percentagem acumulada de cerca de 70%. O teste de independ&#234;ncia do <link target="https://perma.cc/8B82-YAX6">qui-quadrado</link> nos diz que n&#227;o podemos rejeitar a hip&#243;tese de que nossas duas categorias (CPCs e MPs) s&#227;o independentes. O valor p (ou <emph>p-value</emph>) &#233; 0,74, bem acima do 0,05 comumente usado como um recorte para rejeitar uma hip&#243;tese nula.<ref type="footnotemark" target="#8"/> Um valor p menor ocorreria, por exemplo, se todos ou a maioria dos deputados fossem membros de um ou dois comit&#233;s. A prop&#243;sito, o valor de p quadrado de chi da amostra de Trudeau &#233; menor em 0,54, mas ainda n&#227;o o suficiente para rejeitar a hip&#243;tese de categorias mutuamente independentes.</p>
<p>Como discutido, este resultado n&#227;o &#233; muito surpreendente. Esperamos que os deputados sejam distribu&#237;dos de forma relativamente uniforme entre os comit&#233;s. Se optarmos por ponderar as nossas medidas com base na participa&#231;&#227;o dos parlamentares em cada reuni&#227;o de comit&#233; ou em seu desejo de 1-100 de ser membro de cada comit&#233;, poderemos ver resultados diferentes (por exemplo, pode ser mais comum que os parlamentares participem regularmente nas reuni&#245;es financeiras em compara&#231;&#227;o com outras reuni&#245;es).</p>
<p>A CA falhou conosco? Bem, na verdade n&#227;o. Isto significa apenas que n&#227;o podemos simplesmente lan&#231;ar dados em um algoritmo e esperar responder a perguntas reais de hist&#243;ria. Mas n&#243;s n&#227;o somos apenas programadores, mas historiadores de programa&#231;&#227;o. Vamos colocar nossos bon&#233;s da hist&#243;ria e ver se podemos refinar as nossas pesquisas!</p>
</div><div n="1"><head>Trudeau ampliou a Agenda para a Igualdade das Mulheres no Parlamento?</head>
<p>Uma das primeiras medidas pol&#237;ticas que Justin Trudeau tomou foi garantir que o Canad&#225; tinha um gabinete com 50% de mulheres. &#201; discut&#237;vel que o objetivo deste an&#250;ncio era professar uma agenda de igualdade de g&#233;nero. Na sua primeira sess&#227;o, o governo de Trudeau tamb&#233;m criou um novo Comit&#233; Parlamentar sobre igualdade de remunera&#231;&#227;o para as mulheres. Al&#233;m disso, o governo de Trudeau apresentou uma mo&#231;&#227;o para que houvesse um inqu&#233;rito sobre Mulheres Ind&#237;genas Desaparecidas e Assassinadas, substituindo o mandato do comit&#233; parlamentar de Harper para a Viol&#234;ncia Contra as Mulheres Ind&#237;genas.</p>
<p>Se Trudeau tivesse a inten&#231;&#227;o de levar a igualdade das mulheres a s&#233;rio, poder&#237;amos esperar que mais membros do comit&#233; do Status da Mulher estivessem ligados a pastas maiores, como Justi&#231;a, Finan&#231;as, Sa&#250;de e Rela&#231;&#245;es Exteriores, em compara&#231;&#227;o com o governo de Harper. Como o regime de Harper n&#227;o tinha um CPC de sal&#225;rio igual, incluiremos o CPC para "Viol&#234;ncia contra Mulheres Ind&#237;genas".</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_9" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_9.txt"></code></pre>
<p>Isto produz o seguinte gr&#225;fico:</p>
<figure><desc>Figura 6. An&#225;lise de correspond&#234;ncia de Comit&#233;s Parlamentares selecionados para a 1&#170; Sess&#227;o do Governo de Stephen Harper</desc><graphic url="tr-pt-analise-correspondenciaR-6.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncias sobre comit&#233;s parlamentares"/></figure>
<p>O valor p do qui-quadrado para este resultado se move apenas ligeiramente em dire&#231;&#227;o a zero, para 0,71. Ainda n&#227;o podemos tirar nenhuma conclus&#227;o quantitativa sobre uma rela&#231;&#227;o clara entre CPCs e MPs. Para os nossos dados, este n&#227;o &#233; um resultado muito importante. Se pesquis&#225;ssemos os CPCs sobre qual CPC era o mais produtivo ou importante, talvez encontr&#225;ssemos valores p mais baixos. A in&#233;rcia no eixo horizontal praticamente dobrou, sugerindo que o FINA (Finance) &#233; um valor mais baixo no gr&#225;fico em compara&#231;&#227;o com os outros portf&#243;lios.</p>
<p>O significado de um CA depende de uma interpreta&#231;&#227;o qualitativa da trama. Por exemplo, observando os elementos do gr&#225;fico Harper podemos dizer que as preocupa&#231;&#245;es econ&#243;micas caem para a direita do eixo y e as preocupa&#231;&#245;es sociais caem para a esquerda. Portanto, uma das "raz&#245;es" para escolher os parlamentares para participar de comit&#233;s no governo Harper parece ser a distin&#231;&#227;o entre preocupa&#231;&#245;es sociais e econ&#243;micas.</p>
<p>Entretanto, quando fazemos a mesma an&#225;lise com o governo de Trudeau...</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_10" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_10.txt"></code></pre>
<p>Produzimos um gr&#225;fico incompleto e esta mensagem aparece:</p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_11" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_11.txt"></code></pre>
<p>Isto significa que o gr&#225;fico produzido n&#227;o nos mostra as colunas FAEE, INAN e JUST. Como o valor de cada uma delas &#233; 0, elas foram suprimidas da an&#225;lise. Olhando para a tabela <code type="inline">trudeau_table2</code>, vemos que:</p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_12" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_12.txt"></code></pre>
<p>N&#227;o h&#225; nenhuma associa&#231;&#227;o cruzada para FAEE, INAN ou JUST! Bem, isso &#233; um resultado em si mesmo. Podemos concluir, em geral, que as agendas dos dois governos s&#227;o bastante diferentes, e que houve uma abordagem diferente utilizada para organizar os parlamentares em comit&#233;s.</p>
<p>Para um historiador canadense, o resultado faz algum sentido, dado que a Viol&#234;ncia contra as Mulheres Ind&#237;genas (IWFA) tem muito mais probabilidade de estar ligada aos Assuntos Ind&#237;genas e do Norte (INAN), e &#224; Justi&#231;a e Direitos Humanos (JUST), do que &#224; Igualdade de Remunera&#231;&#227;o (ESPE). Afinal, a hist&#243;ria da Viol&#234;ncia contra as Mulheres Ind&#237;genas est&#225; ligada a uma s&#233;rie de casos criminais de alto n&#237;vel no Canad&#225;. Como discutido anteriormente, a an&#225;lise de CA requer uma quantidade de interpreta&#231;&#227;o para se tornar significativa.</p>
<p>Talvez possamos observar alguns comit&#233;s diferentes em seu lugar. Ao retirar &#8220;JUST&#8221;, &#8220;INAN&#8221; e &#8220;FAAE&#8221; (Rela&#231;&#245;es Exteriores) e substitu&#237;-los por &#8220;CIMM&#8221; (Imigra&#231;&#227;o), &#8220;ETHI&#8221; (&#201;tica e Acesso &#224; Informa&#231;&#227;o) e &#8220;HUMA&#8221; (Recursos Humanos), podemos obter uma imagem melhor da estrutura dos comit&#233;s parlamentares neste contexto.</p>
<pre><code class="language-R" xml:id="code_analise-correspondencia-pesquisa-historica-R_13" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_13.txt"></code></pre>
<figure><desc>Figura 7. An&#225;lise de correspond&#234;ncia de Comit&#233;s Parlamentares selecionados para a 1&#170; Sess&#227;o do Governo de Justin Trudeau</desc><graphic url="tr-pt-analise-correspondenciaR-7.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncias sobre comit&#233;s parlamentares"/></figure>
<p>Em geral, a in&#233;rcia no eixo horizontal &#233; menor que a do governo de Harper, mas a separa&#231;&#227;o tem "HUMA" (Recursos Humanos) e "ETHI" (&#201;tica) contra os outros portf&#243;lios &#224; direita. A delimita&#231;&#227;o entre quest&#245;es sociais e econ&#243;micas n&#227;o &#233; t&#227;o evidente como para Harper, sugerindo uma filosofia diferente para a sele&#231;&#227;o. Dito isto, tamb&#233;m h&#225; menos deputados compartilhando as posi&#231;&#245;es. Isto pode ser outro mist&#233;rio para uma maior explora&#231;&#227;o. No entanto, o processo CA nos fornece uma vis&#227;o s&#243;lida das rela&#231;&#245;es que ocorrem dentro dos comit&#233;s com um olhar r&#225;pido e com muito poucos comandos.</p>
</div><div n="1"><head>An&#225;lise</head>
<p>Como na maioria das pesquisas interpretativas, n&#227;o obtemos uma resposta direta &#224; nossa pergunta sobre o poder para as mulheres nos governos parlamentares. No caso Harper, vemos uma divis&#227;o no eixo horizontal entre quest&#245;es sociais como Sa&#250;de e Justi&#231;a e quest&#245;es econ&#243;micas como Finan&#231;as e Rela&#231;&#245;es Exteriores, respondendo por 35% da varia&#231;&#227;o. Pela visualiza&#231;&#227;o, podemos adivinhar que Finan&#231;as (FINA) e Rela&#231;&#245;es Exteriores (FAAE) t&#234;m um membro comum e que Rela&#231;&#245;es Exteriores (FAAE) tem um membro comum com Viol&#234;ncia contra Mulheres Ind&#237;genas (IWFA). Este resultado &#233;, possivelmente, uma preocupa&#231;&#227;o, pois as agendas mais divulgadas de Stephen Harper tendiam a se concentrar em preocupa&#231;&#245;es econ&#243;micas como o com&#233;rcio e a conten&#231;&#227;o fiscal. A separa&#231;&#227;o dos comit&#233;s implica que a filosofia de governan&#231;a de Harper separava as preocupa&#231;&#245;es econ&#243;micas das sociais e que os direitos das mulheres eram principalmente uma preocupa&#231;&#227;o social. A pr&#243;pria pasta Status da Mulher (FEWO) &#233; separada do resto das pastas, encontrando-se ligada &#224;s outras pastas somente atrav&#233;s de parlamentares comuns com os comit&#233;s Viol&#234;ncia contra Mulheres Ind&#237;genas (IWFA) e Assuntos Ind&#237;genas e do Norte (INAN).</p>
<p>O gr&#225;fico do governo de Trudeau n&#227;o mostra conex&#245;es cruzadas do Status da Mulher com a Justi&#231;a, Rela&#231;&#245;es Exteriores e Povos Ind&#237;genas, mas conex&#245;es mais fortes com Finan&#231;as, Cidadania, Recursos Humanos e &#201;tica. Os Direitos da Mulher est&#227;o ligados &#224;s Finan&#231;as e &#224; Imigra&#231;&#227;o atrav&#233;s da carteira de Igualdade de Remunera&#231;&#227;o.</p>
<p>&#201; discut&#237;vel que o regime do governo Harper alinhou os Direitos das Mulheres &#224;s pastas sociais como Justi&#231;a e Sa&#250;de, enquanto Trudeau elevou o perfil do Status da Mulher at&#233; certo ponto ao incluir o comit&#233; de Igualdade de Remunera&#231;&#227;o. A conex&#227;o entre os comit&#233;s focados nos Direitos da Mulher e fortes carteiras como Sa&#250;de, Finan&#231;as e Cidadania e Imigra&#231;&#227;o no governo Trudeau &#233; digna de uma an&#225;lise mais detalhada. Neste contexto, o Status da Mulher parece ter uma posi&#231;&#227;o mais central (mais pr&#243;xima da origem) do que o comit&#233; Status da Mulher no governo de Harper. Dito isto, o n&#250;mero de pontos de dados neste caso ainda &#233; bastante pequeno para se chegar a uma conclus&#227;o definitiva. Talvez outras fontes de evid&#234;ncia possam ser visualizadas de maneira semelhante para confirmar ou negar este ponto.</p>
<p>A agenda anteriormente mantida entre as mulheres e os povos ind&#237;genas foi deslocada no caso Trudeau. Como discutido anteriormente, o <link target="https://perma.cc/U38Y-4CY9">National Inquiry into Missing and Murdered Indigenous Women and Girls</link> (Inqu&#233;rito Nacional sobre Mulheres Ind&#237;genas Desaparecidas e Assassinadas) (em ingl&#234;s) deslocou o mandato para o comit&#233; Viol&#234;ncia contra as Mulheres Ind&#237;genas que existia durante o mandato de Harper. A hist&#243;ria desta transi&#231;&#227;o &#233; complexa, mas a press&#227;o pol&#237;tica foi aplicada ao governo Harper para criar o Inqu&#233;rito Nacional sobre Mulheres Ind&#237;genas Desaparecidas e Assassinadas ap&#243;s o julgamento de Robert Pickton e relatos de investiga&#231;&#245;es policiais insuficientes para mulheres ind&#237;genas desaparecidas. Harper recusou-se a conduzir um inqu&#233;rito citando que o CPC era a melhor abordagem.<ref type="footnotemark" target="#9"/> Trudeau fez uma promessa eleitoral de incluir o inqu&#233;rito, deslocando assim o comit&#233;. At&#233; certo ponto, Harper parece ter dado &#224; viol&#234;ncia contra as mulheres ind&#237;genas um papel bastante central no planejamento do Comit&#233; Parlamentar. Esta evid&#234;ncia &#233; um contraponto &#224;s cr&#237;ticas de que Harper n&#227;o levou a s&#233;rio a quest&#227;o das Mulheres Ind&#237;genas Desaparecidas e Assassinadas.</p>
<p>As diferen&#231;as entre as duas rela&#231;&#245;es levantam quest&#245;es importantes sobre o papel do Status da Mulher no discurso pol&#237;tico e suas interconex&#245;es entre identidade racial, finan&#231;as p&#250;blicas, sa&#250;de e justi&#231;a social, a serem exploradas talvez em um trabalho qualitativo mais detalhado. Tamb&#233;m levanta quest&#245;es importantes sobre o foco no g&#233;nero em geral (de acordo com a carteira do Status da Mulher) ou mais especificamente, uma vez que se aplica a um grupo marginalizado (Mulheres Ind&#237;genas Desaparecidas e Assassinadas). Um documento de pol&#237;tica relacionado aos benef&#237;cios de um Inqu&#233;rito versus discuss&#227;o do Comit&#233; Parlamentar parece razo&#225;vel ap&#243;s examinar esta evid&#234;ncia. Talvez haja um argumento de que a troca do "IWFA" por "ESPE" &#233; uma esp&#233;cie de teto de vidro, colocando artificialmente uma cota em quest&#245;es de mulheres enquanto as carteiras estabelecidas permanecem intocadas. Como uma ferramenta explorat&#243;ria, a CA nos ajuda a identificar tais temas a partir da observa&#231;&#227;o emp&#237;rica, em vez de confiar na teoria ou em preconceitos pessoais.</p>
</div><div n="1"><head>Conclus&#227;o</head>
<p>Agora que este tutorial est&#225; completo, &#233; poss&#237;vel ter alguma no&#231;&#227;o do que &#233; a CA e como pode ser usada para responder perguntas explorat&#243;rias sobre dados. Usamos o comando <code type="inline">CA</code> do FactoMineR para criar a an&#225;lise e tra&#231;ar os resultados em duas dimens&#245;es. Quando as etiquetas se cruzaram, aplicamos o comando <code type="inline">viz_ca_biplot</code> do pacote factoextra para exibir os dados em um formato mais leg&#237;vel.</p>
<p>Tamb&#233;m aprendemos como interpretar uma CA e como detectar potenciais armadilhas anal&#237;ticas, incluindo casos em que as rela&#231;&#245;es entre categorias s&#227;o distribu&#237;das de forma muito uniforme e t&#234;m baixo valor explicativo. Neste caso, refinamos a nossa pergunta e os dados de pesquisa para fornecer uma imagem mais significativa do que aconteceu.</p>
<p>Em geral, o benef&#237;cio desta an&#225;lise &#233; fornecer uma r&#225;pida vis&#227;o geral do <emph>dataset</emph> de duas categorias, como um guia para quest&#245;es hist&#243;ricas mais substantivas. O uso de membros e reuni&#245;es ou eventos em todas as &#225;reas da vida (neg&#243;cios, sem fins lucrativos, reuni&#245;es municipais, <emph>hashtags</emph> de twitter, etc.) &#233; uma abordagem comum para tal an&#225;lise. Os grupos sociais e as suas prefer&#234;ncias s&#227;o outro uso comum para a CA. Em cada caso, a visualiza&#231;&#227;o oferece um mapa com o qual se pode observar um retrato da vida social, cultural e pol&#237;tica.</p>
<p>Os pr&#243;ximos passos podem incluir a adi&#231;&#227;o de outras dimens&#245;es categ&#243;ricas &#224; nossa an&#225;lise, como a incorpora&#231;&#227;o do partido pol&#237;tico, idade ou sexo. Quando se faz CA com mais de duas categorias, &#233; chamada de <link target="https://www.youtube.com/watch?v=RDexHE5Iqrg">An&#225;lise de Correspond&#234;ncia M&#250;ltipla ou MCA</link> (em ingl&#234;s). Enquanto a matem&#225;tica para a MCA &#233; mais complicada, os resultados finais s&#227;o bastante semelhantes aos da CA.</p>
<p>Esperamos que, agora, estes m&#233;todos sejam aplicados aos seus pr&#243;prios dados, ajudando a descobrir perguntas e hip&#243;teses que enriquecem a sua pesquisa hist&#243;rica. Boa sorte!</p>
</div><div n="1"><head>Ap&#234;ndice: A Matem&#225;tica por tr&#225;s da An&#225;lise de Correspond&#234;ncia</head>
<p>Como a matem&#225;tica da CA ser&#225; interessante para alguns e n&#227;o para outros, optamos por discuti-la neste Ap&#234;ndice. A sec&#231;&#227;o tamb&#233;m cont&#233;m um pouco mais de detalhes sobre outros t&#243;picos, tais como in&#233;rcia (<emph>inertia</emph>), dimens&#245;es (<emph>dimensions</emph>) e decomposi&#231;&#227;o de valores singulares (<emph>singular value decomposition</emph> ou SVD).</p>
<p>A fim de facilitar a compreens&#227;o, come&#231;aremos com apenas alguns comit&#233;s. "FEWO" (Status das Mulheres ou <emph>Status of Women</emph>), "HESA" (Sa&#250;de ou <emph>Health</emph>), "INAN" (Assuntos Ind&#237;genas e do Norte ou <emph>Indigenous and Northern Affairs</emph>), "IWFA" (Viol&#234;ncia contra as Mulheres Ind&#237;genas ou <emph>Violence Against Indigenous Women</emph>) e "JUST" (Justi&#231;a ou <emph>Justice</emph>).</p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_14" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_14.txt"></code></pre>
<p>A CA &#233; feita em um <emph>dataset</emph> &#8220;normalizado&#8221; que &#233; criado pela divis&#227;o do valor de cada c&#233;lula pela raiz quadrada do produto da coluna e totais de linhas, ou c&#233;lula \(\frac{1}{\sqrt{column total \times row total}}\). Por exemplo, a c&#233;lula de "FEWO" e S Ambler &#233; \(\frac{1}{\sqrt{3 \times 3}}\) ou 0.333.<ref type="footnotemark" target="#10"/></p>
<p>A tabela &#8220;normalizada&#8221; se parece com isto:</p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_15" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_15.txt"></code></pre>
<p>O processo de normaliza&#231;&#227;o faz algo interessante. Aqueles que s&#227;o membros de m&#250;ltiplos comit&#233;s e/ou que pertencem a comit&#233;s com muitos membros tendem a ter notas de normaliza&#231;&#227;o mais baixas, sugerindo que s&#227;o mais centrais para a rede. Estes membros ser&#227;o colocados mais pr&#243;ximos do centro da matriz. Por exemplo, a c&#233;lula pertencente a S Ambler e "IWFA" tem a pontua&#231;&#227;o mais baixa de 0,192 porque S Ambler &#233; membro de tr&#234;s comit&#233;s e o comit&#233; "IWFA" tem nove membros no gr&#225;fico representado.</p>
<p>A pr&#243;xima etapa &#233; encontrar a decomposi&#231;&#227;o de valor singular destes dados normalizados. Isto envolve &#225;lgebra linear bastante complexa que n&#227;o ser&#225; abordada aqui, mas pode-se aprender mais com este tutorial de <emph><link target="https://perma.cc/CD5F-AL7W">Single Value Decomposition</link></emph> (Decomposi&#231;&#227;o de Valores Singulares) (em ingl&#234;s) ou com mais detalhes <link target="https://perma.cc/F7MJ-EGET">neste pdf sobre SVD</link> (em ingl&#234;s). Vou tentar resumir o que acontece em termos leigos.</p>
<ul>
<li>Duas novas matrizes s&#227;o criadas que mostram pontua&#231;&#245;es de &#8220;dimens&#227;o&#8221; para as linhas (comit&#233;s) e as colunas (MPs) baseadas em vetores pr&#243;prios.</li>
<li>O n&#250;mero de dimens&#245;es &#233; igual ao tamanho das colunas ou filas menos 1, que &#233; sempre menor. Neste caso, h&#225; cinco comit&#233;s em compara&#231;&#227;o com as MPs onze, portanto o n&#250;mero de dimens&#245;es &#233; 4.</li>
<li>Uma outra matriz mostra os valores singulares (valores pr&#243;prios ou <emph>eigenvalues</emph>), que podem ser usados para mostrar a influ&#234;ncia de cada dimens&#227;o na an&#225;lise.</li>
<li>Um dos v&#225;rios &#8220;tratamentos&#8221; &#233; aplicado aos dados para facilitar a plotagem. O mais comum &#233; a abordagem de &#8220;coordenadas padr&#227;o&#8221;, que compara cada pontua&#231;&#227;o normalizada de forma positiva ou negativa com a pontua&#231;&#227;o m&#233;dia.</li>
</ul>
<p>Ao usar coordenadas padr&#227;o, a nossa tabela de dados mostra o seguinte:</p>
<pre><code xml:id="code_analise-correspondencia-pesquisa-historica-R_16" type="block" corresp="code_analise-correspondencia-pesquisa-historica-R_16.txt"></code></pre>
<p>Cada pontua&#231;&#227;o para uma &#8220;dimens&#227;o&#8221; pode ser usada como uma coordenada nesse gr&#225;fico. Como n&#227;o podemos visualizar em quatro dimens&#245;es, as sa&#237;das CA normalmente se concentram nas primeiras duas ou tr&#234;s dimens&#245;es para produzir um gr&#225;fico (por exemplo, "HESA" ser&#225; plotado em <code type="inline">[1.245, 0.989]</code> ou <code type="inline">[1.245, 0.989, 0.438]</code> em um gr&#225;fico 3D).</p>
<figure><desc>Figura 8. An&#225;lise de correspond&#234;ncia de Comit&#233;s Parlamentares selecionados para a 1&#170; Sess&#227;o do Governo Stephen Harper, 2006</desc><graphic url="tr-pt-analise-correspondenciaR-8.png" alt="Imagem representando um gr&#225;fico de correspond&#234;ncias sobre comit&#233;s parlamentares"/></figure>
<p>As pontua&#231;&#245;es de in&#233;rcia s&#227;o uma forma de mostrar a varia&#231;&#227;o nos dados. Sa&#250;de e Justi&#231;a possuem a menor quantidade de membros com uma alta pontua&#231;&#227;o de in&#233;rcia, enquanto o comit&#233; mais popular - "IWFA" - tem uma pequena in&#233;rcia. Assim, a in&#233;rcia &#233; uma forma de quantificar a dist&#226;ncia dos pontos em rela&#231;&#227;o ao centro do gr&#225;fico.</p>
<p>Outra pontua&#231;&#227;o importante &#233; vis&#237;vel no gr&#225;fico de CA - a percentagem do valor explicativo para cada dimens&#227;o. Isto significa que o eixo horizontal explica 42,32% da varia&#231;&#227;o no gr&#225;fico, enquanto o eixo vertical explica quase 31%. O que estes eixos significam deve ser interpretado com base no gr&#225;fico. Por exemplo, podemos dizer que o lado esquerdo representa quest&#245;es relativas &#224; identidade social e os do lado direito s&#227;o mais reguladores. Uma an&#225;lise hist&#243;rica mais aprofundada das atas destes comit&#233;s poderia, por sua vez, oferecer uma maior compreens&#227;o sobre o significado da participa&#231;&#227;o destes membros na &#233;poca.</p>
</div><div n="1"><head>Notas</head>
<p><note id="1"> A CA tem uma hist&#243;ria ramificada de v&#225;rias disciplinas e, assim, a terminologia pode ser confusa. Para simplificar, as categorias se referem aos tipos de dados que est&#227;o sendo comparados (por exemplo, membros e clubes) enquanto cada item dentro dessas categorias (por exemplo, &#8220;The Tennis Club&#8221; ou &#8220;John McEnroe&#8221;) ser&#225; um elemento dentro dessa categoria. A localiza&#231;&#227;o quantitativa dos elementos (coordenadas x e y) s&#227;o <emph>datapoints</emph>.</note></p>
<p><note id="2"> Brigitte Le Roux and Henry Rouanet, <emph>Multiple Correspondence Analysis</emph> (Los Angeles: SAGE Publications, 2010): 3.</note></p>
<p><note id="3"> N&#227;o pretendemos sugerir que esta an&#225;lise seja de forma alguma conclusiva sobre os la&#231;os comerciais entre os EUA e a R&#250;ssia. A quest&#227;o &#233; que, como a R&#250;ssia n&#227;o faz parte da TPP neste acordo, ela se separa dos EUA. Por outro lado, se a ades&#227;o &#224; TPP pudesse ser comprovada como representando la&#231;os tensos entre os EUA e a R&#250;ssia, apareceria no gr&#225;fico de CA.</note></p>
<p><note id="4"> Sebastien Le, Julie Josse, Francois Husson (2008). FactoMineR: An R Package for Multivariate Analysis. Journal of Statistical Software, 25(1), 1-18. <link target="https://doi.org/10.18637/jss.v025.i01">10.18637/jss.v025.i01</link>.</note></p>
<p><note id="5"> Alboukadel Kassambara and Fabian Mundt (2017). factoextra: Extract and Visualize the Results of Multivariate Data Analyses. R package version 1.0.4. <link target="https://perma.cc/Z2RC-F4J7">https://CRAN.R-project.org/package=factoextra</link>.</note></p>
<p><note id="6"> O valor explicativo &#233; a dist&#226;ncia dos <emph>datapoints</emph> afastados do centro do gr&#225;fico. Cada dimens&#227;o &#233; respons&#225;vel por parte da dist&#226;ncia que os <emph>datapoints</emph> divergem do centro. </note></p>
<p><note id="7"> Em geral, a in&#233;rcia nas estat&#237;sticas refere-se &#224; varia&#231;&#227;o ou &#8220;dissemina&#231;&#227;o&#8221; de um <emph>dataset</emph>. Esta &#233; an&#225;loga ao desvio padr&#227;o nos dados de distribui&#231;&#227;o.</note></p>
<p><note id="8"> Ver Laura Kane (3 de abril de 2017), "Missing and murdered women's inquiry not reaching out to families, say advocates." <emph>CBC News Indigenous</emph>. <link target="https://perma.cc/UQ6J-8QVZ">http://www.cbc.ca/news/indigenous/mmiw-inquiry-not-reaching-out-to-families-says-advocates-1.4053694</link>.</note></p>
<p><note id="9"> Em estat&#237;stica, um valor p (<emph>p-value</emph>), abrevia&#231;&#227;o de valor de probabilidade, &#233; um indicador de qu&#227;o prov&#225;vel um resultado teria ocorrido em circunst&#226;ncias aleat&#243;rias. Um baixo valor de p sugere uma probabilidade baixa de que o resultado teria ocorrido ao acaso e, portanto, fornece algumas evid&#234;ncias de que uma hip&#243;tese nula (neste caso, que os MPs e CPCs s&#227;o categorias independentes) &#233; improv&#225;vel.</note></p>
<p><note id="10"> Katherine Faust (2005) "Using Correspondence Analysis for Joint Displays of Affiliation Network" in <emph>Models and Methods in Social Network Analysis</emph> eds. Peter J. Carrington, John Scott and Stanley Wasserman.</note></p>
</div></body>
  </text>
</TEI>
