<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Para entender p&#225;ginas web y HTML</title>
  <authors>William J. Turkel,Adam Crymble</authors>
  <date>2012-07-17</date>
  <translation_date>2017-03-15</translation_date>
  <editors>Miriam Posner</editors>
  <reviewers>Jim Clifford,Amanda Morton</reviewers>
  <translator>V&#237;ctor Gayol</translator>
  <translation-editor>Adam Crymble</translation-editor>
  <translation-reviewer>Jairo A. Melo,Maria Jos&#233; Afanador-Llach,Antonio Rojas Castro</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/39</review-ticket>
  <layout>lesson</layout>
  <next>trabajar-con-archivos-de-texto</next>
  <previous>introduccion-e-instalacion</previous>
  <original>viewing-html-files</original>
  <difficulty>2</difficulty>
  <activity>presenting</activity>
  <topics>python</topics>
  <abstract>Esta lecci&#243;n te introduce a las estructuras de HTML y de p&#225;ginas web.</abstract>
  <avatar_alt>Grabado de un hombre hablando a una mujer.</avatar_alt>
  <doi>10.46430/phes0030</doi>
  <sequence>2</sequence>
  <series_total>15</series_total>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="2"><head>&#8220;Hola Mundo&#8221; en HTML</head>
</div>
      <div type="2"><head>Visualizar archivos HTML</head>
<p>Cuando trabajas con recursos en l&#237;nea, la mayor parte del tiempo est&#225;s usando archivos que han sido etiquetados con HTML (Lenguaje de marcado de h&#237;pertexto): tu navegador de Internet sabe perfectamente c&#243;mo interpretar HTML, lenguaje f&#225;cil de manejar y comprender para los lectores humanos. La mayor&#237;a de los navegadores te permiten tambi&#233;n ver el <emph>c&#243;digo fuente</emph> HTML de cada p&#225;gina que visitas. Las dos im&#225;genes siguientes muestran una p&#225;gina web t&#237;pica (en este caso la de <emph>Old Bailey Online</emph>, con la que trabajaremos en las siguientes lecciones), y la fuente HTML utilizada para generar dicha p&#225;gina y que puedes ver, en Firefox, con el men&#250; <code type="inline">Herramientas -&gt; Desarrollador web -&gt; C&#243;digo fuente de esta p&#225;gina</code>.</p>
<p>Cuando est&#225;s trabajando en el navegador, generalmente no necesitas o no quieres ver el c&#243;digo fuente de esa p&#225;gina web. Pero si est&#225;s escribiendo una p&#225;gina para ti mismo puede ser muy &#250;til ver c&#243;mo otras personas logran un efecto particular en la p&#225;gina a trav&#233;s de ciertos etiquetados. Tambi&#233;n resulta importante conocer el c&#243;digo fuente HTML mientras escribes programas para manipular p&#225;ginas web o extraer autom&#225;ticamente informaci&#243;n de los sitios en la web como, por ejemplo, los repositorios de datos digitales.</p>
<figure><desc>Captura de pantalla de Old Bailey en l&#237;nea</desc><graphic url="obo.png"/></figure>
<figure><desc>Fuente HTML de la p&#225;gina web de Old Bailey en l&#237;nea</desc><graphic url="obo-page-source.png"/></figure>
<p>(Para aprender m&#225;s acerca de HTML, encontrar&#225;s muy &#250;til en este momento estudiar el <link target="http://www.w3schools.com/html/default.asp">tutorial de HTML ofrecido por W3Schools</link>. No es necesario por ahora tener un conocimiento detallado del HTML para continuar leyendo esta lecci&#243;n, pero todo el tiempo que inviertas en aprender HTML va a repercutir ampliamente en tu trabajo y formaci&#243;n como historiador o humanista digital).</p>
</div>
      <div type="2"><head>&#8220;Hola Mundo&#8221; en HTML</head>
<p>HTML es un lenguaje de <emph>etiquetado</emph>; en otras palabras, HTML es, simple y sencillamente, texto "marcado" con "etiquetas" que proveen al programa int&#233;rprete (generalmente un navegador web) con la informaci&#243;n necesaria para ejecutar comandos o representar cosas en la pantalla de la computadora. Imagina que est&#225;s editando la entrada de una ficha bibliogr&#225;fica en la que quieres indicar el t&#237;tulo de un libro mediante la aplicaci&#243;n de cursivas. En HTML usar&#225;s etiquetas <code type="inline">em</code> (&#8220;em&#8221; es sin&#243;nimo de &#8220;&#233;nfasis&#8221; -por "emphasis"). De tal manera que parte de tu archivo HTML puede verse de la siguiente manera:</p>
<pre><code class="language-xml" xml:id="code_ver-archivos-html_0" type="block" corresp="code_ver-archivos-html_0.txt"></code></pre>
<p>Los archivos m&#225;s simples de HTML consisten en etiquetas que indican el principio y el fin del conjunto del documento, y etiquetas que identifican un encabezado <code type="inline">head</code> y un cuerpo <code type="inline">body</code> en medio de dicho documento. La informaci&#243;n respectiva al archivo, como los formatos de tipograf&#237;a y otras caracter&#237;sticas, normalmente se incluyen en el encabezado <code type="inline">head</code>, mientras que la informaci&#243;n que aparecer&#225; en la pantalla del navegador normalmente se inserta en el cuerpo del archivo <code type="inline">body</code>.</p>
<pre><code class="language-xml" xml:id="code_ver-archivos-html_1" type="block" corresp="code_ver-archivos-html_1.txt"></code></pre>
<p>Intenta ahora crear algo de c&#243;digo HTML. Abre tu editor de texto y crea un nuevo archivo. Copia el c&#243;digo que est&#225; m&#225;s abajo en tu editor. La primera l&#237;nea le indica al navegador qu&#233; tipo de archivo es. La etiqueta <code type="inline">html</code>contiene la direcci&#243;n del texto establecida como <code type="inline">ltr</code> (izquierda a derecha) y el idioma o <code type="inline">lang</code> establecido como espa&#241;ol de Espa&#241;a. La etiqueta "<code type="inline">meta</code>" contiene informaci&#243;n muy importante para que el navegador despliegue correctamente las tildes y acentos en espa&#241;ol. La etiqueta <code type="inline">title</code> (t&#237;tulo) en el encabezado (<code type="inline">head</code>) del documento HTML contiene elementos que normalmente se muestran en la barra superior de la ventana del navegador cuando esa p&#225;gina est&#225; siendo vista, y en las pesta&#241;as de Firefox.</p>
<pre><code class="language-xml" xml:id="code_ver-archivos-html_2" type="block" corresp="code_ver-archivos-html_2.txt"></code></pre>
<p>Cambia las l&#237;neas:</p>
<pre><code class="language-xml" xml:id="code_ver-archivos-html_3" type="block" corresp="code_ver-archivos-html_3.txt"></code></pre>
<p>e</p>
<pre><code class="language-xml" xml:id="code_ver-archivos-html_4" type="block" corresp="code_ver-archivos-html_4.txt"></code></pre>
<p>por:</p>
<pre><code class="language-xml" xml:id="code_ver-archivos-html_5" type="block" corresp="code_ver-archivos-html_5.txt"></code></pre>
<p>Salva el archivo en tu carpeta <code type="inline">programming-historian</code> con el nombre <code type="inline">hola-mundo.html</code>. Ahora, ve al navegador de Firefox y selecciona <code type="inline">Archivo -&gt; Nueva pesta&#241;a</code>y luego <code type="inline">Archivo -&gt; Abrir archivo</code>. Selecciona <code type="inline">hola-mundo.html</code>. Dependiendo de tu editor de texto puedes tener la opci&#243;n <code type="inline">view page in browser</code> u <code type="inline">open in browser</code>. Una vez que has abierto el archivo tu mensaje deber&#225; aparecer en el navegador. Nota la diferencia entre abrir un archivo HTML con un navegador como Firefox (que lo interpreta) y abrir el mismo archivo con tu editor de texto (que no lo interpreta).</p>
<p>Sugerencia de lecturas para aprender HTML:</p>
<ul>
<li><link target="http://www.w3schools.com/html/default.asp">W3Schools HTML Tutorial</link></li>
<li><link target="http://www.w3schools.com/html/html5_intro.asp">W3Schools HTML5 Tutorial</link></li>
</ul>
</div>
    </body>
  </text>
</TEI>
