<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Comprendre les pages web et le HTML</title>
  <layout>lesson</layout>
  <slug>comprendre-les-pages-web</slug>
  <date>2012-07-17</date>
  <authors>William J. Turkel,Adam Crymble</authors>
  <reviewers>Jim Clifford,Amanda Morton</reviewers>
  <editors>Miriam Posner</editors>
  <translator>Sylvain Machefert</translator>
  <translation-editor>Sofia Papastamkou</translation-editor>
  <translation-reviewer>Fr&#233;d&#233;ric Clavert,Fran&#231;ois Dominic Laram&#233;e</translation-reviewer>
  <translation_date>2019-07-06</translation_date>
  <difficulty>2</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/228</review-ticket>
  <activity>presenting</activity>
  <topics>python</topics>
  <abstract>Cette le&#231;on propose une introduction au langage HTML et &#224; la structuration des pages web.</abstract>
  <original>viewing-html-files</original>
  <avatar_alt>Une femme entend un homme parler &#224; travers un cornet acoustique</avatar_alt>
  <doi>10.46430/phfr0002</doi>
</metadata>
  <text>
    <body>
      <div n="2"><head>"Hello World" en HTML</head>
</div>
      <div n="2"><head>Consulter des fichiers HTML</head>
<p>Lorsque vous travaillez avec des sources en ligne, vous utilisez
la plupart du temps des fichiers qui ont &#233;t&#233; encod&#233;s en HTML (Hyper Text Markup
Language). Votre navigateur web sait interpr&#233;ter ce code, et vous permet
de consulter le <emph>code source</emph> HTML pour n'importe quelle page que vous visitez.
Les deux images ci-dessous montrent une page web classique (du site <emph>Old Bailey Online</emph>)
et le code source utilis&#233; pour g&#233;n&#233;rer cette page. Vous pouvez voir ce code source
dans votre navigateur par le menu : <code type="inline">Outils -&gt; D&#233;veloppement -&gt; Code source de la page</code>
sous Firefox (ou par le raccourci <code type="inline">Ctrl + U</code>).</p>
<p>Lorsque vous naviguez sur le web, vous n'avez en g&#233;n&#233;ral pas besoin de consulter
le code source de la page. Cependant, si vous devez cr&#233;er une page, il peut &#234;tre
tr&#232;s utile de voir comment d'autres ont r&#233;alis&#233; un effet particulier. Il vous sera
aussi utile de consulter les sources des pages si vous devez manipuler leur contenu
ou en extraire automatiquement de l'information.</p>
<figure><desc>Capture d'&#233;cran du Old Bailey Online</desc><graphic url="obo.png"/></figure>
<figure><desc>Code HTML de Old Bailey Online</desc><graphic url="obo-page-source.png"/></figure>
<p>(&#192; ce point de la lecture, vous pourrez trouver int&#233;ressant de naviguer sur les
<link target="http://www.w3schools.com/html/default.asp">tutoriels W3 Schools HTML</link>. Une connaissance approfondie du HTML n'est pas n&#233;cessaire
pour poursuivre la lecture, mais tout temps pass&#233; &#224; apprendre le HTML sera forc&#233;ment
utile dans vos activit&#233;s d'humaniste num&#233;rique.)</p>
</div>
      <div n="2"><head>"Hello World" en HTML</head>
<p>HTML est ce que l'on appelle un langage de <emph>balisage</emph>. En d'autres termes,
le HTML est du texte qui a &#233;t&#233; "encod&#233;" avec des <emph>balises</emph> qui fournissent
des informations suppl&#233;mentaires &#224; l'interpr&#232;te (souvent le navigateur web).
Supposez que vous souhaitiez formatter une r&#233;f&#233;rence bibliographique et
souhaitez placer le titre en italique. En HTML on utilise le mot-cl&#233; <code type="inline">em</code>
("em" pour emphasis, accentuation). Une partie de votre code HTML pourrait
ressembler &#224; :</p>
<pre><code class="language-xml" xml:id="code_comprendre-les-pages-web_0" type="block" corresp="code_comprendre-les-pages-web_0.txt"></code></pre>
<p>Le plus simple des documents HTML est constitu&#233; de balises indiquant le d&#233;but
et la fin du fichier, et des balises qui identifient une 'en-t&#234;te' (head) et un 'corps' (body)
&#224; l'int&#233;rieur du document. Les informations sur le document se placent dans l'en-t&#234;te,
alors que l'information qui sera affich&#233;e &#224; l'&#233;cran se placera dans le corps.</p>
<pre><code class="language-xml" xml:id="code_comprendre-les-pages-web_1" type="block" corresp="code_comprendre-les-pages-web_1.txt"></code></pre>
<p>Pour cr&#233;er du code HTML : dans votre &#233;diteur de texte, cr&#233;ez un nouveau fichier et collez
le code ci-dessous. La premi&#232;re ligne indique au navigateur le type de fichier.
La balise <code type="inline">html</code> a pour attribut l'orientation du texte, d&#233;finie &#224; <code type="inline">ltr</code> (left to right,
gauche &#224; droite) et l'attribut <code type="inline">lang</code> (language, langue) d&#233;finie &#224; <emph>US English</emph>, anglais des &#201;tats-Unis.
La balise <code type="inline">title</code> dans l'en-t&#234;te contient les information qui sont souvent
affich&#233;es dans la barre du haut du navigateur, ou au niveau de l'onglet
sous Firefox.</p>
<pre><code class="language-xml" xml:id="code_comprendre-les-pages-web_2" type="block" corresp="code_comprendre-les-pages-web_2.txt"></code></pre>
<p>Remplacer :</p>
<pre><code class="language-xml" xml:id="code_comprendre-les-pages-web_3" type="block" corresp="code_comprendre-les-pages-web_3.txt"></code></pre>
<p>et</p>
<pre><code class="language-xml" xml:id="code_comprendre-les-pages-web_4" type="block" corresp="code_comprendre-les-pages-web_4.txt"></code></pre>
<p>par</p>
<pre><code class="language-xml" xml:id="code_comprendre-les-pages-web_5" type="block" corresp="code_comprendre-les-pages-web_5.txt"></code></pre>
<p>Enregistrez le fichier dans un dossier <code type="inline">programming-historian</code> sous le nom
<code type="inline">hello-world.html</code>. Dans Firefox, rendez-vous dans le menu
<code type="inline">Fichier &gt; Nouvel onglet</code> puis <code type="inline">Fichier &gt; Ouvrir un fichier</code>. Choisissez
le fichier <code type="inline">hello-world.html</code>. En fonction de l'&#233;diteur de texte utilis&#233;,
vous pourrez avoir dans les menus une option 'ouvrir dans le navigateur'.
Apr&#232;s avoir ouvert le fichier, votre message devrait appara&#238;tre dans le navigateur.
Vous noterez la diff&#233;rence d'affichage entre le navigateur (qui interpr&#232;te le code)
et l'&#233;diteur de texte qui ne l'interpr&#232;te pas.</p>
</div>
      <div n="2"><head>Suggestions de ressources pour l'apprentissage du HTML</head>
<ul>
<li>
<p><link target="http://www.w3schools.com/html/default.asp">tutoriels W3 Schools HTML</link></p>
</li>
<li>
<p><link target="http://www.w3schools.com/html/html5_intro.asp">tutoriels W3 Schools HTML5</link></p>
</li>
</ul>
</div>
    </body>
  </text>
</TEI>
