<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>No&#231;&#245;es b&#225;sicas de p&#225;ginas web e HTML</title>
  <layout>lesson</layout>
  <slug>nocoes-basicas-paginas-web-html</slug>
  <date>2012-07-17</date>
  <translation_date>2021-05-12</translation_date>
  <authors>William J. Turkel,Adam Crymble</authors>
  <reviewers>Jim Clifford,Amanda Morton</reviewers>
  <editors>Miriam Posner</editors>
  <translator>Aracele Torres</translator>
  <translation-editor>Danielle Sanches</translation-editor>
  <translation-reviewer>Bruno Martins,R&#244;mulo Predes</translation-reviewer>
  <difficulty>2</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/318</review-ticket>
  <activity>presenting</activity>
  <topics>python</topics>
  <abstract>Esta li&#231;&#227;o &#233; uma introdu&#231;&#227;o ao HTML e &#224;s p&#225;ginas da web que ele estrutura.</abstract>
  <next>trabalhando-ficheiros-texto-python</next>
  <previous>introducao-e-instalacao</previous>
  <original>viewing-html-files</original>
  <avatar_alt>Uma mulher ouvindo um homem atrav&#233;s de uma trombeta de ouvido</avatar_alt>
  <doi>10.46430/phpt0002</doi>
</metadata>
  <text>
    <body>
      <div n="1"><head>Visualizando arquivos HTML</head>
<p>Quando voc&#234; est&#225; trabalhando com fontes online, na maior parte do tempo utiliza
ficheiros contendo anota&#231;&#245;es em HTML (Hyper Text Markup Language). O seu navegador web j&#225;
sabe como interpretar HTML, apresentando a informa&#231;&#227;o de uma forma adequada para leitores humanos.
A maioria dos navegadores tamb&#233;m permite que voc&#234; veja o <emph>c&#243;digo-fonte</emph> HTML de qualquer p&#225;gina que voc&#234; visitar.
As duas imagens abaixo mostram uma p&#225;gina web t&#237;pica (do <emph>Old Bailey Online</emph>) e o c&#243;digo
HTML usado para gerar essa p&#225;gina, que voc&#234; pode ver com a op&#231;&#227;o do menu do Firefox
<code type="inline">Abrir menu -&gt; Desenvolvimento web -&gt; C&#243;digo-fonte da p&#225;gina</code>.</p>
<p>Quando voc&#234; est&#225; trabalhando no navegador, normalmente n&#227;o precisa (ou quer) ver o c&#243;digo-fonte HTML de uma p&#225;gina da web.
No entanto, se voc&#234; est&#225; criando uma p&#225;gina pr&#243;pria, pode ser muito &#250;til ver como outras pessoas realizaram um
determinado efeito. Voc&#234; tamb&#233;m vai querer estudar o c&#243;digo HTML enquanto escreve
programas para manipular p&#225;ginas da web ou extrair informa&#231;&#227;o automaticamente delas.</p>
<figure><desc>Captura de tela do Old Bailey Online</desc><graphic url="obo.png"/></figure>
<figure><desc>C&#243;digo HTML da p&#225;gina Old Bailey Online</desc><graphic url="obo-page-source.png"/></figure>
<p>(Para aprender mais sobre HTML, voc&#234; pode achar &#250;til nesse momento usar o <link target="http://www.w3schools.com/html/default.asp">W3 Schools HTML Tutorial</link>. Um conhecimento detalhado de HTML n&#227;o &#233; necess&#225;rio para continuar lendo, mas qualquer tempo que voc&#234; passe aprendendo HTML ser&#225; amplamente recompensado no seu trabalho como historiador digital ou humanista digital.)</p>
</div>
      <div n="1"><head>"Ol&#225; mundo" em HTML</head>
<p>A HTML &#233; conhecida como uma linguagem de <emph>marca&#231;&#227;o</emph>. Em outras palavras, HTML &#233; o texto que foi "marcado" (i.e., anotado), com <emph>tags</emph> que fornecem informa&#231;&#245;es para o interpretador (que geralmente &#233; um navegador web). Suponha que est&#225; formatando uma entrada bibliogr&#225;fica e quer indicar o t&#237;tulo de um trabalho, colocando-o em it&#225;lico. Em HTML, pode utilizar tags <code type="inline">em</code> ("em" significa &#234;nfase) para este efeito. Portanto, parte do seu ficheiro HTML pode ter a seguinte apar&#234;ncia:</p>
<pre><code class="language-xml" xml:id="code_nocoes-basicas-paginas-web-html_0" type="block" corresp="code_nocoes-basicas-paginas-web-html_0.txt"></code></pre>
<p>O ficheiro HTML mais simples consiste em <emph>tags</emph> que indicam o in&#237;cio e o fim de todo o documento, e <emph>tags</emph> que identificam um <code type="inline">head</code> e um <code type="inline">body</code> dentro desse documento. A informa&#231;&#227;o descritiva (i.e., os "meta-dados") sobre o ficheiro geralmente vai para o cabe&#231;alho, enquanto que a informa&#231;&#227;o que ser&#225; exibida ao leitor humano geralmente vai para o corpo. </p>
<pre><code class="language-xml" xml:id="code_nocoes-basicas-paginas-web-html_1" type="block" corresp="code_nocoes-basicas-paginas-web-html_1.txt"></code></pre>
<p>Voc&#234; pode tentar criar algum c&#243;digo HTML. Com o seu editor de texto, crie um novo ficheiro. Copie o c&#243;digo abaixo no editor. A primeira linha diz ao navegador qual o tipo do ficheiro. A <emph>tag</emph> <code type="inline">html</code> tem a dire&#231;&#227;o do texto definida como <code type="inline">ltr</code> (da esquerda para a direita), e ainda a propriedade <code type="inline">lang</code> (idioma) definida como portugu&#234;s. A <emph>tag</emph> <code type="inline">title</code> no cabe&#231;alho do documento HTML cont&#233;m informa&#231;&#227;o que geralmente &#233; exibida na barra superior de uma janela quando a p&#225;gina est&#225; sendo visualizada, e nas abas do Firefox.</p>
<pre><code class="language-xml" xml:id="code_nocoes-basicas-paginas-web-html_2" type="block" corresp="code_nocoes-basicas-paginas-web-html_2.txt"></code></pre>
<p>Altere</p>
<pre><code class="language-xml" xml:id="code_nocoes-basicas-paginas-web-html_3" type="block" corresp="code_nocoes-basicas-paginas-web-html_3.txt"></code></pre>
<p>e</p>
<pre><code class="language-xml" xml:id="code_nocoes-basicas-paginas-web-html_4" type="block" corresp="code_nocoes-basicas-paginas-web-html_4.txt"></code></pre>
<p>para</p>
<pre><code class="language-xml" xml:id="code_nocoes-basicas-paginas-web-html_5" type="block" corresp="code_nocoes-basicas-paginas-web-html_5.txt"></code></pre>
<p>Guarde o ficheiro num diret&#243;rio <code type="inline">programming-historian</code> como <code type="inline">ola-mundo.html</code>. De seguida, v&#225; para o Firefox e escolha <code type="inline">Abrir menu -&gt; Abrir ficheiro...</code> e
ent&#227;o escolha <code type="inline">ola-mundo.html</code>. Dependendo do seu editor de texto, voc&#234; pode ter a op&#231;&#227;o 'visualizar p&#225;gina no navegador' ou 'abrir no navegador'. Depois de abrir o ficheiro, a sua mensagem deve aparecer no navegador. Observe a diferen&#231;a entre abrir um ficheiro HTML com um navegador como o Firefox (que o interpreta), ou abrir o mesmo ficheiro com seu editor de texto (que n&#227;o faz o mesmo).</p>
</div>
      <div n="1"><head>Leituras sugeridas para aprender HTML</head>
<ul>
<li><link target="http://www.w3schools.com/html/default.asp">W3 Schools HTML Tutorial</link></li>
<li><link target="http://www.w3schools.com/html/html5_intro.asp">W3 Schools HTML5 Tutorial</link></li>
</ul>
</div>
    </body>
  </text>
</TEI>
