<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="analisis-redes-sociales-teatro-2">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>An&#225;lisis de redes sociales de personajes teatrales (parte 2)</title>
  <author type="original_author">David Merino Recalde</author><editor type="reviewers"><persName>Sara Arribas Colmenar</persName><persName>Andr&#233;s Lombana</persName></editor><editor type="editors">Jennifer Isasi</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0065</idno><date type="published">11/30/2023</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. This lesson is original. Available translations are the following:<ref type="translations" target=""/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>En esta lecci&#243;n aprender&#225;s a realizar un An&#225;lisis de Redes Sociales con los personajes de un texto teatral. Aprender&#225;s sobre la importaci&#243;n de datos a Gephi, la creaci&#243;n de visualizaciones, la implementaci&#243;n de medidas y algoritmos, y el an&#225;lisis e interpretaci&#243;n de los resultados.</p></abstract><textClass><keyword xml:lang="en">network-analysis</keyword><keyword xml:lang="en">distant-reading</keyword><keyword xml:lang="en">data-visualization</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Introducci&#243;n a la segunda parte</head>
<p>Esta es la segunda parte de la lecci&#243;n <emph>An&#225;lisis de redes sociales de personajes teatrales</emph>. En la <link target="/es/lecciones/analisis-redes-sociales-teatro-1">primera parte</link> conocimos algunas de las aplicaciones del an&#225;lisis de redes sociales (ARS) a los estudios literarios y aprendimos los conceptos y nociones necesarias para enfrentarnos a esta metodolog&#237;a computacional-cuantitativa. Adem&#225;s, establecimos que para llevar a cabo un an&#225;lisis de redes sociales de personajes teatrales debemos seguir una serie de pasos consecutivos: </p>
<ul>
<li>Paso 1. Creaci&#243;n del corpus de an&#225;lisis</li>
<li>
Paso 2. Conseguir los datos<ul>
<li>Toma de decisiones para la extracci&#243;n de datos</li>
<li>Extracci&#243;n y estructuraci&#243;n de datos</li>
<li>El proceso de vaciado    </li>
</ul>
</li>
<li>Paso 4. Visualizaci&#243;n y an&#225;lisis de grafos con Gephi</li>
<li>Paso 5. Interpretaci&#243;n de los resultados  </li>
</ul>
<p>Ya hemos visto los pasos 1 y 2, y en esta segunda parte trataremos los dos &#250;ltimos pasos. Si has seguido la primera parte de la lecci&#243;n cuentas con todos los archivos necesarios para continuar. Si has saltado directamente a la segunda parte porque lo que te interesa es aprender visualizaci&#243;n y an&#225;lisis de grafos con <link target="https://gephi.org/">Gephi</link>, debes descargar ahora los archivos que utilizaremos aqu&#237;. En cualquier caso, recomendamos leer la primera parte, pues es importante comprender el proceso de extracci&#243;n y recogida de datos para poder analizar correctamente los resultados del an&#225;lisis. &#161;Vamos a ello! </p>
</div>
      <div type="2"><head>Paso 3. Visualizaci&#243;n y an&#225;lisis de grafos con Gephi</head>
<p>Tenemos tres archivos CSV: por un lado, una <link target="/assets/analisis-redes-sociales-teatro-1/nodos_bizarrias.csv">lista de nodos</link> (<code type="inline">nodos_bizarrias.csv</code>); por el otro, la <link target="/assets/analisis-redes-sociales-teatro-1/aristas-coaparicion_bizarrias.csv">lista de aristas</link> de un grafo no dirigido (<code type="inline">aristas-coaparicion_bizarrias.csv</code>) y la <link target="/assets/analisis-redes-sociales-teatro-1/aristas-interaccion_bizarrias.csv">matriz de adyacencia</link> de uno dirigido (<code type="inline">aristas-interaccion_bizarrias.csv</code>), seg&#250;n el criterio de la coaparici&#243;n de personajes en escena y el de interacciones ling&#252;&#237;sticas directas entre personajes, respectivamente. El siguiente paso es generar visualizaciones, los grafos propiamente dichos, y analizarlos aplicando lo que se conoce como 'medidas' o 'm&#233;tricas' de ARS.</p>
<div type="3"><head>Instalaci&#243;n de Gephi y primeros pasos</head>
<p>El programa que vamos a utilizar para llevar a cabo todo esto se llama <link target="https://gephi.org/">Gephi</link>, pero existen muchos otros para los que tambi&#233;n te servir&#225;n los archivos CSV que hemos preparado<ref type="footnotemark" target="#1"/>. Gephi es un software libre de c&#243;digo abierto especializado en an&#225;lisis de redes, muy conocido y utilizado en Humanidades Digitales, bastante intuitivo, y que es sostenido y actualizado por sus desarrolladores<ref type="footnotemark" target="#2"/>. Adem&#225;s, disponemos de numerosos <link target="https://gephi.org/plugins/#/">plugins</link> (complementos de software que a&#241;aden funcionalidades al programa), <link target="https://perma.cc/4RFA-TZB9">gu&#237;as de uso</link>, videotutoriales en espa&#241;ol<ref type="footnotemark" target="#3"/> y una comunidad activa en Twitter/X y Github a la que consultar nuestras dudas.</p>
<p>Lo primero que debemos hacer es instalar el programa. En su sitio web, <link target="https://gephi.org/">https://gephi.org/</link>, haz clic en <emph>Download FREE</emph>. Est&#225; disponible para Windows, Mac OS y Linux. Es posible que la web reconozca tu sistema operativo y te ofrezca lo que necesitas, si no, selecciona en el apartado <hi rend="bold">All Downloads</hi> de tu sistema operativo. Si necesitas ayuda con la instalaci&#243;n, puedes visitar <link target="https://perma.cc/YF6E-994N">https://gephi.org/users/install/</link> (est&#225; solo disponible en ingl&#233;s, pero puedes consultar los primeros minutos de este <link target="https://www.youtube.com/watch?v=sX5XYec4tWo">videotutorial en espa&#241;ol</link>).</p>
<p>Una vez que finalices la instalaci&#243;n, ejecuta Gephi. Se abrir&#225; una ventana de bienvenida con distintas opciones: crear un nuevo proyento, abrir un archivo de grafo ya existente, una columna con proyectos y archivos recientes (si los hubiese) y varios proyectos de ejemplo. Haz clic en <emph>Nuevo proyecto</emph>:</p>
<figure><desc> Figura 1. Ventana de bienvenida de Gephi</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-01.png" alt="Captura de pantalla de la ventana de bienvenida al programa Gephi, con las opciones de crear un nuevo proyecto, abrir recientes o proyectos de ejemplo"/></figure>
<p>Ahora est&#225;s en la pantalla principal del programa. Gephi funciona mediante proyectos (f&#237;jate que te indicar&#225; en la barra superior que est&#225;s en el <hi rend="bold">Proyecto 1</hi>), y dentro de cada proyecto puedes crear distintos espacios de trabajo. Ahora est&#225;s en el <hi rend="bold">Espacio de trabajo 1</hi>. Cada espacio de trabajo funciona como la pesta&#241;a de un navegador web y contiene a su vez los tres apartados de Gephi: <hi rend="bold">Vista general</hi>, <hi rend="bold">Laboratorio de datos</hi> y <hi rend="bold">Previsualizaci&#243;n</hi>. </p>
<figure><desc>Figura 2. Pantalla principal de Gephi, la Vista general</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-02.png" alt="Captura de pantalla de la pantalla principal del programa Gephi, la llamada vista general"/></figure>
<p class="alert alert-info" style="alert alert-info">
Si te aparece el programa en ingl&#233;s te recomiendo cambiar el idioma, pues esta lecci&#243;n se ha preparado con Gephi en espa&#241;ol. Puedes hacerlo f&#225;cilmente en <b>Tools</b> &gt; <b>Language</b> &gt; <b>Espa&#241;ol</b>. Te indicar&#225; que el programa debe cerrarse y que deber&#225;s reiniciarlo manualmente, es decir, volver a abrirlo. No es necesario que guardes nada si a&#250;n no has importando ning&#250;n dato.
</p>
<p>En la pesta&#241;a <hi rend="bold">Vista general</hi>, se crean las visualizaciones y se aplican los filtros y medidas para analizar los grafos. En <hi rend="bold">Laboratorio de datos</hi> se trabaja con los datos que generan los grafos, pudi&#233;ndose importar o introducir directamente, modificar y exportar. En el apartado de <hi rend="bold">Previsualizaci&#243;n</hi> se realizan los &#250;ltimos ajustes para generar y exportar las visualizaciones (grafos) en formato de imagen <code type="inline">.svg</code>, <code type="inline">.pdf</code> o <code type="inline">.png</code>.</p>
<p>Comencemos a trabajar:</p>
<ol>
<li>En la barra de opciones superior, haz clic en <hi rend="bold">Espacio de trabajo</hi> &gt; <hi rend="bold">Nuevo</hi> para crear un nuevo espacio de trabajo.</li>
<li>Renombra los dos espacios creados. Dentro de cada espacio, has clic en <hi rend="bold">Espacio de trabajo</hi> &gt; <emph>Renombrar</emph>. Denomina al primero 'Coaparici&#243;n en escena', y al segundo, 'Interacci&#243;n ling&#252;&#237;stica'.</li>
<li>Guarda el proyecto en <hi rend="bold">Archivo</hi> &gt; <emph>Guardar como</emph>, y denom&#237;nalo <code type="inline">bizarrias.gephi</code>.</li>
</ol>
</div><div type="3"><head>El laboratorio de datos: importaci&#243;n de aristas y nodos</head>
<p>Ahora vamos a importar nuestros datos. Lo haremos en paralelo con los dos grafos, pues te ayudar&#225; a no perderte. Primero las aristas del grafo de coaparici&#243;n de personajes en escena:<br/>
1. En el espacio de trabajo 'Coaparici&#243;n en escena', dir&#237;gete al <hi rend="bold">Laboratorio de datos</hi> y haz clic en <emph>Importar hoja de c&#225;lculo</emph>.<br/>
2. Busca y selecciona el archivo <code type="inline">aristas-coaparicion_bizarrias.csv</code> y haz clic en <emph>Abrir</emph>.<br/>
3. Se abrir&#225; una primera ventana de <hi rend="bold">Opciones generales de CSV</hi>. Seguramente Gephi ha detectado que se trata de una tabla de aristas, que el separador es la coma y que el formato de codificaci&#243;n de caracterse es UTF-8. Si no, selecciona estas opciones en los desplegables y haz clic en <emph>Siguiente</emph>.   </p>
<figure><desc>Figura 3. Ventana de importaci&#243;n de hojas de c&#225;lculo con las opciones generales para la lista de aristas</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-03.png" alt="Captura de pantalla de la ventana de importaci&#243;n de hojas de c&#225;lculo con las opciones generales de importaci&#243;n desde archivos CSV para la lista de aristas"/></figure>
<p>4. En la siguiente ventana, <hi rend="bold">Par&#225;metros de importaci&#243;n</hi>, deja seleccionadas todas las casillas, pues queremos importar nuestras cinco columnas. Gephi reconoce el tipo de datos: <code type="inline">double</code> (n&#250;meros) para el peso y <code type="inline">string</code> (cadena de caracteres) para las etiquetas. Haz clic en <emph>Terminar</emph>.<br/>
5. Ahora te aparecer&#225; la &#250;ltima ventana del proceso: el <hi rend="bold">Informe de importaci&#243;n</hi>. Ver&#225;s que Gephi ha detectado que se trata de un grafo 'no dirigido' con 11 nodos y 42 aristas, y que no encuentra ning&#250;n problema en el archivo. Muy importante: cambia la selecci&#243;n de <hi rend="bold">Nuevo espacio de trabajo</hi> a <hi rend="bold">A&#241;adir al espacio de trabajo existente</hi>. Queremos que nos importe los datos en el espacio en el que estamos trabajando, <hi rend="bold">Coaparici&#243;n en escena</hi>. Cuando lo hagas, haz clic en <emph>Aceptar</emph>. </p>
<figure><desc>Figura 4. Ventana con el informe de importaci&#243;n de la lista de aristas</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-04.png" alt="Captura de pantalla del informe de importaci&#243;n de una lista de aristas, con opciones finales como seleccionar el tipo de grafo o en qu&#233; espacio de trabajo se quiere realizar la importaci&#243;n"/></figure>
<p>Ver&#225;s que ha aparecido una tabla con los <code type="inline">id</code> de los personajes en la pesta&#241;a <hi rend="bold">Nodos</hi> y una tabla con las relaciones en la pesta&#241;a <hi rend="bold">Aristas</hi>. Gephi ha extraido esta informaci&#243;n de nuestra lista de aristas, asignando adem&#225;s un <code type="inline">id</code> a cada arista. </p>
<p>Ahora vamos a importar las aristas del grafo de interacciones ling&#252;&#237;sticas directas, siguiendo los mismos pasos:</p>
<ol>
<li>Dentro del espacio de trabajo <hi rend="bold">Interacci&#243;n ling&#252;&#237;stica</hi> dir&#237;gete al <hi rend="bold">Laboratorio de datos</hi> y haz clic en <emph>Importar hoja de c&#225;lculo</emph>.</li>
<li>Busca y selecciona el archivo <code type="inline">aristas-interaccion_bizarrias.csv</code> y haz clic en <emph>Abrir</emph>.</li>
<li>Se abrir&#225; una primera ventana de <hi rend="bold">Opciones generales de CSV</hi>. Seguramente Gephi ha detectado que se trata de una matriz, que el separador es la coma y que el formato de codificaci&#243;n de caracterse es UTF-8. Si no, selecciona estas opciones en los desplegables y haz clic en <emph>Siguiente</emph>.</li>
<li>En la siguiente ventana, <hi rend="bold">Par&#225;metros de importaci&#243;n</hi>, simplemente haz clic en <emph>Terminar</emph>. Ahora no hay columnas entre las que poder elegir.</li>
<li>Por &#250;ltimo te aparecer&#225; la ventana <hi rend="bold">Informe de importaci&#243;n</hi>. Ver&#225;s que Gephi ha detectado que se trata de un grafo 'dirigido' con 11 nodos y 51 aristas, y que no encuentra ning&#250;n problema en el archivo. Muy importante: cambia la selecci&#243;n de <hi rend="bold">Nuevo espacio de trabajo</hi> a <hi rend="bold">A&#241;adir al espacio de trabajo existente</hi>. Como antes, queremos que nos importe los datos en el espacio en el que estamos trabajando, <hi rend="bold">Interacci&#243;n ling&#252;&#237;stica</hi>. Cuando lo hagas, haz clic en <emph>Aceptar</emph>.</li>
</ol>
<p>Gephi ha importado nuestra matriz y la ha transformado en una lista de aristas con un nodo de origen, otro de destino, un tipo de relaci&#243;n, un peso y un <code type="inline">id</code>. Adem&#225;s, ha creado 11 nodos utilizando como etiqueta el <code type="inline">id</code> num&#233;rico que les asignamos. A esta nueva lista de aristas le faltan los atributos ('label', etiqueta), que s&#237; pudimos importar en el caso de la lista de aristas. Seleccionando la pesta&#241;a <hi rend="bold">Aristas</hi> del <hi rend="bold">Laboratorio de datos</hi> puedes introducir manualmente estas etiquetas, que describen el tipo de relaci&#243;n entre los personajes. Recuerda que ahora las relaciones est&#225;n duplicadas y tambi&#233;n deber&#225;s duplicar sus etiquetas. Es decir, hay un <code type="inline">amor correspondido</code> de Belisa a Don Juan y tambi&#233;n un <code type="inline">amor correspondido</code> de Don Juan a Belisa. Y una relaci&#243;n de <code type="inline">amistad</code> de Belisa a Celia y otra relaci&#243;n de <code type="inline">amistad</code> de Celia a Belisa.</p>
<figure><desc>Figura 5. Pesta&#241;a de aristas despu&#233;s de introducir manualmente las etiquetas de las relaciones</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-05.png" alt="Captura de pantalla del laboratorio de datos en la pesta&#241;a de aristas, ya con los todos los datos introducidos"/></figure>
<p>Una vez finalices el etiquetado de las aristas, vamos a importar los datos referentes a los nodos de los dos grafos. Los pasos ahora son exactamente los mismos para los dos grafos, as&#237; que hazlo primero en un espacio de trabajo y luego en el otro:</p>
<ol>
<li>Dentro del <hi rend="bold">Laboratorio de datos</hi> de cada espacio de trabajo vuelve a hacer clic en <emph>Importar hoja de c&#225;lculo</emph>.</li>
<li>Ahora busca y selecciona el archivo <link target="/assets/analisis-redes-sociales-teatro-1/nodos_bizarrias.csv"><code type="inline">nodos_bizarrias-csv</code></link> y haz clic en <emph>Abrir</emph>.</li>
<li>En esta ocasi&#243;n Gephi habr&#225; detectado que se trata de una 'tabla de nodos', que nuevamente el separador es la coma y que la codificaci&#243;n de caracteres es UTF-8. Si no, selecciona estas opciones en los desplegables y haz clic en <emph>Siguiente</emph>.</li>
<li>En la ventana <hi rend="bold">Par&#225;metros de importaci&#243;n</hi>, mant&#233;n seleccionadas todas las casillas; queremos que importe las cuatro columnas. Ahora ha detectado que tanto la columna <code type="inline">g&#233;nero</code> como <code type="inline">funci&#243;n</code> son cadenas de caracteres. Haz clic en <emph>Terminar</emph>.</li>
<li>En la &#250;ltima ventana, <hi rend="bold">Informe de importaci&#243;n</hi>, cerci&#243;rate que de que ha identificado 11 nodos y que no hay problemas en la importaci&#243;n. En el desplegable referente al tipo de grafo, selecciona <hi rend="bold">No dirigido</hi> o <hi rend="bold">Dirigido</hi> en funci&#243;n del grafo al que est&#233;s importando los nodos. Importante: cambia una vez m&#225;s la opci&#243;n de <hi rend="bold">Nuevo espacio de trabajo</hi> a <hi rend="bold">A&#241;adir al espacio de trabajo existente</hi>. Despu&#233;s, haz clic en <emph>Aceptar</emph>.</li>
</ol>
<figure><desc>Figura 6. Ventana con el informe de importaci&#243;n de la lista de nodos del grafo de coaparici&#243;n de personajes en escena</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-06.png" alt="Captura de pantalla de la ventana con el informe de importaci&#243;n de la lista de nodos"/></figure>
<p>Gephi ha importado la lista de nodos y ha combinado la nueva informaci&#243;n con los nodos que cre&#243; antes a partir de la lista de aristas o la matriz de adyacencia. Este es el motivo por el que era importante sustituir los nombres de los personaje por su <code type="inline">id</code> antes de exportar las hojas de c&#225;lculo a CSV. As&#237;, Gephi ha podido identificar qui&#233;n es qui&#233;n y fusionar los datos de ambos archivos.</p>
<p>&#161;Enhorabuena! Hemos terminado la importaci&#243;n de los datos de los dos grafos, ahora podemos pasar a trabajar en la pesta&#241;a <hi rend="bold">Vista general</hi>. </p>
</div><div type="3"><head>La vista general</head>
<p>La <hi rend="bold">Vista general</hi> es donde modificaremos la visualizaci&#243;n de nuestros grafos (que se ve en el centro del programa) y donde aplicaremos las medidas y m&#233;tricas de an&#225;lisis. A la izquierda tienes las opciones de visualizaci&#243;n (los paneles <hi rend="bold">Apariencia</hi> y <hi rend="bold">Distribuci&#243;n</hi>), y a la derecha est&#225;n el panel con informaci&#243;n sobre el grafo (<hi rend="bold">Contexto</hi>) y los paneles <hi rend="bold">Filtros</hi> y <hi rend="bold">Estad&#237;sticas</hi> para consultar y analizar el grafo:</p>
<figure><desc>Figura 7. Vista general de nuestro espacio de trabajo</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-07.png" alt="Captura de pantalla de la vista general del espacio de trabajo con una primera visualizaci&#243;n del grafo, a&#250;n sin cambiar par&#225;metros de visualizaci&#243;n"/></figure>
<p>Las opciones de visualizaci&#243;n y an&#225;lisis son muy numerosas y no las cubriremos todas en esta lecci&#243;n, as&#237; que para explorar e introducirnos en Gephi vamos a crear una visualizaci&#243;n sencilla y aplicar solo algunas medidas b&#225;sicas. A partir de ahora todos los pasos que des en un espacio de trabajo puedes replicarlos en el otro. As&#237;, repetir los mismos pasos dos veces te servir&#225; adem&#225;s para aprender a usar el programa. Despu&#233;s, te animo a continuar probando todas las dem&#225;s opciones y configuraciones por tu cuenta.</p>
<div type="4"><head>Modificar la apariencia y distribuci&#243;n del grafo</head>
<p>En el centro de la <hi rend="bold">Vista general</hi>, en el panel llamado <hi rend="bold">Grafo</hi>, nos ha tenido que aparecer una red con nodos y aristas en negro. Seguramente, el grafo de la captura de arriba (es el de coaparici&#243;n en escena) no es exactamente igual al que te ha aparecido a ti. Es normal, se ha generado con una distribuci&#243;n de nodos aleatoria. Comencemos a dar forma y color a nuestra red de personajes:</p>
<ol>
<li>Para desenmara&#241;ar la red empezaremos por aplicar un 'algoritmo de distribuci&#243;n'. En el panel de abajo a la izquierda, <hi rend="bold">Distribuci&#243;n</hi> elige el algoritmo <code type="inline">ForceAtlas 2</code> y modifica estos par&#225;metros: escalado 2500 y activar <emph>Evitar el solapamiento</emph>. Lo dem&#225;s puedes dejarlo como est&#225; por defecto. Haz clic en <emph>Ejecutar</emph> y cuando el grafo se estabilice y deje de moverse, haz clic en <emph>Parar</emph>. &#191;Qu&#233; ha ocurrido? Los nodos han comenzado a repelerse (alejarse) entre ellos a la vez que las aristas que los conectan los han intentado atraer. As&#237;, se ha generado un movimiento que ha terminado convergiendo en una posici&#243;n balanceada para cada nodo en la que aquellos personajes m&#225;s conectados entre s&#237; han quedado m&#225;s cerca y los menos conectados m&#225;s alejados. El objetivo de este algoritmo de distribuci&#243;n no es otro que colocar los nodos de forma que nos ayude a entender e interpretar mejor el grafo <ref type="footnotemark" target="#4"/>. Adem&#225;s de <code type="inline">ForceAtlas 2</code> existen otros algoritmos, como puedes comprobar en el desplegable, pero este nos ofrece buenos resultados y es uno de los m&#225;s extendidos.</li>
<li>Ahora haz clic en el icono 'T' negro que se encuentra en la cinta de opciones inferior, a la derecha de la c&#225;mara fotogr&#225;fica, en la parte inferior del panel del Grafo. Has activado las etiquetas (label) de los nodos, es decir, los nombres de los personajes. Puedes modificar el tama&#241;o, tipograf&#237;a y color en el resto de opciones de la cinta.</li>
<li>Vamos a modificar ahora el color y el tama&#241;o de los nodos y aristas. Para ello, ve al panel <hi rend="bold">Apariencia</hi> (arriba a la izquierda) y sigue estas indicaciones:<br/>
a.  En <hi rend="bold">Nodos-Color</hi> (icono de la paleta de pintura), selecciona <hi rend="bold">Partici&#243;n</hi> y escoge el atributo <code type="inline">Funci&#243;n</code>. Gephi asigna un color distinto a cada valor del atributo, puedes modificar la paleta de colores o dejar los colores por defecto y hacer clic en <emph>Aplicar</emph>. Los nodos del grafo se han coloreado y tambi&#233;n lo han hecho las aristas. Ve a la cinta de opciones inferior y deselecciona la opci&#243;n <hi rend="bold">Las aristas tienen el color del nodo de origen</hi>, su icono es una l&#237;nea con un arcoiris. Ahora las aristas ser&#225;n todas de un mismo color gris.<br/>
b.  En <hi rend="bold">Nodos-Tama&#241;o</hi> (icono de los c&#237;rculos), selecciona <hi rend="bold">Ranking</hi> y escoge el atributo <code type="inline">Grado</code> (Gephi calcula autom&#225;ticamente el grado de los nodos). Cambia el tama&#241;o m&#237;nimo a 10 y el m&#225;ximo a 40 y haz clic en <emph>Aplicar</emph>. Ahora los nodos tienen un tama&#241;o relativo a su grado, es decir, a la cantidad de nodos con los que est&#225;n relacionados. A mayor n&#250;mero de personajes con los que comparte escena un personaje -&gt; mayor grado del nodo que representa el personaje -&gt; mayor di&#225;metro del nodo en la visualizaci&#243;n.<br/>
c.  En <hi rend="bold">Aristas-Color</hi> (icono de la paleta de pintura), selecciona <hi rend="bold">Ranking</hi> y escoge el atributo <code type="inline">Peso</code>. Te aparecer&#225; un gradiente de color. Puedes cambiar la paleta de colores o dejarlo en verde y hacer clic en <emph>Aplicar</emph>. Ahora el color de las aristas est&#225; m&#225;s o menos intenso en funci&#243;n de su peso, es decir, del n&#250;mero de escenas que comparten dos los personajes o de sus interacciones ling&#252;&#237;sticas. Si las ves muy finas, puedes cambiar el tama&#241;o de las aristas en la cinta de opciones inferior, est&#225;n por defecto m&#225;s o menos gruesas tambi&#233;n seg&#250;n el peso.   </li>
</ol>
<p>Seguramente te ha quedado algo muy similar esto en el caso del grafo de coaparici&#243;n de personajes en escena:</p>
<figure><desc>Figura 8. Visualizaci&#243;n del grafo de coaparici&#243;n de personajes en escena, resultado de aplicar los par&#225;metros indicados</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-08.png" alt="Captura de pantalla de la vista general del espacio de trabajo con la visualizaci&#243;n del grafo una vez aplicados los par&#225;metros de visualizaci&#243;n escogidos"/></figure>
<p>&#161;Enhorabuena! Ahora puedes ver cu&#225;les son los personajes m&#225;s relacionados (<code type="inline">grado</code>) por el tama&#241;o de los nodos, la <code type="inline">funci&#243;n</code> de estos personajes por el color de los nodos y la cantidad de veces que dos personajes coinciden en escena o interact&#250;an entre ellos (<code type="inline">peso</code>) por el grosor y la intensidad de color de sus aristas. Si comparas la captura con tu vista del grafo de coaparici&#243;n en escena puede que tu grafo tenga otra disposici&#243;n. En realidad tus nodos y los m&#237;os est&#225;n colocados en el mismo sitio y a la misma distancia, solo que est&#225;n rotados en otro sentido. En el panel de <hi rend="bold">Distribuci&#243;n</hi> puedes utilizar la opci&#243;n <hi rend="bold">Rotar</hi> (en el desplegable) y buscar una disposici&#243;n que te guste m&#225;s. No cambiar&#225; la distribuci&#243;n que cre&#243; el algoritmo <code type="inline">ForceAtlas 2</code>. Otras opciones que puedes explorar son <hi rend="bold">Contracci&#243;n</hi> y <hi rend="bold">Expansi&#243;n</hi>, o <hi rend="bold">Ajuste de etiquetas</hi> si alguna est&#225; superpuesta.</p>
<p>Una vez repitas los pasos tambi&#233;n en el espacio de trabajo del grafo de interacciones ling&#252;&#237;sticas y hayas modificado su apariencia ver&#225;s que en este caso las aristas tienen flechas que nos indican la direcci&#243;n de las relaciones, se trata de un grafo dirigido:</p>
<figure><desc>Figura 9. Visualizaci&#243;n del grafo de interacciones ling&#252;&#237;sticas entre personajes, resultado de aplicar los par&#225;metros indicados</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-09.png" alt="Captura de pantalla de la vista general del espacio de trabajo con la visualizaci&#243;n del grafo una vez aplicados los par&#225;metros de visualizaci&#243;n escogidos"/></figure>
<p>Tambi&#233;n puedes activar las etiquetas de las aristas, haciendo clic en la 'T' blanca en la cinta de opciones de debajo del grafo. El color de las etiquetas y su tama&#241;o deber&#225;s modificarlo en <hi rend="bold">Apariencia</hi>, en la pesta&#241;a <hi rend="bold">Aristas-A subrayada</hi> (color) y en la pesta&#241;a <hi rend="bold">Aristas-tT</hi> (tama&#241;o):</p>
<figure><desc>Figura 10. Visualizaci&#243;n del grafo de coaparici&#243;n de personajes en escena con las etiqutas de las aristas activadas</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-10.png" alt="Captura de pantalla de la vista general del espacio de trabajo con la visualizaci&#243;n del grafo seg&#250;n los par&#225;metros escogidos y con las etiquetas de las aristas visibles"/></figure>
</div><div type="4"><head>El contexto y los filtros</head>
<p>Nos quedan por explorar los paneles de configuraci&#243;n de la derecha. El de <hi rend="bold">Contexto</hi> nos da informaci&#243;n sobre grafo en pantalla. Por ejemplo, en el de interacciones ling&#252;&#237;sticas nos dice que se trata de un 'grafo dirigido' con 11 nodos y 51 aristas.</p>
<p>Vamos a probar los filtros, por ejemplo, filtrando cualquiera de los grafos seg&#250;n el g&#233;nero de los personajes:</p>
<ol>
<li>En el panel <hi rend="bold">Filtros</hi>, despliega las carpetas <hi rend="bold">Atributos</hi> y <hi rend="bold">Partici&#243;n</hi> (dentro de la primera).</li>
<li>Selecciona el atributo <code type="inline">g&#233;nero (Nodo)</code> y arr&#225;stralo al panel de <hi rend="bold">Consultas</hi>.</li>
<li>Haz clic en <emph>Mujer (45,45 %)</emph> y en <emph>Filtrar</emph>.</li>
</ol>
<p>Ver&#225;s algo similar a esto, un grafo solo con los personajes clasificados por ti como <hi rend="bold">Mujer</hi>:</p>
<figure><desc>Figura 11. Grafo resultante de filtrar por el atributo 'Mujer'</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-11.png" alt="Captura de pantalla de la vista general del espacio de trabajo con el resultado de filtrar el grafo seg&#250;n el atributo 'mujer'"/></figure>
<p>Puedes hacer lo mismo con los personajes <hi rend="bold">Hombre</hi> o utilizar otro atributo para el filtrado, como la funci&#243;n de los personajes. Con cada filtro que apliques ver&#225;s que la informaci&#243;n del <hi rend="bold">Contexto</hi> cambia. Para volver atr&#225;s, elimina el filtro con el bot&#243;n derecho <emph>Suprimir</emph> sobre el filtro o haciendo clic en <emph>Restaurar</emph>.</p>
</div><div type="4"><head>Medidas, m&#233;tricas y algoritmos de an&#225;lisis</head>
<p>Ahora vamos a aplicar algunas medidas en el panel <hi rend="bold">Estad&#237;sticas</hi>. Te dejar&#233; explicaciones de cada una. Gephi ha simplificado al m&#225;ximo el an&#225;lisis de los grafos, pues es tan f&#225;cil como hacer clic en <emph>Ejecutar</emph> en la medida o algoritmo que queramos implementar. Algunas de estas medidas abriran una ventana emergente al ejecutarlas, un peque&#241;o informe que podemos descargar u opciones de configuraci&#243;n. Otras, simplemente a&#241;adir&#225;n columnas en nuestra tabla de nodos del <hi rend="bold">Laboratorio de datos</hi>. Estos nuevos datos, generados gracias a la aplicaci&#243;n de medidas, nos dan m&#225;s informaci&#243;n sobre nuestro grafo, nos permiten modificar la visualizaci&#243;n en base a ellos (son como nuevos atributos) y export&#225;ndolos podremos procesarlos en otra herramienta o programa. En esta lecci&#243;n no nos adentraremos ah&#237;, pero quiero que sepas que a partir de aqu&#237; las posibilidades se multiplican.</p>
<p>En el apartado <hi rend="bold">Visi&#243;n general de la red</hi> lo primero que encontramos es el <link target="https://perma.cc/M8B7-34LD">'grado medio'</link>, es decir, la media de los grados de todos los nodos del grafo. Recordemos que el grado es el n&#250;mero de nodos con los que un nodo est&#225; conectado. En el caso de los grafos dirigidos, obtendremos adem&#225;s el 'grado medio de entrada' y el 'grado medio de salida'. Despu&#233;s, el 'grado medio con pesos', que tiene en cuenta el peso de las aristas conectadas a un nodo y no simplemente la cantidad nodos con los que se conecta. De nuevo, habr&#225; un 'grado medio con pesos de entrada' y un 'grado medio con pesos de salida'. Al ejecutar estas dos estad&#237;sticas, se a&#241;adir&#225;n dos columnas nuevas en la tabla de nodos del <hi rend="bold">Laboratorio de datos</hi> con los valores de grado y grado con peso de cada nodo:</p>
<figure><desc>Figura 12. Laboratorio de datos del grafo de interacciones ling&#252;&#237;sticas con las nuevas columnas de grado</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-12.png" alt="Captura de pantalla del laboratorio de datos del grafo de interacciones ling&#252;&#237;sticas con columnas resultantantes de aplicar las medidas de grado"/></figure>
<p>El 'di&#225;metro de la red' es una de las medidas de tama&#241;o o distancia. Para entenderlo, primero has de saber que en an&#225;lisis de redes se entiende por 'camino' una secuencia de nodos conectados por aristas. Esta noci&#243;n de camino nos permite calcular las m&#233;tricas de distancia y tama&#241;o de la red. Por otro lado, se entiende por <link target="https://perma.cc/YYA3-ZLG9">'distancia'</link> o 'longitud' de un camino el n&#250;mero de aristas (no de nodos) que deben cruzarse para ir de un nodo a otro (siempre por el camino m&#225;s corto). El <link target="https://perma.cc/2EU8-J4ZR">'di&#225;metro'</link> es, entonces, la distancia entre los nodos m&#225;s alejados de una red:</p>
<figure><desc>Figura 13. Ejemplo del di&#225;metro de una red</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-13.png" alt="Grafo explicativo del concepto 'di&#225;metro', con las aristas que sirven para medir el di&#225;metro coloreadas"/></figure>
<p>Haz clic en <emph>Ejecutar</emph> el di&#225;metro:</p>
<ol>
<li>En la ventana que se ha abierto encontrar&#225;s definiciones de las m&#233;tricas de distancia: distancia media, di&#225;metro y las medidas de centralidad de intermediaci&#243;n, cercan&#237;a y excentricidad. Al ejecutar esta funci&#243;n, no solo se calcula el di&#225;metro sino todas esas m&#233;tricas relacionadas con la distancia.</li>
<li>Gephi te permite normalizar las centralidades (ahora veremos lo que son) en un rango [0,1], lo que facilita despu&#233;s la comparaci&#243;n de grafos de obras distintas. Marca esta opci&#243;n y haz clic en <emph>Aceptar</emph>.</li>
</ol>
<figure><desc>Figura 14. Ventana de par&#225;metros de distancia del grafo de coaparici&#243;n de personajes en escena</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-14.png" alt="Captura de pantalla de la ventana de par&#225;metros que se abre para ejecutar las medidas de distancia de un grafo"/></figure>
<p>Si comparas el di&#225;metro de los dos grafos ver&#225;s que hay diferencias: en uno es 2 y en el otro 4. Es normal la diferencia, nos habla de que hay personajes que comparten escena pero que no interact&#250;an entre ellos.</p>
<p>Si te diriges al <hi rend="bold">Laboratorio de datos</hi>, ver&#225;s que se han a&#241;adido varias columnas m&#225;s en la tabla de nodos, ahora con los resultados de las 'medidas de centralidad'. La 'centralidad' en ARS tiene que ver con el lugar que ocupan los nodos en el conjunto de una red y nos ayuda a entender la 'importancia' de los nodos dentro del sistema que analizamos<ref type="footnotemark" target="#5"/>. Estas son algunas de las medidas de centralidad, pero hay unas cuantas m&#225;s:</p>
<ul>
<li>El 'grado' o el 'grado con pesos' pueden ser medidas de centralidad, pues valores m&#225;s altos indican mayor conectividad. En ese caso, nos referimos a ellas como <link target="https://perma.cc/2SW2-LZT4">'centralidad de grado'</link> (degree centrality) y 'centralidad de grado con pesos' (weighted degree centrality).</li>
<li>La <link target="https://perma.cc/7E9Y-CH68">'centralidad de cercan&#237;a'</link> (closeness centrality) de un nodo se obtiene midiendo la distancia media que guarda dicho nodo con todos los dem&#225;s del grafo. Dicho de otra forma, nos ayuda a encontrar el nodo m&#225;s cercano a todos los dem&#225;s, que no tiene por qu&#233; ser el de mayor grado (el m&#225;s conectado).</li>
<li>La <link target="https://perma.cc/5YSB-9KVX">'centralidad de intermediaci&#243;n'</link> (betweenness centrality) de un nodo se halla calculando la cantidad de veces que dicho nodo se encuentra en el camino m&#225;s corto entre todos los otros nodos. La importancia de los nodos depende, en este caso, de su labor de intermediaci&#243;n, de puente conector entre nodos separados. Si faltan estos nodos, la estructura de un grafo suele verse muy afectada.</li>
</ul>
<p>Por ejemplo, en la comedia con la que estamos trabajando, <emph>Las bizarr&#237;as de Belisa</emph>, ning&#250;n personaje tiene una centralidad de intermediaci&#243;n normalizada demasiado alta. No hay ning&#250;n nodo que elimin&#225;ndolo provoque un 'grafo disconexo' en el que ciertos nodos queden desconectados del n&#250;cleo principal.  </p>
<p>Siguiendo en el panel de <hi rend="bold">Estad&#237;sticas</hi> nos encontramos la <hi rend="bold">Densidad</hi>. La <link target="https://perma.cc/E5C7-XVX8">'densidad'</link> mide el nivel de conectividad entre todos los nodos de un grafo. Por ejemplo, un grafo tendr&#237;a una densidad del 100% cuando todos los nodos est&#225;n conectados entre s&#237;. Matem&#225;ticamente la densidad se calcula a trav&#233;s de la proporci&#243;n de aristas que tiene una red frente al total de aristas posibles, expresado el resultado en un rango [0,1]: cerca de 1 se dice que es un grafo 'denso'; cuanto m&#225;s cerca de 0 se habla de un grafo 'disperso'. Haz clic en <emph>Ejecutar</emph>:</p>
<ol>
<li>Se abrir&#225; una ventana que nos permite elegir seleccionar si nuestro grafo es dirigido o no dirigido.</li>
<li>Selecciona tu opci&#243;n haz clic en <emph>Aceptar</emph>.</li>
</ol>
<p>Nuevamente, hay diferencia entre la densidad del grafo de coaparici&#243;n en escena y la del grafo de interacciones ling&#252;&#237;sticas por el mismo motivo: hay personajes que comparten escena pero que no intercambian palabra.</p>
<p>Vamos a saltar ahora al apartado <hi rend="bold">Community Detection</hi>. En ARS se entiende por <link target="https://perma.cc/CJ23-HB7M">'comunidad'</link> un grupo de nodos que est&#225;n densamente interconectados entre s&#237; y que a su vez est&#225;n poco conectados con los nodos de otra comunidad:</p>
<figure><desc>Figura 15. Ejemplo de grafo con comunidades coloreadas en dos colores distintos</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-15.png" alt="Grafo explicativo del concepto 'comunidad' con los nodos coloreados seg&#250;n la comunidad a la que pertenecen"/></figure>
<p>Las distintas comunidades de un grafo se hayan implementando un &#8217;algoritmo de <link target="https://perma.cc/PY99-MBVB">modularidad</link>&#8217; que Gephi incorpora, que podemos utilizar simplemente haciendo clic en <emph>Ejecutar</emph>. </p>
<ol>
<li>Se abrir&#225; una ventana de <hi rend="bold">Par&#225;metro de Modularid</hi>. No es necesario que modifiques nada: utiliza la opci&#243;n de aleatoriedad y de incorporar los pesos de las aristas, y deja la resoluci&#243;n en 1 (modularidad est&#225;ndar).</li>
<li>El algoritmo va a numerar las comunidades a partir del 0, pero si quieres que comience a contar en 1, simplemente cambia la opci&#243;n <hi rend="bold">Classes start at: 1</hi> y dale a <emph>Aceptar</emph>.</li>
</ol>
<p>Si implementas el algoritmo de modularidad en el grafo de interacciones ling&#252;&#237;sticas directas comprobar&#225;s que se detectan tres comunidades de nodos. Puedes ver qu&#233; comunidad ha sido asignada a cada nodo en la nueva columna del <hi rend="bold">Laboratorio de datos</hi>. Para visualizar las comunidades en el grafo, ve al panel <hi rend="bold">Apariencia</hi> de la <hi rend="bold">Vista general</hi> y cambia el color de los nodos eligiendo la partici&#243;n <hi rend="bold">Modularity Class</hi>, haciendo clic en <emph>Aplicar</emph> con los colores por defecto o modific&#225;ndolos. Deber&#237;a quedarte un grafo similar a este:</p>
<figure><desc>Figura 16. Grafo de interacciones ling&#252;&#237;sticas con los nodos coloreados seg&#250;n la comunidad a la que pertenecen, detectadas gracias al algoritmo de modiularidad</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-16.png" alt="Captura de pantalla de la vista general del espacio de tabajo con la visualizaci&#243;n del grafo de interacciones ling&#252;&#237;sticas con los nodos coloreados seg&#250;n la comunidad a la que pertenecen: morado, verde o naranja"/></figure>
<p>Cuando has desplegado el men&#250; de <hi rend="bold">Partici&#243;n</hi> en el color de los nodos habr&#225;s visto que han aparecido muchas m&#225;s opciones de las que ten&#237;amos al principio, y es que puedes utilizar los resultados de las medidas que has ido implementando para colorear y dar tama&#241;o a los nodos y aristas. Por ejemplo, utilizando la opci&#243;n <hi rend="bold">Ranking</hi> puedes poner el di&#225;metro de los nodos en funci&#243;n de su centralidad de intermediaci&#243;n y el color graduado en intensidad seg&#250;n su grado. Esto te permitir&#237;a a golpe de vista comparar la diferencia entre ambas medidas para cada nodo. &#191;Ves c&#243;mo las opciones se multiplican?</p>
</div></div><div type="3"><head>La previsualizaci&#243;n: &#250;ltimos ajustes y exportaci&#243;n de visualizaciones</head>
<p>Para finalizar con el trabajo en Gephi, vamos a exportar alguna visualizaci&#243;n en la pesta&#241;a de <hi rend="bold">Previsualizaci&#243;n</hi>. Al entrar, ver&#225;s un panel grande en gris vac&#237;o: es donde aparecer&#225; el grafo una vez introduzcas los par&#225;metros en el panel de configuraci&#243;n de la izquierda. Haz una prueba: entra a la previsualizaci&#243;n del espacio de trabajo <hi rend="bold">Coaparici&#243;n en escena</hi>, haz clic en <emph>Refrescar</emph> y mira c&#243;mo se ve tu grafo con los par&#225;metros que vienen por defecto. Estar&#225;s viendo el mismo grafo de la <hi rend="bold">Vista general</hi> pero con algunos ajustes de visualizaci&#243;n. Ahora modifica estos par&#225;metros y deja el resto como est&#225;n por defecto:</p>
<ul>
<li>
Nodos:<ul>
<li>Ancho de borde: 0.0</li>
</ul>
</li>
<li>
Etiquetas de nodos:<ul>
<li>Mostrar etiqueta: activado</li>
<li>Fuente: Arial 24 Sin Formato</li>
<li>Tama&#241;o proporcional: desactivado</li>
</ul>
</li>
<li>
Aristas:<ul>
<li>Grosor: 20</li>
<li>Reescalar pesos: activado</li>
<li>Color: original (es decir, el gradiente que pusimos en la vista general)</li>
</ul>
</li>
<li>
Etiquetas de aristas<ul>
<li>Mostrar etiquetas: activado</li>
<li>Fuente: Arial 14 Sin Formato</li>
<li>Color: espec&#237;fico: #000000</li>
</ul>
</li>
</ul>
<p>Haz clic en <emph>Refrescar</emph> de nuevo y deber&#237;a aparecerte un grafo similar a este, quiz&#225; con otra rotaci&#243;n:</p>
<figure><desc>Figura 17. Visualizaci&#243;n final del grafo de coaparici&#243;n de personajes en escena</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-17.png" alt="Captura de pantalla de la pesta&#241;a de previsualizaci&#243;n, con la columna de opciones finales de visualizaci&#243;n a la izquierda y el grafo resultante a la derecha"/></figure>
<p>Ahora puedes exportar la visualizaci&#243;n hacienco clic en <emph>Exportar SVG/PDF/PNG</emph> en la parte inferior del panel de la izquierda. Como bien deduces, esos son los tres formatos que permite exportar Gephi. <link target="https://perma.cc/3CAF-NZTD">PNG</link> es un buen formato de imagen, y podr&#225;s insertarlo en un documento de texto, utilizarlo para crear un p&#243;ster o una presentaci&#243;n de diapositivas. Si seleccionas en el desplegable <code type="inline">Files of type</code> la opci&#243;n <code type="inline">Archivos PNG (*.png)</code> y accedes al men&#250; de <hi rend="bold">Opciones</hi>, Gephi te permitir&#225; configurar la resoluci&#243;n de la imagen, el margen alrededor del grafo y si quieres fondo transparente o no.</p>
<figure><desc>Figura 18. Men&#250; de exportaci&#243;n de visualizaciones</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-18.png" alt="Captura de pantalla de las ventanas del men&#250; de exportaci&#243;n de visualizaciones"/></figure>
<p>Otra buena opci&#243;n es exportar en <link target="https://perma.cc/EBJ4-C2KZ">SVG</link>, el formato de gr&#225;ficos vectoriales escalables que se suele utilizar en dise&#241;o gr&#225;fico, ya que son manipulables por ejemplo con <link target="https://perma.cc/6M8D-Q4MS">CSS</link> y <link target="https://perma.cc/2M3K-JRT8">JavaScript</link>. Si quieres utilizar tus visualizaciones en un sitio web, puede que este formato sea el que m&#225;s te convenga. Adem&#225;s, este formato lo puedes abrir y editar con programas de c&#243;digo abierto como <link target="https://inkscape.org/es/">Inkscape</link> o <link target="https://es.libreoffice.org/descubre/draw/">LibreOffice Draw</link> o privativos como <link target="https://www.adobe.com/es/products/illustrator.html">Adoble Illustrator</link>.</p>
<p>Si repites lo mismo con el grafo de interacci&#243;n ling&#252;&#237;stica directa ahora podr&#225;s seleccionar si quieres aristas curvas (que marcan la direcci&#243;n en el sentido de las agujas de un reloj) o rectas con flechas. Por ejemplo, reutiliza los par&#225;metros anteriores y modifica estos:</p>
<ul>
<li>
Aristas:<ul>
<li>Curvas: desactivado</li>
</ul>
</li>
<li>
Flechas de aristas:<ul>
<li>Tama&#241;o: 3.0</li>
</ul>
</li>
<li>
Etiquetas de aristas:<ul>
<li>Mostrar etiquetas: desactivado</li>
</ul>
</li>
</ul>
<p>Haz clic en <emph>Refrescar</emph> y ver&#225;s algo as&#237; (con los nodos coloreados seg&#250;n su comunidad porque antes aplicamos este cambio en la vista general):</p>
<figure><desc>Figura 19. Visualizaci&#243;n final del grafo de interacciones ling&#252;&#237;sticas entre personjes</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-19.png" alt="Captura de pantalla de la pesta&#241;a de previsualizaci&#243;n, con la columna de opciones finales de visualizaci&#243;n a la izquierda y el grafo resultante a la derecha"/></figure>
</div></div>
      <div type="2"><head>Paso 4. Interpretaci&#243;n de los resultados</head>
<p>Hemos generado visualizaciones y aplicado medidas a los grafos construidos gracias a los datos que primero extrajimos de <emph>Las bizarr&#237;as de Belisa</emph>. Las visualizaciones ya nos pueden ayudar en el an&#225;lisis de una obra, por ejemplo, ilustrando un an&#225;lisis de los personajes m&#225;s 'tradicional'. Pero si has llegado hasta aqu&#237; seguramente lo que te interesa es tener en consideraci&#243;n los datos obtenidos de la aplicaci&#243;n de medidas, m&#233;tricas y algoritmos.</p>
<p>Primero creo que es necesario incidir en que los datos obtenidos de un an&#225;lisis de redes sociales como el que hemos llevado a cabo deben analizarse cuidadosamente y no utilizarse para confirmar hip&#243;tesis sin una valoraci&#243;n cr&#237;tica. En realidad, todo el proceso que has llevado a cabo, desde la elecci&#243;n del corpus hasta la creaci&#243;n de visualizaciones, debe considerarse parte del proceso cr&#237;tico de investigaci&#243;n. Piensa, por ejemplo, en la tediosa extracci&#243;n de datos y todas las decisiones interpretativas que has tomado. &#161;Cualquier otra decisi&#243;n variar&#237;a los resultados! Por eso debes insistir en ser consistente con el procedimiento y criterios de an&#225;lisis que elijas, y comunicarlos con detalle para contextualizar tus resultados.</p>
<p>Vamos entonces a explorar los datos y grafos obtenidos de nuestro an&#225;lisis de redes sociales de <emph>Las bizarr&#237;as de Belisa</emph>. Mi primera recomendaci&#243;n es que, despu&#233;s de aplicar las medidas y algoritmos que te interesen, vayas al <hi rend="bold">Laboratorio de datos</hi> y hagas clic en <emph>Exportar tabla</emph> para exportar la tabla de nodos pero ahora con las nuevas columnas agregadas con m&#225;s datos sobre los personajes. Gracias a este CSV podr&#225;s procesar los resultados c&#243;modamente con lenguajes de programaci&#243;n como <link target="https://perma.cc/7ESJ-S5K4">R</link> (enfocado al an&#225;lisis estad&#237;stico) o <link target="https://perma.cc/BT4G-U7FE">Python</link>, o incluso con el mismo programa de hojas de c&#225;lculo que utilizaste para recoger tus datos. </p>
<p>Hagamos esto &#250;ltimo. Abre un nuevo archivo de hojas de c&#225;lculo e importa la tabla de nodos CSV del grafo de interacci&#243;n ling&#252;&#237;stica que acabas de exportar de Gephi. Puedes llamar a este nuevo archivo <code type="inline">analisis-datos_Bizarrias</code>. &#191;Qu&#233; podemos hacer ahora? Primero analicemos el grado de los personajes que, recordemos, cuantifica lo conectado que est&#225; un nodo con el resto de nodos de la red social. Los nodos adem&#225;s de 'grado' (a secas) tambi&#233;n tienen 'grado con peso'. El primero tiene que ver con el n&#250;mero de personajes con los que habla un nodo (en un sentido y otro) y el segundo tiene en cuenta adem&#225;s la cantidad de interacciones. Fij&#233;monos en las diferencias entre una y otra medida, observando estos gr&#225;ficos generados en la hoja de c&#225;lculo mediante las opciones que ofrece Google Sheets:</p>
<figure><desc>Figura 20. Grados y grados con pesos de los personajes de 'Las bizarr&#237;as de Belisa' seg&#250;n sus interacciones ling&#252;&#237;sticas directas</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-20.png" alt="Gr&#225;ficos de barras verticales con los gafos y grados con pesos de los personajes de la comedia analizada, ordenados de mayor a menor grado"/></figure>
<p>Don Juan ha resultado ser el personaje que m&#225;s interact&#250;a, logrando el grado m&#225;s alto de toda la red social (15) y superando a Belisa por un punto, la indiscutible protagonista femenina que incluso da nombre a la comedia. &#191;Por qu&#233;? Si vamos a nuestro grafo podremos ver c&#243;mo Don Juan interact&#250;a con Octavio y Julio, mientras que Belisa, aunque se enfrenta a ellos vestida de hombre y con espada, no cruza palabra durante dicho enfrentamiento. Sin embargo, si vemos los datos del grafo de coaparici&#243;n en escena, son Belisa y su criada Finea quienes logran el grado m&#225;s alto, convirti&#233;ndose en los dos &#250;nicos personajes de la comedia que comparten escena al menos una vez con todos los dem&#225;s personajes (por eso su grado es 10). Pero recordemos, compartir escena no significa necesariamente compartir di&#225;logo, como nos demuestra el grafo dirigido. &#191;Y en cuanto al grado con peso? Si volvemos al gr&#225;fico de barras, ahora s&#237; Belisa logra la primera posici&#243;n, y supera con creces a Don Juan. Su grado con peso es 318, es decir, se dirige 157 veces a otros personajes y es receptora de 161 intervenciones. Como vemos, en funci&#243;n de qu&#233; nos interese estudiar de un texto teatral, puede interesarnos m&#225;s un criterio de an&#225;lisis u otro.</p>
<p>Veamos por &#250;ltimo un dato global de los grafos: su densidad. El grafo de coaparici&#243;n en escena (no dirigido) tiene una densidad de 0,764, mientras que el de interacci&#243;n ling&#252;&#237;stica alcanza tan solo 0,464. &#191;Qu&#233; nos aporta esta informaci&#243;n? <emph>Las bizarr&#237;as de Belisa</emph> se trata de una comedia bastante densa en cuanto a la coaparici&#243;n de personajes en escena (cuanto m&#225;s cerca de 1, mayor densidad). Son pocos personajes, tan solo diez, y la configuraci&#243;n de la acci&#243;n genera que compartan muchas escenas. Lope escribi&#243; una comedia urbana del gusto de la &#233;poca, alejado ya de sus primeras incursiones al g&#233;nero en las que el reparto superaba los 20 personajes y las acciones estaban m&#225;s dispersas. Sin embargo, la densidad del grafo dirigido no llega al medio punto, lo que nos demuestra que aunque los personajes coinciden en escena, no significa que necesariamente dialoguen. La diferencia entre la densidad de los dos tipos de grafo en esta comedia podemos explicarla principalmente por la situaci&#243;n particular de Octavio, gal&#225;n rival de don Juan (por ser pretendiente tambi&#233;n de Lucinda, la segunda dama). Aunque sabemos que Octavio visita a Lucinda (le vemos salir de su casa), esta pareja nunca interact&#250;a en el escenario. Es una situaci&#243;n quiz&#225; algo at&#237;pica pero que entendemos por el desdoblamiento de galanes rivales: don Juan y el Conde pretenden a Belisa, y don Juan y Octavio pretenden a Lucinda. Dado que la acci&#243;n amorosa principal es la de Belisa, Lope no dedica demasiados versos al desarrollo de la relaci&#243;n entre Octavio y Lucinda.</p>
<p>No podemos explorar todos los resultados del an&#225;lisis practicado sobre <emph>Las bizarr&#237;as de Belisa</emph>, as&#237; que sirva lo dicho para comprender el tipo de conclusiones a las que nos llevan los datos y grafos generados. Por &#250;ltimo, apuntar las posibilidades del an&#225;lisis comparado de redes sociales, es decir, a partir de un corpus de dos o m&#225;s obras. Por ejemplo, este es un gr&#225;fico en el que se compara el grado con pesos normalizado (sobre 1) de los primeros galanes y primeras damas de ocho comedias urbanas de Lope de Vega (en orden cronol&#243;gico), entre las que se incluye la que hemos utilizado en esta lecci&#243;n:</p>
<figure><desc>Figura 21. Gr&#225;fico comparativo del grado con pesos normalizado de los primeros galanes y primeras damas de ocho comedias urbanas de Lope de Vega (elaboraci&#243;n propia, Merino Recalde (2022)</desc><graphic url="es-or-analisis-redes-sociales-teatro-2-21.png" alt="Diagrama de dispersi&#243;n de puntos con l&#237;neas de tendencia comparando el grado con pesos normalizado de los primeros galanes y primeras damas de ocho comedias urbanas de Lope de Vega"/></figure>
</div>
      <div type="2"><head>Recapitulaci&#243;n final</head>
<p>Terminemos esta lecci&#243;n anotando las cuestiones elementales que deber&#225;s tener en cuenta cuando realices un an&#225;lisis de redes sociales de textos teatrales: </p>
<ol>
<li>Divide el proceso en cuatro partes diferenciadas:<br/>
a. Creaci&#243;n del corpus<br/>
b. Extracci&#243;n y estructuraci&#243;n de datos<br/>
c. Visualizaciones y an&#225;lisis<br/>
d. Interpretaci&#243;n de los resultados (datos y grafos)   </li>
<li>Documenta el proceso y la toma de decisiones. S&#233; consistente en ello. Procura basarte siempre en criterios preestablecidos, ya sean provenientes de otras investigaciones que trabajen con el mismo tipo de obras o dise&#241;ados por ti en funci&#243;n de tus objetivos y del corpus de an&#225;lisis.</li>
<li>Procura guardar tus datos finales en <link target="https://perma.cc/M2XM-DYUZ">formatos abiertos</link> que garanticen el acceso a los datos a largo plazo, como el CSV (<code type="inline">.csv</code>). Si &#250;nicamente guardas tus datos en formato excel (<code type="inline">.xlxs</code>) o en la extensi&#243;n del propio Gephi (<code type="inline">.gephi</code>) puede que tu archivo termine corrompi&#233;ndose o fallando. Un CSV tiene una vida m&#225;s larga, es m&#225;s f&#225;cil de preservar y r&#225;pidamente puedes importarlo, transformarlo y volver sobre tus datos para reconstruir tus grafos y an&#225;lisis.</li>
<li>Cuando generes visualizaciones anota los par&#225;metros que utilizaste (tama&#241;o de los nodos, colores, algoritmo de distribuci&#243;n, etc.). Es importante que acompa&#241;es tus resultados de esta informaci&#243;n, pues ayuda a entender y contextualizar las representaciones.</li>
</ol>
<p>Y sobre todo, no tengas miedo de probar y explorar todas las posibilidades que nos ofrece el an&#225;lisis de redes para estudiar la literatura teatral.</p>
</div>
      <div type="2"><head>Notas</head>
<p><note id="1"> Existen otros programas y herramientas de an&#225;lisis de redes que podemos mencionar. Por ejemplo, <link target="https://cytoscape.org/">Cytoscape</link> es otro programa de c&#243;digo abierto y libre descarga, muy utilizado en bioinform&#225;tica. Tambi&#233;n hay aplicaciones web: <link target="http://hdlab.stanford.edu/palladio/">Palladio</link>, desarrollada por el Humanities+Design Research Lab de la Standford University y pensada para la investigaci&#243;n hist&#243;rica; o <link target="https://onodo.org/">ONODO</link>, una aplicaci&#243;n muy sencilla que permite crear redes e implementar medidas f&#225;cilmente.    </note>
<note id="2"> Esta lecci&#243;n se ha preparado con la versi&#243;n 0.9.7 de Gephi. En 2022, y tras cinco a&#241;os sin actualizaciones, se han publicado 5 versiones nuevas corrigiendo errores (bug fixes) y a&#241;adiendo mejoras. Por ejemplo, desde la versi&#243;n 0.9.3 ya no es necesario instalar Java para que Gephi funcione en Windows y Linux, lo que causaba numerosos problemas en Windows. Durante las revisiones de est&#225; lecci&#243;n se han publicado las versiones 0.10 y 0.10.1, pero sus actualizaciones no impiden el correcto seguimiento de esta lecci&#243;n. Puedes leer m&#225;s acerca de las actualizaciones de Gephi en <link target="https://perma.cc/XPF2-ZKJY">https://gephi.wordpress.com/2022/05/11/transition-to-semantic-versioning/</link> y en <link target="https://perma.cc/NQL4-77P2">https://github.com/gephi/gephi/releases</link>.      </note>
<note id="3"> Por ejemplo, este estupendo videotutorial en 5 partes de Salvador S&#225;nchez, disponible en YouTube: <link target="https://www.youtube.com/playlist?list=PLIvIcfwy1T6IDiW3K10TplK3rvdwMLOb2">https://www.youtube.com/playlist?list=PLIvIcfwy1T6IDiW3K10TplK3rvdwMLOb2</link>. O la <emph>introducci&#243;n r&#225;pida a Gephi</emph> de Jos&#233; Manuel Gal&#225;n, tambi&#233;n en Youtube: <link target="https://www.youtube.com/watch?v=sX5XYec4tWo">https://www.youtube.com/watch?v=sX5XYec4tWo</link>.     </note>
<note id="4"> Si te interesa conocer m&#225;s sobre c&#243;mo funciona <code type="inline">ForceAtlas 2</code> y sabes ingl&#233;s, te recomiendo este art&#237;culo de sus desarrolladores: Jacomy, Mathieu, Tommaso Venturini, Sebastien Heymann, y Mathieu Bastian. &#171;ForceAtlas2, a Continuous Graph Layout Algorithm for Handy Network Visualization Designed for the Gephi Software&#187;. PLoS ONE 9, n.&#186; 6 (2014): e98679. <link target="https://doi.org/10.1371/journal.pone.0098679">https://doi.org/10.1371/journal.pone.0098679</link>.     </note>
<note id="5"> 'Importancia' es un concepto algo complejo. Debemos diferenciar la importancia de los nodos seg&#250;n su centralidad (una importancia cuantitativa derivada del ARS) y la importancia que le otorgamos a los personajes (una importancia cualitativa, por ejemplo: protagonista, secundario, terciario, etc.). La correlaci&#243;n entre estos dos tipos de importancia no siempre se da, como demuestran Santa Mar&#237;a Fern&#225;ndez et al. en un estudio de 2020. Te recomiendo este art&#237;culo para explorar en profundidad las implicaciones de las medidas de centralidad: Santa Mar&#237;a Fern&#225;ndez, Teresa, Jos&#233; Calvo Tello, y Concepci&#243;n Mar&#237;a Jim&#233;nez Fern&#225;ndez. &#171;&#191;Existe correlaci&#243;n entre importancia y centralidad? Evaluaci&#243;n de personajes con redes sociales en obras teatrales de la Edad de Plata&#187;. Digital Scholarship in the Humanities 36, n.&#186; June (2020): i81-i88. <link target="https://doi.org/10.1093/llc/fqaa015">https://doi.org/10.1093/llc/fqaa015</link>.     </note></p>
</div>
    </body>
  </text>
</TEI>
