<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introducci&#243;n a la publicaci&#243;n web de archivos TEI con CETEIcean</title>
  <collection>lessons</collection>
  <layout>lesson</layout>
  <slug>publicar-archivos-tei-ceteicean</slug>
  <date>2021-12-14</date>
  <authors>Gabriel Calarco,Gimena del R&#237;o Riande</authors>
  <reviewers>Melissa Jerome,Aldo Barriente</reviewers>
  <editors>Joshua G. Ortiz Baco</editors>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/373</review-ticket>
  <difficulty>2</difficulty>
  <activity>transforming</activity>
  <topics>website</topics>
  <abstract>Esta lecci&#243;n te ense&#241;a los pasos necesarios para publicar en l&#237;nea un archivo de TEI usando CETEIcean</abstract>
  <avatar_alt>Grabado que representa distintas fuentes tipogr&#225;ficas</avatar_alt>
  <doi>10.46430/phes0056</doi>
</metadata>
  <text>
    <body><p><hi rend="bold">Nota:</hi> Para seguir este tutorial de forma comprensiva debes saber qu&#233; es el lenguaje de marcado XML-TEI desarrollado por la <link target="https://tei-c.org/">Text Encoding Initiative o TEI</link> y cu&#225;l es su funci&#243;n como lenguaje est&#225;ndar en la edici&#243;n digital acad&#233;mica de textos de Ciencias Sociales y Humanidades. Puedes encontrar recursos y tutoriales en espa&#241;ol sobre codificaci&#243;n de textos con TEI en <link target="https://tthub.io/">TTHub</link>. Asimismo, te recomendamos las partes 1 y 2 de la lecci&#243;n <link target="/es/lecciones/introduccion-a-tei-1">Introducci&#243;n a la codificaci&#243;n de textos en TEI de Nicol&#225;s Vaughan</link> y la <link target="https://tthub.io/aprende/introduccion-a-tei/">Introducci&#243;n a la Text Encoding Initiative de Susanna All&#233;s</link>. Durante este tutorial se utilizar&#225;n otros lenguajes inform&#225;ticos (como <link target="https://www.javascript.com/">JavaScript</link> y <link target="https://es.wikipedia.org/wiki/Hoja_de_estilos_en_cascada">CSS</link>), pero no es necesario tener conocimientos previos sobre su funcionamiento para utilizar <link target="https://github.com/TEIC/CETEIcean">CETEIcean</link>.</p>
<div n="2"><head>Introducci&#243;n y software que usaremos</head>
<p>Para quienes se inician en el uso de TEI, uno de los escollos m&#225;s comunes es que, una vez que se han codificado los textos con este lenguaje de marcado, es dif&#237;cil saber c&#243;mo hacer para publicarlos en l&#237;nea. Para ser visualizados en un navegador, los archivos XML-TEI deben ser transformados primero a <link target="https://es.wikipedia.org/wiki/HTML">HTML</link> mediante el uso de plantillas <link target="https://es.wikipedia.org/wiki/Extensible_Stylesheet_Language_Transformations">XSLT</link>. Sin embargo, este proceso requiere de conocimientos t&#233;cnicos y herramientas que no siempre se encuentran al alcance de todos los humanistas digitales, especialmente de quienes se acercan al uso de TEI por primera vez, de quienes a&#250;n no conocen en profundidad el manejo de software de edici&#243;n, o de quienes no cuentan con acceso a servidores propios. CETEIcean es un software de edici&#243;n digital que permite visualizar archivos XML-TEI en el navegador sin que necesitemos aplicarles una transformaci&#243;n XSLT.</p>
<p>Este tutorial te guiar&#225; a trav&#233;s de los pasos necesarios para publicar un archivo TEI en l&#237;nea utilizando CETEIcean, una librer&#237;a abierta escrita en el lenguaje de programaci&#243;n JavaScript. CETEIcean permite que los documentos TEI se muestren en un navegador web sin transformarlos primero a HTML. CETEIcean carga el archivo TEI din&#225;micamente en el navegador y cambia el nombre de los elementos de TEI por otros en HTML, de tal forma que estos nos permitan visualizar en el navegador web los fen&#243;menos textuales que marcamos en nuestros archivos usando TEI.</p>
<p>En primer lugar, una aclaraci&#243;n sobre la visualizaci&#243;n de tu trabajo: el m&#233;todo por defecto de CETEIcean para mostrar archivos TEI consiste en cargar los archivos desde otra ubicaci&#243;n. Sin embargo, no todos los navegadores te permitir&#225;n cargar los archivos si estos se encuentran almacenados en tu computadora. Puedes hacer el intento, pero si eso no funciona, tendr&#225;s que generar un servidor local, colocar los archivos en un servidor en l&#237;nea, o utilizar un editor de c&#243;digo con funciones de previsualizaci&#243;n. Para el caso de este tutorial, seguiremos esta &#250;ltima opci&#243;n, ya que usaremos el editor <link target="https://atom.io">Atom</link>, con el plug-in <code type="inline">atom-html-preview</code>. No obstante, existen otras opciones libres para editar archivos TEI y generar previsualizaciones de HTML, como <link target="http://www.jedit.org/">jEdit</link> o <link target="https://code.visualstudio.com/">Visual Studio Code</link>, y versiones propietarias como <link target="https://www.oxygenxml.com/">Oxygen</link>.</p>
<p>Deber&#225;s entonces descargar e instalar <link target="https://atom.io">Atom</link> antes de continuar con este tutorial. Con Atom ya funcionando, instala el plug-in <code type="inline">atom-html-preview</code> (creado por Kyle J. Harms) que podr&#225;s encontrar abriendo el men&#250; de opciones de Atom (file &gt; settings o cntrl+). En la pantalla de "Settings" ve a la pesta&#241;a "Install" y en el cuadro de di&#225;logo introudce <code type="inline">atom-html-preview</code>. Cuando aparezca el plug-in que estamos buscando en la lista de resultado debes hacer clic en el bot&#243;n azul que dice "Install":</p>
<figure><desc>Proceso de instalaci&#243;n del plug-in de Atom para previsualizar archivos en HTML</desc><graphic url="publicar-archivos-tei-ceteicean1.png"/></figure>
<p>Usaremos como texto de prueba la cr&#243;nica conocida como <emph>La Argentina Manuscrita</emph>, del hispano-guaran&#237; <link target="https://es.wikipedia.org/wiki/Ruy_D%C3%ADaz_de_Guzm%C3%A1n">Ruy D&#237;az de Guzm&#225;n</link>. Este texto del siglo XVII hace uso del top&#243;nimo Argentina por primera vez, para referirse a los extensos territorios del Cono Sur que compon&#237;an el R&#237;o de la Plata y sus adyacencias, es decir, territorios de la actual Argentina, Paraguay, Uruguay, sur de Brasil y Bolivia. Puedes encontrar una edici&#243;n digital completa del texto en: <link target="http://hdlab.space/La-Argentina-Manuscrita">http://hdlab.space/La-Argentina-Manuscrita</link>.</p>
<p>Comenzaremos con un archivo simple (aunque un tanto extenso) en formato TEI P5, que queremos hacer visible en un navegador web: <link target="http://hdlab.space/La-Argentina-Manuscrita/assets/Ruy_Diaz-La_argentina_manuscrita.tei.xml"><code type="inline">Ruy_Diaz-La_Argentina_Manuscrita.xml</code></link>. Para descargar el archivo haz clic derecho sobre el enlace de descarga y selecciona la opci&#243;n 'Save Link As...'.</p>
</div><div n="2"><head>Paso 1: Crear una estructura para nuestros archivos</head>
<p>Comenzaremos por establecer una estructura para nuestros archivos, es decir, una carpeta contenedora con el nombre 'tutorial_es' con las subcarpetas y archivos que te indicaremos a continuaci&#243;n. Puedes descargar el directorio completo del repositorio <link target="https://github.com/TEIC/CETEIcean">CETEIcean en GitHub</link> y trabajar en la carpeta 'tutorial_es', o puedes descargar los archivos individualmente, siempre y cuando mantengan la misma estructura que en GitHub, que es la siguiente:</p>
<pre><code xml:id="code_publicar-archivos-tei-ceteicean_0" type="block" corresp="code_publicar-archivos-tei-ceteicean_0.txt"></code></pre>
<p>El siguiente paso ser&#225; crear un archivo nuevo en Atom con el nombre <code type="inline">index.html</code>. Para ello puedes ir a File &gt; New o utilizar el atajo Ctrl + N (Cmd + N en Mac). En este documento deber&#225;s copiar y pegar el siguiente contenido:</p>
<pre><code class="language-html" xml:id="code_publicar-archivos-tei-ceteicean_1" type="block" corresp="code_publicar-archivos-tei-ceteicean_1.txt"></code></pre>
<p>A continuaci&#243;n, debes guardar este archivo en el directorio ra&#237;z (en nuestro caso la carpeta 'tutorial_es'); recuerda que su t&#237;tulo debe ser <code type="inline">index.html</code>. Este archivo servir&#225; como una estructura en la cual pondremos las instrucciones para mostrar nuestros archivos TEI. Al igual que en TEI, los archivos HTML tienen un encabezado, llamado <code type="inline">head</code> y un cuerpo de texto, llamado <code type="inline">body</code>. A lo largo de este tutorial usaremos este archivo para agregar enlaces a nuestra CSS (<emph>Cascading Style Sheet</emph>, tambi&#233;n llamada <emph>hoja de estilo</emph> u <link target="https://es.wikipedia.org/wiki/Hoja_de_estilos_en_cascada"><emph>hoja de estilos en cascada</emph></link> en espa&#241;ol) y a nuestros archivos de JavaScript, y escribiremos un poco de JavaScript para lograr una visualizaci&#243;n de nuestro documento TEI que refleje los aspectos del marcado que nos interesa destacar. En la primera l&#237;nea vac&#237;a del <code type="inline">&lt;head&gt;</code>, escribe:</p>
<pre><code class="language-html" xml:id="code_publicar-archivos-tei-ceteicean_2" type="block" corresp="code_publicar-archivos-tei-ceteicean_2.txt"></code></pre>
<p>Esto conectar&#225; nuestro archivo CSS con nuestra p&#225;gina HTML, d&#225;ndole acceso a las directivas de estilo que este contiene (solo hay unas pocas, pero agregaremos m&#225;s). A continuaci&#243;n, incluiremos la librer&#237;a de CETEIcean, a&#241;adiendo la siguiente l&#237;nea luego del enlace a la hoja de estilo:</p>
<pre><code class="language-html" xml:id="code_publicar-archivos-tei-ceteicean_3" type="block" corresp="code_publicar-archivos-tei-ceteicean_3.txt"></code></pre>
<p>En este punto nuestro archivo <code type="inline">index.html</code> debe tener el siguiente contenido:</p>
<pre><code class="language-html" xml:id="code_publicar-archivos-tei-ceteicean_4" type="block" corresp="code_publicar-archivos-tei-ceteicean_4.txt"></code></pre>
</div><div n="2"><head>Paso 2: Cargar y previsualizar el archivo TEI</head>
<p>Ahora ya estamos listos para cargar el archivo TEI. Para eso, debemos a&#241;adir una secuencia de comandos inform&#225;ticos conocida habitualmente por su nombre en ingl&#233;s <link target="https://es.wikipedia.org/wiki/Script">"script"</link>, que nos permitir&#225; recuperar el documento TEI de <emph>La Argentina manuscrita</emph> en nuestro archivo HTML (el que estamos editando en este momento). Copia y pega las siguientes l&#237;neas de c&#243;digo a continuaci&#243;n del &#250;ltimo elemento que agregamos:</p>
<pre><code class="language-html" xml:id="code_publicar-archivos-tei-ceteicean_5" type="block" corresp="code_publicar-archivos-tei-ceteicean_5.txt"></code></pre>
<p>No necesitas ser un experto en JavaScript para usar CETEIcean, pero aprender su funcionamiento b&#225;sico puede ser de utilidad. Si deseas incluir funciones avanzadas, tendr&#225;s que aprender JavaScript. En la red para desarrolladores de Mozilla puedes encontrar una excelente <link target="https://developer.mozilla.org/es/docs/Web/JavaScript/Guide">gu&#237;a de JavaScript</link> en varias lenguas, incluido el espa&#241;ol. Para el caso de este tutorial, solo te contaremos que las l&#237;neas de c&#243;digo que a&#241;adimos hacen varias cosas:</p>
<ul>
<li>En primer lugar, una variable <code type="inline">c</code> es definida como un nuevo objeto CETEI. Esto har&#225; el trabajo de cargar y darle estilo a nuestro archivo fuente</li>
<li>A continuaci&#243;n, le indicaremos a <code type="inline">c</code> que cargue el archivo fuente y lo convierta en HTML (<link target="https://lenguajejs.com/webcomponents/nativos/bases-custom-elements/">Custom Elements</link>), y tambi&#233;n le daremos una funci&#243;n que tomar&#225; los resultados y los pondr&#225; en el <code type="inline">&lt;body&gt;</code>de nuestro archivo <code type="inline">index.html</code></li>
<li>En la l&#237;nea <code type="inline">document.getElementsByTagName('body')</code> se llama a una funci&#243;n que busca todos los elementos <code type="inline">&lt;body&gt;</code> y los devuelve en la forma de una lista ordenada (una lista en la cual se puede acceder a los miembros que la componen a trav&#233;s de su n&#250;mero &#237;ndice)</li>
<li>En nuestro ejemplo solo hay un elemento <code type="inline">&lt;body&gt;</code>, por lo que obtendremos una sola entrada en nuestra lista, con el &#237;ndice 0. Este &#237;tem, que es un elemento HTML, queda adjunto como un hijo del documento TEI que acabamos de cargar</li>
</ul>
<p>En este punto deber&#237;as poder ejecutar una previsualizaci&#243;n del HTML desde el men&#250; "Packages" y as&#237; ver tu documento. Vamos a previsualizarlo con el plug-in que instalamos al inicio de este tutorial. Entonces, ve a la pesta&#241;a packages del men&#250; superior y elige en el men&#250; desplegable la opci&#243;n "Preview HTML / Enable preview":</p>
<figure><desc>Men&#250; de opciones para previsualizar archivos en HTML en Atom</desc><graphic url="publicar-archivos-tei-ceteicean2.png"/></figure>
<figure><desc>Primera previsualizaci&#243;n de nuestro archivo TEI con CETEIcean</desc><graphic url="publicar-archivos-tei-ceteicean3.png"/></figure>
<p>Si no est&#225;s usando Atom, puedes hacer esto mismo colocando tus archivos en un servidor web. Si conoces el funcionamiento de GitHub, puedes utilizar GitHub Pages (aqu&#237; tienes un <link target="https://guides.github.com/features/pages/">tutorial</link> en ingl&#233;s) y crear un repositorio. Si tienes instalado Python en tu computadora, puedes ejecutar un servidor web simple en el directorio de este tutorial (en nuestro caso la carpeta 'tutorial_es'). Con este fin debes abrir la consola de comandos y comprobar que te encuentras en la carpeta deseada (en caso contrario puedes navegar hasta esa carpeta con el comando <code type="inline">cd + url del archivo</code>, por ejemplo: <code type="inline">cd Documentos/tutorial_es</code> ) e ingresar el comando:</p>
<pre><code class="language-bash" xml:id="code_publicar-archivos-tei-ceteicean_6" type="block" corresp="code_publicar-archivos-tei-ceteicean_6.txt"></code></pre>
<p>Tambi&#233;n es posible que tu computadora ya tenga los programas necesarios para ejecutar un servidor web, o puedes instalar <link target="https://www.mamp.info">MAMP</link> o alg&#250;n otro programa similar. El objetivo de crear este servidor es vusualizar nuestros archivos TEI en el navegador como si estos se trataran de un contenido online.</p>
</div><div n="2"><head>Paso 3: Mejorar la visualizaci&#243;n de nuestro archivo</head>
<p>Esta primera visualizaci&#243;n tendr&#225; varios errores que deberemos arreglar. Para eso volveremos a nuestro trabajo en Atom. Comenzaremos por a&#241;adir una hoja de estilo para manipular los elementos de TEI en nuestro archivo y luego a&#241;adiremos funciones de CETEIcean para hacer modificaciones m&#225;s complejas. Si todav&#237;a no le has echado un vistazo al archivo fuente XML, es un buen momento para hacerlo, para ver lo que CETEIcean ya est&#225; haciendo y lo que no. Podemos observar que el contenido del <code type="inline">teiHeader</code> no est&#225; siendo mostrado, como tampoco los comienzos de p&#225;gina y comienzos de l&#237;neas. Los elementos <code type="inline">div</code> y <code type="inline">p</code>, por su parte, est&#225;n siendo formateados como bloques y las notas aparecen en el cuerpo del texto entre par&#233;ntesis. Con un poco de investigaci&#243;n sobre las posibilidades de codificaci&#243;n de la TEI, ver&#225;s que hay siete tipos de elementos TEI en el <code type="inline">body</code> de nuestro documento fuente:  </p>
<ul>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-div.html">div</link></li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-head.html">head</link></li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-note.html">note</link></li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-p.html">p</link></li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-persName.html">persName</link></li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-placeName.html">placeName</link></li>
<li><link target="https://tei-c.org/release/doc/tei-p5-doc/en/html/ref-rs.html">rs</link></li>
</ul>
<p>Algunos de estos elementos pueden no necesitar estilos o comportamientos especiales, pero otros definitivamente lo necesitar&#225;n.
Echa un vistazo al archivo <code type="inline">tei.css</code> de la carpeta <code type="inline">css/</code>. Como puedes ver, por ahora tiene solo unas pocas reglas:</p>
<pre><code class="language-css" xml:id="code_publicar-archivos-tei-ceteicean_7" type="block" corresp="code_publicar-archivos-tei-ceteicean_7.txt"></code></pre>
<p>Algunas cosas para tener en cuenta: los nombres de los elementos en nuestros selectores CSS tienen el prefijo <code type="inline">tei-</code>. Esto es necesario para que CETEIcean pueda convertir los elementos de TEI en elementos personalizados (<link target="https://lenguajejs.com/webcomponents/nativos/bases-custom-elements/">Custom Elements</link>) de HTML. Estas reglas establecen que los elementos <code type="inline">&lt;div&gt;</code> se visualicen como bloques (empiezan en una nueva l&#237;nea y terminan con un corte); lo mismo sucede con los p&#225;rrafos, que tambi&#233;n tienen un espaciado superior e inferior.</p>
<p>Decidir qu&#233; estilos aplicar a los elementos que todav&#237;a no tienen reglas de estilo puede no resultar sencillo, pero podemos comenzar eligiendo algunos de los casos m&#225;s simples. En nuestro documento fuente se se&#241;alan los encabezados de los cap&#237;tulos y de las diferentes secciones mediante el elemento <code type="inline">&lt;head&gt;</code>. Probablemente desearemos que estos encabezados se destaquen del cuerpo del texto, para lograrlo podemos utilizar CSS para darles un estilo diferente. Ahora debes abrir el archivo <code type="inline">tei.css</code> (que encontrar&#225;s en la carpeta "css") en Atom y al final del documento agregar las siguientes l&#237;neas:</p>
<pre><code class="language-css" xml:id="code_publicar-archivos-tei-ceteicean_8" type="block" corresp="code_publicar-archivos-tei-ceteicean_8.txt"></code></pre>
<p>Ver&#225;s que esta no es una soluci&#243;n perfecta, ya que tenemos diferentes niveles de elementos <code type="inline">&lt;div&gt;</code>, y ser&#237;a apropiado que los encabezados de diferentes niveles tuvieran diferentes tama&#241;os para identificarlos. Debido a que los elementos <code type="inline">&lt;div&gt;</code> de nuestro archivo TEI no indican a qu&#233; nivel pertenecen, esto puede resultar dif&#237;cil de lograr con CSS.  Sin embargo, tambi&#233;n podemos utilizar los comportamientos (behaviors) de CETEIcean para dar formato.</p>
<p>En HTML, la convenci&#243;n es representar los diferentes niveles de encabezados con los elementos <code type="inline">h1</code>, <code type="inline">h2</code>, <code type="inline">h3</code>, etc&#233;tera (hasta <code type="inline">h6</code>). Podemos lograr esto utilizando un comportamiento. Para ello, en tu archivo <code type="inline">index.html</code> a&#241;ade lo siguiente entre la primera y la segunda l&#237;nea del c&#243;digo que se encuentra entre las etiquetas <code type="inline">&lt;script&gt;&lt;/script&gt;</code> (es decir, entre <code type="inline">"let c = new CETEI();"</code> y <code type="inline">"c.getHTML5('Ruy_Diaz-La_Argentina_Manuscrita.xml'&#8230;"</code>):</p>
<pre><code class="language-js" xml:id="code_publicar-archivos-tei-ceteicean_9" type="block" corresp="code_publicar-archivos-tei-ceteicean_9.txt"></code></pre>
<p>Esto crear&#225; un objeto Javascript y le asignar&#225; la variable <code type="inline">comportamientos</code>, que luego enlazaremos con el objeto <code type="inline">CETEI</code> que creamos antes, usando el m&#233;todo <code type="inline">addBehaviors</code> (que ya viene incluido en CETEIcean). En el interior de ese objeto tenemos una secci&#243;n etiquetada como &#8220;tei&#8221; (que es el prefijo para todos nuestros elementos personalizados), y dentro de esta se definen los comportamientos para los elementos. Cuando CETEIcean encuentra una coincidencia para el nombre de un elemento, como &#8220;head&#8221; (ten en cuenta que se utiliza el nombre de TEI sin el prefijo), aplica los comportamientos correspondientes.</p>
<p>Este nuevo comportamiento toma una funci&#243;n de JavaScript, lo que hace que el elemento sea procesado como un par&#225;metro (el <code type="inline">e</code>). Esto crea la variable <code type="inline">nivel</code>, que contiene el nivel de encabezamiento de la <code type="inline">&lt;tei-div&gt;</code> que contiene el <code type="inline">&lt;tei-head&gt;</code>, crea un elemento <code type="inline">&lt;h[nivel]&gt;</code> con el nivel correspondiente, y copia el contenido del elemento original en el nuevo elemento de encabezado. CETEIcean esconder&#225; el contenido de <code type="inline">&lt;tei-head&gt;</code> y, en cambio, mostrar&#225; el contenido del nuevo elemento de encabezado. Ten en cuenta que este c&#243;digo tiene un problema potencial: un documento con muchas divisiones anidadas unas dentro de otras podr&#237;a llegar a producir un elemento de encabezado superior al l&#237;mite admitido por HTML (por ejemplo un elemento <code type="inline">&lt;h7&gt;</code>). Nuestro documento fuente no tiene m&#225;s de dos niveles de anidamiento, pero para utilizarlo en otras fuentes ser&#237;a prudente revisar que el anidamiento no supere el nivel del elemento <code type="inline">&lt;h6&gt;</code>.</p>
<p>Si en este punto previsualizamos nuestro HTML en Atom, obtendremos el siguiente el resultado:</p>
<figure><desc>Previsualizaci&#243;n de nuestro archivo TEI con estilo para los t&#237;tulos</desc><graphic url="publicar-archivos-tei-ceteicean4.png"/></figure>
<p>Con esta previsualizaci&#243;n hemos mejorado notablemente la presentaci&#243;n de nuestro documento, pero las notas de la edici&#243;n todav&#237;a dificultan la lectura del texto. Para solucionar este problema agregaremos un comportamiento m&#225;s a nuestro script. Sin embargo, para lograr este objetivo, tendremos que usar una secuencia de comandos un tanto m&#225;s extensa y compleja que la anterior. Copia y pega el siguiente texto entre las l&#237;neas <code type="inline">"tei": {</code> y <code type="inline">"head": function(e) {</code> que se encuentran en el segundo elemento <code type="inline">&lt;script&gt;</code> de nuestro documento <code type="inline">index.html</code>:</p>
<pre><code class="language-js" xml:id="code_publicar-archivos-tei-ceteicean_10" type="block" corresp="code_publicar-archivos-tei-ceteicean_10.txt"></code></pre>
<p>A los fines de completar este tutorial no es necesario entender el funcionamiento de cada l&#237;nea de este comportamiento. Sin embargo, si observas el resultado de la previsualizaci&#243;n, notar&#225;s que al incluirlo las notas aparecen al final del texto, hipervinculadas con sus respectivas referencias:</p>
<figure><desc>Previsualizaci&#243;n de nuestro archivo TEI con estilo para las notas</desc><graphic url="publicar-archivos-tei-ceteicean5.png"/></figure>
</div><div n="2"><head>Paso 4: Para seguir trabajando con CETEIcean</head>
<p>CETEIcean posee una cantidad de comportamientos integrados que puedes reemplazar o desactivar al agregarles valores. Si, por ejemplo, deseas mostrar el contenido del TEI Header (que est&#225; oculto por defecto), puedes a&#241;adir la siguiente l&#237;nea a nuestro <code type="inline">&lt;script&gt;</code> debajo de <code type="inline">"tei": {</code>:</p>
<pre><code class="language-js" xml:id="code_publicar-archivos-tei-ceteicean_11" type="block" corresp="code_publicar-archivos-tei-ceteicean_11.txt"></code></pre>
<p>Si haces esto, puede que desees agregar estilos de CSS o comportamientos para elegir la forma en la que se visualizar&#225; el contenido del TEI Header en el navegador.</p>
<p>En este tutorial no agotamos todas las posibilidades para la presentaci&#243;n de nuestro documento fuente. Te invitamos a que contin&#250;es experimentando por tu cuenta en las diferentes formas en las que un marcado de TEI puede visualizarse en un navegador usando CETEICean. Puedes encontrar m&#225;s informaci&#243;n en <link target="http://teic.github.io/CETEIcean/">CETEIcean</link>.</p>
</div><div n="2"><head>Referencias</head>
<p>All&#233;s Torrent, Susanna; del Rio Riande, Gimena, y Calarco, Gabriel. 2018-. <emph>TTHub. Text Technologies Hub. Recursos sobre tecnolog&#237;as del texto y edici&#243;n digital</emph>. <link target="https://tthub.io/">https://tthub.io/</link></p>
<p>All&#233;s Torrent, Susanna. 2019. "Introducci&#243;n a la Text Encoding Initiative". <emph>TTHUB. Text Technologies Hub: Recursos sobre tecnolog&#237;as del texto y edici&#243;n digital</emph>. <link target="https://tthub.io/aprende/introduccion-a-tei/">https://tthub.io/aprende/introduccion-a-tei/</link></p>
<p>Atom. A hackable text editor for the 21st Century. <link target="https://atom.io">https://atom.io</link></p>
<p>Cayless, Hugh y Viglianti, Raffaele. CETEIcean. <link target="http://teic.github.io/CETEIcean/">http://teic.github.io/CETEIcean/</link></p>
<p>del Rio Riande, Gimena; De Le&#243;n, Romina, y Hern&#225;ndez, Nidia. 2019. <emph>Historia de la conquista del R&#237;o de la Plata o La Argentina manuscrita</emph>. <link target="http://hdlab.space/La-Argentina-Manuscrita/">http://hdlab.space/La-Argentina-Manuscrita/</link></p>
<p>Jedit. Programmer's text editor. Stable Version: 5.6.0. <link target="http://www.jedit.org/">http://www.jedit.org/</link></p>
<p>Oxygen. XML Editor. <link target="https://www.oxygenxml.com/">https://www.oxygenxml.com/</link></p>
<p>Vaughan, Nicol&#225;s. 2021. "Introducci&#243;n a la codificaci&#243;n de textos en TEI (parte 1)", <emph>Programming Historian en espa&#241;ol</emph> 5 (2021), <link target="https://doi.org/10.46430/phes0053">https://doi.org/10.46430/phes0053</link></p>
<p>Visual Studio Code. <link target="https://code.visualstudio.com/">https://code.visualstudio.com/</link></p>
</div></body>
  </text>
</TEI>
