<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="limpieza-de-datos-con-OpenRefine">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Limpieza de datos con OpenRefine</title>
  <author type="original_author"><persName>Seth van Hooland</persName><persName>Ruben Verborgh</persName><persName>Max De Wilde</persName></author><editor type="reviewers"><persName>Patrick Burns</persName><persName>Nora McGregor</persName></editor><author type="translators">Mar&#237;a-Jes&#250;s Colmenero-Ruiz</author><editor type="translation-reviewers"><persName>Antonio Rojas Castro</persName><persName>Luisina Silva</persName></editor><editor type="editors">Adam Crymble</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0017</idno><date type="published">08/05/2013</date><date type="translated">05/17/2017</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#cleaning-data-with-openrefine"/>.</p><p>There are other translations: <ref target="#nettoyer-ses-donnees-avec-openrefine #limpar-dados-openrefine"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Este tutorial se enfoca en c&#243;mo los acad&#233;micos pueden diagnosticar y tomar acciones para asegurar la precisi&#243;n de sus datos.</p></abstract><textClass><keyword xml:lang="en">data-manipulation</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Objetivos de la lecci&#243;n</head>
<p>No conf&#237;es ciegamente en tus datos. Ese es el mensaje clave de este tutorial que se centra en mostrar c&#243;mo los investigadores pueden diagnosticar y proceder sobre la exactitud de los datos. En esta lecci&#243;n aprender&#225;s los principios y la pr&#225;ctica de la limpieza de datos,  as&#237; como la forma de usar <link target="http://openrefine.org/"><emph>OpenRefine</emph></link> para realizar cuatro tareas esenciales que te ayudar&#225;n a limpiar tus datos:</p>
<ol>
<li>Eliminar registros duplicados</li>
<li>Separar varios valores contenidos en el mismo campo</li>
<li>Analizar la distribuci&#243;n de valores a lo largo de un conjunto de datos</li>
<li>Agrupar diferentes representaciones de la misma realidad</li>
</ol>
<p>Estos pasos se ilustran con la ayuda de una serie de ejercicios basados en una colecci&#243;n de metadatos del <link target="https://powerhouse.com.au/">Museo Powerhouse</link>, que demuestran c&#243;mo los m&#233;todos (semi-)automatizados pueden ayudarte a corregir los errores que puedan presentar tus datos.</p>
</div>
      <div type="2"><head>&#191;Por qu&#233; los historiadores deben preocuparse por la calidad de los datos?</head>
<p>Los registros duplicados, los valores vac&#237;os y los formatos inconsistentes son fen&#243;menos para los que debemos estar preparados cuando se usan conjuntos de datos hist&#243;ricos. Esta lecci&#243;n te ense&#241;ar&#225; a descubrir las inconsistencias en los datos incluidos en una hoja de c&#225;lculo o en una base de datos. A medida que incrementamos el compartir, agregar y reutilizar datos en la web, los historiadores tendr&#225;n que responder a los problemas de calidad de los datos que inevitablemente aparecer&#225;n. Usando un programa llamado <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link>, podr&#225;s identificar f&#225;cilmente errores sistem&#225;ticos tales como celdas en blanco, duplicados, inconsistencias de ortograf&#237;a, etc. <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link> no s&#243;lo te permite diagnosticar r&#225;pidamente la exactitud de tus datos, sino tambi&#233;n actuar sobre ciertos errores de forma automatizada.</p>
</div>
      <div type="2"><head>Descripci&#243;n de la herramienta: OpenRefine</head>
<p>Tiempo atr&#225;s los historiadores debieron confiar en los especialistas en tecnolog&#237;as de la informaci&#243;n para diagnosticar la calidad de los datos y ejecutar tareas de limpieza. Estas tareas requer&#237;an el uso de programas de ordenador personalizados cuando se trabajaba con conjuntos de datos de gran tama&#241;o. Por suerte, el advenimiento de las herramientas de transformaci&#243;n interactiva de datos (<emph>Interactive Data Transformation</emph> - IDTs) permiten realizar actualmente  operaciones r&#225;pidas y econ&#243;micas sobre grandes cantidades de datos, incluso realizadas por profesionales que carecen de amplias habilidades t&#233;cnicas.</p>
<p>Las IDTs se asemejan a los programas de hojas de c&#225;lculo de escritorio con los que todos estamos familiarizados, con los que comparten algunas funcionalidades. Por ejemplo, puedes utilizar una aplicaci&#243;n como Microsoft Excel para ordenar los datos bas&#225;ndote en filtros num&#233;ricos, alfab&#233;ticos y desarrollados a medida, lo que te permite detectar errores con mayor facilidad. Configurar estos filtros en una hoja de c&#225;lculo puede resultar dif&#237;cil, ya que son una funcionalidad secundaria. De forma gen&#233;rica se puede decir que las hojas de c&#225;lculo est&#225;n dise&#241;adas para trabajar en filas y celdas individuales mientras que las IDTs operan en grandes rangos de datos a la vez. Estas &#8220;super-hojas de c&#225;lculo&#8221; ofrecen una interfaz integrada y f&#225;cil de usar a trav&#233;s de la cual los usuarios finales pueden detectar y corregir errores.</p>
<p>En los &#250;ltimos a&#241;os se han desarrollado varias herramientas de prop&#243;sito general para la transformaci&#243;n interactiva de datos, tales como <link target="http://control.cs.berkeley.edu/abc/"><emph>Potter&#8217;s Wheel ABC</emph></link> y <link target="http://vis.stanford.edu/papers/wrangler/"><emph>Wrangler</emph></link> (actualmente <link target="https://www.trifacta.com/products/wrangler/"><emph>Trifacta Wrangler</emph></link>). Aqu&#237; nos centraremos espec&#237;ficamente en <link target="http://openrefine.org/"><emph>OpenRefine</emph></link> (anteriormente Freebase Gridworks y Google Refine) pues, en opini&#243;n de los autores, es la herramienta m&#225;s f&#225;cil de usar para procesar y limpiar eficientemente grandes cantidades de datos en una interfaz basada en navegador.</p>
<p>Adem&#225;s del perfilado de datos y las operaciones de limpieza, las extensiones de <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link> permiten a los usuarios identificar conceptos en texto no estructurado, un proceso denominado <link target="https://es.wikipedia.org/wiki/Reconocimiento_de_nombres_de_entidades">reconocimiento de nombres de entidades</link> (<link target="http://en.wikipedia.org/wiki/Named-entity_recognition"><emph>named-entity recognition</emph></link>, NER, en ingl&#233;s), pudiendo tambi&#233;n cotejar<ref type="footnotemark" target="#1"/> sus propios datos con bases de conocimiento existentes. As&#237;, <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link> puede ser una pr&#225;ctica herramienta para vincular datos con conceptos y autoridades que ya han sido publicadas en la Web por instituciones como la <link target="http://www.loc.gov/index.html"><emph>Biblioteca del Congreso de los EEUU</emph></link> u <link target="http://www.oclc.org/home.en.html">OCLC</link>. La limpieza de datos es un requisito previo para estos pasos; la tasa de &#233;xito del NER y un proceso de coincidencia fruct&#237;fera entre tus datos y las autoridades externas depende de tu capacidad para hacer tus datos tan coherentes como sea posible.</p>
</div>
      <div type="2"><head>Descripci&#243;n del ejercicio Powerhouse Museum</head>
<p>El Museo Powerhouse de Sydney ofreci&#243; la exportaci&#243;n gratuita de metadatos de su colecci&#243;n en su <link target="https://powerhouse.com.au/">sitio web</link>. Este museo es uno de los mayores de ciencia y tecnolog&#237;a de todo el mundo, proporcionando acceso a casi 90.000 objetos, que van desde m&#225;quinas de vapor a cristaler&#237;a fina y desde  alta costura a chips de ordenador.</p>
<p>El museo dio a conocer activamente su colecci&#243;n en l&#237;nea y puso la mayor&#237;a de sus datos a libre disposici&#243;n. Anteriormente, se pod&#237;a descargar del sitio web del museo un archivo de texto separado por tabuladores llamado <code type="inline">phm-collection.tsv</code> y abrirlo como hoja de c&#225;lculo. El archivo descomprimido (58MB) contiene metadatos b&#225;sicos (17 campos) para 75.823 objetos, publicados bajo una licencia <link target="https://creativecommons.org/licenses/by-sa/2.5/es/">Creative Commons de Reconocimiento-Compartir-Igual 2.5</link>. En este tutorial usaremos una copia de los datos que hemos archivado para descargarlos (en un momento). Esto asegura que si el Museo Powerhouse actualiza los datos, te seguir&#225; siendo posible el seguir esta Lecci&#243;n.</p>
<p>A trav&#233;s del proceso de perfilado de datos y de limpieza, el estudio de caso se centrar&#225; espec&#237;ficamente en el campo <code type="inline">Categor&#237;as</code>, que se rellena con t&#233;rminos del Tesauro de nombres de objetos del museo Powerhouse (PONT). PONT reconoce el uso y la ortograf&#237;a de Australia, y refleja de forma muy directa las fortalezas de la colecci&#243;n. En la colecci&#243;n encontrar&#225;s las mejores representaciones de la historia social y las artes decorativas y, en comparaci&#243;n, pocos nombres de objetos relacionados con las bellas artes y la historia natural.</p>
<p>Los t&#233;rminos del campo Categor&#237;as constituyen lo que llamamos un vocabulario controlado. Un vocabulario controlado consiste en palabras clave que describen el contenido de una colecci&#243;n usando un n&#250;mero limitado de t&#233;rminos, y a menudo es un punto de entrada clave en los conjuntos de datos utilizados por los historiadores en las bibliotecas, archivos y museos. Por esta raz&#243;n vamos a prestar especial atenci&#243;n al campo 'Categor&#237;as'. Una vez que se han limpiado los datos, deber&#237;a ser posible reutilizar los t&#233;rminos del vocabulario controlado para encontrar informaci&#243;n adicional sobre ellos en otros sitios en l&#237;nea, lo que se conoce como creaci&#243;n de <link target="https://es.wikipedia.org/wiki/Datos_enlazados">datos enlazados</link>.</p>
<div type="3"><head>Comenzando: instalaci&#243;n de OpenRefine e importaci&#243;n de datos</head>
<p><link target="http://openrefine.org/#download_openrefine">Descarga <emph>OpenRefine</emph></link> y sigue las instrucciones de instalaci&#243;n. <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link> funciona en todas las plataformas: Windows, Mac y Linux. <link title="OpenRefine" target="http://openrefine.org"><emph>OpenRefine</emph></link> se abrir&#225; en tu navegador, pero es importante se&#241;alar que la aplicaci&#243;n se ejecuta localmente y que tus datos no se almacenar&#225;n en l&#237;nea. Los archivos de datos est&#225;n disponibles <link target="/assets/phm-collection.tsv">en GitHub</link> o en nuestro <link target="http://data.freeyourmetadata.org/powerhouse-museum/">sitio web FreeYourMetadata</link>, que ser&#225;n los que se utilizar&#225;n a lo largo de este tutorial. Descarga el archivo <code type="inline">phm-collection.tsv</code> antes de continuar.</p>
<blockquote>
<p>Nota de la traductora: Open Refine se instala por defecto en ingl&#233;s. Para usarlo en espa&#241;ol s&#243;lo necesitas cambiar la configuraci&#243;n del lenguaje. Pulsa <hi rend="bold">Language settings</hi> y se mostrar&#225; en la ventana un desplegable donde podr&#225;s escoger el espa&#241;ol. Pulsa <hi rend="bold">Change language</hi> y la p&#225;gina te dir&#225; que necesita refrescarse para aplicar los cambios. Haz clic en <hi rend="bold">Aceptar</hi> y la p&#225;gina y el resto del programa aparecer&#225;n en espa&#241;ol.</p>
</blockquote>
<p>En la p&#225;gina de inicio de <emph>OpenRefine</emph>, crea un nuevo proyecto utilizando el archivo de datos descargado y haz clic en '<hi rend="bold">Siguiente</hi>'. De forma predeterminada, la primera l&#237;nea se analizar&#225; correctamente como el nombre de una columna, pero es necesario desmarcar la casilla de verificaci&#243;n 'Las comillas se usan para agrupar celdas que contienen separadores de columna', ya que las comillas dentro del archivo no tienen ning&#250;n significado para <emph>OpenRefine</emph>. Ahora haz clic en '<hi rend="bold">Crear proyecto</hi>'. Si todo va bien, ver&#225;s 75.814 filas. Como alternativa, puedes descargarte directamente el <link target="http://data.freeyourmetadata.org/powerhouse-museum/phm-collection.google-refine.tar.gz">proyecto inicial de <emph>OpenRefine</emph></link>.</p>
<p>El conjunto de datos del museo Powerhouse est&#225; formado por metadatos detallados de todos los objetos de la colecci&#243;n, incluyendo t&#237;tulo, descripci&#243;n, varias categor&#237;as a las que pertenece el objeto, informaci&#243;n de procedencia y un v&#237;nculo persistente al objeto en el sitio web del museo. Para tener una idea de a qu&#233; objeto corresponden los metadatos simplemente haz clic en el v&#237;nculo persistente y se abrir&#225; el sitio web.<ref type="footnotemark" target="#2"/></p>
<p>{% include figure.html caption="Figura 1: Captura de pantalla de un Objeto de Muestra del sitio web del Museo Powerhouse" filename="en-or-cleaning-data-with-openrefine-01.png" %}</p>
</div><div type="3"><head>Conoce tus datos</head>
<p>Lo primero que debes hacer es echar un vistazo general y conocer tus datos. Puedes inspeccionar los diferentes valores de datos mostr&#225;ndolos en <code type="inline">facetas</code>. Se podr&#237;a considerar una <link target="https://es.wikipedia.org/wiki/B%C3%BAsqueda_por_facetas">faceta</link> como una lente a trav&#233;s de la cual se visualiza un subconjunto espec&#237;fico de los datos, basado en un criterio de su elecci&#243;n. Haz clic en el tri&#225;ngulo situado delante del nombre de la columna, selecciona Facetas y crea una faceta. Por ejemplo, intenta crear una faceta de <code type="inline">texto</code> o una faceta <code type="inline">num&#233;rica</code>, dependiendo de la naturaleza de los valores contenidos en los campos (los valores num&#233;ricos se muestran en color verde <ref type="footnotemark" target="#3"/>). Sin embargo, debes tener en cuenta que las facetas de texto son m&#225;s &#250;tiles en campos con valores redundantes (por ejemplo, Categor&#237;as); si al ejecutarse te aparece el error 'son muchas para mostrar', puedes optar por aumentar el l&#237;mite de recuento de opciones por encima de los 2.000 predeterminados, aunque un l&#237;mite demasiado alto puede enlentecer la aplicaci&#243;n (5.000 suele ser una opci&#243;n segura). Las facetas num&#233;ricas no tienen esta restricci&#243;n. Para m&#225;s opciones, selecciona <hi rend="bold">Facetas personalizadas</hi>: la faceta por blanco, por ejemplo, resulta &#250;til para saber cu&#225;ntos valores se rellenaron para cada campo. Las exploraremos m&#225;s adelante en los siguientes ejercicios.</p>
</div><div type="3"><head>Eliminar filas en blanco</head>
<p>Una cosa que notar&#225;s al crear una faceta num&#233;rica <ref type="footnotemark" target="#4"/> para la columna Record ID (Identificador del registro) es que tres filas est&#225;n vac&#237;as. Puedes encontrarlos deseleccionando la casilla Num&#233;rico, dejando s&#243;lo valores No-num&#233;ricos. En realidad, estos valores no est&#225;n realmente en blanco sino que contienen un solo car&#225;cter de espacio en blanco, que puede verse moviendo el cursor hasta donde deber&#237;a haber estado y haciendo clic en el bot&#243;n '<hi rend="bold">Editar</hi>' que aparece. Para eliminar estas filas, haz clic en el tri&#225;ngulo que se encuentra delante de la primera columna denominada '<hi rend="bold">Todas</hi>', selecciona '<hi rend="bold">Editar filas</hi>' y, a continuaci&#243;n, '<hi rend="bold">Eliminar todas las filas que encajen</hi>'. Cierra la faceta num&#233;rica para ver las restantes 75.811 filas.</p>
</div><div type="3"><head>Eliminar duplicados</head>
<p>Un segundo paso es detectar y eliminar duplicados. Estos pueden ser localizados clasific&#225;ndolos por un valor &#250;nico, como el Record ID (en este caso estamos asumiendo que el ID de registro deber&#237;a ser &#250;nico para cada entrada). La operaci&#243;n se puede realizar haciendo clic en el tri&#225;ngulo izquierdo de Record ID, luego eligiendo '<hi rend="bold">Ordenar</hi>' ... y seleccionando la vi&#241;eta '<hi rend="bold">n&#250;meros</hi>'. En <emph>OpenRefine</emph>, la clasificaci&#243;n es s&#243;lo una ayuda visual, a menos que hagas permanente el reordenamiento. Para ello, haz clic en el men&#250; Sort que aparece en la parte superior y selecciona '<hi rend="bold">Reordenar filas permanentemente</hi>'. Si olvidas hacer esto, obtendr&#225;s resultados impredecibles m&#225;s adelante en este tutorial.</p>
<p>Las filas id&#233;nticas son ahora adyacentes entre s&#237;. A continuaci&#243;n, dejaremos en blanco el Record ID de las filas que tienen el mismo ID de registro que la fila superior a ellos, marc&#225;ndolos como duplicados. Para ello, haz clic en el tri&#225;ngulo del campo Record ID, elije <hi rend="bold">Editar celdas</hi> &gt; <hi rend="bold">Vaciar hacia abajo</hi>. El mensaje de estado indica que la operaci&#243;n ha afectado a 84 columnas (si olvidaste reordenar las filas permanentemente, obtendr&#225;s s&#243;lo 19, si es as&#237;, deshaz la operaci&#243;n en la pesta&#241;a 'Deshacer / Rehacer' y vuelve al p&#225;rrafo anterior para asegurarte de que las filas se reordenan y no est&#225;n simplemente ordenadas). Elimina estas filas creando una faceta de '<hi rend="bold">celdas en blanco</hi>' en la columna Record ID ('<hi rend="bold">Facetas</hi>' &gt; '<hi rend="bold">Facetas personalizadas</hi>' &gt; '<hi rend="bold">Faceta por blanco</hi>'), seleccionando las 84 l&#237;neas en blanco haciendo clic en '<hi rend="bold">true</hi>' y quit&#225;ndolas usando el tri&#225;ngulo '<hi rend="bold">Todos</hi>' ('<hi rend="bold">Editar filas</hi>' &gt; '<hi rend="bold">Eliminar todas las filas que encajen</hi>'). Al cerrar la faceta, ver&#225;s 75.727 filas &#250;nicas.</p>
<p>Ten en cuenta que se necesita especial precauci&#243;n al eliminar duplicados. En el paso antes mencionado, suponemos que el conjunto de datos tiene un campo con valores &#250;nicos, lo que indica que la fila entera representa un duplicado. Esto no tiene porqu&#233; ser necesariamente el caso, por lo que se debe adoptar gran precauci&#243;n para verificar manualmente si la fila entera representa o no un duplicado.</p>
</div><div type="3"><head>Separar</head>
<p>Una vez eliminados los registros duplicados, podemos observar m&#225;s de cerca el campo <emph>Categor&#237;as</emph>. En promedio, a cada objeto se le han atribuido 2,25 categor&#237;as. Estas categor&#237;as est&#225;n contenidas dentro del mismo campo, separadas por barras verticales, el car&#225;cter '<code type="inline">|</code>'. El registro 9, por ejemplo, contiene tres: <code type="inline">Mineral samples|Specimens|Mineral Samples-Geological</code>. Para analizar en detalle el uso de las palabras clave, los valores del campo Categor&#237;as deben separarse en celdas individuales ayud&#225;ndonos con la barra vertical, expandiendo los 75.727 registros en 170.167 filas. Seleccione '<hi rend="bold">Editar celdas</hi>', '<hi rend="bold">Dividir celdas multi-valuadas</hi>', introduciendo '<hi rend="bold"><code type="inline">|</code></hi>' como el car&#225;cter separador de valores. <emph>OpenRefine</emph> te informa que tiene ahora 170.167 filas.</p>
<p>Es importante entender bien el paradigma filas/registros. Haz que la columna Record ID sea visible para ver qu&#233; est&#225; pasando. Puedes cambiar entre las vistas 'filas' y 'registros' haciendo clic en los enlaces con ese nombre que est&#225;n justo encima de los encabezados de las columnas. En la 'vista de filas', cada fila representa un Record ID y una sola categor&#237;a emparejados, permitiendo la manipulaci&#243;n de cada uno individualmente. La 'vista de registros' tiene una entrada para cada Record ID, que puede tener diferentes categor&#237;as en filas diferentes (agrupadas en gris o blanco), pero cada registro se manipula como un todo. Concretamente, ahora hay 170.167 asignaciones de categor&#237;a (filas), distribuidas en 75.736 items de la colecci&#243;n (registros). Quiz&#225;s notaste que hay 9 registros m&#225;s que los 75.727 originales, pero no te preocupes por esto de momento, regresaremos a esta peque&#241;a diferencia m&#225;s tarde.</p>
</div><div type="3"><head>Hacer facetas y agrupar</head>
<p>Una vez que el contenido de un campo ha sido separado correctamente, pueden aplicarse los filtros, las facetas y los cl&#250;steres para dar una visi&#243;n general r&#225;pida y sencilla de los cl&#225;sicos problemas con metadatos. Mediante la aplicaci&#243;n de la faceta personalizada '<code type="inline">faceta por blanco</code>', se pueden identificar inmediatamente los 461 registros que no tienen una categor&#237;a, lo que representa el 0,6% de la colecci&#243;n. La aplicaci&#243;n de una faceta de texto al campo Categor&#237;as permite obtener una visi&#243;n general de las 4.934 categor&#237;as diferentes utilizadas en la colecci&#243;n (el l&#237;mite predeterminado es de 2.000, puedes hacer clic en '<hi rend="bold">Establecer l&#237;mite de recuento de opciones</hi>' para aumentarlo a 5.000). Los encabezados pueden ordenarse alfab&#233;ticamente o por frecuencia ('conteo'), dando una lista de los t&#233;rminos m&#225;s utilizados para indexar la colecci&#243;n. Los tres t&#237;tulos principales son 'Numismatics' (8.041), 'Ceramics' (7.390) y 'Clothing and dress' (7.279).</p>
<p>Tras la aplicaci&#243;n de una faceta, <emph>OpenRefine</emph> propone agrupar facetas que han sido elegidas para ser agrupadas bas&#225;ndose en  varios m&#233;todos de similitud. Como muestra la Figura 2, el agrupamiento te permite resolver problemas relacionados con inconsistencias de casos, uso incoherente de la forma singular o plural y errores ortogr&#225;ficos sencillos. <emph>OpenRefine</emph> presenta los valores relacionados y propone fusionarlos en el valor m&#225;s frecuente. Selecciona los valores que desees agrupar seleccionando individualmente sus casillas o haciendo clic en '<hi rend="bold">Seleccionar todos</hi>' en la parte inferior, luego selecciona '<hi rend="bold">Unir seleccionados y reagrupar</hi>'.</p>
<p>{% include figure.html caption="Figura 2: Visi&#243;n general de algunas agrupaciones" filename="visionAgrupaciones.png" %}</p>
<p>El m&#233;todo de agrupaci&#243;n por defecto no es demasiado complejo, por eso no encuentra a&#250;n todos los grupos. Experimenta con diferentes m&#233;todos para ver qu&#233; resultados obtienen. No obstante, ten cuidado: algunos m&#233;todos son demasiado agresivos, de forma que podr&#237;as terminar agrupando valores que no est&#225;n relacionados. Ahora que los valores han sido agrupados individualmente, podemos volverlos a unir en una sola celda. Haz clic en el tri&#225;ngulo Categor&#237;as y elije <hi rend="bold">Editar celdas</hi>, <hi rend="bold">Unir celdas multi-valuadas</hi>, <hi rend="bold">Aceptar</hi>. Elije el car&#225;cter barra vertical (<code type="inline">|</code>) como separador. Las filas ahora se ven como antes, con un campo de Categor&#237;as de valor m&#250;ltiple.</p>
</div><div type="3"><head>Aplicaci&#243;n de transformaciones <emph>ad hoc</emph> mediante el uso de expresiones regulares</head>
<p>Como recordar&#225;s se produjo un aumento en el n&#250;mero de registros tras el proceso de separaci&#243;n: nueve registros aparecieron de la nada. Para encontrar la causa de esta disparidad, necesitamos retroceder en el tiempo hasta antes de que separ&#225;ramos las categor&#237;as en filas diferentes. Para ello, activa la ficha Deshacer/Rehacer a la derecha de la ficha Facetas/Filtros y obtendr&#225;s un historial de todas las acciones que realizaste desde la creaci&#243;n del proyecto. Selecciona el paso justo antes de 'Split multi-valued cells in column Categories'<ref type="footnotemark" target="#5"/> (Dividir celdas multi-valuadas en la columna categor&#237;as) (si has seguido nuestro ejemplo este deber&#237;a ser 'Remove 84 rows' (Eliminar 84 filas)) y luego vuelve a la ficha Facetas/Filtros.</p>
<p>La cuesti&#243;n surgi&#243; durante la operaci&#243;n de divisi&#243;n con el car&#225;cter barra vertical, por lo que hay una gran probabilidad de que todo lo que sali&#243; mal est&#233; vinculado a este car&#225;cter. Apliquemos un filtro en la columna Categor&#237;as seleccionando '<hi rend="bold">Filtro de texto</hi>' en el men&#250;. Primero escribe un solo <code type="inline">|</code> en el campo de la izquierda: <emph>OpenRefine</emph> te informa que hay 71.064 registros coincidentes (es decir, registros que contienen una barra vertical) de un total de 75.727. Las celdas que no contienen una barra vertical pueden estar en blanco, pero tambi&#233;n pueden ser celdas que contienen una sola categor&#237;a sin separador, como el registro 29 que s&#243;lo tiene 'Scientific instruments'.</p>
<p>Ahora ingresa una segunda <code type="inline">|</code> despu&#233;s de la primera para obtener `||`` (doble barra vertical): podr&#225;s ver que 9 registros coinciden con este patr&#243;n. Estos son probablemente los 9 registros culpables de nuestra discrepancia: cuando <emph>OpenRefine</emph> los divide la doble barra vertical se interpreta como una ruptura entre dos registros en lugar de un separador doble sin sentido. Y ahora, &#191;c&#243;mo corregimos estos valores? Ve al men&#250; del campo 'Categor&#237;as' y elije '<hi rend="bold">Editar celdas</hi>' &gt; '<hi rend="bold">Transformar...</hi>'. Bienvenido a la interfaz de transformaci&#243;n de texto personalizado, una potente funcionalidad de <emph>OpenRefine</emph> que usa el Lenguaje de Expresi&#243;n <emph>OpenRefine</emph> (GREL).</p>
<p>La palabra 'valor' en el campo de texto representa el valor actual de cada celda, que puedes ver a continuaci&#243;n. Podemos modificar este valor aplic&#225;ndole funciones (v&#233;ase la <link target="https://github.com/OpenRefine/OpenRefine/wiki/GREL-Functions">documentaci&#243;n de GREL</link> para una lista completa). En este caso, queremos reemplazar las barras verticales dobles por una sola. Esto puede lograrse introduciendo la siguiente <link target="https://es.wikipedia.org/wiki/Expresi%C3%B3n_regular">expresi&#243;n regular</link> (aseg&#250;rate de no olvidar las comillas):</p>
<pre><code xml:id="code_limpieza-de-datos-con-OpenRefine_0" type="block" corresp="code_limpieza-de-datos-con-OpenRefine_0.txt"/></pre>
<p>Bajo el campo de texto 'Expression', obtienes una vista previa de los valores modificados, con las barras verticales dobles eliminadas. Haz clic en <hi rend="bold">Aceptar</hi> y vuelve a intentar dividir las categor&#237;as con '<hi rend="bold">Editar celdas</hi>' &gt; '<hi rend="bold">Dividir celdas multi-valuadas...</hi>', el n&#250;mero de registros se mantendr&#225; ahora en 75.727 (haz clic en el v&#237;nculo '<hi rend="bold">registros</hi>' para realizar una doble comprobaci&#243;n).</p>
<p>* * *<br/>
Otro problema que se puede resolver con la ayuda de GREL es el problema de los registros para los que la misma categor&#237;a se enumera dos veces. Tomemos el registro 41, por ejemplo, cuyas categor&#237;as son 'Models|Botanical specimens|Botanical Specimens|Didactic Displays|Models'. La categor&#237;a 'Models' aparece dos veces sin ning&#250;n motivo, por lo que queremos eliminar este duplicado. Haz clic en el tri&#225;ngulo del campo Categor&#237;as y elije Editar celdas, Unir celdas multi-valuadas, Aceptar. Elije el car&#225;cter barra vertical como separador. Ahora las categor&#237;as se listan como anteriormente. Luego selecciona '<hi rend="bold">Editar celdas</hi>' &gt; '<hi rend="bold">Transformar</hi>', tambi&#233;n en la columna de categor&#237;as. Utilizando GREL podemos dividir sucesivamente las categor&#237;as mediante el car&#225;cter barra vertical, buscar categor&#237;as &#250;nicas y unirlas de nuevo. Para hacerlo, simplemente escribe la siguiente expresi&#243;n:</p>
<pre><code xml:id="code_limpieza-de-datos-con-OpenRefine_1" type="block" corresp="code_limpieza-de-datos-con-OpenRefine_1.txt"/></pre>
<p>Notar&#225;s que 32.599 celdas est&#225;n afectadas, m&#225;s de la mitad de la colecci&#243;n.</p>
</div><div type="3"><head>Exportaci&#243;n de tus datos limpios</head>
<p>Desde que cargaste tus datos por primera vez en <emph>OpenRefine</emph>, todas las operaciones de limpieza se han realizado en la memoria del programa, dejando intacto el conjunto original de datos. Si deseas guardar los datos que has estado limpiando debes exportarlos haciendo clic en el men&#250; '<hi rend="bold">Exportar</hi>' en la parte superior derecha de la pantalla. <emph>OpenRefine</emph> soporta una gran variedad de formatos, como <link target="https://es.wikipedia.org/wiki/Valores_separados_por_comas">CSV</link>, HTML o Excel: selecciona lo que mejor te convenga o a&#241;ade tu propia plantilla de exportaci&#243;n haciendo clic en 'Plantilla'. Tambi&#233;n puedes exportar tu proyecto en el formato interno de <emph>OpenRefine</emph> para compartirlo con otras personas.</p>
</div><div type="3"><head>Construir sobre tus datos limpios</head>
<p>Una vez que tus datos han sido limpiados, puedes dar el siguiente paso y explorar otras caracter&#237;sticas interesantes de <emph>OpenRefine</emph>. La comunidad de usuarios de <emph>OpenRefine</emph> ha desarrollado dos extensiones particularmente interesantes que te permiten vincular tus datos a datos que ya se han publicado en la Web. La <link target="http://web.archive.org/web/20180113121435/http://refine.deri.ie/docs">extensi&#243;n RDF Refine</link> transforma las palabras clave de texto sin formato en URLs. La <link target="https://github.com/RubenVerborgh/Refine-NER-Extension">extensi&#243;n NER</link> te permite aplicar el reconocimiento de nombres de entidades (NER), que identifica palabras clave en el texto de los campos textuales y les inserta una URL.</p>
</div></div>
      <div type="2"><head>Conclusiones</head>
<p>Si s&#243;lo recordaras una cosa de esta lecci&#243;n, deber&#237;a ser lo siguiente: <emph>todos los datos est&#225;n sucios, pero t&#250; puedes hacer algo para remediarlo</emph>. Como te hemos mostrado, hay ya bastantes cosas que puedes hacer t&#250; mismo para aumentar significativamente la calidad de los datos. En primer lugar, has aprendido c&#243;mo puedes obtener una panor&#225;mica r&#225;pida de cu&#225;ntos valores vac&#237;os contiene tu conjunto de datos y con qu&#233; frecuencia se utiliza un valor determinado (por ejemplo, una palabra clave) en toda una colecci&#243;n. Estas lecciones tambi&#233;n han demostrado c&#243;mo resolver problemas recurrentes tales como duplicados e inconsistencias ortogr&#225;ficas de forma automatizada con la ayuda de OpenRefine. No dudes en experimentar con las funciones de limpieza, ya que est&#225;s realizando estos pasos en una copia de tu conjunto de datos, y <emph>OpenRefine</emph> te permite rastrear todos tus pasos (y volver atr&#225;s) en el caso de que hayas cometido un error.</p>
</div>
      <div type="2"><head>Notas de la traductora</head>
<p><note id="1"> Denominado tambi&#233;n conciliar o reconciliar.</note>
<note id="2"> La p&#225;gina del Museo Powerhouse ha sido modificada desde la publicaci&#243;n original de esta lecci&#243;n en 2013. La p&#225;gina actual que muestra la informaci&#243;n de este mismo objeto de la imagen es <link target="https://collection.maas.museum/object/11848">https://collection.maas.museum/object/11848</link></note>
<note id="3"> Es posible que al cargar este proyecto no veas ninguna columna con este color. Esto significa que ning&#250;n campo tiene definidos sus valores como num&#233;ricos.</note>
<note id="4"> Al cargar el proyecto es muy posible que esta columna aparezca con formato de texto. Para poder aplicar una faceta num&#233;rica primero hay que convertirla a formato num&#233;rico: '<hi rend="bold">Editar celdas</hi>' &gt; '<hi rend="bold">Transformaciones comunes</hi>' &gt; '<hi rend="bold">a n&#250;mero</hi>'.</note>
<note id="5"> Esta parte de la interfaz del programa no aparece traducida.</note></p>
</div>
    </body>
  </text>
</TEI>
