<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Autoria Sustent&#225;vel em Texto Simples usando Pandoc e Markdown</title>
  <layout>lesson</layout>
  <collection>lessons</collection>
  <slug>autoria-sustentavel-texto-simples-pandoc-markdown</slug>
  <date>2014-03-19</date>
  <translation_date>2022-11-27</translation_date>
  <authors>Dennis Tenen,Grant Wythoff</authors>
  <lesson-testers>Pao-Chuan Ma</lesson-testers>
  <tested-date>2021-06-10</tested-date>
  <editors>Fred Gibbs</editors>
  <translator>Gabriela Kucuruza</translator>
  <translation-editor>Jimmy Medeiros</translation-editor>
  <translation-reviewer>Daniel Bonatto Seco,Andr&#233; Salvo</translation-reviewer>
  <difficulty>2</difficulty>
  <activity>sustaining</activity>
  <topics>website,data-management</topics>
  <abstract>Neste tutorial, voc&#234; aprender&#225; primeiro o b&#225;sico do Markdown - uma sintaxe de marca&#231;&#227;o f&#225;cil de ler e escrever para texto simples - bem como Pandoc, uma ferramenta de linha de comando que converte texto simples em v&#225;rios tipos de ficheiros formatados: PDF, docx, HTML, LaTeX, apresenta&#231;&#227;o de slides e muito mais.</abstract>
  <exclude_from_check>reviewers,review-ticket</exclude_from_check>
  <original>sustainable-authorship-in-plain-text-using-pandoc-and-markdown</original>
  <avatar_alt>Um homem trabalhando numa mesa de desenho</avatar_alt>
  <doi>10.46430/phpt0036</doi>
</metadata>
  <text>
    <body><figure><desc/><graphic url="lexoriter.jpg"/></figure>
<div n="1"><head>Objetivos</head>
<p>Neste tutorial, voc&#234; aprender&#225; primeiro o b&#225;sico do Markdown - uma sintaxe de marca&#231;&#227;o f&#225;cil de ler e de escrever para texto simples - assim como o <link target="http://johnmacfarlane.net/pandoc/">Pandoc</link>, uma ferramenta de linha de comando que converte texto simples em v&#225;rios tipos de ficheiro belamente formatados: PDF, docx, HTML, LaTeX, apresenta&#231;&#245;es de slides e muito mais.<ref type="footnotemark" target="#1"/> Com o Pandoc como sua ferramenta de composi&#231;&#227;o digital, voc&#234; pode usar a sintaxe Markdown para adicionar figuras, bibliografia, formata&#231;&#227;o e alterar facilmente os estilos de cita&#231;&#227;o de Chicago para MLA (por exemplo), todos usando texto simples.</p>
<p>Este tutorial n&#227;o pressup&#245;e nenhum conhecimento t&#233;cnico pr&#233;vio, mas aumenta com a experi&#234;ncia, uma vez que vamos sugerir t&#233;cnicas mais avan&#231;adas ao final de cada se&#231;&#227;o. Elas est&#227;o claramente marcadas e podem ser revisitadas ap&#243;s alguma pr&#225;tica e experimenta&#231;&#227;o.</p>
<p>Ao inv&#233;s de seguir esse tutorial de maneira mec&#226;nica, recomendamos que se esforce para entender as solu&#231;&#245;es oferecidas aqui como uma <emph>metodologia</emph>, que pode precisar de adapta&#231;&#245;es para se adequar ao seu ambiente e fluxo de trabalho. A instala&#231;&#227;o das ferramentas necess&#225;rias apresenta talvez a maior barreira &#224; participa&#231;&#227;o. Tenha tempo e paci&#234;ncia suficientes para instalar tudo corretamente, ou fa&#231;a isso com um/a colega que tenha uma configura&#231;&#227;o semelhante e ajudem-se mutuamente. Consulte a se&#231;&#227;o <link target="/pt/licoes/autoria-sustentavel-texto-simples-pandoc-markdown#recursos-uteis">Recursos &#218;teis</link> abaixo se ficar preso.<ref type="footnotemark" target="#2"/> </p>
</div><div n="1"><head>Filosofia</head>
<p>Escrever, armazenar e recuperar documentos s&#227;o atividades centrais para o fluxo de trabalho de pesquisa das humanidades. Mesmo assim, muitos autores baseiam suas pr&#225;ticas em ferramentas e formatos propriet&#225;rios que, &#224;s vezes, ficam aqu&#233;m dos requisitos mais b&#225;sicos da escrita acad&#234;mica. Talvez possa se lembrar de certa frustra&#231;&#227;o com a fragilidade de notas de rodap&#233;, bibliografias, figuras e rascunhos de livros escritos em Microsoft Word ou Google Docs. No entanto, a maioria dos peri&#243;dicos ainda insiste em submiss&#245;es no formato .docx.</p>
<p>Mais do que causar frustra&#231;&#227;o pessoal, essa depend&#234;ncia de ferramentas e de formatos propriet&#225;rios tem implica&#231;&#245;es negativas de longo prazo para a comunidade acad&#234;mica. Em tal ambiente, os peri&#243;dicos devem terceirizar a composi&#231;&#227;o, alienando os autores dos contextos materiais de publica&#231;&#227;o e adicionando outras barreiras desnecess&#225;rias &#224; circula&#231;&#227;o irrestrita do conhecimento.<ref type="footnotemark" target="#3"/></p>
<p>Quando se usa MS Word, Google Docs ou Open Office para escrever documentos, o que se v&#234; n&#227;o &#233; o que se obt&#233;m. Embaixo da camada vis&#237;vel de palavras, frases e par&#225;grafos, encontra-se uma complicada camada de c&#243;digo compreens&#237;vel apenas para as m&#225;quinas. Por causa dessa camada oculta, os ficheiros .docx e .pdf dependem de ferramentas propriet&#225;rias para serem visualizados corretamente. Esses documentos s&#227;o dif&#237;ceis de pesquisar, imprimir e converter em outros formatos de ficheiros.</p>
<p>Al&#233;m disso, o tempo gasto formatando documentos em MS Word ou Open Office &#233; perdido, pois toda essa formata&#231;&#227;o &#233; removida pelo editor durante a submiss&#227;o. Tanto os autores quanto os editores se beneficiariam da troca de ficheiros com formata&#231;&#227;o m&#237;nima, deixando a composi&#231;&#227;o tipogr&#225;fica para o est&#225;gio final de composi&#231;&#227;o do processo de publica&#231;&#227;o.</p>
<p>Aqui &#233; onde o Markdown brilha. Markdown &#233; uma sintaxe para marcar explicitamente elementos sem&#226;nticos dentro de um documento, n&#227;o em alguma camada oculta. A ideia &#233; identificar as unidades que s&#227;o significativas para humanos, como t&#237;tulos, se&#231;&#245;es, subse&#231;&#245;es, notas de rodap&#233; e ilustra&#231;&#245;es. No m&#237;nimo, os seus ficheiros sempre permanecer&#227;o compreens&#237;veis <hi rend="bold">para voc&#234;</hi>, mesmo se o editor de texto que estiver usando parar de funcionar ou "sair do mercado".</p>
<p>Escrever dessa forma libera o autor da ferramenta. Markdown pode ser escrito em qualquer editor de texto simples e oferece um rico ecossistema de software que pode renderizar o texto em documentos belamente formatados. Por esta raz&#227;o, o Markdown est&#225; atualmente passando por um per&#237;odo de crescimento, n&#227;o apenas como meio para escrever artigos acad&#234;micos, mas como uma conven&#231;&#227;o para edi&#231;&#227;o online em geral.</p>
<p>Os editores de texto simples de uso geral populares incluem <link target="https://atom.io/">Atom</link> (todas as plataformas) e <link target="https://notepad-plus-plus.org/">Notepad ++</link> (somente para Windows).</p>
<p>&#201; importante entender que o Markdown &#233; apenas uma conven&#231;&#227;o. Os ficheiros Markdown s&#227;o armazenados como texto simples, aumentando ainda mais a flexibilidade do formato. Ficheiros de texto simples existem desde a m&#225;quina de escrever eletr&#244;nica. A longevidade deste padr&#227;o torna, de modo inerente, o texto simples mais sustent&#225;vel e est&#225;vel do que os formatos propriet&#225;rios. Enquanto os ficheiros produzidos at&#233; dez anos atr&#225;s no Microsoft Word e no Apple Pages, podem causar problemas significativos quando abertos nas vers&#245;es mais recentes, ainda &#233; poss&#237;vel abrir um ficheiro escrito em qualquer editor de texto simples &#8220;morto&#8221; nas &#250;ltimas d&#233;cadas: AlphaPlus, Perfect Writer, Text Wizard, Spellbinder, WordStar ou o favorito de Isaac Asimov, SCRIPSIT 2.0 , feito por Radio Shack. Escrever em texto simples garante que seus ficheiros permanecer&#227;o leg&#237;veis daqui a dez, quinze, vinte anos. Neste tutorial, descrevemos um fluxo de trabalho que libera o pesquisador de softwares propriet&#225;rios de processamento de texto e de formatos de ficheiro fr&#225;geis.</p>
<p>Agora &#233; poss&#237;vel escrever uma ampla variedade de documentos em um formato - artigos, postagens de blog, wikis, programas de estudos e cartas de recomenda&#231;&#227;o - usando o mesmo conjunto de ferramentas e t&#233;cnicas para pesquisar, descobrir, fazer backup e distribuir nossos materiais. Suas notas, entradas de blog, documenta&#231;&#227;o de c&#243;digo e wikis podem ser criados no Markdown. Cada vez mais, muitas plataformas como WordPress, Reddit e GitHub suportam a autoria Markdown nativamente. A longo prazo, sua pesquisa se beneficiar&#225; desses fluxos de trabalho unificados, tornando mais f&#225;cil salvar, pesquisar, compartilhar e organizar seus materiais.</p>
</div><div n="1"><head>Princ&#237;pios</head>
<p>Inspirados pelas melhores pr&#225;ticas em uma variedade de disciplinas, n&#243;s fomos guiados pelos seguintes princ&#237;pios: </p>
<ol>
<li><emph>Sustentabilidade</emph>. O texto simples garante tanto transpar&#234;ncia, como atende aos padr&#245;es de preserva&#231;&#227;o de longo prazo. O Word pode seguir o caminho do <link target="https://pt.wikipedia.org/wiki/WordPerfect">Word Perfect</link> no futuro, mas o texto simples sempre permanecer&#225; f&#225;cil de ler, catalogar, extrair e transformar. Al&#233;m disso, o texto simples permite um controle f&#225;cil e poderoso do versionamento do documento, o que &#233; &#250;til na colabora&#231;&#227;o e na organiza&#231;&#227;o de rascunhos. Seus ficheiros de texto simples estar&#227;o acess&#237;veis em telefones celulares, tablets ou, talvez, em um terminal de baixa pot&#234;ncia em alguma biblioteca remota. O texto simples &#233; compat&#237;vel com vers&#245;es anteriores e &#224; prova de futuro. Qualquer que seja o software ou hardware que vier a seguir, ele ser&#225; capaz de entender os seus ficheiros de texto simples.</li>
<li><emph>Prefer&#234;ncia por formatos leg&#237;veis por humanos</emph>. Quando escrevemos no Word ou no Google Docs, o que vemos n&#227;o &#233; o que obtemos. O ficheiro .doc contem uma formata&#231;&#227;o oculta de caracteres gerados automaticamente, criando uma camada de composi&#231;&#227;o tipogr&#225;fica ofuscada que &#233; dif&#237;cil para o usu&#225;rio solucionar. Algo t&#227;o simples como colar uma imagem ou texto do navegador pode ter efeitos imprevis&#237;veis na formata&#231;&#227;o do seu documento.</li>
<li><emph>Separa&#231;&#227;o entre forma e conte&#250;do</emph>. Escrever e formatar ao mesmo tempo &#233; distrativo. A ideia &#233; escrever primeiro e formatar depois, o mais pr&#243;ximo poss&#237;vel da hora da publica&#231;&#227;o. Uma tarefa como mudar da formata&#231;&#227;o Chicago para MLA deve ser simples. Os editores de peri&#243;dicos que desejam economizar tempo na formata&#231;&#227;o desnecess&#225;ria e na edi&#231;&#227;o de c&#243;pias devem ser capazes de fornecer aos seus autores um modelo de formata&#231;&#227;o que cuida dos detalhes da composi&#231;&#227;o tipogr&#225;fica.</li>
<li><emph>Apoio ao aparato acad&#234;mico</emph>. O fluxo de trabalho precisa lidar com notas de rodap&#233;, figuras, caracteres internacionais e bibliografias com eleg&#226;ncia.</li>
<li><emph>Independ&#234;ncia de plataforma</emph>. Na medida em que os vetores de publica&#231;&#227;o se multiplicam, precisamos ser capazes de gerar uma multiplicidade de formatos, incluindo proje&#231;&#227;o de slides, impress&#227;o, web e celular. Idealmente, gostar&#237;amos de poder gerar os formatos mais comuns sem quebrar as depend&#234;ncias bibliogr&#225;ficas. Nosso fluxo de trabalho tamb&#233;m precisa ser port&#225;til - seria bom poder copiar uma pasta para um pen drive e saber que ela cont&#233;m tudo o que &#233; necess&#225;rio para publica&#231;&#227;o de estudos. Escrever em texto simples significa que &#233; poss&#237;vel facilmente compartilhar, editar e arquivar seus documentos em praticamente qualquer ambiente. Por exemplo, um programa escrito em Markdown pode ser salvo como PDF, impresso como um folheto e convertido em HTML para a web, tudo a partir do mesmo ficheiro. Tanto os documentos da web quanto os impressos devem ser publicados da mesma fonte e ter apar&#234;ncia semelhante, preservando o layout l&#243;gico do material.</li>
</ol>
<p>Mardown e LaTeX cumprem todos esses requisitos. N&#243;s escolhemos Markdown (e n&#227;o LaTeX) porque ele oferece a sintaxe mais leve e organizada (por isso, <emph>mark down</emph>) e porque quando unido com Pandoc, permite maior flexibilidade nas sa&#237;das (incluindo ficheiros .docs e .tex).<ref type="footnotemark" target="#4"/></p>
</div><div n="1"><head>Requisitos de Software</head>
<p>N&#243;s omitimos propositalmente alguns dos detalhes menores vinculados &#224; plataforma ou ao sistema operacional de instala&#231;&#227;o do software listado abaixo. Por exemplo, n&#227;o faz sentido fornecer instru&#231;&#245;es de instala&#231;&#227;o para o LaTeX, quando as instru&#231;&#245;es online para o seu sistema operacional ser&#227;o sempre mais atuais e completas. Da mesma forma, o processo de instala&#231;&#227;o do Pandoc &#233; melhor explorado pesquisando por &#8220;instalar o Pandoc&#8221; no Google, com o prov&#225;vel primeiro resultado sendo a p&#225;gina inicial do Pandoc.</p>
<ul>
<li><hi rend="bold">Editor de texto simples</hi>. Entrar no mundo de edi&#231;&#227;o de texto simples expande dramaticamente as suas escolhas de ferramentas inovadoras de autoria. Pesquise online por "editor de texto markdown" e experimente as op&#231;&#245;es. N&#227;o importa qual for usada, contanto que seja explicitamente um editor de texto simples, como Atom e Notepad++. Lembre-se de que n&#243;s n&#227;o estamos presos a ferramenta, &#233; poss&#237;vel trocar de editor a qualquer momento. </li>
<li><hi rend="bold">Terminal de linha de comando</hi>. Trabalhar na "linha de comando" equivale a escrever comandos no terminal. Em um Mac, apenas pesquise por "Terminal". No Windows, use o <link target="https://pt.wikipedia.org/wiki/PowerShell">PowerShell</link>. Usu&#225;rios de Linux provavelmente j&#225; devem estar familiarizados com seus terminais. N&#243;s iremos cobrir o b&#225;sico de como procurar e usar a linha de comando abaixo. </li>
<li><hi rend="bold">Pandoc</hi>. Instru&#231;&#245;es de instala&#231;&#227;o detalhadas e para plataformas espec&#237;ficas est&#227;o dispon&#237;veis no <link target="https://pandoc.org/installing.html">site do Pandoc</link>. <emph>A instala&#231;&#227;o do Pandoc na sua m&#225;quina &#233; crucial para esse tutorial</emph>, ent&#227;o tome o seu tempo navegando pelas instru&#231;&#245;es. O Pandoc foi criado e &#233; mantido por John MacFarlane, Professor de Filosofia na Universidade da Calif&#243;rnia, Berkeley. Isso &#233; a humanidade computacional em sua melhor express&#227;o e servir&#225; como o motor de nosso fluxo de trabalho. Com o Pandoc, ser&#225; poss&#237;vel compilar texto e bibliografia em documentos belamente formatados e flex&#237;veis. Depois de seguir as instru&#231;&#245;es de instala&#231;&#227;o, verifique se o Pandoc est&#225; instalado digitando <code type="inline">pandoc --version</code> na linha de comando. Presumimos que a sua vers&#227;o seja ao menos a vers&#227;o 1.12.3, lan&#231;ada em janeiro de 2014.</li>
</ul>
<p>Os pr&#243;ximos dois softwares s&#227;o recomendados, mas n&#227;o requisitados para realizar esse tutorial. </p>
<ul>
<li><hi rend="bold">Zotero ou Endnote</hi>. Softwares de refer&#234;ncia bibliogr&#225;fica como Zotero e Endnote s&#227;o ferramentas indispens&#225;veis para organizar e formatar cita&#231;&#245;es em um artigo de pesquisa. Esses programas podem exportar suas bibliotecas como um ficheiro BibTeX (sobre o qual voc&#234; aprender&#225; mais no Caso 2 a seguir). Este ficheiro, por si s&#243; um documento de texto simples formatado com todas as suas cita&#231;&#245;es, permitir&#225; que voc&#234; cite refer&#234;ncias de forma r&#225;pida e f&#225;cil usando <code type="inline">@tags</code>. Deve-se notar que tamb&#233;m &#233; poss&#237;vel digitar todas as suas refer&#234;ncias bibliogr&#225;ficas &#224; m&#227;o, usando <link target="https://github.com/dh-notes/pandoc-workflow/blob/master/pandoctut.bib">nossa bibliografia</link> como modelo.</li>
<li><hi rend="bold">LaTeX</hi>. Instru&#231;&#245;es de instala&#231;&#227;o detalhadas e espec&#237;ficas da plataforma est&#227;o dispon&#237;veis no <link target="https://pandoc.org/installing.html">site do Pandoc</link>. Embora o LaTeX n&#227;o seja abordado neste tutorial, ele &#233; usado pelo Pandoc para a cria&#231;&#227;o de .pdf. Usu&#225;rios avan&#231;ados frequentemente ir&#227;o converter para LaTeX diretamente para ter um controle mais minucioso sobre a composi&#231;&#227;o do .pdf. Os iniciantes podem querer pular esta etapa. Caso contr&#225;rio, digite<code type="inline">latex -v</code> para ver se o LaTeX est&#225; instalado corretamente (voc&#234; receber&#225; um erro se n&#227;o estiver e algumas informa&#231;&#245;es sobre a vers&#227;o, se estiver).</li>
</ul>
</div><div n="1"><head>B&#225;sico do Markdown</head>
<p>O Markdown &#233; uma conven&#231;&#227;o para estruturar os seus documentos de texto simples semanticamente. A ideia &#233; identificar estruturas l&#243;gicas no seu documento (t&#237;tulos, se&#231;&#245;es, subse&#231;&#245;es, notas de rodap&#233;, etc.), marc&#225;-las com caracteres discretos e ent&#227;o "compilar" o texto resultante com um interpretador de composi&#231;&#227;o tipogr&#225;fica que formatar&#225; o documento consistentemente, de acordo com um estilo espec&#237;fico. </p>
<p>As conven&#231;&#245;es de Markdown v&#234;m em v&#225;rias &#8220;vers&#245;es&#8221; projetadas para uso em contextos espec&#237;ficos, como blogs, wikis ou reposit&#243;rios de c&#243;digo. O do Markdown usado pelo <link target="http://pandoc.org/README.html#pandocs-markdown">Pandoc</link> &#233; voltado para uso acad&#234;mico. Suas conven&#231;&#245;es s&#227;o descritas na p&#225;gina Markdown do Pandoc. Suas conven&#231;&#245;es incluem o bloco &#8220;<link target="http://johnmacfarlane.net/pandoc/README.html#yaml-metadata-block">YAML</link>&#8221;, que cont&#233;m alguns metadados &#250;teis. </p>
<p>Vamos agora criar um documento simples no Markdown. Abra um editor de texto simples de sua escolha e comece a digitar. Deve ser assim:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_0" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_0.txt"></code></pre>
<p>A vers&#227;o do Markdown usada pelo Pandoc armazena cada um dos valores acima, e "imprime-os" na localiza&#231;&#227;o apropriada do seu documento de sa&#237;da quando o documento estiver pronto para a composi&#231;&#227;o tipogr&#225;fica. Aprenderemos mais tarde a adicionar outros campos mais poderosos ao bloco "YAML". Por enquanto, vamos fingir que estamos escrevendo um artigo que cont&#233;m tr&#234;s se&#231;&#245;es, cada uma subdividida em duas subse&#231;&#245;es. Deixe uma linha em branco ap&#243;s os tr&#234;s &#250;ltimos tra&#231;os no bloco "YAML" e cole o seguinte:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_1" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_1.txt"></code></pre>
<p>V&#225; em frente e escreva um texto simulado tamb&#233;m. Espa&#231;os em branco s&#227;o significativos em Markdown: n&#227;o recue os seus par&#225;grafos.  Ao inv&#233;s disso, separe par&#225;grafos usando uma linha vazia. Linhas vazias tamb&#233;m devem preceder os cabe&#231;alhos das se&#231;&#245;es. </p>
<p>Use asteriscos para adicionar &#234;nfases em negrito ou em it&#225;lico, assim: <code type="inline">*it&#225;lico*</code> e <code type="inline">**negrito**</code>. N&#243;s devemos tamb&#233;m adicionar um link e uma nota de rodap&#233; no nosso texto para cobrir os componentes b&#225;sicos de um artigo m&#233;dio. Digite: </p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_2" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_2.txt"></code></pre>
<p>Quando o texto do link e o endere&#231;o s&#227;o iguais, &#233; mais r&#225;pido escrever <code type="inline">&lt;www.eff.org&gt;</code> ao inv&#233;s de <code type="inline">[www.eff.org](www.eff.org)</code>. </p>
<p>Vamos salvar nosso ficheiro antes de avan&#231;ar. Crie a nova pasta que ir&#225; armazenar esse projeto. &#201; prov&#225;vel que tenha algum sistema de organiza&#231;&#227;o de seus documentos, projetos, ilustra&#231;&#245;es e bibliografias, mas geralmente, o seu documento, e as suas ilustra&#231;&#245;es e bibliografia est&#227;o em pastas diferentes, o que os torna mais dif&#237;ceis de achar. Nosso objetivo &#233; criar uma &#250;nica pasta para cada projeto, com todos os materiais relevantes inclu&#237;dos. A regra geral &#233; um projeto, um artigo, uma pasta. Nomeie seu ficheiro como <code type="inline">main.md</code>, onde &#8220;md&#8221; significa markdown.</p>
<p>Depois que seu ficheiro for salvo, vamos adicionar uma ilustra&#231;&#227;o. Copie uma imagem (qualquer imagem pequena) para a sua pasta e adicione o seguinte em algum lugar no corpo do texto: <code type="inline">![legenda da imagem](sua_imagem.jpg)</code>.</p>
<p>Nesse ponto, o seu <code type="inline">main.md</code> deve parecer com o que est&#225; abaixo. &#201; poss&#237;vel baixar esse exemplo de ficheiro teste.md <link target="/assets/teste.md">aqui</link>.</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_3" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_3.txt"></code></pre>
<p>Como faremos em breve, esse ficheiro de texto simples pode ser renderizado em um belo PDF: </p>
<figure><desc>Exemplo de captura de tela de Word renderizado no Pandoc</desc><graphic url="autoria-sustentavel-texto-simples-pandoc-markdown-01.png" alt="Imagem representando o ficheiro MarkDown e a respectiva vers&#227;o em Word produzida com o Pandoc"/></figure>
<p>Se quiser ter uma ideia de como esse tipo de marca&#231;&#227;o ser&#225; interpretado como formata&#231;&#227;o HTML, experimente esse <link target="https://daringfireball.net/projects/markdown/dingus">espa&#231;o de teste online</link> e brinque com v&#225;rios tipos de sintaxe. Lembre-se de que certos elementos do Markdown com o sabor do Pandoc (como o bloco de t&#237;tulo e as notas de rodap&#233;) n&#227;o funcionar&#227;o neste formul&#225;rio da web, que aceita apenas o b&#225;sico.</p>
<p>Neste ponto, gaste algum tempo explorando alguns dos outros recursos do Markdown, como cita&#231;&#245;es (referenciadas pelo s&#237;mbolo <code type="inline">&gt;</code>), listas de marcadores que come&#231;am com <code type="inline">*</code> ou <code type="inline">-</code>, quebras de linha textuais que come&#231;am com <code type="inline">|</code> (&#250;til para poesia), tabelas e algumas das outras fun&#231;&#245;es listadas na p&#225;gina de marca&#231;&#227;o do Pandoc.</p>
<p>Preste bastante aten&#231;&#227;o em espa&#231;os vazios e no fluxo dos par&#225;grafos. A documenta&#231;&#227;o coloca sucintamente quando define um par&#225;grafo como "uma ou mais linhas de texto seguida por uma ou mais linhas vazias.". Note que "linhas novas s&#227;o tratadas como espa&#231;os" e que "se precisa de uma quebra de linha forte, coloque dois ou mais espa&#231;os no final de uma linha." A melhor maneira de entender o que isso significa &#233; experimentar livremente. Use o modo de visualiza&#231;&#227;o do seu editor ou apenas execute o Pandoc para ver os resultados dos seus experimentos.  </p>
<p>Acima de tudo, evite a vontade de formatar. Lembre-se de que estamos identificando unidades sem&#226;nticas: se&#231;&#245;es, subse&#231;&#245;es, &#234;nfases, notas de rodap&#233; e figuras. Mesmo  <emph>it&#225;lico</emph>  e  <hi rend="bold">negrito</hi> em Markdown n&#227;o s&#227;o realmente marcos de formata&#231;&#227;o, mas indicam diferentes n&#237;veis de <emph>&#234;nfase</emph>. A formata&#231;&#227;o acontecer&#225; depois, quando souber o lugar e os requisitos da publica&#231;&#227;o. </p>
<p>Existem programas que permitem que se veja uma pr&#233;-visualiza&#231;&#227;o em tempo real da sa&#237;da do Markdown enquanto se edita o ficheiro de texto simples, que n&#243;s detalhamos abaixo na se&#231;&#227;o de Recursos &#218;teis. Poucos deles suportam, entretanto, notas de rodap&#233;, figuras e bibliografias. Para aproveitar o Pandoc ao m&#225;ximo, n&#243;s recomendamos que use ficheiros de texto simples armazenados localmente, no seu computador. </p>
</div><div n="1"><head>Entrando em contato com a linha de comendos do seu computador</head>
<p>Antes de come&#231;armos a publicar o nosso ficheiro <code type="inline">main.md</code> em outros formatos, n&#243;s precisamos nos orientar sobre como trabalhar com a linha de comando usando o programa de terminal do seu computador, que &#233; o &#250;nico (e melhor) modo de usar o Pandoc. </p>
<p>A linha de comando &#233; um lugar amig&#225;vel, uma vez que se acostuma com ela. Se j&#225; estiver familiarizado com o uso da linha de comando, sinta-se &#224; vontade para pular esta se&#231;&#227;o. Para outros, &#233; importante entender que ser capaz de usar seu programa de terminal diretamente permitir&#225; que se use uma ampla gama de poderosas ferramentas de pesquisa que n&#227;o poderiam ser usadas de outra forma, e podem servir como base para um trabalho mais avan&#231;ado. Para os fins deste tutorial, &#233; preciso aprender apenas alguns comandos muito simples.</p>
<p>Primeiro, abra uma janela de linha de comando. Se voc&#234; estiver usando o macOS, abra o aplicativo Terminal no diret&#243;rio &#8216;Aplicativos / Utilit&#225;rios&#8217;. No Windows, recomendamos que use o PowerShell ou, para uma solu&#231;&#227;o mais robusta, instale o subsistema do Windows para Linux e use o terminal que vem com sua distribui&#231;&#227;o favorita do Linux. Para obter uma excelente introdu&#231;&#227;o &#224; linha de comando, consulte <link target="/en/lessons/intro-to-bash">&#8220;Introdu&#231;&#227;o &#224; linha de comando Bash&#8221; (em ingl&#234;s)</link>, de Ian Milligan e James Baker.  </p>
<p>No terminal, deve-se ver uma janela de texto e um prompt que parece com isso: <code type="inline">nome-do-computador:~nome-do-usu&#225;rio$</code>. O t&#237;tulo indica qual &#233; o diret&#243;rio do usu&#225;rio, e &#233; poss&#237;vel escrever <code type="inline">$ cd~</code> em qualquer ponto para retornar para o seu diret&#243;rio de usu&#225;rio. N&#227;o escreva o cifr&#227;o, ele apenas simboliza o prompt de comando no seu terminal, indicando que se digite algo no terminal (em oposi&#231;&#227;o a digitar algo no seu documento); lembre-se de apertar "Enter" ap&#243;s todo comando. </p>
<p>&#201; bem prov&#225;vel que a sua pasta "Documentos" esteja localizada aqui. Digite <code type="inline">$ pwd</code>(= <emph>print working directory</emph>, exibe o diret&#243;rio de trabalho) e aperte "Enter" para exibir o nome do diret&#243;rio atual. Use <code type="inline">$ pwd</code> sempre que se sentir perdido. </p>
<p>O comando <code type="inline">$ ls</code> (= <emph>list</emph>, listar) simplesmente lista os ficheiros no diret&#243;rio atual. Enfim, pode usar <code type="inline">$cd&gt;</code>(= <emph>change directory,</emph> mudar diret&#243;rio) assim: <code type="inline">$ cd NOME_DIRET&#211;RIO</code> (em que <code type="inline">NOME_DIRET&#211;RIO</code> &#233; o nome do diret&#243;rio que se quer acessar). Use <code type="inline">$ cd ..</code> para mover automaticamente um n&#237;vel para cima na estrutura de diret&#243;rios (o diret&#243;rio-pai do diret&#243;rio em que se est&#225;). Uma vez que come&#231;ar a digitar o nome do diret&#243;rio, use a tecla Tab para completar automaticamente o texto - particularmente &#250;til para nomes de diret&#243;rio longos ou nomes de diret&#243;rios que contenham espa&#231;os.<ref type="footnotemark" target="#5"/></p>
<p>Esses tr&#234;s comandos de terminal: <code type="inline">pwd</code>, <code type="inline">ls</code> e <code type="inline">cd</code> s&#227;o tudo o que &#233; preciso para esse tutorial. Pratique-os por alguns minutos para navegar pela sua pasta de documentos e pense na forma em que os seus ficheiros est&#227;o organizados. Se quiser, acompanhe seu gerenciador gr&#225;ficos regular de ficheiros para se manter informado.</p>
</div><div n="1"><head>Usando Pandoc para converter Markdown em um documento do MS Word</head>
<p>N&#243;s estamos agora prontos para formatar! Abra a sua janela de terminal, use o <code type="inline">$ pwd</code>e <code type="inline">$ cd NOME_DIRET&#211;RIO</code> para navegar at&#233; a pasta correta para o seu projeto. Chegando l&#225;, digite <code type="inline">$ ls</code> no terminal para listar os ficheiros. Se encontrar o seu ficheiro .md e suas imagens, est&#225; no lugar certo. Para converter o .md em um .docx escreva: </p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_4" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_4.txt"></code></pre>
<p>Abra o ficheiro no MS Word e confira os resultados. Alternativamente, se usa o Open- ou LibreOffice, escreva:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_5" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_5.txt"></code></pre>
<p>Se n&#227;o estiver acostumado com a linha de comando, imagine ler o comando acima como se fosse algo como: "Pandoc, crie um ficheiro MS Word a partir do meu ficheiro Markdown". A parte <code type="inline">-o</code> &#233; uma "bandeira", que nesse caso diz algo como "ao inv&#233;s de eu lhe dizer explicitamente os formatos de ficheiro de origem e destino, apenas tente adivinhar olhando para a extens&#227;o do ficheiro" ou simplesmente "output (sa&#237;da)". Muitas op&#231;&#245;es est&#227;o dispon&#237;veis atrav&#233;s desses sinalizadores no Pandoc. &#201; poss&#237;vel ver a lista completa no  <link target="http://johnmacfarlane.net/pandoc/README.html">site do Pandoc</link> ou digitando <code type="inline">$ man pandoc</code> no terminal. </p>
<p>Tente rodar o comando:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_6" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_6.txt"></code></pre>
<p>Agora navegue de volta para o diret&#243;rio do seu projeto. O que aconteceu? </p>
<p>Usu&#225;rios mais avan&#231;ados que tem o LaTeX instalado podem querer experimentar convertendo o Markdown em .tex ou ficheiros .pdf especialmente formatados. Uma vez que o LaTeX estiver instalado, um ficheiro PDF belamente formatado pode ser criado usando a mesma estrutura de comando:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_7" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_7.txt"></code></pre>
<p>Se o seu documento estiver escrito em outros idiomas que n&#227;o o ingl&#234;s, voc&#234; provavelmente precisar&#225; usar o mecanismo XeLaTeX em vez do LaTeX simples para convers&#227;o .pdf:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_8" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_8.txt"></code></pre>
<p>Tenha certeza de que o seu editor de texto suporta a codifica&#231;&#227;o UTF-8. Quando usar XeLaTeX para convers&#227;o em .pdf, ao inv&#233;s do atributo <code type="inline">fontfamily</code> no "YAML" para mudar fontes, especifique o atributo <code type="inline">mainfont</code> para produzir algo como isto:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_9" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_9.txt"></code></pre>
<p>Por exemplo, estilos de fontes podem ser passados para o Pandoc na forma de <code type="inline">pandoc main.md -- mainfont=times -o destino.pdf</code>. N&#243;s preferimos, entretanto, usar as op&#231;&#245;es de cabe&#231;alho do "YAML" sempre que poss&#237;vel, uma vez que os comandos s&#227;o mais f&#225;ceis de lembrar. Usar uma ferramenta de controle de vers&#227;o como o Git preservar&#225; as mudan&#231;as "YAML", onde o que &#233; digitado no terminal &#233; mais ef&#234;mero. Consulte a se&#231;&#227;o de Templates (Modelos) no manual do Pandoc (<code type="inline">man pandoc</code>) para a lista de vari&#225;veis do "YAML" dispon&#237;veis.</p>
</div><div n="1"><head>Trabalhando com Bibliografias</head>
<p>Nesta se&#231;&#227;o, adicionaremos uma bibliografia ao nosso documento e, em seguida, converteremos os formatos de Chicago para MLA.</p>
<p>Se n&#227;o estiver usando um gerenciador de refer&#234;ncia como Endnote ou Zotero, use. Preferimos o Zotero porque, como o Pandoc, foi criado pela comunidade acad&#234;mica e, como outros projetos de c&#243;digo aberto, &#233; lan&#231;ado sob a GNU, General Public License. O mais importante para n&#243;s &#233; que o seu gerenciador de refer&#234;ncia deve ter a capacidade de gerar bibliografias em formato de texto simples, para manter o alinhamento com nosso princ&#237;pio &#8220;tudo em texto simples&#8221;. V&#225; em frente e abra um gerenciador de refer&#234;ncia de sua escolha e adicione algumas entradas de amostra. Quando estiver pronto, encontre a op&#231;&#227;o de exportar sua bibliografia no formato BibTeX (.bib). Salve o ficheiro .bib no diret&#243;rio do projeto e d&#234; a ele um t&#237;tulo razo&#225;vel como &#8220;projeto.bib&#8221;.</p>
<p>A ideia geral &#233; manter as suas fontes organizadas sob um banco de dados bibliogr&#225;fico centralizado, enquanto geramos ficheiros .bib menores e mais espec&#237;ficos que devem ficar no mesmo diret&#243;rio que o seu projeto. V&#225; em frente e abra o seu ficheiro .bib com o editor de texto simples que escolher.<ref type="footnotemark" target="#6"/> </p>
<p>O seu ficheiro .bib deve conter m&#250;ltiplas entradas que se parecem com esta: </p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_10" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_10.txt"></code></pre>
<p>Raramente ser&#225; necess&#225;rio edit&#225;-las manualmente (embora seja poss&#237;vel). Na maioria dos casos, simplesmente o ficheiro .bib ser&#225; exportado do Zotero ou de um gerenciador de refer&#234;ncias semelhante. Reserve um momento para se orientar aqui. Cada entrada consiste em um tipo de documento, &#8220;artigo&#8221; em nosso caso, um identificador exclusivo (fyfe_digital_2011) e os metadados relevantes sobre t&#237;tulo, volume, autor e assim por diante. O que mais nos interessa &#233; o ID exclusivo que segue imediatamente a chave na primeira linha de cada entrada. O ID &#250;nico &#233; o que nos permite conectar a bibliografia ao documento principal. Deixe este ficheiro aberto por enquanto e volte para o seu ficheiro <code type="inline">main.md</code>.</p>
<p>Edite a nota de rodap&#233; na primeira linha do seu ficheiro <code type="inline">main.md</code> para se parecer com algo como os seguintes exemplos, em que o <code type="inline">@nome_t&#237;tulo_data</code> pode ser substitu&#237;do por um dos IDs &#250;nicos do seu ficheiro <code type="inline">projeto.bib</code>. </p>
<ul>
<li><code type="inline">Uma refer&#234;ncia formatada como esta ser&#225; renderizada apropriadamente como cita&#231;&#227;o no estilo em linha - ou nota de rodap&#233; [@nome_t&#237;tulo_data, 67].</code><ref type="footnotemark" target="#7"/></li>
<li><code type="inline">Para cita&#231;&#245;es entre aspas, coloque a v&#237;rgula fora das marcas de cita&#231;&#227;o [@nome_t&#237;tulo_data, 67]. </code></li>
</ul>
<p>Uma vez que rodarmos o Markdown atrav&#233;s do Pandoc, "@fyfe_digital_2011" ser&#225; expandido em uma cita&#231;&#227;o completa no estilo que desejar. &#201; poss&#237;vel usar a sintaxe da <code type="inline">@cita&#231;&#227;o</code> como preferir: em linha com o seu texto ou em notas de rodap&#233;. Para gerar a bibliografia simplesmente inclua uma se&#231;&#227;o chamada <code type="inline"># Bibliografia</code> no fim do documento. </p>
<p>Agora, retorne para o seu cabe&#231;alho de metadados no topo do seu documento .md, e especifique o ficheiro de bibliografia a ser usado, assim: </p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_11" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_11.txt"></code></pre>
<p>Isso diz ao Pandoc para procurar pela bibliografia no ficheiro <code type="inline">projeto.bib</code>, sob o mesmo diret&#243;rio que o seu <code type="inline">main.md</code>. Vamos ver se funciona. Salve o ficheiro, mude para a janela do terminal e execute: </p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_12" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_12.txt"></code></pre>
<p>O filtro &#8220;pandoc-citeproc&#8221; analisar&#225; quaisquer tags de cita&#231;&#227;o encontradas em seu documento. O resultado deve ser um ficheiro MS Word formatado. Se tiver o LaTeX instalado, converta para .pdf usando a mesma sintaxe para resultados mais bonitos. N&#227;o se preocupe se as coisas n&#227;o estiverem exatamente como prefere - lembre-se de que far&#225; o ajuste refinado da formata&#231;&#227;o de uma vez mais tarde, o mais pr&#243;ximo poss&#237;vel da data da publica&#231;&#227;o. Por enquanto, estamos apenas criando rascunhos baseados em padr&#245;es razo&#225;veis. </p>
</div><div n="1"><head>Mudando estilos de cita&#231;&#227;o</head>
<p>O estilo de cita&#231;&#227;o padr&#227;o no Pandoc &#233; <link target="https://www.chicagomanualofstyle.org/tools_citationguide/citation-guide-2.html">Chicago Author-date</link>. Podemos especificar um estilo diferente usando a folha de estilo, escrita na &#8220;Linguagem de Estilo de Cita&#231;&#227;o&#8221; (outra conven&#231;&#227;o de texto simples, neste caso para descrever estilos de cita&#231;&#227;o) e denotada pela extens&#227;o de ficheiro .csl. Felizmente, o projeto CSL mant&#233;m um reposit&#243;rio de estilos de cita&#231;&#227;o comuns, alguns at&#233; personalizados para peri&#243;dicos espec&#237;ficos. Visite <link target="http://editor.citationstyles.org/about/">http://editor.citationstyles.org/about/</link> para localizar o ficheiro .csl para Modern Language Association (Associa&#231;&#227;o de Linguagem Moderna), baixe <code type="inline">modern-language-association.csl</code> e salve no diret&#243;rio do projeto como <code type="inline">mla.csl</code>. Agora precisamos dizer ao Pandoc para usar a folha de estilo MLA em vez do padr&#227;o Chicago. Fazemos isso atualizando o cabe&#231;alho YAML:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_13" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_13.txt"></code></pre>
<p>Ent&#227;o repita o comando Pandoc para carregar seu ficheiro markdown em seu formato de destino (.pdf ou .docx):</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_14" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_14.txt"></code></pre>
<p>Traduza o comando para o Portugu&#234;s enquanto digita. Na minha cabe&#231;a, eu traduzo o comando acima em algo como: "Pandoc, pegue o meu ficheiro markdown, aplique o filtro de cita&#231;&#227;o sobre ele e retorne um ficheiro PDF". Quanto ficar mais familiarizado com as p&#225;ginas de estilo de cita&#231;&#227;o, considere adicionar os seus ficheiros .csl customizados para peri&#243;dicos do seu campo no ficheiro como um servi&#231;o para a comunidade. </p>
</div><div n="1"><head>Resumo</head>
<p>Agora, voc&#234; deve ser capaz de escrever artigos em Markdown, criar rascunhos em m&#250;ltiplos formatos, adicionar bibliografias e facilmente mudar os estilos de cita&#231;&#227;o. Um &#250;ltimo olhar no diret&#243;rio do projeto revelar&#225; v&#225;rios ficheiros de origem: o ficheiro <code type="inline">main.md</code>, o ficheiro <code type="inline">projeto.bib</code>, o ficheiro <code type="inline">mla.csl</code> e algumas imagens. Al&#233;m dos ficheiros origens, deve haver alguns ficheiros "destino" que criamos ao longo desse tutorial: <code type="inline">main.docx</code> ou <code type="inline">main.pdf</code>. A sua pasta deve se parecer com isso:</p>
<pre><code xml:id="code_autoria-sustentavel-texto-simples-pandoc-markdown_15" type="block" corresp="code_autoria-sustentavel-texto-simples-pandoc-markdown_15.txt"></code></pre>
<p>Trate seus ficheiros de origem como uma vers&#227;o autorizada de seu texto e seus ficheiros de destino como &#8220;impress&#245;es&#8221; descart&#225;veis que podem ser geradas facilmente com o Pandoc em tempo real. Todas as revis&#245;es devem ser feitas no <code type="inline">main.md</code>. O ficheiro <code type="inline">main.docx</code> est&#225; l&#225; para formata&#231;&#227;o e limpeza em est&#225;gio final. Se, por exemplo, o peri&#243;dico requisitar manuscritos com espa&#231;amento duplo, &#233; poss&#237;vel rapidamente colocar o espa&#231;amento duplo no Open Office ou Microsoft Word. Mas n&#227;o gaste muito tempo formatando. Lembre-se, tudo &#233; retirado quando o seu manuscrito vai para a impress&#227;o. O tempo gasto em formata&#231;&#227;o desnecess&#225;ria pode ser usado melhorando a prosa do seu rascunho. </p>
</div><div n="1"><head>Recursos &#250;teis</head>
<p>Se tiver problemas, n&#227;o h&#225; lugar melhor para come&#231;ar a procurar ajuda do que o <link target="http://johnmacfarlane.net/pandoc/">site do Pandoc</link> de John MacFarlane e a <link target="https://groups.google.com/forum/#%21forum/pandoc-discuss">lista de e-mails</link> associados.  Pelo menos dois sites do tipo &#8220;Pergunta e Resposta&#8221; podem responder a perguntas no Pandoc: <link target="https://stackoverflow.com/questions/tagged/pandoc">Stack Overflow</link> e <link target="https://web.archive.org/web/20190203062832/http://digitalhumanities.org/answers/">Digital Humanities Q&amp;A</link>. As perguntas tamb&#233;m podem ser feitas ao vivo, no Freenode IRC, canal #Pandoc, frequentado por um amig&#225;vel grupo de regulares. Conforme aprender mais sobre o Pandoc, tamb&#233;m pode explorar um de seus recursos mais poderosos: <link target="https://github.com/jgm/pandoc/wiki/Pandoc-Filters">filtros</link>.</p>
<p>Embora nossa sugest&#227;o seja come&#231;ar com um editor simples, muitas (mais de 70, de acordo com <link target="https://web.archive.org/web/20140120195538/http://mashable.com/2013/06/24/markdown-tools/">esta postagem do blog</link> outras alternativas espec&#237;ficas do Markdown para o MS Word est&#227;o dispon&#237;veis online, e muitas vezes sem custo. Dos aut&#244;nomos, gostamos de <link target="http://writemonkey.com/">Write Monkey</link> e <link target="https://www.sublimetext.com/">Sublime Text</link>. V&#225;rias plataformas baseadas na web surgiram recentemente que fornecem interfaces gr&#225;ficas elegantes para escrita colaborativa e controle de vers&#227;o usando Markdown. Algumas delas s&#227;o: <link target="http://prose.io/">prose.io</link>, <link target="https://www.authorea.com/">Authorea</link>, <link target="http://www.draftin.com/">Draft</link> e <link target="https://stackedit.io/">StackEdit</link>.</p>
<p>Mas o ecossistema n&#227;o &#233; limitado a editores. <link target="http://gitit.net/">Gitit</link> e <link target="https://github.com/dubiousjim/pandoc-iki">Ikiwiki</link> suportam autoria em Markdown com Pandoc como analisador. Podemos incluir nesta lista uma s&#233;rie de ferramentas que geram p&#225;ginas da Web est&#225;ticas e r&#225;pidas, <link target="https://github.com/jgm/yst">Yst</link>, <link target="https://github.com/fauno/jekyll-pandoc-multiple-formats">Jekyll</link>, <link target="http://jaspervdj.be/hakyll/">Hakyll</link> e o <link target="https://github.com/wcaleb/website">script de shell bash</link> do historiador Caleb McDaniel.</p>
<p>Por fim, plataformas de publica&#231;&#227;o completas est&#227;o se formando ao redor do uso de Markdown. O Markdown na plataforma de marketplace <link target="https://leanpub.com/">Leanpub</link> pode ser uma alternativa interessante ao modelo de publica&#231;&#227;o tradicional. E n&#243;s mesmos estamos experimentando o design de peri&#243;dicos acad&#234;micos com base no GitHub e <link target="https://readthedocs.org/">readthedocs.org</link> (ferramentas geralmente usadas para documenta&#231;&#227;o t&#233;cnica).</p>
<div n="2"><head>Notas</head>
<p><note id="1"> N&#227;o se preocupe se n&#227;o entender essa terminologia ainda!</note>
<note id="2"> Os ficheiros fonte para essa documenta&#231;&#227;o podem ser <link target="https://github.com/dh-notes/pandoc-workflow">baixados no GitHub</link>. Use a op&#231;&#227;o "raw" quando visualizar no GitHub para ver o Markdown fonte. Os autores gostariam de agradecer a Alex Gil e seus colegas do Digital Humanities Center de Columbia e aos participantes do openLab no Studio na biblioteca Butler por testar o c&#243;digo deste tutorial em uma variedade de plataformas.</note>
<note id="3"> Veja a excelente discuss&#227;o de Charlie Stross sobre esse t&#243;pico em <link target="http://www.antipope.org/charlie/blog-static/2013/10/why-microsoft-word-must-die.html">Porque Microsoft Word Deve Morrer (em ingl&#234;s)</link>. </note>
<note id="4"> N&#227;o existem boas solu&#231;&#245;es para chegar diretamente no MS Word a partir do LaTeX. </note>
<note id="5"> &#201; uma boa ideia criar o h&#225;bito de n&#227;o usar espa&#231;os em nomes de pastas ou ficheiros. Tra&#231;os ou sublinhados ao inv&#233;s de espa&#231;os nos nomes de seus ficheiros garantem uma duradoura compatibilidade entre plataformas. </note>
<note id="6"> Note que a extens&#227;o .bib pode estar "registrada" no Zotero no seu sistema operacional. Isso significa que quando se clica em um ficheiro .bib &#233; prov&#225;vel que se chame o Zotero para abri-lo, enquanto n&#243;s queremos abrir com o editor de texto. Eventualmente, pode querer associar a extens&#227;o .bib ao seu editor de texto, </note>
<note id="7"> Agrade&#231;o a <link target="https://github.com/njbart">@njbart</link> pela corre&#231;&#227;o. Em resposta a nossa sugest&#227;o original, <code type="inline">Algumas frases precisam de cita&#231;&#227;o.^[@fyfe_digital_2011 argumenta isso tamb&#233;m.]</code>, <link target="https://github.com/programminghistorian/jekyll/issues/46#issue-45559983">ele escreve</link>: &#8220;Isso n&#227;o &#233; recomendado, pois evita que se alterne facilmente entre os estilos de nota de rodap&#233; e data do autor. &#201; melhor usar o [corrigido] (sem circunflexo, sem ponto final entre colchetes e a pontua&#231;&#227;o final da frase do texto ap&#243;s os colchetes; com estilos de notas de rodap&#233;, o pandoc ajusta automaticamente a posi&#231;&#227;o da pontua&#231;&#227;o final). &#8221;</note></p>
</div></div></body>
  </text>
</TEI>
