<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Escritura sostenible en texto plano usando Pandoc y Markdown</title>
  <authors>Dennis Tenen,Grant Wythoff</authors>
  <date>2014-03-19</date>
  <translation_date>2017-04-04</translation_date>
  <editors>Fred Gibbs</editors>
  <translator>V&#237;ctor Gayol</translator>
  <translation-editor>Maria Jos&#233; Afanador-Llach</translation-editor>
  <translation-reviewer>Antonio Rojas Castro,Maria Jos&#233; Afanador-Llach</translation-reviewer>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/57</review-ticket>
  <avatar_alt>Hombre leyendo y escribiendo en un escritorio</avatar_alt>
  <layout>lesson</layout>
  <difficulty>2</difficulty>
  <activity>sustaining</activity>
  <topics>website,data-management</topics>
  <abstract>En este tutorial aprender&#225;s lo b&#225;sico de Markdown&#8212;una sintaxis de marcado para texto plano que es f&#225;cil de leer y de escribir as&#237; como Pandoc, una herramienta de l&#237;nea de comandos que convierte el texto plano en varios tipos de archivos bellamente formateados: PDF, .docx, HTML, LaTeX, presentaciones de diapositivas y m&#225;s.</abstract>
  <original>sustainable-authorship-in-plain-text-using-pandoc-and-markdown</original>
  <exclude_from_check>reviewers</exclude_from_check>
  <doi>10.46430/phes0008</doi>
</metadata>
  <text>
    <body><figure><desc/><graphic url="lexoriter.jpg"/></figure>
<div n="2"><head>Objetivos</head>
<p>En este tutorial aprender&#225;s lo b&#225;sico de Markdown -una sintaxis de marcado para texto plano que es f&#225;cil de leer y de escribir-, as&#237; como <link target="http://johnmacfarlane.net/pandoc/">Pandoc</link>, una herramienta de l&#237;nea de comandos que convierte el texto plano en varios tipos de archivos bellamente formateados: PDF, .docx, HTML, LaTeX, presentaciones de diapositivas y m&#225;s.<ref type="footnotemark" target="#1"/> Con Pandoc como tu herramienta digital de composici&#243;n tipogr&#225;fica, puedes usar la sintaxis de Markdown para a&#241;adir figuras, una bibliograf&#237;a, formato, y cambiar f&#225;cilmente estilos de citaci&#243;n de Chicago a MLA (por ejemplo), todo ello utilizando texto plano.</p>
<p>El tutorial asume que no tienes conocimientos t&#233;cnicos previos, pero escala con la experiencia ya que a menudo sugerimos t&#233;cnicas m&#225;s avanzadas hacia el final de cada secci&#243;n. &#201;stas est&#225;n claramente marcadas y pueden ser revisitadas despu&#233;s de alguna pr&#225;ctica y experimentaci&#243;n.</p>
<p>En vez de seguir este tutorial de una manera mec&#225;nica, te recomendamos esforzarte por entender las soluciones ofrecidas aqu&#237; como una <emph>metodolog&#237;a</emph> que necesitar&#237;as adaptar posteriormente para ajustarla a tu entorno y flujo de trabajo. La instalaci&#243;n de las herramientas necesarias presenta tal vez el mayor obst&#225;culo para la participaci&#243;n. Destina suficiente tiempo y paciencia para instalar todo correctamente o h&#225;zlo con un colega que tenga una configuraci&#243;n similar para ayudarse mutuamente. Consulta la secci&#243;n <link target="#recursos-%C3%BAtiles">Recursos &#250;tiles</link> m&#225;s adelante si te quedas atascado.<ref type="footnotemark" target="#2"/></p>
</div><div n="2"><head>Filosof&#237;a</head>
<p>Escribir, almacenar y recuperar documentos son actividades centrales en el flujo de trabajo de la investigaci&#243;n en humanidades. Sin embargo, muchos autores basan su pr&#225;ctica en herramientas y formatos propietarios que a veces no cubren ni siquiera los requerimientos b&#225;sicos de la escritura acad&#233;mica. Habr&#225;s experimentado cierta frustaci&#243;n por la fragilidad de las notas a pie de p&#225;gina, las bibliograf&#237;as, figuras y borradores de libros escritos en Microsoft Word o Google Docs. Sin embargo, la mayor&#237;a de las revistas a&#250;n insisten en recibir textos en formato .docx.</p>
<p>Pero m&#225;s que causar una frustaci&#243;n personal, esta dependencia a las herramientas y formatos propietarios tiene implicaciones negativas a largo plazo para la comunidad acad&#233;mica. En este entorno, las revistas deben subcontratar la composici&#243;n tipogr&#225;fica, alienan a los autores de los contextos materiales de la publicaci&#243;n a&#241;adiendo otros obst&#225;culos innecesarios a la libre circulaci&#243;n del conocimiento.<ref type="footnotemark" target="#3"/></p>
<p>Cuando utilizas MS Word, Google Docs u Open Office para escribir documentos, lo que ves no es lo que obtienes. Debajo de la capa visible de palabras, oraciones y p&#225;rrafos se encuentra una complicada capa de c&#243;digo comprensible solamente para las m&#225;quinas. Debido a esta capa oculta, tus archivos <code type="inline">.docx</code> y <code type="inline">.pdf</code> dependen de herramientas propietarias para mostrarse correctamente. Dichos documentos son dif&#237;ciles de buscar, de imprimir y de convertir a archivos con otros formatos.</p>
<p>M&#225;s a&#250;n, el tiempo utilizado en formar el documento en MS Word u Open Office se desperdicia, porque el editor de la revista donde lo env&#237;as retira todo ese formato. Tanto los autores como los editores se beneficiar&#237;an si intercambiaran archivos con un formato m&#237;nimo, dejando la composici&#243;n tipogr&#225;fica a la etapa de composici&#243;n final del proceso de publicaci&#243;n.</p>
<p>Aqu&#237; es donde brilla Markdown. Markdown es una sitaxis para el marcado sem&#225;ntico de elementos dentro de un documento de forma expl&#237;cita, no en alguna capa oculta. La idea es identificar las unidades que tienen significado para los seres humanos como t&#237;tulos, secciones, subsecciones, notas a pie de p&#225;gina y las ilustraciones. Por lo menos, los archivos seguir&#225;n siendo comprensibles para ti, incluso si el editor de textos que est&#225;s utilizando deja de funcionar o si queda fuera del mercado.</p>
<p>Escribir en esta forma libera al autor de la herramienta. Markdown se puede escribir en cualquier editor de texto y ofrece un rico ecosistema de <emph>software</emph> que puede representar ese texto en documentos con aspecto atractivo. Por esta raz&#243;n, Markdown est&#225; experimentando un periodo de crecimiento, no solamente como un medio para la escritura de documentos acad&#233;micos sino como una convenci&#243;n para la edici&#243;n en l&#237;nea en general.</p>
<p>Los editores de texto para todo pr&#243;sito m&#225;s populares incluyen <link target="https://atoms.io/">Atom</link> (para todas las plataformas) y <link target="http://notepad-plus-plus.org">Notepad++</link> (para Windows).</p>
<p>Es importante entender que Markdown no es m&#225;s que una convenci&#243;n. Los archivos Markdown se almacenan como texto plano, adem&#225;s de a&#241;adir la flexibilidad del formato. Los archivos de texto plano han existido desde los tiempos de las m&#225;quinas de escribir el&#233;ctr&#243;nicas. La longevidad de este est&#225;ndar hace, de manera inherente, que sean m&#225;s sostenibles y m&#225;s estables que los formatos propietarios. Mientras que los archivos producidos hace diez a&#241;os en Microsfot Word o en Pages de Apple pueden causar serios problemas cuando se abren con la &#250;ltima versi&#243;n del programa, a&#250;n es posible abrir un archivo de texto plano escrito en alguno de los editores de texto "muertos", del pasado, muchas d&#233;cadas despu&#233;s: AlphaPlus, Perfect Writer, Text Wizard, Spellbinder, WordStar o SCRIPSIT2.0, el favorito de Isaac Asimov producido por Radio Shack. Escribir en texto plano te garantiza que tus archivos permanecer&#225;n legibles diez, quince o veinte a&#241;os a partir de ahora. En esta lecci&#243;n se describe un flujo de trabajo que libera al investigador de programas de procesamiento de texto propietarios y archivos de formatos fr&#225;giles.</p>
<p>Ahora es posible escribir una amplia gama de documentos en un formato -art&#237;culos, entradas de blogs, wikis, programas de estudio y cartas de recomendaci&#243;n-, utilizando el mismo conjunto de herramientas y t&#233;cnicas para buscar, descubrir, hacer copias de seguridad y distribuir nuestros materiales. Tus notas, entradas de blog, documentaci&#243;n de c&#243;digo y wikis pueden ser creados en Markdown. Cada vez m&#225;s, muchas plataformas como WorPress, Reddit y GitHub soportan nativamente la escritura en Markdown. A largo plazo, tu investigaci&#243;n se beneficiar&#225; de este tipo de flujos de trabajo unificados, lo que hace que sea m&#225;s f&#225;cil guardar, buscar, compartir y organizar tus materiales.</p>
</div><div n="2"><head>Principios</head>
<p>Inspirados en las buenas pr&#225;cticas de una variedad de disciplinas nos hemos guiado por los siguientes principios:</p>
<ol>
<li>
<p><emph>Sostenibilidad.</emph> El texto plano a la vez garantiza transparencia y responde a las normas de conservaci&#243;n a largo plazo. MS Word puede seguir el camino de Word Perfect en el futuro, pero el texto plano seguir&#225; siendo siempre f&#225;cil de leer, catalogar, minar y transformar. Por otra parte, el control de versiones de texto plano permite efectuar cambios de manera f&#225;cil y potente, lo cual es muy &#250;til en la creaci&#243;n colaborativa y organizaci&#243;n de borradores. Tus archivos de texto plano ser&#225;n accesibles en tel&#233;fonos celulares, tabletas, o tal vez en una terminal de baja potencia de alguna biblioteca lejana. El texto plano es compatible con versiones anteriores y tiene garant&#237;a de futuro. Cualquier <emph>software</emph> o <emph>hardware</emph> que se presente m&#225;s adelante ser&#225; capaz de entender tus archivos de texto plano.</p>
</li>
<li>
<p><emph>Preferencia por formatos legibles por humanos.</emph> Al escribir en Word o en Google Docs, lo que se ve no es lo que se obtiene. El archivo .docx tiene caracteres escondidos, generados autom&#225;ticamente, que crean una capa de composici&#243;n tipogr&#225;fica eclipsada que hace que al usuario le sea dif&#237;cil solucionar problemas. Algo tan sencillo como pegar una imagen o un texto desde el navegador puede tener efectos impredecibles en el formato del documento.</p>
</li>
<li>
<p><emph>Separaci&#243;n de forma y contenido.</emph> Escribir y formar al mismo tiempo distrae. La idea es escribir primero y dar formato m&#225;s tarde, lo m&#225;s cerca posible al momento de la publicaci&#243;n. Una tarea como cambiar el estilo de citaci&#243;n de Chicago a MLA debe ser posible sin esfuerzo. Los editores de revistas que quieran ahorrar tiempo ante formatos innecesarios y correcci&#243;n de textos, deben ser capaces de proporcionar a sus autores una plantilla de formato que se encargue de las minucias de la composici&#243;n tipogr&#225;fica.</p>
</li>
<li>
<p><emph>Soporte del aparato cr&#237;tico.</emph> El flujo de trabajo tiene que manejar con gracia notas a pie de p&#225;gina, cifras, caracteres internacionales y bibliograf&#237;a.</p>
</li>
<li>
<p><emph>Independencia de plataforma.</emph> Como las plataformas de publicaci&#243;n se multiplican, tenemos que ser capaces de generar una multiplicidad de formatos, incluyendo presentaciones de diapositivas, impresi&#243;n, web y dispositivos m&#243;viles. Idealmente, nos gustar&#237;a ser capaces de generar los formatos m&#225;s comunes sin romper las referencias bibliogr&#225;ficas. Nuestro flujo de trabajo debe ser port&#225;til al grado que ser&#237;a bueno poder copiar una carpeta a un <emph>pendrive</emph> y saber que contiene todo lo necesario para su publicaci&#243;n. Escribir en texto plano significa que puedes compartir f&#225;cilmente, editar y archivar tus documentos en pr&#225;cticamente cualquier entorno. Por ejemplo, un temario de clase escrito en Markdown puede ser guardado como PDF, impreso como hoja de mano, convertido a HTML para la Web, todo desde el mismo archivo. Los archivos impresos y subidos a la web pueden ser publicados de la misma fuente y tener un aspecto similar, preservando la distribuci&#243;n l&#243;gica del material.</p>
</li>
</ol>
<p>Markdown y LaTeX responden a todas estas exigencias. Elegimos Markdown (y no LaTeX) porque ofrece la sintaxis m&#225;s ligera y libre de desorden (de ah&#237; "mark <emph>down</emph>"), y porque cuando se combina con Pandoc permite una mayor flexibilidad de salidas (incluyendo archivos .docx y .tex).<ref type="footnotemark" target="#4"/></p>
</div><div n="2"><head>Requisitos de <emph>software</emph></head>
<p>Expresamente omitiremos algunos detalles menudos relacionados con la instalaci&#243;n del <emph>software</emph> listado abajo para cada plataforma o sistema. Por ejemplo, no tiene sentido proporcionar las instrucciones de instalaci&#243;n para LaTeX cuando las instrucciones en l&#237;nea para tu sistema operativo siempre ser&#225;n m&#225;s completas y actualizadas. De la misma manera la mec&#225;nica de la instalaci&#243;n de Pandoc se obtiene de manera m&#225;s completa si buscas en Google "installing Pandoc", con lo que probablemente el primer resultado sea la p&#225;gina principal de Pandoc.</p>
<ul>
<li>
<p><hi rend="bold">Editor de Texto Plano</hi>. Entrar al mundo de la edici&#243;n en texto plano ampl&#237;a tu capacidad de seleccionar herramientas innovadoras de manera espectacular. Busca en l&#237;nea "markdown text editor" y experimenta con las opciones. No importa lo que utilices siempre que sea expl&#237;citamente un editor de texto plano como Atom o Notepad++. Recuerda: ya no estamos atados a la herramienta, se puede cambiar de editor en cualquier momento.</p>
</li>
<li>
<p><hi rend="bold">Terminal de l&#237;nea de comandos.</hi> Trabajar en la "l&#237;nea de comandos" es lo mismo que escribir comandos en la terminal. En Mac s&#243;lo tienes que utilizar tu <emph>Finder</emph> para acceder a "Terminal". En Windows utiliza <emph>PowerShell</emph>. Es probable que los usuarios de Linux ya est&#233;n familiarizados con sus terminales. A continuaci&#243;n, vamos a cubrir los conceptos m&#225;s basicos de c&#243;mo encontrar y utilizar la l&#237;nea de comandos.</p>
</li>
<li>
<p><hi rend="bold">Pandoc</hi>. Las instrucciones detalladas de instalaci&#243;n espec&#237;fica para cada plataforma est&#225;n disponibles en el <link target="http://johnmacfarlane.net/pandoc/installing.html">sitio web de Pandoc</link>. <emph>Para este tutorial es crucial que instales Pandoc en tu ordenador</emph>, as&#237; que aseg&#250;rate de invertir tiempo navegando por las instrucciones. Pandoc fue creado y es mantenido por John MacFarlane, profesor de Filosof&#237;a en la Universidad de California en Berkeley. Esto es <emph>humanidades digitales</emph> en su mejor expresi&#243;n y servir&#225; como el motor de nuestro flujo de trabajo. Con Pandoc ser&#225;s capaz de compilar el texto y la bibliograf&#237;a de tu trabajo en documentos con un formato flexible y atractivo. Una vez que hayas seguido las instrucciones de instalaci&#243;n, verifica su instalaci&#243;n escribiendo en la l&#237;nea de comandos de tu m&#225;quina "pandoc --version". Asumimos que por lo menos tienes la versi&#243;n 1.12.3 publicada en enero de 2014.</p>
</li>
</ul>
<p>Recomendamos que instales los dos siguientes programas de aplicaci&#243;n, aunque no son un requisito indispensable para completar este tutorial.</p>
<ul>
<li>
<p><hi rend="bold">Zotero o Endnote</hi>. El <emph>software</emph> para referencias bibliogr&#225;ficas como Zotero y Endnote son herramientas indispensables para organizar y formar citaciones en un trabajo de investigaci&#243;n. Estos programas pueden exportar tus biliotecas como un archivo BibTeX (sobre el que aprender&#225;s inmediatamente en el caso 2, m&#225;s abajo). Este archivo, que es en s&#237; mismo un documento de texto con el formato de todas tus referencias bibliogr&#225;ficas, te permitir&#225; citar publicaciones r&#225;pida y f&#225;cilmente utilizando <code type="inline">@tags</code>. Cabe se&#241;alar que tambi&#233;n es posible escribir todas tus referencias bibliograficas a mano usando <link target="https://github.com/dhcolumbia/pandoc-workflow/blob/master/pandoctut.bib">nuestra bibliograf&#237;a</link> como plantilla.</p>
</li>
<li>
<p><hi rend="bold">LaTeX</hi>. Las instrucciones detalladas para la instalaci&#243;n espec&#237;fica en cada plataforma est&#225;n disponibles en el <link target="http://johnmacfarlane.net/pandoc/installing.html">sitio web de Pandoc</link>. A pesar de que este tutorial no cubre LaTeX, &#233;ste es utilizado por Pandoc para la creaci&#243;n de PDF. Los usuarios suelen convertir en LaTeX directamente para tener un control m&#225;s minucioso de la composici&#243;n tipogr&#225;fica de los .pdf. Los principiantes pueden considerar saltarse este paso. De lo contrario, escribe en tu terminal <code type="inline">latex -v</code>para ver si LaTeX se ha instalado correctamente (obtendr&#225;s un error si as&#237; no fuera y algo de informaci&#243;n sobre la versi&#243;n si fue exitosa).</p>
</li>
</ul>
</div><div n="2"><head>Bases de Markdown</head>
<p>Markdown es una convenci&#243;n para estructurar tus documentos en texto plano de una manera sem&#225;ntica. La idea es identificar estructuras l&#243;gicas en tu documento (un t&#237;tulo, una secci&#243;n, subsecciones, notas al pie, etc.), marcarlas con algunos caracteres distintivos y luego "compilar" el texto resultante con un int&#233;rprete de composici&#243;n tipogr&#225;fica que dar&#225; forma al documento en consonancia con el estilo especificado.</p>
<p>Las convenciones para Markdown est&#225;n disponibles en varios tipos o "<emph>flavors</emph>", dise&#241;ados para su uso en contextos particulares como blogs, <emph>wikis</emph> o repositorios de c&#243;digo. El <emph>flavor</emph> de Markdown utilizado por Pandoc est&#225; orientado para un uso acad&#233;mico. Sus convenciones est&#225;n descritas en la p&#225;gina de <link target="http://pandoc.org/README.html#pandocs-markdown">Pandoc's Markdown</link>. Estas convenciones incluyen el <link target="http://johnmacfarlane.net/pandoc/README.html#yaml-metadata-block">"YAML" block</link>, que contiene una serie de metadatos muy &#250;tiles. <ref type="footnotemark" target="#ft-1"/></p>
<p>Vamos a crear ahora un documento simple en Markdown. Abre tu editor de texto plano seleccionado y escribe algo que debe tener un aspecto como el siguiente:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_0" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_0.txt"></code></pre>
<p>El Markdown "Pandoc-flavored" almacena cada uno de los valores anteriores y los "imprime" en la ubicaci&#243;n apropiada de tu documento de salida una vez que est&#225; listo para la composici&#243;n tipogr&#225;fica. M&#225;s adelante aprenderemos a incluir campos m&#225;s potentes en YAML. Por ahora, vamos a suponer que estamos escribiendo un documento compuesto por tres secciones, cada una subdividida en dos. Hay que dejar una l&#237;nea en blanco despu&#233;s de los tres &#250;ltimos guiones del bloque YAML para que puedas pegar lo que sigue:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_1" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_1.txt"></code></pre>
<p>Sigue adelante e introduce cualquier texto de relleno. Los espacios vac&#237;os tienen significado en Markdown por lo que no debes poner sangr&#237;a en los p&#225;rrafos pero s&#237; es importante que separes los p&#225;rrafos con una l&#237;nea en blanco. Las l&#237;neas en blanco tambi&#233;n deben preceder a los encabezados de secci&#243;n.</p>
<p>Puedes a&#241;adir asteriscos para dar &#233;nfasis a las palabras con negritas o cursivas de esta manera: <code type="inline">*cursivas*</code>y <code type="inline">**negritas**</code>. Tambi&#233;n hay que a&#241;adir a nuestro texto un enlace y una nota a pie de p&#225;gina para cubrir los requisitos de un texto promedio. Escribe:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_2" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_2.txt"></code></pre>
<p>Cuando el texto del enlace y la direcci&#243;n del mismo son iguales es m&#225;s r&#225;pido escribir: <code type="inline">&lt;https://www.eff.org/&gt;, en vez de [https://www.eff.org/](https://www.eff.org/)</code>.</p>
<p>Vamos a guardar nuestro archivo antes de ir m&#225;s lejos. Haz una carpeta para albergar este proyecto. Es probable que tengas un sistema de organizaci&#243;n de tus documentos, proyectos, ilustraciones y bibliograf&#237;as, pero a menudo tu documento, tus proyectos, tus ilustraciones y bibliograf&#237;as se encuentran en diferentes carpetas, lo que los hace dif&#237;ciles de encontrar. Nuestro objetivo es crear una carpeta &#250;nica para cada proyecto con todos los materiales relevantes incluidos en ella. La regla general es "un proyecto, un texto, una carpeta". Denomina a tu archivo algo as&#237; como "principal.md", donde "md" significa que es un archivo Markdown.</p>
<p>Una vez que has guardado el archivo, vamos a a&#241;adir una imagen. Copia una imagen peque&#241;a a la carpeta y a&#241;ade lo siguiente en alguna parte del cuerpo de texto: <code type="inline">![una imagen](tu_imagen.jpg)</code>.</p>
<p>En este punto tu archivo <code type="inline">principal.md</code> debe verse como sigue</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_3" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_3.txt"></code></pre>
<p>Y como veremos en breve, este archivo de texto plano se puede representar como un muy buen PDF.</p>
<figure><desc>Captura de pantalla de un PDF interpretado por Pandoc</desc><graphic url="Screen-Shot-2014-11-06.png"/></figure>
<p>Si quieres tener una idea de c&#243;mo ser&#225;n interpretado en un fomato HTML este tipo de marcado, prueba este <link target="http://daringfireball.net/projects/markdown/dingus">sitio de prueba en l&#237;nea</link> y juega con varios tipos de sintaxis. Recuerda que ciertos elementos del <emph>Pandoc-flavored markdown</emph> (como el bloque de t&#237;tulo o las notas al pie) no funcionan en esta versi&#243;n web ya que solamente acepta lo b&#225;sico.</p>
<p>En este punto, deber&#225;s ocupar alg&#250;n tiempo explorando algunas de las caracter&#237;sticas de Markdown como las citas de texto (referidas con el s&#237;mbolo <code type="inline">&gt;</code>), los listados que empiezan con <code type="inline">*</code> o <code type="inline">-</code>, los saltos de l&#237;nea literales que empiezan con <code type="inline">|</code> (&#250;tiles para poes&#237;a), las tablas y algunas otras funciones se&#241;aladas en la p&#225;gina sobre Markdown de Pandoc.</p>
<p>Presta particular atenci&#243;n a los espacios en blanco y al flujo de los p&#225;rrafos. La documentaci&#243;n lo explica sucintamente cuando define un p&#225;rrafo como "una o m&#225;s l&#237;neas de texto seguidas por una o m&#225;s l&#237;neas en blanco." Consiedra que "las nuevas l&#237;neas son tratadas como espacios" y que "si necesitas un salto de l&#237;nea elocuente, utiliza dos o m&#225;s espacios en blanco al final de la l&#237;nea." La mejor manera de entender lo que significa es experimentar libremente. Utiliza el modo de vista previa de tu editor o solamente ejecuta Pandoc para ver los resultados de tus experimentos.</p>
<p>Pero sobre todo, evita la necesidad de formatear. Recuerda que est&#225;s identificando unidades sem&#225;nticas: secciones, subsecciones, &#233;nfasis, notas al pie y figuras. Incluso <code type="inline">*cursivas*</code>y <code type="inline">**negritas**</code> en Markdown no son en realidad marcas de formato, sino que indican un nivel diferente de &#233;nfasis. La aplicaci&#243;n del formato suceder&#225; despu&#233;s, una vez que conozcas el momento del proceso en el que hay que hacerlo y los requerimientos de la publicaci&#243;n.</p>
<p>Existen programas que te permiten obtener una vista previa en vivo de la salida de markdown al tiempo que editas tu archivo de texto plano y que detallaremos m&#225;s adelante en la secci&#243;n de Recursos &#250;tiles. Algunos de ellos soportan notas a pie, figuras, incluso bibliograf&#237;as. Sin embargo, para sacar provecho al m&#225;ximo de Pandoc, te recomendamos que te quedes con lo m&#225;s sencillo: archivos de texto plano almacenados localmente en tu computadora.</p>
</div><div n="2"><head>Estar en contacto con la terminal de la m&#225;quina</head>
<p>Antes de que podamos publicar nuestro archivo <code type="inline">principal.md</code> en otros formatos, necesitamos un poco de orientaci&#243;n para trabajar en la interfaz de l&#237;nea de comandos utilizando la aplicaci&#243;n de la terminal de nuestro ordenador, que es la &#250;nica manera (y la mejor) de utilizar Pandoc.</p>
<p>La interfaz de l&#237;nea de comandos es un sitio amigable una vez que te acostumbras a ella. Si ya te es familiar la utilizaci&#243;n de l&#237;nea de comandos, puedes saltarte esta secci&#243;n. Para el resto de lectores, es importante entender que al usar la terminal directamente podr&#225;n acceder a una amplia gama de herramientas de investigaci&#243;n poderosas que de otra manera es imposible, y ser&#225; la base para trabajos m&#225;s avanzados. Para el prop&#243;sito de este tutorial necesitas aprender solamente unos cuantos comandos muy sencillos.</p>
<p>Primero, abre una nueva ventana de l&#237;nea de comandos. Si utilizas una macOS, abre Terminal en el directorio <code type="inline">Aplicaciones/Utilidades</code>. En Windows utilizar&#225;s PowerShell. En Windows 7 o posterior, recomendamos que utilices el "poweshell" o, para una soluci&#243;n m&#225;s robusta, instala el subsistema de Windows para Linux y utiliza la terminal que viene con tu distribuci&#243;n Linux favorita. Para una excelente introducci&#243;n a la l&#237;nea de comando, consulta "<link target="/es/lecciones/introduccion-a-bash">Introduction to the Bash Command
Line</link>" por Ian Milligan y James Baker.</p>
<p>En el terminal debe ver una ventana de texto y un puntero (<emph>prompt</emph>) que puede verse m&#225;s o menos como esto: <code type="inline">nombre-del-ordenador:~nombre-de-usuario$</code>. La tilde indica que est&#225;s en el directorio de usuario, y de hecho puedes escribir <code type="inline">$ cd ~</code>en cualquier punto para regresar a tu directorio de usuario. No escribas el s&#237;mbolo de moneda pues solamente indica el puntero de tu terminal, solicit&#225;ndote que escribas algo en la terminal (como opuesto a que escribas algo en un documento); recuerda introducir Enter despu&#233;s de escribir cada comando.</p>
<p>Es muy com&#250;n que tu carpeta "Documents" est&#233; localizada en este directorio. Escribe <code type="inline">$ pwd</code> (= "<emph>print working directory</emph>") y oprime Enter para mostrar el nombre del directorio actual. Utiliza <code type="inline">$ pwd</code> cada vez que sientas que te has extraviado.</p>
<p>El comando <code type="inline">$ ls</code> (= <emph>list</emph>), simplemente enlista los archivos en el directorio actual. Finalmente, puedes usar <code type="inline">$ cd&gt;</code> (= <emph>change directory</emph>) como <code type="inline">$ cd NOMBRE_DE_LA_CARPETA</code> (en donde <code type="inline">NOMBRE_DE_LA_CARPETA</code> indica la carpeta en la que quieres navegar). Puedes utilizar <code type="inline">$ cd ..</code>para moverte autom&#225;ticamente un nivel arriba en la estructura del directorio (el directorio principal de la carpeta en la que te encuentras actualmente). Una vez que has empezado a escribir el nombre de la carpeta, utiliza la tecla de tabulador para autocompletar el nombre -lo cual es particularmente &#250;til para carpetas con nombre muy largos o nombres de carpetas que contienen espacios en blanco.<ref type="footnotemark" target="#5"/></p>
<p>Estos tres comandos de terminal: <code type="inline">pwd</code>, <code type="inline">ls</code> y <code type="inline">cd</code> es todo lo que necesitas en este tutorial. Practica con ellos la navegaci&#243;n por las carpetas de tus documentos por unos minutos y mientras piensa en la manera en la que has organizado tus archivos. Si lo deseas, sigue lo que haces ayud&#225;ndote de tu organizador de archivos de la interfaz gr&#225;fica de usuario (Finder) para poder orientarte.</p>
</div><div n="2"><head>Usar Pandoc para convertir Markdown a un documento de MS Word</head>
<p>&#161;Ya estamos listos para la composici&#243;n tipogr&#225;fica! Abre la ventana de tu terminal, utiliza <code type="inline">$ pwd</code>y <code type="inline">$ cd</code> NOMBRE_DE_LA_CARPETA para navegar hasta la carpeta en la que se encuentra tu proyecto. Una vez que est&#233;s ah&#237; escribe <code type="inline">$ ls</code> en la terminal para enlistar los archivos. Si ves tu archivo <code type="inline">.md</code> y tus im&#225;genes te encuentras en el lugar correcto. Para convertir <code type="inline">.md</code> a <code type="inline">.docx</code> escribe:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_4" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_4.txt"></code></pre>
<p>Abre el arhivo con MS Word para contejar tus resultados. Si utilizas Open- o Libre Office puedes ejecutar:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_5" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_5.txt"></code></pre>
<p>Si la linea de comandos es una novedad para ti, imagina que lees los comandos anteriores y que dicen algo como: "Pandoc: crea un archivo MS Word a partir de mi archivo Markdown." La part&#237;cula <code type="inline">-o</code> es una "bandera" que en este caso dice algo como "en vez de que expl&#237;citamente tenga yo que indicarte la fuente y el objeto de los formatos de archivos, adivina con s&#243;lo ver la extensi&#243;n de los archivos." Hay muchas opciones disponibles en Pandoc a trav&#233;s de estas "banderas". Puedes ver la lista completa en el <link target="http://johnmacfarlane.net/pandoc/README.html">sitio web de Pandoc</link>, o escribiendo en la terminal:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_6" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_6.txt"></code></pre>
<p>Intenta ejecutar el comando:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_7" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_7.txt"></code></pre>
<p>Ahora navega de nuevo por el directorio de tu proyecto. &#191;Puedes decir qu&#233; sucedi&#243;?</p>
<p>Los usuarios m&#225;s avanzados que tienen instalado LaTeX querr&#225;n experimentar con la conversi&#243;n de markdown a un archivo <code type="inline">.txt</code> o a un archivo <code type="inline">.pdf</code> formateado especialmente. Una vez que se ha instalado LaTeX se pueden crear archivos PDF bellamente formados utilizando la misma estructura de comandos:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_8" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_8.txt"></code></pre>
<p>Aseg&#250;rate que tu editor de texto soporte el formato de codificaci&#243;n UTF-8. Cuando utilices LaTeX para convertir al formato .pdf, en vez del atributo <code type="inline">fontfamily</code> en YAML para cambiar la fuente, especifica el atributo <code type="inline">mainfont</code> para producir algo como esto:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_9" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_9.txt"></code></pre>
<p><note id="ft-1"> Ten en cuenta que a menudo el YAML replica algo, aunque no todo, de la funcionalidad (bandera) de la l&#237;nea de comando. Por ejemplo, los estilos de fuentes pueden pasarse a Pandoc en la forma de <code type="inline">pandoc principal.md --mainfont=times -o target.pdf</code>. Sin embargo, preferimos utilizar las opciones de, encabezado YAML siempre cuando sea posible, pues hace la funcionalidad de nuestra l&#237;nea de comandos m&#225;s f&#225;cil de escribir y recordar. Utilizando una herramienta de control de cambios como Git preservar&#225; tus cambios al YAML, mientras lo que escribes en la terminal es m&#225;s ef&#237;mero. Consulta la secci&#243;n de plantillas en el manual de Pandoc (<code type="inline">man pandoc</code>) para ver la lista de variables YAML disponibles.</note></p>
</div><div n="2"><head>Trabajar con bibliograf&#237;as</head>
<p>En esta secci&#243;n agregaremos una bibliograf&#237;a a nuestro documento y despu&#233;s la convertiremos de un formato estilo Chicago a un formato estilo MLA.</p>
<p>Si no est&#225;s usando un gestor de referencias bibliogr&#225;ficas como Endnote o Zotero, deber&#237;as comenzar a hacerlo inmediatamente. Nosotros preferimos Zotero porque, al igual que Pandoc, fue creado por la comunidad acad&#233;mica y, al igual que otros proyectos de c&#243;digo abierto, es distribuido con una Licencia P&#250;blica General de GNU. Mucho m&#225;s importante para nosotros es que tu gestor de referencias tenga la habilidad de generar bibliograf&#237;as en formato de texto plano para estar en consonancia con nuestro principio de "todo en texto plano". Prosigue y abre el gestor de referencias de tu elecci&#243;n y a&#241;ade algunas entradas de ejemplo. Cuando hayas terminado, encuentra la opci&#243;n para exportar tu bibliograf&#237;a en formato BibTeX (<code type="inline">.bib</code>). Guarda tu archivo <code type="inline">.bib</code> en el directorio de tu proyecto y dale un nombre razonable como <code type="inline">proyecto.bib</code>.</p>
<p>La idea general es mantener tus fuentes organizadas en una base de datos bibliogr&#225;fica centralizada mientras vas generando archivos <code type="inline">.bib</code> espec&#237;ficos y m&#225;s peque&#241;os que ser&#225;n almacenados en el mismo diretorio de tu proyecto. Prosigue y abre tu archivo <code type="inline">.bib</code> con el editor de texto plano que hayas elegido.<ref type="footnotemark" target="#6"/></p>
<p>Tu archivo <code type="inline">.bib</code> deber&#225; contener m&#250;ltiples entradas que se ven m&#225;s o menos as&#237;:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_10" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_10.txt"></code></pre>
<p>Rara vez tendr&#225;s que editar esto a mano (aunque puedes hacerlo). En la mayor&#237;a de los casos, simplemente exportas el archivo <code type="inline">.bib</code> de Zotero o de un gestor de referencias similar. Tomate un tiempo para orientarte en esto. Cada entrada consiste en un tipo de documento, "art&#237;culo" (<emph>article</emph>) en nuestro caso, un identificador &#250;nico (fyfe_digital_2011) y los metadatos relevantes de t&#237;tulo (<emph>title</emph>), autor (<emph>author</emph>), etc. Lo que m&#225;s nos interesa es el identificador (ID) &#250;nico que sigue inmediatamente al s&#237;mbolo de llave ( { ) en la primera l&#237;nea de cada entrada. El ID &#250;nico es lo que nos permite conectar la bibliograf&#237;a con el documento principal. Deja este archivo abierto por ahora y regresa a tu archivo <code type="inline">principal.md</code>.</p>
<p>Edita la nota a pie de p&#225;gina en la primera l&#237;nea de tu archivo <code type="inline">principal.md</code> para que se vea de una forma parecida a los siguientes ejemplos en los cuales <code type="inline">@nombre_t&#237;tulo_fecha</code> puede ser reemplazado por uno de los ID &#250;nicos de tu archivo <code type="inline">proyecto.bib</code>.</p>
<ul>
<li><code type="inline">Una referencia bibliogr&#225;fica formateada como &#233;sta se traducir&#225; apropiadamente tanto en un estilo de citaci&#243;n en texto -como en nota a pie- [@nombre_t&#237;tulo_fecha, 67].</code><ref type="footnotemark" target="#7"/></li>
<li><code type="inline">"Para citas entrecomilladas, pon la coma afuera de los signos de las comillas" [@nombre_t&#237;tulo_fecha, 67].</code></li>
</ul>
<p>Una vez que ejecutes el markdown a trav&#233;s de Pandoc, "@fyfe_digital_2011" se ampliar&#225; a una citaci&#243;n completa en el estilo que hayas seleccionado. Puedes usar la sintaxis <code type="inline">@citacion</code> de cualquier manera que veas que encaja: dentro de las l&#237;neas de tu texto o en las notas a pie. Para generar una bibliograf&#237;a simplemente incluye una secci&#243;n llamada <code type="inline"># Bibliograf&#237;a</code> al final del documento.</p>
<p>Ahora, vayamos de nuevo a nuestro bloque de metadatos en el encabezado de tu documento <code type="inline">.md</code>, y especifica el archivo de bibliograf&#237;a que deber&#225; utilizarse, algo como:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_11" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_11.txt"></code></pre>
<p>Esto le dice a Pandoc que busque tu bibliograf&#237;a en el archivo <code type="inline">proyecto.bib</code> dentro del mismo directorio de tu archivo <code type="inline">principal.md</code>. Veamos si esto trabaja. Guarda tu archivo, ve a la ventana de terminal y ejecuta:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_12" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_12.txt"></code></pre>
<p>El filtro "citeproc" compila todas tus etiquetas de citas. El resultado debe ser un archivo de MS Word formateado decentemente. Si tienes instalado LaTeX, convi&#233;rtelo a .pdf utilizando la misma sintaxis para mejores resultados. No te preocupes si las cosas no aparecen exactamente de la manera que t&#250; quisieras -recuerda que vas a afinar el formato de todo una vez y m&#225;s tarde, lo m&#225;s cerca posible del momento de la publicaci&#243;n. Por ahora solamente estamos creando borradores basados en valores por defecto.</p>
</div><div n="2"><head>Cambiar los estilos de citaci&#243;n</head>
<p>El estilo de citaci&#243;n por defecto en Pandoc es el de Chicago Autor-fecha. Podemos especificar un estilo diferente utilizando una hoja de estilo escrita en "lenguaje de estilo de citaci&#243;n" (CSL por <emph>citation style language</emph>, otra convenci&#243;n en texto plano utilizada para describir estilos de citas) y que es designado por la extensi&#243;n de archivo <code type="inline">.csl</code>. Afortunadamente, el proyecto CSL mantiene un repositorio de estilos de citaciones comunes, algunas incluso ajustadas a ciertas revistas en espec&#237;fico. Visita <link target="http://editor.citationstyles.org/about/">http://editor.citationstyles.org/about/</link> para encontrar el archivo <code type="inline">.csl</code> para el estilo Modern Language Association (MLA), descarga el archivo <code type="inline">modern-language-association.csl</code> y gu&#225;rdalo en la carpeta de tu proyecto como <code type="inline">mla.csl</code>. Ahora, necesitamos indicarle a Pandoc que utilice la hoja de estilo de MLA en vez de la de Chicago que tiene por defecto. Haremos esto actualizando el encabezado o bloque YAML:</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_13" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_13.txt"></code></pre>
<p>Despu&#233;s simplemente utiliza la funcionalidad de Pandoc para transformar tu archivo de markdown a tu formato objetivo (.pdf o .docx):</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_14" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_14.txt"></code></pre>
</div><div n="2"><head>Resumen</head>
<p>Ahora debes ser capaz de escribir art&#237;culos en Markdown, crear borradores en varios formatos, a&#241;adir bibliograf&#237;as y cambiar estilos de citaci&#243;n de manera sencilla. Un vistazo final al directorio de tu proyecto te mostrar&#225; un n&#250;mero de archivos de origen de datos: tu archivo <code type="inline">principal.md</code>, el archivo <code type="inline">proyecto.bib</code>, el archivo <code type="inline">mla.csl</code>, y algunas im&#225;genes. Adem&#225;s de los archivos de origen, deber&#237;as ver algunos archivos de salida que creamos durante el tutorial: <code type="inline">principal.docx</code> o <code type="inline">principal.pdf</code>. Tu carpeta debe verse m&#225;s o menos de esta manera.</p>
<pre><code xml:id="code_escritura-sostenible-usando-pandoc-y-markdown_15" type="block" corresp="code_escritura-sostenible-usando-pandoc-y-markdown_15.txt"></code></pre>
<p>Trata tus archivos de origen como versiones autorizadas de tu texto y los archivos de salida como impresiones desechables que puedes  generar f&#225;cilmente y sobre la marcha con Pandoc. Todas las revisiones deben ir dentro del archivo <code type="inline">principal.md</code>. El archivo <code type="inline">principal.docx</code> est&#225; ah&#237; para la &#250;ltima etapa de limpieza y formato. Por ejemplo, si la revista requiere manuscritos a doble espacio, puedes darle el doble espacio r&#225;pidamente en Open Office o Microsoft Word. Pero no gastes demasiado tiempo formando. Recuerda que el manuscrito debe ir despojado de todo cuando va a imprenta. El tiempo dedicado a formar cosas innecesarias puede aprovecharse mejor en pulir la prosa de tu borrador.</p>
</div><div n="2"><head>Recursos &#250;tiles</head>
<p>En caso de meterte en problemas no hay un mejor lugar para empezar a buscar soluciones que el <link target="http://johnmacfarlane.net/pandoc/">sitio web de Pandoc</link> de John MacFarlane y la <link target="https://groups.google.com/forum/#%21forum/pandoc-discuss">lista de correos</link> afiliada (en ingl&#233;s). Al menos en dos sitios de tipo "Pregunta y respuesta" puedes encontrar respuestas a preguntas sobre Pandoc: <link target="http://stackoverflow.com/questions/tagged/pandoc">Stack Overflow</link> y <link target="http://web.archive.org/web/20190203062832/http://digitalhumanities.org/answers/">Digital Humanities Q&amp;A</link>. Puedes hacer preguntas en vivo en Freenode IRC, #Pandoc channel, frecuentado por un amistoso grupo de asiduos. A medida que aprendas m&#225;s acerca de Pandoc, puedes explorar una de sus particularidades m&#225;s poderosa: <link target="https://github.com/jgm/pandoc/wiki/Pandoc-Filters">filtros</link>.</p>
<p>Aunque te sugerimos comenzar con un simple editor de texto plano, hay muchas m&#225;s alternativas (m&#225;s de 70, de acuerdo con <link target="http://web.archive.org/web/20140120195538/http://mashable.com/2013/06/24/markdown-tools/">esta entrada de blog</link> a MS Word para trabajar espec&#237;ficamente con Markdown, disponibles en l&#237;nea y a menudo sin costo. Para las aut&#243;nomas nos gustan <link target="http://mouapp.com/">Mou</link>, <link target="http://writemonkey.com">Write Monkey</link>, y <link target="http://www.sublimetext.com/">Sublime Text</link>. Varias plataformas web que han surgido recientemente proporcionan interfaces gr&#225;ficas adecuadas para desarrollar una escritura colaborativa con seguimiento de cambios en las versiones utilizando Markdown. &#201;stas incluyen: <link target="http://prose.io">prose.io</link>, <link target="http://www.authorea.com">Authorea</link>, <link target="http://www.draftin.com">Draft</link>, y <link target="https://stackedit.io">StackEdit</link>.</p>
<p>Pero el ecosistema no est&#225; limitado s&#243;lo a editores. <link target="http://gitit.net/">Gitit</link> e <link target="https://github.com/dubiousjim/pandoc-iki">Ikiwiki</link> soportan escritura en Markdown utilizando Pandoc como compilador. A esta lista se puede agregar una serie de herramientas que generan p&#225;ginas web est&#225;ticas de manera r&#225;pida: <link target="https://github.com/jgm/yst">Yst</link>, <link target="http://github.com/fauno/jekyll-pandoc-multiple-formats">Jekyll</link>, <link target="http://jaspervdj.be/hakyll/">Hakyll</link> y <link target="https://github.com/wcaleb/website">bash shell script</link> por el historiador Caleb McDaniel.</p>
<p>Finalmente, se est&#225;n creando plataformas de publicaci&#243;n enteras basadas en el uso de Markdown. La plataforma de mercado <link target="https://leanpub.com">Leanpub</link> puede ser una alternativa interesante al modelo tradicional de publicaci&#243;n y nosotros mismos estamos experimentando con el dise&#241;o de una revista acad&#233;mica en GitHub y <link target="http://readthedocs.org">readthedocs.org</link> (herramientas que suelen utilizarse para t&#233;cnicas de documentaci&#243;n).</p>
<p><note id="1"> &#161;No te preocupes si no entiendes a&#250;n esta terminolog&#237;a!</note></p>
<p><note id="2"> <link target="https://github.com/dhcolumbia/pandoc-workflow">GitHub</link>. Utiliza la opci&#243;n "raw" cuando lo veas en GitHub para observar la fuente de Markdown. Los autores queremos agradecer a Alex Gil y sus colegas del Columbia's Digital Humanities Center, y a los participantes de openLab en el Studio de la Bilioteca Butler por probar el c&#243;digo de este tutorial en diversas plataformas.</note></p>
<p><note id="3"> V&#233;ase la excelente discusi&#243;n sobre este tema, por Charlie Stross, en <link target="http://www.antipope.org/charlie/blog-static/2013/10/why-microsoft-word-must-die.html">Why Microsoft Word Must Die</link>.</note></p>
<p><note id="4"> Considera que la extensi&#243;n <code type="inline">.bib</code> debe estar "vinculada" a Zotero en tu sistema operativo. Esto significa que si haces doble click en un archivo <code type="inline">.bib</code>, es probable que Zotero intente abrir el archivo mientras que nosotros queremos abrirlo con un editor de texto. Es posible que en el futuro quieras asociar la extensi&#243;n <code type="inline">.bib</code> a tu editor de texto.</note></p>
<p><note id="5"> No hay buenas soluciones para traducir a MS Word desde LaTeX.</note></p>
<p><note id="6"> Es una buena idea crearse el h&#225;bito de no usar espacios en el nombre de una carpeta o un archivo. Los guiones y guiones bajos en vez espacios en los nombres de archivo aseguran una compatibilidad perdurable entre plataformas cruzadas.</note></p>
<p><note id="7"> Gracias a <link target="https://github.com/njbart?">@njbart</link> por la correcci&#243;n. En respuesta a nuestra sugerencia original: <code type="inline">Alguna frase que necesita citaci&#243;n.^[@fyfe_digital_2011 argues that too.]</code> <link target="https://github.com/programminghistorian/jekyll/issues/46#issuecomment-59219906">&#233;l escribe</link>: "This is not recommended since it keeps you from switching easily between footnote and author-date styles. Better use the [corrected] (no circumflex, no final period inside the square braces, and the final punctuation of the text sentence after the square braces; with footnote styles, pandoc automatically adjusts the position of the final punctuation)."</note></p>
</div></body>
  </text>
</TEI>
