<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Exhibici&#243;n digital m&#237;nima e interactiva con CollectionBuilder</title>
  <collection>lessons</collection>
  <layout>lesson</layout>
  <slug>exhibicion-con-collection-builder</slug>
  <authors>Jennifer Isasi</authors>
  <editors>Maria Jos&#233; Afanador-Llach,Isabelle Gribomont</editors>
  <reviewers>Juan Pablo Angarita Bernal,Mat&#237;as Butelman</reviewers>
  <date>2022-08-21</date>
  <difficulty>2</difficulty>
  <activity>presenting</activity>
  <topics>website,data-visualization</topics>
  <abstract>En esta lecci&#243;n aprender&#225;s a utilizar la versi&#243;n ligera de CollectionBuilder para publicar una colecci&#243;n digital.</abstract>
  <avatar_alt>Interior de una sala de museo antiguo.</avatar_alt>
  <doi>10.46430/phes0060</doi>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/407</review-ticket>
</metadata>
  <text>
    <body>
      <div n="2"><head>Objetivos</head>
<ul>
<li>Aprender a utilizar la versi&#243;n ligera de CollectionBuilder</li>
<li>Localizar la interfaz web al espa&#241;ol</li>
<li>Publicar una colecci&#243;n digital siguiendo los preceptos "minimal computing"</li>
</ul>
</div>
      <div n="2"><head>Pre-requisitos</head>
<p>Esta lecci&#243;n se va a enfocar en la versi&#243;n m&#225;s sencilla de <link target="https://collectionbuilder.github.io"><hi rend="bold">CollectionBuilder</hi></link>, que podr&#225;s manejar desde el navegador web y una cuenta gratuita de GitHub. Para ello, es necesario tener nociones b&#225;sicas de:</p>
<ul>
<li>
<p>Archivos de im&#225;genes en formato JPEG o PNG y/o archivos de audio en formato MP3<ref type="footnotemark" target="#1"/></p>
<p><note id="1"> Puedes aprender a editar archivos de audio para reducir su tama&#241;o con la lecci&#243;n <link target="/es/lecciones/editar-audio-con-audacity">"Editar audio con Audacity"</link> de Brandon Walsh y traducida por Jos&#233; Antonio Motilla.</note></p>
</li>
<li>
<p>Curadur&#237;a de metadatos, guardados en formato CSV</p>
</li>
<li>
<p>Escritura en formato Markdown<ref type="footnotemark" target="#2"/></p>
<p><note id="2"> Si necesitas aprender este formato te recomendamos la lecci&#243;n de Sarah Simpkin y traducida por V&#237;ctor Gayol <link target="/es/lecciones/introduccion-a-markdown">"Introducci&#243;n a Markdown"</link></note></p>
</li>
<li>
<p>Manejo de una cuenta y un repositorio b&#225;sico en GitHub</p>
</li>
</ul>
</div>
      <div n="2"><head>Reutilizaci&#243;n de colecciones digitalizadas con Collection Builder</head>
<p>Los archivos, bibliotecas y museos digitalizan cada vez m&#225;s sus colecciones con tres objetivos clave: primero, quieren preservar una copia digital del objeto f&#237;sico; segundo, buscan ofrecer la copia digital para evitar el desgaste del objeto durante consultas o exposiciones; y tercero, la copia digital sirve para la diseminaci&#243;n de su acervo a corto y largo plazo. No existe un &#250;nico modelo para estas tres tareas y, por ello, las opciones de sistemas inform&#225;ticos para realizar cada una de ellas es muy amplia. Esta lecci&#243;n se enfoca en el tercer objetivo de la digitalizaci&#243;n, a saber, la diseminaci&#243;n de la colecci&#243;n, y te ense&#241;a a utilizar una de las herramientas m&#225;s sencillas de todas las disponibles para crear exposiciones digitales, desde la metodolog&#237;a de la computaci&#243;n m&#237;nima.</p>
<p>En el contexto de archivos peque&#241;os, CollectionBuilder resulta muy c&#243;modo porque permite publicar im&#225;genes de resoluci&#243;n media de documentos, fotograf&#237;as, obras de arte, etc., as&#237; como grabaciones que quieran circularse o darse a conocer entre la comunidad de usuarios. Y esto puede hacerse desde la reutilizaci&#243;n de archivos ya digitalizados y adaptados para esta plataforma o bien desde copias digitales de menor calidad.</p>
<p>Se recomienda el uso de CollectionBuilder, por ejemplo, para crear exhibiciones digitales temporales (tres meses, seis meses, etc.), que den acceso a la colecci&#243;n a aquellos usuarios que no tengan acceso a las instalaciones f&#237;sicas del museo o archivo. Tambi&#233;n puede usarse como complemento a las exhibiciones temporales, para proporcionar archivos extra, mayor contexto, etc. Adem&#225;s, puesto que los usuarios pueden descargar los datos de la colecci&#243;n, se puede aprovechar la plataforma como herramienta para promover el an&#225;lisis y la visualizaci&#243;n de datos.</p>
<p>En caso de contar con un acervo digital de la colecci&#243;n de un archivo o museo, se podr&#225;n reutilizar los archivos digitales en una menor resoluci&#243;n que la original y as&#237; dar salida o acceso a documentos u otros elementos hist&#243;ricos de forma r&#225;pida sin necesidad de tener acceso a internet de alta velocidad.</p>
<p>CollectionBuilder cuenta con tres versiones de, m&#225;s o menos, la misma herramienta, cada una con funcionalidades algo m&#225;s complejas o mayor nivel de personalizaci&#243;n posible: CB en GitHub Pages, CB Stand Alone y CB CSV. Para crear una colleci&#243;n digital sencilla sin necesidad de tener conocimientos de inform&#225;tica avanzados, nosotros vamos a utilizar su versi&#243;n basada totalmente en GitHub: <hi rend="bold"><link target="https://github.com/CollectionBuilder/collectionbuilder-gh">collectionbuilder-gh</link></hi>.  </p>
<div n="3"><head>&#191;Qu&#233; es CollectionBuilder-GH?</head>
<p>CollectionBuilder-GH es una herramienta de c&#243;digo abierto para publicar exhibiciones digitales basadas en metadatos y formada por la tecnolog&#237;a de p&#225;ginas web est&#225;ticas. Su objetivo principal es ofrecer un modelo simple para diseminar colecciones de forma pr&#225;ctica y sostenible que, a la vez, no involucre conocimientos de inform&#225;tica avanzada. As&#237;, las exhibiciones est&#225;n formadas por tres archivos b&#225;sicos (hoja de c&#225;lculo con metadatos, archivos audio visuales y un archivo de configuraci&#243;n) y un conjunto de archivos Jekyll basado en GitHub, que sigue la metodolog&#237;a <hi rend="bold"><link target="https://lib-static.github.io/">Lib-STATIC</link></hi> desarrollada en la biblioteca de la Universidad de Idaho en Estados Unidos.</p>
<p>El objetivo de la metodolog&#237;a Lib-STATIC es utilizar la tecnolog&#237;a de webs est&#225;ticas y las habilidades de clasificaci&#243;n y creaci&#243;n de metadatos de los bibliotecarios para crear publicaciones interesantes y con las que el p&#250;blico puede interactuar f&#225;cilmente.</p>
<p>CollectionBuilder-GH (CB-GH) es una de las alternativas de tipo computaci&#243;n m&#237;nima (minimal computing), que se refiere a "la actividad computacional que se realiza bajo restricciones significativas de hardware, software, educaci&#243;n, capacidad de red, energ&#237;a u otros factores" (<link target="https://go-dh.github.io/mincomp/about/"><emph>Minimal Computing: a working group of GO::DH</emph></link>). Precisamente, por su formato, las exhibiciones digitales creadas con CollectionBuilder en GitHub necesitar&#225;n de menos hardware o tecnolog&#237;a y menos ancho de banda de Internet. Adem&#225;s, est&#225; totalmente adaptada a sistemas celulares. Este sistema es una buena alternativa a sistemas de exhibiciones digitales como <link target="https://es.wikipedia.org/wiki/Omeka">Omeka</link> y al algo m&#225;s complejo sistema <link target="https://minicomp.github.io/wax/">Wax</link>, para aquellos que no tengan recursos inform&#225;ticos avanzados a su alcance, que no dispongan del tiempo para aprender a utilizar algo m&#225;s complicado y, en resumidas cuentas, que quieran reutilizar de forma r&#225;pida las colecciones digitalizadas en sus archivos para dar acceso a su comunidad.</p>
<p>El trabajo para crear CB-GH est&#225; financiada por una beca National Leadership Grants for Libraries Planning Grant ofrecida por el Instituto de Servicios de Museos y Bibliotecas (<link target="https://www.imls.gov">IMLS</link>, por sus siglas en ingl&#233;s). Varias bibliotecas y museos ya han utilizado esta herramienta para la diseminaci&#243;n de sus colecciones u otros prop&#243;sitos, como son <link target="https://drodz11.github.io/colors-of-ozu/">Colors of Ozu</link>, de Dave Rodriguez o la <link target="http://dna.nust.na/heritage_week/">Namibia Heritage Week 2020</link>, de Namibia University of Science and Technology.</p>
</div></div>
      <div n="2"><head>1. Preparar los archivos b&#225;sicos para la colecci&#243;n</head>
<p>CollectionBuilder-GH est&#225; basado en cuatro componentes b&#225;sicos que generan la p&#225;gina web est&#225;tica en la que puedes publicar exhibiciones para tu proyecto: Jekyll, Git/GitHub, Bootstrap 4 y archivos de datos CSV y YAML. Y es que para preparar la exhibici&#243;n solo necesitar&#225;s preocuparte de tener una colecci&#243;n de objetos que quieras presentar con su correspondiente informaci&#243;n. Para presentarla en la web sin m&#225;s a&#241;adidos, puedes crear y/o editar los dos tipos de documentos explicados a continuaci&#243;n. Explicaremos c&#243;mo editar p&#225;ginas de contexto y los componentes de navegaci&#243;n m&#225;s adelante.</p>
<div n="3"><head>Colecci&#243;n de objetos</head>
<p>CollectionBuilder-GH est&#225; pensado para ser utilizado con colecciones peque&#241;as. Para poder utilizar la versi&#243;n gratuita de GitHub, el total de los archivos de la exhibici&#243;n no puede superar 1GB de peso. Por eso, se recomienda que la carpeta de im&#225;genes no supere los 500MB. Puedes realizar la edici&#243;n necesaria en im&#225;genes de alta resoluci&#243;n que ya tengas con cualquier software de editado de im&#225;genes, como <link target="http://www.gimp.org.es/descargar-gimp.html">GIMP</link>. Es importante tener en cuenta las siguientes consideraciones:</p>
<ul>
<li>
<p>Formato de los objetos: GitHub y esta herramienta aceptan los formatos m&#225;s comunes de im&#225;genes y audio con los que ya estar&#225;s familiarizado: jpg, png y mp3. Tambi&#233;n puedes utilizar enlaces externos a objetos en YouTube o Vimeo, pero estos no aparecer&#225;n dentro de la exhibici&#243;n</p>
</li>
<li>
<p>Tama&#241;o de cada archivo: La <link target="https://es.wikipedia.org/wiki/Resoluci%C3%B3n_de_imagen">resoluci&#243;n de las im&#225;genes</link> no debe superar los 1200px, esto es, deben ser inferiores a 1MB. Ten en cuenta que utilizar un tama&#241;o mayor a lo anterior no s&#243;lo limitar&#225; el n&#250;mero de im&#225;genes que puedes a&#241;adir (500MB en total) sino que tambi&#233;n ralentizar&#225; la carga de las im&#225;genes para tu audiencia. Si sabes que la mayor&#237;a de los usuarios acceder&#225;n a la colecci&#243;n a trav&#233;s de un tel&#233;fono m&#243;vil y con una conexi&#243;n limitada a Internet, un tama&#241;o de im&#225;genes o audio inferior har&#225; m&#225;s f&#225;cil su tarea</p>
</li>
<li>
<p>Nombre de cada archivo: Debe ser una cadena de caracteres, sin espacios, en min&#250;sculas y sin caracteres especiales como la barra diagonal <code type="inline">/</code>, aunque puedes usar el gui&#243;n <code type="inline">-</code> y el gui&#243;n bajo <code type="inline">_</code> para separar palabras. Vas a utilizar este nombre en la casilla "filename" en los metadatos para conectar el objeto con sus datos</p>
</li>
<li>
<p>Localizaci&#243;n: La colecci&#243;n de objetos u archivos ir&#225;, tal cual, en la carpeta "objects" en el repositorio</p>
</li>
</ul>
</div><div n="3"><head>Documento de metadatos</head>
<p>CollectionBuilder funciona con una simple hoja de metadatos para cada uno de los objetos que queramos mostrar en la colecci&#243;n. Por ejemplo, si descargas <link target="https://docs.google.com/spreadsheets/d/1Uv9ytll0hysMOH1j-VL1lZx6PWvc1zf3L35sK_4IuzI/edit#gid=0">su plantilla de Google Drive</link> (en ingl&#233;s) o <link target="/assets/exhibicion-con-collection-builder/collectionbuilder-metadata-template.csv">de nuestro repositorio</link>, ver&#225;s que es una hoja de c&#225;lculo con una columna para el ID (identificaci&#243;n) de cada objeto y m&#250;ltiples columnas para las caracter&#237;sticas de estos:</p>
<figure><desc>Plantilla de metadatos de Collection Builder</desc><graphic url="exhibicion-con-collection-builder01.png"/></figure>
<p>Puedes trabajar con dicho archivo, editar el archivo "metadata-template.csv" en la carpeta "_data" o generar un archivo de valores separados por comas con los campos obligatorios que mostramos a continuaci&#243;n y despu&#233;s cargarlo al repositorio. En cualquier caso, debes dejar los nombres de cada columna en ingl&#233;s (a lo largo de esta lecci&#243;n se traducen entre par&#233;ntesis para tu referencia) ya que los podemos traducir en un archivo de configuraci&#243;n en la misma carpeta, como veremos m&#225;s abajo.</p>
<p>A continuaci&#243;n explicamos los campos obligatorios, los campos para generar visualizaciones y los campos totalmente opcionales:</p>
<div n="4"><head>Campos obligatorios</head>
<ul>
<li>
<p>objectid (identificaci&#243;n del objeto): Esta es la informaci&#243;n que CB utiliza para identificar cada objeto (imagen o audio) y unirlo a sus metadatos correspondientes. Debe ser una cadena de caracteres, sin espacios, en min&#250;sculas y sin caracteres especiales como la <code type="inline">/</code> aunque puedes usar el gui&#243;n (<code type="inline">-</code>) y la barra baja (<code type="inline">_</code>) para separar palabras. Ejemplo: <code type="inline">poster_001</code></p>
</li>
<li>
<p>filename (nombre del archivo): Esto corresponde al t&#237;tulo de cada archivo en la colecci&#243;n m&#225;s la extensi&#243;n de formato (.png o .jpg, por ejemplo) o el enlace a la URL del archivo en otro lugar externo. Ejemplo: <code type="inline">poster_001.jpg</code></p>
</li>
<li>
<p>title (t&#237;tulo): Sigue la idea de t&#237;tulo de objetos de las normas de metadatos y corresponde a un t&#237;tulo que lleve el objeto original. Se recomienda que sea corto y descriptivo. Ejemplo: <code type="inline"> Coordinadora Nacional de la Mujer Savaldore&#241;a - CONAMUS</code></p>
</li>
<li>
<p>format (formato): Aqu&#237; se indica el formato del objeto mostrado. Es importante que rellenes este campo puesto que CB lo utiliza para crear las visualizaciones interactivas seg&#250;n el tipo de objeto que a&#241;adas. Estas son una de las opciones que puedes usar:</p>
<ul>
<li>Para im&#225;genes: <code type="inline">image/jpeg o png</code></li>
<li>Para documentos: <code type="inline">application/pdf</code></li>
<li>Para audio: <code type="inline">audio/mp3</code></li>
<li>Para video:<code type="inline">video/mp3</code></li>
</ul>
</li>
</ul>
</div><div n="4"><head>Campos para visualizaciones</head>
<p>CollectionBuilder cuenta con la creaci&#243;n autom&#225;tica de visualizaciones o puntos de entrada a la colecci&#243;n, a trav&#233;s de la informaci&#243;n proporcionada en el archivo de metadatos. Estos pueden ser de gran utilidad para nuestra audiencia pues generar&#225;n visualizaciones interactivas para explorar la colecci&#243;n en diferentes p&#225;ginas. Cada p&#225;gina "extra" necesita un tipo de informaci&#243;n diferente, que se explica a continuaci&#243;n:</p>
<ul>
<li>
<p>Map (mapa): Crear&#225; un mapa y, para ello, requiere de los campos de metadatos en las columnas latitude (latitud, informaci&#243;n de norte-sur) y longitude  (longitud, informaci&#243;n de este-oeste), es decir, los datos de coordenadas de una localizaci&#243;n correspondiente al objeto que presentas en la exhibici&#243;n. Por ejemplo: una fotograf&#237;a de la catedral de San Salvador llevar&#225; las coordenadas <code type="inline">43.2145</code> y <code type="inline">5.5035</code></p>
</li>
<li>
<p>Timeline (l&#237;nea de tiempo): Se refiere a una fecha asociada en el tiempo a cada imagen y genera una p&#225;gina con las im&#225;genes ordenadas por fecha. Por tanto, requiere datos cronol&#243;gicos en la columna date. El formato a seguir es <code type="inline">aaaa-mm-dd</code> con los cuatro d&#237;gitos del a&#241;o siendo el valor m&#237;nimo que se necesita para formar la l&#237;nea de tiempo. Ejemplos: para el 25 de diciembre de 1989: <code type="inline">1989-12-25</code></p>
</li>
<li>
<p>Subjects (temas): Forma una nube de palabras con los temas sobre los que trata cada objeto en la columna subject. Puedes colocar m&#250;ltiples temas en cada casilla (por cada objeto) y separarlos por un punto y coma (<code type="inline">;</code>). Ejemplo: <code type="inline">catedral; religi&#243;n; edificio</code>. Recuerda que es importante contar con un vocabulario de temas reducido a seguir por todo el equipo y que debe tener siempre la misma forma de escritura: min&#250;sculas o may&#250;sculas, tildes, singular o plural, etc., porque si no, ver&#225;s un tema duplicado (la m&#225;quina no sabe que <code type="inline">edificio</code> y <code type="inline">edificios</code> corresponde a una misma cosa)</p>
</li>
<li>
<p>Location (lugares): Es similar a la p&#225;gina de temas ya que formar&#225; una nube de palabras correspondientes a la localizaci&#243;n de las im&#225;genes. Utiliza una coma (<code type="inline">,</code>) para separar, por ejemplo, una localidad y una regi&#243;n dentro del pa&#237;s, o un pa&#237;s. Puedes incluir varios lugares para una misma imagen usando tambi&#233;n el punto y coma (<code type="inline">;</code>) para separarlos</p>
</li>
</ul>
</div><div n="4"><head>Campos opcionales</head>
<p>Como en cualquier archivo de metadatos que sea creado por seres humanos y que no siga una plantilla est&#225;tica con campos siempre iguales, puedes a&#241;adir m&#225;s informaci&#243;n para cada objeto en tu colecci&#243;n, siguiendo los intereses de los creadores y la audiencia de la colecci&#243;n digital. Estos que mostramos son solo algunas de las opciones que puedes a&#241;adir:</p>
<ul>
<li>
<p>creator (creador): Nombre de la persona que cre&#243; el objeto original que se ha digitalizado</p>
</li>
<li>
<p>description (descripci&#243;n): Una nota breve sobre el objeto</p>
</li>
<li>
<p>source (fuente): Designa la fuente del objeto, como puede ser su localizaci&#243;n en la colecci&#243;n f&#237;sica en un archivo y puede seguir su formato correspondiente</p>
</li>
<li>
<p>language (idioma): Puede indicar el idioma asociado al objeto. En caso de a&#241;adirlo, se recomienda seguir el c&#243;digo ISO 659-2 de cada idioma: <code type="inline">en</code> para ingl&#233;s, <code type="inline">es</code> para espa&#241;ol, <code type="inline">pt</code> para portugu&#233;s, etc&#233;tera</p>
</li>
<li>
<p>rights (derechos): Un texto que contenga informaci&#243;n sobre los derechos de la audiencia sobre los objetos digitales</p>
</li>
</ul>
</div></div></div>
      <div n="2"><head>2. "Instalaci&#243;n" de CollectionBuilder</head>
<p>Lo primero que necesitas es tener una <link target="https://github.com">cuenta en GitHub</link> para tu archivo, biblioteca, museo o una cuenta personal. Para instalar CollectionBuilder simplemente tendr&#225;s que clonar su repositorio, cargar tu colecci&#243;n, localizar la web a tu idioma (opcional), configurar la p&#225;gina web y publicar la exhibici&#243;n. Excepto algunos pasos, como los anteriores, todo esto se puede realizar a trav&#233;s del navegador web y a partir de aqu&#237; te ense&#241;o c&#243;mo hacerlo.</p>
<blockquote>
<p>Ver&#225;s que en el perfil de GitHub de CollectionBuilder hay cuatro repositorios. En esta lecci&#243;n nos interesa el que puede ser manejado completamente en/a trav&#233;s de GitHub: collectionbuilder-gh</p>
</blockquote>
<div n="3"><head>Clonar el repositorio a nuestra cuenta GitHub</head>
<ol>
<li>
<p>Abre el navegador y con&#233;ctate a tu cuenta de GitHub</p>
</li>
<li>
<p>Navega a la p&#225;gina de GitHub de CollectionBuilder y el repositorio que nos interesa en <link target="https://github.com/CollectionBuilder/collectionbuilder-gh">https://github.com/CollectionBuilder/collectionbuilder-gh</link></p>
</li>
<li>
<p>Haz click en el bot&#243;n verde que dice "Use this template" (usar esta plantilla)</p>
<figure><desc>Clonar repositorio" alt="Imagen que indica d&#243;nde clicar para clonar el repositorio.</desc><graphic url="exhibicion-con-collection-builder02.png"/></figure>
</li>
<li>
<p>Se abrir&#225; una ventana nueva con las instrucciones para clonar todos los archivos de <code type="inline">collectionbuilder-gh</code> en un nuevo repositorio en tu cuenta de GitHub:</p>
<ol>
<li>
<p>Da un nombre al que ser&#225; tu nuevo repositorio</p>
</li>
<li>
<p>Opcional: Escribe una descripci&#243;n para ese repositorio</p>
</li>
<li>
<p>Puesto que tu cuenta es gratuita, debes dejar el repositorio abierto al p&#250;blico</p>
</li>
<li>
<p>Deja sin marcar la casilla "Include all branches" (incluir todas las ramas)</p>
</li>
<li>
<p>Haz click en el bot&#243;n verde que dice "Create repository from this template" (crear repositorio desde esta plantilla)</p>
</li>
</ol>
</li>
</ol>
<figure><desc>Campos a rellenar para clonar el repositorio" alt="Imagen de los campos a rellenar para clonar el repositorio.</desc><graphic url="exhibicion-con-collection-builder03.png"/></figure>
<p>Si te aparece una nueva pantalla donde aparece tu nombre de cuenta de GitHub seguido por el nombre que has dado al nuevo repositorio &#161;felicidades! has clonado de forma correcta la base o plantilla de CollectionBuilder para tu exhibici&#243;n.</p>
<figure><desc>El repositorio ha sido copiado a tu cuenta" alt="Imagen de que nuestra un nuevo repositorio en tu cuenta.</desc><graphic url="exhibicion-con-collection-builder04.png"/></figure>
<div n="4"><head>Contenido de la copia de CollectionBuilder</head>
<p>Brevemente, el contenido de cada carpeta es el siguiente:</p>
<ul>
<li>
<p>_data: Contiene tres tipos de archivos que ayudan a formar el "esqueleto" de la exhibici&#243;n. En formato CSV (valores separados por comas) tenemos, primero, <code type="inline">metadata-template.csv</code> o una plantilla para los metadatos tal y como deben ir (excepto lo notado arriba) para que la herramienta funcione. Tambi&#233;n a&#241;aden un ejemplo en el archivo <code type="inline">demo-metadata.csv</code>. Tambi&#233;n encontramos aqu&#237; el vocabulario para las p&#225;ginas de navegar por los objetos (<code type="inline">config-browse.csv</code>), ver el mapa (<code type="inline">config-map.csv</code>), los metadatos (<code type="inline">config-metadata.csv</code>), navegaci&#243;n general o men&#250; (<code type="inline">config-nav.csv</code>), b&#250;squeda (<code type="inline">config-search.csv</code>) y una tabla (<code type="inline">config-table.csv</code>). Finalmente, en esta misma carpeta encontramos el archivo de tipo YML (<link target="https://es.wikipedia.org/wiki/YAML">formato de serializaci&#243;n de datos legible por humanos</link>) de configuraci&#243;n del tema de la p&#225;gina y del que no te tienes que preocupar</p>
</li>
<li>
<p>_includes y _layouts: Estas carpetas contienen los archivos HTML que forman muchas de las funcionalidades de la herramienta CollectionBuilder. Para un uso sencillo de la misma y si no tienes conocimientos inform&#225;ticos, es mejor que no te preocupes por editar estos archivos</p>
</li>
<li>
<p>_sass y assets: Aqu&#237; se encuentran los archivos SCSS (<link target="https://es.wikipedia.org/wiki/Sass">Syntactically Awesome Style Sheets</link>) que aporta el lado visual a la p&#225;gina web (colores, tama&#241;os de fuentes, etc.) y los archivos JSON (JavaScript Object Notation o <link target="https://es.wikipedia.org/wiki/JSON">notaci&#243;n de objeto de JavaScript</link>) que hacen que todo funcione. De nuevo, si no tienes conocimientos de c&#243;mo escribir css o json, es mejor que ignores estos archivos por el momento</p>
</li>
<li>
<p>docs: Aqu&#237; puedes encontrar instrucciones en ingl&#233;s referidas a la creaci&#243;n de mini-iconos para tu p&#225;gina (<code type="inline">create-favicon.md</code> y <code type="inline">create-thumbs.md</code>), la funcionalidad para a&#241;adir servicios de google (<code type="inline">google.md</code>), informaci&#243;n sobre campos de metadatos (<code type="inline">metadata-info.csv</code>) y otra copia de la plantilla de metadatos (<code type="inline">metadata-template.csv</code>)  </p>
</li>
<li>
<p>objects: Este es el directorio en el que se guardar&#225;n las im&#225;genes o archivos digitales de la colecci&#243;n con la que quieras crear tu exhibici&#243;n digital</p>
</li>
<li>
<p>pages: Contiene los archivos en formato markdown que forman parte de lo que llamamos la informaci&#243;n contextual de tu colecci&#243;n digital: informaci&#243;n (<code type="inline">about.md</code>), navegar (<code type="inline">browse.md</code>), y conjunto de datos (<code type="inline">data.md</code>) y otros que son, simplemente, el t&#237;tulo de las p&#225;ginas (que cambiaremos a otro idioma) de los objetos (<code type="inline">item.md</code>), el mapa (<code type="inline">map.md</code>), la barra de b&#250;squeda (<code type="inline">search.md</code>), la p&#225;gina de navegaci&#243;n por palabras clave (<code type="inline">subject.md</code>)  y la l&#237;nea de tiempo que se genera siguiendo el orden de las fechas en los metadatos (<code type="inline">timeline.md</code>)  </p>
</li>
</ul>
<p>Existen tambi&#233;n una serie de archivos individuales ya en la carpeta del repositorio. Solamente tendr&#225;s que preocuparte, ya al final, por el que se llama "_config.yml" y que ser&#225; el que edites para configurar tu p&#225;gina web antes de publicarla (con una URL, t&#237;tulo, informaci&#243;n de derechos, etc.)</p>
</div></div></div>
      <div n="2"><head>3. Cargar los archivos b&#225;sicos para la colecci&#243;n</head>
<p>Una vez que tengas claro qu&#233; archivos van en cada carpeta y hayas creado una colecci&#243;n con objetos de tu elecci&#243;n junto con sus metadados, es momento de cargar todo al repositorio.</p>
<div n="3"><head>Cargar im&#225;genes</head>
<p>Como se ha indicado, la colecci&#243;n de im&#225;genes o audios ir&#225; en la carpeta llamada "objects". Para ello, entra en dicha carpeta y sigue estas instrucciones para cargar las im&#225;genes juntas. Aseg&#250;rate de subir las correctas de una vez, pues para editarlas tendr&#225;s que borrar y volver a cargar los archivos.</p>
<ol>
<li>
<p>Entra en la carpeta "objects"</p>
</li>
<li>
<p>Haz click en el bot&#243;n que dice "Add file" o a&#241;adir archivo arriba a la derecha</p>
</li>
<li>
<p>Haz click en la opci&#243;n "Upload files" o cargar archivos</p>
<figure><desc>C&#243;mo cargar o subir los objetos a la carpeta objects" alt="Imagen que indica c&#243;mo subir los archivos a la carpeta objects.</desc><graphic url="exhibicion-con-collection-builder05.png"/></figure>
</li>
<li>
<p>Arrastra los archivos a la caja donde dice "Drag files here to add them to your repository" o arrastra hasta aqu&#237; los archivos que quieres a&#241;adir en tu repositorio</p>
</li>
<li>
<p>A&#241;ade una descripci&#243;n simple de lo que acabas de hacer en la caja que dice "Add files via upload" (a&#241;adir archivos mediante carga) y, para seguir buenas pr&#225;cticas, a&#241;ade una descripci&#243;n algo m&#225;s indicativa de lo que acabas de a&#241;adir en la caja de texto</p>
</li>
<li>
<p>Finalmente, aseg&#250;rate de que dejas marcada la opci&#243;n "Commit directly to the <code type="inline">main</code> branch" (aceptar cambios directamente en la rama <code type="inline">principal</code>) y  haz click en el bot&#243;n verde que dice "Commit changes" o aceptar cambios</p>
</li>
</ol>
<figure><desc>C&#243;mo guardar los cambios realizados" alt="Imagen que indica c&#243;mo guardar los cambios realizados.</desc><graphic url="exhibicion-con-collection-builder06.png"/></figure>
<p>&#161;Ya est&#225;! Si todo ha ido bien, ahora deber&#237;as ver los archivos de tus im&#225;genes en la carpeta objects.</p>
</div><div n="3"><head>Cargar metadatos</head>
<p>Si tienes tu archivo con los metadatos para los objetos en formato CSV en tu computadora, c&#225;rgalo a la carpeta de "_data" siguiendo el mismo proceso de carga de archivos de objetos que acabas de ver.</p>
<ol>
<li>Entra en la carpeta "_data"</li>
<li>Haz click en el bot&#243;n que dice "Add file" o a&#241;adir archivo arriba a la derecha</li>
<li>Haz click en la opci&#243;n "Upload files" o cargar archivos</li>
<li>Arrastra o busca tu archivo CSV de metadatos y c&#225;rgalo (aseg&#250;rate de saber su nombre)</li>
<li>A&#241;ade una descripci&#243;n a la tarea realizada y acepta los cambios en la rama principal</li>
</ol>
<p>De forma alternativa, puedes editar el archivo de metadatos existente haciendo clic en el lapicero de edici&#243;n que aparece arriba a la derecha al entrar al archivo. Sigue el formato de separaci&#243;n de columnas.</p>
</div></div>
      <div n="2"><head>4. P&#225;ginas de contexto</head>
<p>Hay una serie de p&#225;ginas en la exhibici&#243;n que contienen lo que podr&#237;amos llamar informaci&#243;n contextual de la colecci&#243;n presentada en esta herramienta. Lo mejor para dar a conocer la colecci&#243;n de tus archivos es agregar informaci&#243;n de contexto y/o interpretativa para tu audiencia, igual que si estuvieran visitando el archivo de forma f&#237;sica y consultando los objetos. Esto es, toda la informaci&#243;n adicional relacionada con la colecci&#243;n en su conjunto y no simplemente de cada objeto en particular o de forma individual: &#191;Qui&#233;n es responsable de la curadur&#237;a de los objetos presentados en la colecci&#243;n digital? &#191;Cu&#225;l es la entidad responsable de la creaci&#243;n y mantenimiento de la p&#225;gina? &#191;Hay alguna entidad que financia el proyecto?, etc. Estas p&#225;ginas est&#225;n escritas en formato de escritura markdown con un sencillo sistema de formato Jekyll que configura su visualizado. Para procesarlas, todas estas p&#225;ginas deben seguir el formato de inicio YAML como este:</p>
<pre><code class="language-yaml" xml:id="code_exhibicion-con-collection-builder_0" type="block" corresp="code_exhibicion-con-collection-builder_0.txt"></code></pre>
<p>El inicio de YAML necesita tres guiones (<code type="inline">---</code>) de principio y tres de final. Entre dichos guiones, van los tres elementos necesarios para procesar la p&#225;gina: <code type="inline">title</code>, <code type="inline">layout</code> y <code type="inline">permalink</code>.</p>
<p>Esta informaci&#243;n no se ver&#225; en la p&#225;gina final de tu colecci&#243;n digital.</p>
<h4>Formato markdown</h4>
<p>Para crear o editar estas p&#225;ginas, debes utilizar el formato de marcado para escritura markdown (con extensi&#243;n de formato <code type="inline">.md</code>). Si no lo conoces, puedes leer esta <link target="/es/lecciones/introduccion-a-markdown">Introducci&#243;n a Markdown</link> escrita por Sarah Simpkin.</p>
<div n="3"><head>Listado de p&#225;ginas contextuales</head>
<h5>P&#225;gina de Informaci&#243;n (About)</h5>
<p>Hasta que te sientas c&#243;modo/a creando p&#225;ginas nuevas, lo mejor es utilizar la ya incluida <code type="inline">about.md</code> con el prop&#243;sito de a&#241;adir esta informaci&#243;n. Navega a la carpeta pages (p&#225;ginas) y entra en el archivo markdown. Ver&#225;s que primero incluye el bloque de YAML explicado m&#225;s arriba, en el que puedes cambiar el t&#237;tulo (<emph>title</emph>) a algo en espa&#241;ol u otro idioma.</p>
<p>Puedes empezar a escribir, en formato markdown, inmediatamente despu&#233;s del bloque YAML.</p>
<p>Se incluye adem&#225;s un bloque escrito en <link target="https://shopify.github.io/liquid/">lenguaje de formato Liquid</link> (solo en ingl&#233;s) que podr&#225;s utilizar m&#225;s adelante para a&#241;adir alguna imagen en esta p&#225;gina. Este utiliza una combinaci&#243;n de objetos, etiquetas y filtros dentro de los archivos de plantilla, como el que est&#225;s editando, para mostrar contenido din&#225;mico.</p>
</div><div n="3"><head>Men&#250; de navegaci&#243;n</head>
<p>Para que las p&#225;ginas de contexto aparezcan en tu p&#225;gina web, deber&#225;s incluir su nombre en el archivo de valores separado por comas llamado <code type="inline">config-nav.csv</code> de tu repositorio en la carpeta "_data". Si no has cambiado el nombre de archivo para la p&#225;gina de informaci&#243;n <code type="inline">about.md</code> no necesitas editar este archivo; por el contrario, si lo has cambiado o si necesitas a&#241;adir otra p&#225;gina, aseg&#250;rate de editar tambi&#233;n este archivo.</p>
</div></div>
      <div n="2"><head>5. Editar el idioma de la p&#225;gina web en CollectionBuilder</head>
<p>Puedes cambiar el idioma por defecto de la plataforma al tuyo propio. A diferencia de otros contenidos m&#225;s sencillos de a&#241;adir, el cambio de idioma de la interfaz supone indagar un poco en los archivos de c&#243;gido de la colecci&#243;n y aqu&#237; te ense&#241;amos c&#243;mo. Familiar&#237;zate con <link target="https://collectionbuilder.github.io/collectionbuilder-gh/">la pagina de ejemplo</link> que nos ofrece Collection-Builder-gh para saber qu&#233; est&#225;s editando (y podr&#225;s seguir realizando esta localizaci&#243;n una vez publiques y veas tu p&#225;gina web).</p>
<div n="3"><head>Men&#250; de navegaci&#243;n (Navigation Menu)</head>
<p>Es muy sencillo cambiar a otro idioma las palabras que aparecen en la barra o el men&#250; de navegaci&#243;n de tu web desde el archivo <code type="inline">config-nav.csv</code> en la carpeta "_data". Se trata de un archivo de valores separados por comas con dos columnas. Edita las palabras de la columna "display_name" (lo que se muestra) por la palabra aqu&#237; en espa&#241;ol (u otro idioma):</p>
<table>
<thead>
<tr>
<th>Nombre en ingl&#233;s</th>
<th>en espa&#241;ol</th>
</tr>
</thead>
<tbody>
<tr>
<td>Home</td>
<td>Inicio</td>
</tr>
<tr>
<td>Browse</td>
<td>Navegar</td>
</tr>
<tr>
<td>Subjects</td>
<td>Temas</td>
</tr>
<tr>
<td>Map</td>
<td>Mapa</td>
</tr>
<tr>
<td>Timeline</td>
<td>L&#237;nea de tiempo</td>
</tr>
<tr>
<td>Data</td>
<td>Datos</td>
</tr>
<tr>
<td>About</td>
<td>M&#225;s informaci&#243;n</td>
</tr>
</tbody></table><p>Si quieres a&#241;adir la p&#225;gina con nube de palabras de localizaciones, solamente tienes que a&#241;adir una l&#237;nea con la palabra "Localizaciones". Y si quieres quitar una de las p&#225;ginas de tu web, simplemente borra la l&#237;nea.</p>
</div><div n="3"><head>Informaci&#243;n de metadatos</head>
<p>Es muy sencillo editar los campos de metadatos para que aparezcan en espa&#241;ol u otro idioma aunque tu archivo contenga el nombre de las columnas en ingl&#233;s. Como arriba, vamos a editar un archivo CSV de configuraci&#243;n dentro de la carpeta "_data", en este caso <code type="inline">config-metadata.csv</code></p>
<pre><code xml:id="code_exhibicion-con-collection-builder_1" type="block" corresp="code_exhibicion-con-collection-builder_1.txt"></code></pre>
<p>&#191;Has a&#241;adido alguna columna que no estaba presente en el modelo o "demo" de Collection Builder? Es un buen momento para a&#241;adir ese campo de informaci&#243;n extra en este archivo si quieres que aparezca junto con cada objeto.</p>
</div><div n="3"><head>P&#225;gina de Inicio (Home page)</head>
<p>Puedes editar los botones y varios t&#237;tulos en la pag&#237;na de inicio desde la carpeta "index" (&#237;ndice) en la carpeta "_includes" (incluye). Aqu&#237; podr&#225;s encontrar varios archivos HTML y cada uno pertenece a una tarjeta de la p&#225;gina de inicio.</p>
<div n="4"><head>Descripci&#243;n</head>
<p>El archivo <code type="inline">description.html</code> contiene la informaci&#243;n descriptiva de tu p&#225;gina de inicio y aqu&#237; podemos reemplazar varias palabras a otros idiomas. Las palabras que pueden ser modificadas est&#225;n "fuera" de las etiquetas sem&#225;nticas de formato HTML. Veamos un ejemplo:</p>
<p>De la l&#237;nea <code type="inline">&lt;h5 class="card-title"&gt;Description&lt;/h5&gt;</code> podemos reemplazar "Description" por "Descripci&#243;n" puesto que est&#225; fuera de las etiquetas de t&#237;tulo de nivel 5 y clase "tarjeta de t&#237;tulo, enmarcadas entre  <code type="inline">&lt;&gt;</code> en su apertura y <code type="inline">&lt;/&gt;</code>.</p>
<p>M&#225;s abajo, tambi&#233;n puedes editar la l&#237;nea en la que enlazamos la p&#225;gina de inicio con la p&#225;gina de informaci&#243;n sobre el proyecto (en <code type="inline">about.md</code>). De igual forma, tenemos que identificar la informaci&#243;n que queda fuera de las etiquetas de apertura y cierre en formato HTML (<code type="inline">&lt;&gt;</code> y  <code type="inline">&lt;/&gt;</code>):  </p>
<p><code type="inline">&lt;a class="btn btn-outline-primary" href="/cb-docs/about.html"&gt;Learn More &amp;raquo;&lt;/a&gt;</code></p>
<p>Cambia "Learn More " por algo como "Aprende m&#225;s".</p>
<p>Puedes cambiar el resto de botones y t&#237;tulos de tu p&#225;gina de inicio de esta forma en el resto de archivos de la carpeta mencionada.</p>
</div></div><div n="3"><head>P&#225;gina de exploraci&#243;n de la colecci&#243;n (Browse)</head>
<p>La p&#225;gina de navegaci&#243;n de la colecci&#243;n sirve para explorar todos los objetos en tu colecci&#243;n. Puesto que esta p&#225;gina es algo m&#225;s complicada en s&#237; misma por su funcionalidad, tenemos que editar varios archivos para diferentes partes (mostradas en esta captura):</p>
<figure><desc>Ejemplo de la p&#225;gina para navegar por los objetos de la colecci&#243;n" alt="Captura de la p&#225;gina para navegar por los objetos de la colecci&#243;n.</desc><graphic url="exhibicion-con-collection-builder07.png"/></figure>
<div n="4"><head>T&#237;tulo</head>
<p>Ver&#225;s que esta p&#225;gina tiene por t&#237;tulo "Browse Items". Para cambiarlo a otro idioma, busca el archivo markdown <code type="inline">browse.md</code> en la carpeta "pages" (p&#225;ginas). Aqu&#237;, reemplaza el t&#237;tulo de nivel 2 (marcado con dos s&#237;mbolos de almohadilla o <code type="inline">#</code>) "Browse Items" por algo como "Explora la colecci&#243;n" (o lo m&#225;s adecuado para tu regi&#243;n.)</p>
</div><div n="4"><head>Opciones de filtrado</head>
<p>Para editar los botones cerca de la caja de filtrado en esta p&#225;gina, hay que editar el archivo <code type="inline">browse.html</code>en la carpeta "_layouts" (plano). Con la funci&#243;n de b&#250;squeda de caracteres de tu computadora (ctrl + F), busca las palabras fuera de las etiquetas HTML (ejemplo <code type="inline">&gt;Random&lt;</code>), que aqu&#237; aparecen en la primera columna, y reempl&#225;zalas por las palabras de la segunda:</p>
<table>
<thead>
<tr>
<th>Palabra original</th>
<th>Palabra en espa&#241;ol</th>
</tr>
</thead>
<tbody>
<tr>
<td>Sort by</td>
<td>Ordenar por</td>
</tr>
<tr>
<td>Random</td>
<td>Orden aleatorio</td>
</tr>
<tr>
<td>Reset</td>
<td>Empezar</td>
</tr>
<tr>
<td>Title</td>
<td>T&#237;tulo</td>
</tr>
<tr>
<td>Loading...</td>
<td>Cargando...</td>
</tr>
</tbody></table><p>Hay dos elementos que no est&#225;n fuera de las etiquetas HTML pero que tambi&#233;n podemos editar para localizar m&#225;s nuestra p&#225;gina; se trata de "filtrar" y "buscar":</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_2" type="block" corresp="code_exhibicion-con-collection-builder_2.txt"></code></pre>
</div><div n="4"><head>Conteo de art&#237;culos</head>
<p>Finalmente, podemos editar el conteo de art&#237;culos disponibles durante la exploraci&#243;n de la colecci&#243;n (que antes de la b&#250;squeda indica el n&#250;mero total de art&#237;culos en la colecci&#243;n) y que ver&#225;s que por defecto dice "# of # items" (n&#186; de n&#186; elementos). Edita el archivo JavaScript <code type="inline">browse-js.html</code> en las carpetas <hi rend="bold">_includes/js</hi>. Busca la l&#237;nea:</p>
<pre><code class="language-javascript" xml:id="code_exhibicion-con-collection-builder_3" type="block" corresp="code_exhibicion-con-collection-builder_3.txt"></code></pre>
<p>Reemplaza la preposici&#243;n inglesa "of" por la tuya "de" y el sustantivo "items" por "objetos".</p>
<p>Vamos a aprovechar que estamos en este archivo para cambiar el texto del bot&#243;n que dice "View Full Record" por "Ver registro completo" en el c&#243;digo:</p>
<pre><code class="language-javascript" xml:id="code_exhibicion-con-collection-builder_4" type="block" corresp="code_exhibicion-con-collection-builder_4.txt"></code></pre>
</div></div><div n="3"><head>P&#225;ginas de visualizaciones opcionales</head>
<p>Las p&#225;ginas dedicadas a crear visualizaciones opcionales a partir de los datos a&#241;adidos en el archivo de metadatos tambi&#233;n aparecen con t&#237;tulos en ingl&#233;s que podemos editar a otro idioma. Adem&#225;s, hay algunos ajustes que deber&#225;s hacer para facilitar su visualizaci&#243;n:</p>
<div n="4"><head>Mapa</head>
<p>Para editar el bot&#243;n que dice "View item" (ver objeto) en la ventanilla "pop-up" que aparece cuando hacemos click en un objeto en el mapa, buscaremos el archivo <code type="inline">map-js.html</code> en las carpetas "_includes/js". Busca el siguiente c&#243;digo y reemplaza las palabras "View Item" por "Ver objeto":</p>
<pre><code class="language-javascript" xml:id="code_exhibicion-con-collection-builder_5" type="block" corresp="code_exhibicion-con-collection-builder_5.txt"></code></pre>
<p>Para editar los nombres de la informaci&#243;n que aparece en las ventanas o "pop-up" en cada objeto en el mapa, podemos editar la p&#225;gina <code type="inline">config-map.csv</code> dentro de la carpeta "_data". Deber&#225;s dejar la primera columna (<code type="inline">field</code>) en ingl&#233;s pero puedes cambiar la segunda (<code type="inline">display_name</code> o mostrar nombre) a tu idioma:</p>
<pre><code class="language-csv" xml:id="code_exhibicion-con-collection-builder_6" type="block" corresp="code_exhibicion-con-collection-builder_6.txt"></code></pre>
<div n="5"><head>Cambiar el lugar por defecto del mapa</head>
<p>Por defecto, en CB-gh aparece la regi&#243;n de Idaho, Estados Unidos en la p&#225;gina que contiene el mapa, sin importar d&#243;nde est&#233;n las coordenadas dadas a nuestros objetos en los metadatos. Para centrar, digamos, el mapa al lugar donde est&#225;n las im&#225;genes de la colecci&#243;n, basta con editar estos dos datos en la secci&#243;n dedicada al mapa en el archivo <code type="inline">theme.yml</code>en la carpeta "_data":</p>
<pre><code xml:id="code_exhibicion-con-collection-builder_7" type="block" corresp="code_exhibicion-con-collection-builder_7.txt"></code></pre>
<p>Adem&#225;s, si necesitas m&#225;s o menos zoom sobre el mapa, puedes editar el campo dedicado a ello en la misma secci&#243;n del archivo, con un rango de entre <code type="inline">0</code> y <code type="inline">18</code>:</p>
<p><code type="inline">zoom-level: 5 </code></p>
</div></div></div><div n="3"><head>P&#225;gina de datos</head>
<p>Esta p&#225;gina ofrece un cuadro que, por defecto, aparece en ingl&#233;s. Podemos cambiar dichos t&#233;rminos en el archivo <code type="inline">config-table.csv</code> en la carpeta "_data". Como arriba, podemos cambiar la segunda columna a espa&#241;ol:</p>
<pre><code class="language-csv" xml:id="code_exhibicion-con-collection-builder_8" type="block" corresp="code_exhibicion-con-collection-builder_8.txt"></code></pre>
<p><hi rend="bold">Bot&#243;n de descarga</hi>: Hay dos partes a editar. Primero, para cambiar las palabras "Download Data" por "Descargar datos" en el bot&#243;n de descarga de los datos en la parte derecha de la p&#225;gina, entramos al archivo <code type="inline">data-download-modal.html</code> en la carpeta "_includes" y buscamos la l&#237;nea de c&#243;digo:</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_9" type="block" corresp="code_exhibicion-con-collection-builder_9.txt"></code></pre>
<p>Cambia "Download Data" por algo como "Descargar datos".</p>
<p>Por otro lado, para editar las opciones, en ingl&#233;s, que aparecen al hacer click en dicho bot&#243;n de descarga de datos, debemos editar otra parte del c&#243;digo en ese mismo archivo:</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_10" type="block" corresp="code_exhibicion-con-collection-builder_10.txt"></code></pre>
<p>Cambia el texto dentro de las clases "card-title" y  "card-text":</p>
<p>"card-title": Metadata completa</p>
<p>"card-text": Todos los campos de metadatos de la colecci&#243;n est&#225;n disponibles en formato CSV o JSON.</p>
</div><div n="3"><head>P&#225;gina de Informaci&#243;n (About)</head>
<p>A parte de los cambios explicados m&#225;s arriba, puedes cambiar ciertas palabras que aparecen por defecto en esta p&#225;gina. Para editar la palabra "Contents" (contenidos) en el men&#250; de navegaci&#243;n entra al archivo <code type="inline">nav-menu.html</code> en las carpetas "_includes/feature" y busca la siguiente l&#237;nea de c&#243;digo para cambiar la palabra:</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_11" type="block" corresp="code_exhibicion-con-collection-builder_11.txt"></code></pre>
<p>Si prefieres deshacerte de este men&#250; por completo, puedes borrar la siguiente l&#237;nea de c&#243;digo:</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_12" type="block" corresp="code_exhibicion-con-collection-builder_12.txt"></code></pre>
</div><div n="3"><head>P&#225;gina de b&#250;squeda</head>
<p>Como otros sistemas de generaci&#243;n de exposiciones digitales, CB tiene una p&#225;gina que sirve para realizar b&#250;squedas sobre nuestra colecci&#243;n. Para cambiar esta p&#225;gina al espa&#241;ol u otro idioma, vamos a editar el archivo <code type="inline">search.html</code>en la carpeta "_layouts" y varias l&#237;neas de c&#243;digo:</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_13" type="block" corresp="code_exhibicion-con-collection-builder_13.txt"></code></pre>
<p>En esta l&#237;nea de arriba reemplaza "Search Operators!" por "Operadores de b&#250;squeda", para cambiar el texto que aparece en el bot&#243;n de b&#250;squeda. Y en la de abajo cambia "Lunr Search Operators" por "Operadores de b&#250;squeda Lunr"</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_14" type="block" corresp="code_exhibicion-con-collection-builder_14.txt"></code></pre>
<p>Para indicar a los usuarios qu&#233; tipo de b&#250;squeda pueden realizar, vamos a editar las siguientes l&#237;neas:</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_15" type="block" corresp="code_exhibicion-con-collection-builder_15.txt"></code></pre>
<p>C&#225;mbialo por:</p>
<pre><code class="language-html" xml:id="code_exhibicion-con-collection-builder_16" type="block" corresp="code_exhibicion-con-collection-builder_16.txt"></code></pre>
<p>Seguramente nos hemos olvidado de indicar qu&#233; archivo editar para traducir alg&#250;n t&#233;rmino en particular. No obstante, con este recorrido deber&#237;as ser capaz de localizar y editar esa palabra que encuentres trabajando en tu exhibici&#243;n digital en particular.</p>
</div></div>
      <div n="2"><head>6. Publicar nuestra exhibici&#243;n digital</head>
<p>Una vez que tienes todo lo anterior preparado, puedes realizar los &#250;ltimos cambios para poder publicar la exposici&#243;n digital en Internet. Para ello, vamos a editar uno de los archivos inform&#225;ticos m&#225;s importantes en el sistema de computaci&#243;n m&#237;nima que estamos usando: <code type="inline">_config.yml</code> Despu&#233;s, haremos unos cambios o a&#241;adidos en GitHub mismo para indicarle que debe hacer p&#250;blica la web que hemos creado.</p>
<div n="3"><head>Instrucciones para el config.yml</head>
<p>El archivo  <code type="inline">_config.yml</code>, en formato YAML, es utilizado para generar o configurar la web por Jekyll y GitHub. Aunque no es mucho, hay diferentes variables -rellenadas por defecto con informaci&#243;n aleatoria- que debes editar en este archivo para que todo funcione correctamente. Lo importante est&#225; en el c&#243;digo siguiente, "site settings" o configuraci&#243;n de p&#225;gina:</p>
<pre><code class="language-yml" xml:id="code_exhibicion-con-collection-builder_17" type="block" corresp="code_exhibicion-con-collection-builder_17.txt"></code></pre>
<p>Cambia la informaci&#243;n en las siguientes secciones, sin cambiar el nombre de cada secci&#243;n:</p>
<ul>
<li>
<p>"title" o t&#237;tulo: Corresponde al t&#237;tulo de tu colecci&#243;n digital</p>
</li>
<li>
<p>"tagline" o subt&#237;tulo: Puede ser una explicaci&#243;n de tu colecci&#243;n digital</p>
</li>
<li>
<p>"description" o descripci&#243;n: Escribe una descripci&#243;n m&#225;s larga sobre lo que contiene la colecci&#243;n</p>
</li>
<li>
<p>"author" o autor/a: Nombre de la entidad o persona creadora de la exposici&#243;n</p>
</li>
<li>
<p>"metadata" o metadatos: Nombre del archivo de metadatos que has cargado anteriormente, sin la terminaci&#243;n de formato (<code type="inline">.csv</code>)</p>
</li>
</ul>
<p>Puesto que vas a utilizar GitHub Pages para publicar esta p&#225;gina web, no necesitas hacer m&#225;s cambios.</p>
</div><div n="3"><head>Publicar la p&#225;gina GitHub Pages</head>
<p>&#161;Es el momento de "activar" tu exposici&#243;n digital en la web! Para ello, vamos a realizar unos pasos de configuraci&#243;n dentro de la interfaz de GitHub:</p>
<ol>
<li>Ve a la p&#225;gina del repositorio y busca la p&#225;gina de "Settings" (configuraci&#243;n) arriba a la derecha</li>
<li>Aqu&#237;, haz click en "Pages" (p&#225;ginas) en el men&#250; de la izquierda</li>
<li>En la secci&#243;n "Source", haz click en el bot&#243;n donde dice "None" (ninguno/a) y selecciona la opci&#243;n "main" (principal)</li>
<li>Haz click en "Save" (guardar)</li>
</ol>
<figure><desc>Publicar la p&#225;gina web." alt="Captura con las instrucciones de publicar la p&#225;gina</desc><graphic url="exhibicion-con-collection-builder08.png"/></figure>
<p>Al guardar el cambio, aparecer&#225;n nuevas opciones y, lo m&#225;s importante, la URL de tu colecci&#243;n digital:</p>
<figure><desc>Ejemplo con la publicaci&#243;n de la p&#225;gina." alt="Captura del mensaje al publicar la p&#225;gina</desc><graphic url="exhibicion-con-collection-builder09.png"/></figure>
<p>&#161;Felicidades! Ya tienes una p&#225;gina web con tu colecci&#243;n digital que puedes compartir con tus usuarios. Haz click en la URL azul o copia y p&#233;gala en un navegador o tel&#233;fono celular para verla.</p>
</div></div>
      <div n="2"><head>7. Realizar cambios posteriores y a&#241;adidos</head>
<p>Si necesitas realizar cambios en la p&#225;gina web, puedes hacerlos en tu repositorio en GitHub como los hechos anteriormente. Puedes cambiar las im&#225;genes y los metadatos, las p&#225;ginas contextuales, etc. Puesto que se trata de una p&#225;gina creada con computaci&#243;n m&#237;nima, se pueden rotar f&#225;cilmente exhibiciones digitales de forma trimestral o anual.</p>
<p>CollectionBuilder cuenta con funcionalidades extra que puedes ir a&#241;adiendo cuando te sientas m&#225;s c&#243;modo/a con el manejo de los archivos en el respositorio. Adem&#225;s, est&#225;n ampliando la herramienta poco a poco. Visita su p&#225;gina web<link target="https://collectionbuilder.github.io">https://collectionbuilder.github.io</link> de vez en cuando para ver nuevas actualizaciones.  </p>
</div>
      <div n="2"><head>Agradecimiento</head>
<p>Esta lecci&#243;n fue escrita a partir de los materiales creados para un taller virtual de capacitaci&#243;n digital para las organizaciones latinoamericanas que colaboran con el repositorio de <link target="https://ladi.lib.utexas.edu/es">Iniciativas Digitales de Am&#233;rica Latina</link> de la Universidad de Texas en Austin y financiada por una beca de la Andrew W. Mellon Foundation.</p>
</div>
      <div n="2"><head>Notas</head>
</div>
    </body>
  </text>
</TEI>
