<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Pr&#233;server ses donn&#233;es de recherche</title>
  <layout>lesson</layout>
  <slug>preserver-ses-donnees-de-recherche</slug>
  <date>2014-04-30</date>
  <translation_date>2020-01-16</translation_date>
  <authors>James Baker</authors>
  <reviewers>Jane Winters,Sharon Howard,William J. Turkel</reviewers>
  <editors>Adam Crymble</editors>
  <translator>Anne-Sophie Bessero-Lagarde</translator>
  <translation-editor>Fran&#231;ois Dominic Laram&#233;e</translation-editor>
  <translation-reviewer>Sofia Papastamkou,Martin Grandjean</translation-reviewer>
  <original>preserving-your-research-data</original>
  <difficulty>1</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/263</review-ticket>
  <activity>sustaining</activity>
  <topics>data-management</topics>
  <abstract>Cette le&#231;on donne des pistes aux historiens et aux historiennes pour documenter, structurer et p&#233;renniser leurs donn&#233;es de recherche.</abstract>
  <avatar_alt>Un gros baril</avatar_alt>
  <doi>10.46430/phfr0009</doi>
</metadata>
  <text>
    <body>
      <div n="1"><head>Contexte</head>
<p>Dans son essai de 2003 "Scarcity or Abundance" Roy Rosenzweig cherchait &#224; alerter les historiens et les historiennes sur ce qu'il a appel&#233; "la fragilit&#233; de l'administration de la preuve &#224; l'&#232;re num&#233;rique" (Rosenzweig, 736). Et bien que ses pr&#233;occupations se concentrent sur les sources disponibles sur le web ouvert, elles peuvent facilement &#234;tre &#233;tendues aux mat&#233;riaux nativement num&#233;riques - ou donn&#233;es - que les historiens et historiennes cr&#233;ent durant leurs recherches.</p>
<p>C'est &#224; ces donn&#233;es de la recherche que cette le&#231;on va se consacrer. Mais pourquoi ?</p>
<p>De plus en plus, les historiens et les historiennes utilisent leurs ordinateurs comme moyen de stockage par d&#233;faut de toutes leurs donn&#233;es de recherche, leurs mat&#233;riaux. Leurs manuscrits sont devenus des objets num&#233;riques depuis un certain temps et leurs recherches s'adaptent en cons&#233;quence, que ce soit dans le format de notes dactylographi&#233;es, de photographies d'archives, ou de donn&#233;es tabul&#233;es. De plus, la conservation des donn&#233;es de la recherche dans un format num&#233;rique a clairement des avantages par rapport au pr&#233;c&#233;dent format physique : elles peuvent &#234;tre parcourues et fouill&#233;es, h&#233;berg&#233;es d'une fa&#231;on qui permette un acc&#232;s depuis de nombreux endroits, fusionn&#233;es ou crois&#233;es avec d'autres donn&#233;es de la recherche.</p>
<p>Le simple fait de mettre ses donn&#233;es de la recherche dans un format num&#233;rique ne garantit pas qu'elles survivent. Ici je n'entends pas survie au sens litt&#233;ral ni d'&#234;tre lisible par la prochaine version de Microsoft Word, mais plut&#244;t dans le sens d'utilisable par des personnes. Car, si ce n'est certes pas un probl&#232;me r&#233;solu, la mani&#232;re de pr&#233;server les donn&#233;es de la recherche pour le futur est une probl&#233;matique dont des solutions potentielles ont d&#233;j&#224; &#233;t&#233; longuement discut&#233;es, en pensant ou non aux historien(ne)s. En outre des experts en gestion de donn&#233;es, tout comme des services et d'autres acteurs concern&#233;s, ont expos&#233; des bonnes pratiques acad&#233;miques pour les documenter, structurer et organiser. Malgr&#233; cela, les donn&#233;es de la recherche individuellement produites par les historien(ne)s sont sujettes &#224; un risque de perte, s'ils et elles ne sont pas capables de les g&#233;n&#233;rer et de les pr&#233;server dans un format compr&#233;hensible qui garde du sens des ann&#233;es, voire des d&#233;cennies plus tard ; sans parler de ceux et celles qui pataugeront dans les idiosyncrasies de leur processus de recherche. En bref, il y a un risque de perte d&#232;s lors que les donn&#233;es sont d&#233;tach&#233;es de leur contexte de cr&#233;ation, des connaissances tacites qui les ont rendues utiles pour la pr&#233;paration du discours X ou du manuscrit Y. Comme William Stafford Noble le dit :</p>
<blockquote>
<p>Le principe de base est simple: quelqu'un non familiaris&#233; avec votre
projet devrait &#234;tre capable de consulter vos fichiers informatiques et de comprendre
en d&#233;tails ce que vous avez fait et pourquoi [&#8230;] Cependant, le plus souvent ce
&#171; quelqu'un &#187; c'est vous. Dans quelques mois, vous ne vous souviendrez peut-&#234;tre plus
de ce que vous faisiez lorsque vous avez cr&#233;&#233; un ensemble particulier de fichiers, ou des
conclusions que vous avez tir&#233;es. Vous devrez alors passer
du temps &#224; reconstruire vos exp&#233;riences pr&#233;c&#233;dentes ou perdre toutes
les connaissances que vous aviez acquises de ces exp&#233;riences.</p>
<p>William Stafford Noble (2009) A Quick Guide to Organizing
Computational Biology Projects. PLoSComputBiol 5(7): e1000424.
doi:10.1371/journal.pcbi.1000424</p>
</blockquote>
<p>S'appuyant sur les le&#231;ons et l'expertise de professionnels en donn&#233;es de la recherche, ce guide sugg&#232;re aux historiennes et aux historiens des moyens de documenter et de structurer leurs propres donn&#233;es de mani&#232;re &#224; ce qu'elles restent utilisables dans le futur. Il ne se veut pas normatif mais suppose que les lecteurs et lectrices it&#233;reront, changeront et adapteront les id&#233;es pr&#233;sent&#233;es pour correspondre au mieux &#224; leurs recherches.</p>
</div>
      <div n="1"><head>Documentation des donn&#233;es de la recherche</head>
<blockquote>
<p>Birkwood, Katie (girlinthe).
&#8220;Victory is mine: while ago I worked out some Clever Stuff &#8482; in Excel. And I MADE NOTES ON IT. And those notes ENABLED ME TO DO IT AGAIN.&#8221; 7 October 2013, 3:46 a.m.. Tweet.</p>
<p>&#8220;La victoire est mienne : il y a quelques temps, j'ai travaill&#233;
sur Des Trucs Brillants &#8482; dans Excel. Et J'AI PRIS DES NOTES DESSUS. Et ces notes
M'ONT PERMIS DE LE REFAIRE.&#8221; 7 octobre 2013, 3:46 a.m.. Tweet.</p>
<p><link target="https://twitter.com/Girlinthe/status/387166944094199809">https://twitter.com/Girlinthe/status/387166944094199809</link></p>
</blockquote>
<p>L'int&#233;r&#234;t de la documentation est de saisir le processus de cr&#233;ation des donn&#233;es, les modifications qui peuvent &#234;tre apport&#233;es &#224; celles-ci et les connaissances tacites qui leur sont associ&#233;es. Des m&#233;thodologies de gestion de projet, comme <link target="https://fr.wikipedia.org/wiki/PRINCE2">PRINCE2</link>, accordent une grande importance &#224; une documentation pr&#233;cise, structur&#233;e et d&#233;taill&#233;e. Bien que cette approche pr&#233;sente des avantages, particuli&#232;rement pour les grands projets, complexes et multipartenaires, le travail de l'historien(ne) moyen(ne) est plus susceptible de tirer des b&#233;n&#233;fices d'une approche flexible et sur mesure d'une documentation qui s'appuiera sur les principes de la gestion de projet. Dans le cas de la recherche historique, le type de documentation qui pourrait &#234;tre produit pour pr&#233;server l&#8217;utilit&#233; des donn&#233;es de recherche comprend:</p>
<ul>
<li>une documentation d&#233;crivant les notes prises lors de la consultation d'un document d'archives, comme la r&#233;f&#233;rence archivistique de l'original, la repr&#233;sentativit&#233; des notes (par exemple: transcription compl&#232;te, transcription partielle ou r&#233;sum&#233;), la degr&#233; d'exhaustivit&#233; de l'&#233;tude du document, ou en revanche les d&#233;cisions prises d'exclure certaines sections du document du processus de recherche;</li>
<li>une documentation d&#233;crivant les donn&#233;es tabul&#233;es, comme la fa&#231;on dont elles ont &#233;t&#233; g&#233;n&#233;r&#233;es (par exemple, manuellement ou de mani&#232;re automatis&#233;e), les r&#233;f&#233;rences archivistiques des sources dont les donn&#233;es ont &#233;t&#233; extraites, ou les attributs des sources d'origine conserv&#233;s (et pourquoi);</li>
<li>une documentation d&#233;crivant le r&#233;pertoire des images num&#233;riques, comme la fa&#231;on dont chaque image a &#233;t&#233; cr&#233;&#233;e, o&#249; elle a &#233;t&#233; t&#233;l&#233;charg&#233;e et les notes de recherche qui s'y rapportent.</li>
</ul>
<p>Comme le dernier exemple le sugg&#232;re, l'un des principaux objectifs de la documentation est de d&#233;crire les liens significatifs qui existent entre les donn&#233;es de la recherche, liens dont on risque de perdre le sens au fil du temps.</p>
<p>Le moment de la documentation d&#233;pend beaucoup de l'individu et du rythme de ses recherches. La r&#232;gle principale est de prendre l'habitude de r&#233;diger et de mettre &#224; jour la documentation &#224; intervalles r&#233;guliers, id&#233;alement chaque fois qu'une partie du travail est termin&#233;e pour la matin&#233;e, l'apr&#232;s-midi ou la journ&#233;e. En m&#234;me temps, il est important de ne pas s&#8217;inqui&#233;ter de la perfection, mais plut&#244;t de chercher &#224; r&#233;diger une documentation coh&#233;rente et efficace qui vous sera utile et, esp&#233;rons-le, qui le sera aussi &#224; une autre personne utilisant vos donn&#233;es de recherche, des ann&#233;es plus tard.</p>
</div>
      <div n="1"><head>Formats des fichiers</head>
<p>Les donn&#233;es de la recherche et la documentation devraient dans l'id&#233;al &#234;tre sauvegard&#233;es dans des formats ouverts, qui sont <link target="https://fr.wikipedia.org/wiki/Logiciel_multiplateforme">compatibles avec tous les syst&#232;mes d'exploitation</link>, comme .txt pour les notes et .csv (comma-separated values) ou .tsv (tab-seperated values) pour les donn&#233;es tabul&#233;es. Ces formats texte brut sont pr&#233;f&#233;rables aux formats propri&#233;taires utilis&#233;s par d&#233;faut avec Microsoft Office ou iWork parce qu'ils peuvent &#234;tre ouverts avec de nombreux logiciels et ont une forte chance de rester lisibles et modifiables dans le futur. La plupart des suites bureautiques standards incluent une option permettant de sauvegarder les fichiers dans les formats .txt, .csv et .tsv, ce qui signifie que vous pouvez continuer &#224; travailler avec vos logiciels habituels tout en faisant ce qu'il faut pour pr&#233;server votre travail. Compar&#233;s &#224; du .doc ou du .xls, ces formats ont en plus l'atout, dans une perspective de pr&#233;servation, de ne contenir que des &#233;l&#233;ments lisibles par la machine. Bien que l'utilisation des caract&#232;res gras, italiques ou color&#233;s pour signifier des titres ou &#233;tablir des connections visuelles entre des donn&#233;es soit une pratique courante, ces annotations servent &#224; l'affichage sans &#234;tre lisibles par les machines et ne peuvent pas &#234;tre interrog&#233;es ni fouill&#233;es. Elles ne sont pas non plus appropri&#233;es pour les grandes quantit&#233;s d'informations. Il est pr&#233;f&#233;rable d'utiliser des sch&#233;mas de notations simples comme des doubles ast&#233;risques ou des triples croisillons pour repr&#233;senter des caract&#233;ristiques: dans mes notes, par exemple, trois points d'interrogations indiquent un point que je dois suivre, j'ai choisi "???' car cette suite peut &#234;tre facilement trouv&#233;e avec une recherche CTRL+F.</p>
<p>Dans de nombreuses occasions, il est probable que ces sch&#233;mas de notation &#233;mergent de la pratique individuelle (et doivent par cons&#233;quent &#234;tre document&#233;s), alors qu'il existe des sch&#233;mas comme le <link target="https://fr.wikipedia.org/wiki/Markdown">Markdown</link> de <link target="https://github.com">GitHub</link> (les fichiers Markdown sont enregistr&#233;s au format .md). Un excellent aide-m&#233;moire au Markdown est disponible sur <link target="https://github.com/adam-p/markdown-here">GitHub</link> pour ceux qui veulent suivre - ou adapter - le sch&#233;ma existant. <link target="http://notepad-plus-plus.org">Notepad++</link> est recommand&#233; pour les utilisateurs de Windows, bien que nullement essentiel pour travailler avec des fichiers .md. Les utilisateurs de Mac ou d'Unix peuvent utiliser <link target="https://www.activestate.com/products/komodo-edit/">Komodo Edit</link> ou <link target="https://www.barebones.com/support/textwrangler/updates.html">Text Wrangler</link>.</p>
</div>
      <div n="1"><head>R&#233;capitulatif 1</head>
<p>Pour r&#233;sumer, les points cl&#233;s sur les formats de documentation et de fichiers sont les suivants :</p>
<ul>
<li>Tentez de documenter pour saisir de mani&#232;re pr&#233;cise et coh&#233;rente les connaissances tacites relatives au processus de recherche, qu&#8217;il s&#8217;agisse de la prise de notes, de la g&#233;n&#233;ration de donn&#233;es sous forme de tableaux ou de la collecte de sources visuelles.</li>
<li>Privil&#233;giez une documentation simple en utilisant des formats de fichiers et des pratiques de notation compatibles avec tous les syst&#232;mes d'exploitation et lisibles par machine.</li>
<li>Pr&#233;voyez du temps pour mettre &#224; jour et cr&#233;er de la documentation dans votre flux de travail sans que cela ne devienne un fardeau.</li>
<li>Investissez maintenant pour laisser des traces &#233;crites, cela vous &#233;conomisera le temps que vous risquez de perdre dans l'avenir en essayent de reconstituer ce cheminement.</li>
</ul>
</div>
      <div n="1"><head>Structurer les donn&#233;es de la recherche</head>
<p>Il est plus facile de documenter votre recherche en structurant vos donn&#233;es de recherche de mani&#232;re coh&#233;rente et intuitive.</p>
<p>Pourquoi ?</p>
<p>Pour naviguer dans les donn&#233;es (physiques et num&#233;riques) que contient une biblioth&#232;que ou un centre d'archives, nous nous appuyons sur les informations structur&#233;es de leurs catalogues et inventaires. Sans cette information structur&#233;e, notre recherche serait beaucoup plus pauvre.</p>
<p>L'examen des URL est un bon moyen de r&#233;fl&#233;chir &#224; la raison pour laquelle la structuration coh&#233;rente et intuitive des donn&#233;es peut s'av&#233;rer utile dans votre recherche. Pour &#234;tre reproductibles et cit&#233;es dans un contexte scientifique, les URL doivent repr&#233;senter avec clart&#233; le contenu de la page qu'ils identifient, soit en contenant des &#233;l&#233;ments s&#233;mantiques, soit en utilisant un seul &#233;l&#233;ment de donn&#233;es trouv&#233; sur un ensemble ou la majorit&#233; des pages.</p>
<p>Les URL utilis&#233;s par les sites d&#8217;informations ou les blogues en sont un exemple typique. Les URL Wordpress suivent le format suivant :</p>
<ul>
<li><emph>nom du site Web</emph>/<emph>ann&#233;e (4 chiffres)</emph>/<emph>mois (2 chiffres)</emph>/<emph>jour (2 chiffres)</emph>/<emph>mots du titre s&#233;par&#233;s par des traits d'union</emph></li>
<li><link target="http://cradledincaricature.com/2014/02/06/comic-art-beyond-the-print-shop/">http://cradledincaricature.com/2014/02/06/comic-art-beyond-the-print-shop/</link></li>
</ul>
<p>Un usage similaire est utilis&#233; par les agences de presse telles que le journal <emph>The Guardian</emph> :</p>
<ul>
<li><emph>nom du site Web</emph>/<emph>section de section</emph>/<emph>ann&#233;e (4 chiffres)</emph>/<emph>mois (3 caract&#232;res)</emph>/<emph>jour (2 chiffres)</emph>/<emph>mots-descripteurs-contenus-s&#233;par&#233;s-par-tirets</emph></li>
<li><link target="http://www.theguardian.com/uk-news/2014/feb/20/rebekah-brooks-rupert-murdoch-phone-hacking-trial">http://www.theguardian.com/uk-news/2014/feb/20/rebekah-brooks-rupert-murdoch-phone-hacking-trial</link></li>
</ul>
<p>De leur c&#244;t&#233;, les catalogues d&#8217;archives utilisent souvent des URL structur&#233;es avec un seul &#233;l&#233;ment de donn&#233;es. La British Cartoon Archive structure ses archives en ligne en utilisant le format :</p>
<ul>
<li><emph>nom du site</emph>/record/<emph>num&#233;ro de r&#233;f&#233;rence</emph></li>
<li><link target="http://www.cartoons.ac.uk/record/SBD0931">http://www.cartoons.ac.uk/record/SBD0931</link></li>
</ul>
<p>Et l'Old Bailey (la Haute Cour criminelle britannique) utilise le format :</p>
<ul>
<li><emph>nom du site</emph>/browse.jsp?ref=<emph>num&#233;ro de r&#233;f&#233;rence</emph></li>
<li><link target="http://www.oldbaileyonline.org/browse.jsp?ref=OA16780417">http://www.oldbaileyonline.org/browse.jsp?ref=OA16780417</link></li>
</ul>
<p>Ce que nous apprenons de ces exemples, c&#8217;est qu&#8217;une combinaison de description parlante et d&#8217;&#233;l&#233;ments de donn&#233;es rend les structures de donn&#233;es coh&#233;rentes et intuitives, lisibles &#224; la fois par les humains et par les machines. Appliqu&#233; aux donn&#233;es num&#233;riques accumul&#233;es au cours de recherches historiques, cela facilite la navigation, la recherche et l'interrogation des donn&#233;es de recherche &#224; l'aide des outils standard fournis par nos syst&#232;mes d'exploitation (et, comme nous le verrons dans une prochaine le&#231;on, d'outils plus perfectionn&#233;s).</p>
<p>En pratique (pour les utilisateurs d'OS X et de Linux, remplacez les antislashs par des slashs), la structure d'un bon archivage des donn&#233;es de la recherche devrait ressembler &#224; ceci :</p>
<p>Un r&#233;pertoire de base ou racine qui pourrait s'appeler "travail".</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_0" type="block" corresp="code_preserver-ses-donnees-de-recherche_0.txt"></code></pre>
<p>Une s&#233;rie de sous-r&#233;pertoires.</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_1" type="block" corresp="code_preserver-ses-donnees-de-recherche_1.txt"></code></pre>
<p>Ces r&#233;pertoires contiennent des s&#233;ries de dossiers pour chaque &#233;v&#233;nement, projet de recherche, module ou document &#233;crit. L'introduction d'une convention de nommage incluant des &#233;l&#233;ments de date permet de conserver les informations organis&#233;es sans avoir besoin de sous-r&#233;pertoires par ann&#233;e ou par mois.</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_2" type="block" corresp="code_preserver-ses-donnees-de-recherche_2.txt"></code></pre>
<p>Enfin, d'autres sous-r&#233;pertoires peuvent &#234;tre utilis&#233;s pour s&#233;parer les informations &#224; mesure que le projet se d&#233;veloppe.</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_3" type="block" corresp="code_preserver-ses-donnees-de-recherche_3.txt"></code></pre>
<p>Bien &#233;videmment, toutes les informations ne s'int&#232;greront pas parfaitement dans une structure donn&#233;e et, &#224; mesure que de nouveaux projets apparaissent, la classification devra &#234;tre r&#233;examin&#233;e. D'une mani&#232;re ou d'une autre, l'idiosyncrasie est acceptable tant que la structure globale du r&#233;pertoire est coh&#233;rente et intuitive, et que tout ce qui ne l&#8217;est pas est clairement document&#233;: par exemple, le sous-r&#233;pertoire "&#233;criture" de la structure ci-dessus peut inclure un fichier .txt indiquant ce qu&#8217;il contient (brouillons et version finale du travail &#233;crit) et ce qu&#8217;il ne contient pas (recherche concernant ce travail &#233;crit).</p>
<p>Le nommage de ce fichier .txt, de m&#234;me que de toute documentation et de toutes les donn&#233;es de recherche, est important pour garantir sa lisibilit&#233; et son contenu. "Notes sur ce dossier.docx" n'est pas un nom qui remplit cet objectif, alors que "2014-01-31_Publication_Lisez-moi.txt" avec une r&#233;plique du titre du r&#233;pertoire et quelques &#233;l&#233;ments de dates parvient &#224; le faire. Les lecteurs nord-am&#233;ricains remarqueront que j'ai choisi la structure ann&#233;e_mois_jour. Un exemple de <link target="/assets/preserving-your-research-data/network_analysis_of_Isaac_Cruikshank_and_his_publishers_readme.txt">fichier Lisez-moi que j'ai r&#233;dig&#233; pour un projet</link> contient le type d'information dont vous et les autres utilisateurs de vos donn&#233;es pourriez avoir besoin.</p>
<p>Un retour d'exp&#233;rience devrait &#234;tre suffisant pour confirmer l'int&#233;r&#234;t de cette approche. Au cours d'un projet de recherche pr&#233;c&#233;dent, j'ai rassembl&#233; quelque 2 000 images num&#233;riques d'empreintes satiriques georgiennes provenant de plusieurs sources en ligne, en conservant les noms de fichier lors du t&#233;l&#233;chargement. Si j&#8217;avais appliqu&#233; d&#232;s le d&#233;part une convention de nommage (par exemple, &#171;ANNEE DE PUBLICATION _NOM DE L'ARTISTE_TITRE DE L'OEUVRE.FORMAT&#187;), je serais en mesure de rechercher et d&#8217;interroger ces images. En effet, commencer les noms de chaque fichier avec AAAAMMDD aurait permis que les fichiers puissent &#234;tre tri&#233;s par ordre chronologique sous Windows, OS X et Linux. Et s'assurer que tous les espaces, signes de ponctuation et caract&#232;res accentu&#233;s (sauf les tirets, les points et les traits de soulignement) soient absents des noms de fichiers afin de les rendre coh&#233;rents et intuitis aurait permis de faire fonctionner la ligne de commande avec les fichiers. Mais je ne l&#8217;ai pas fait et, dans l&#8217;&#233;tat actuel des choses, j&#8217;aurais besoin de beaucoup de temps pour modifier chaque nom de fichier individuellement afin de rendre les donn&#233;es utilisables de cette mani&#232;re. <!--Il existe l'outil Vrenamer lorsqu'on est dans cette situation https://vrenamer.com/ --></p>
<p>En outre, l'application de telles conventions de nommage &#224; toutes les donn&#233;es de recherche de mani&#232;re coh&#233;rente et intuitive facilite la lisibilit&#233; et la compr&#233;hension de la structure de donn&#233;es. Par exemple, pour un projet sur des articles de revues, nous pourrions choisir le r&#233;pertoire&#8230;</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_4" type="block" corresp="code_preserver-ses-donnees-de-recherche_4.txt"></code></pre>
<p>&#8230; O&#249; les &#233;l&#233;ments ann&#233;e-mois indiquent la date de d&#233;but du projet.</p>
<p>Dans ce r&#233;pertoire, nous incluons un r&#233;pertoire \donnees\ o&#249; sont conserv&#233;es les donn&#233;es d'origine utilis&#233;es dans le projet.</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_5" type="block" corresp="code_preserver-ses-donnees-de-recherche_5.txt"></code></pre>
<p>En plus des donn&#233;es, on y trouve la documentation qui d&#233;crit 2014-01-31_Journal_Articles.tsv.</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_6" type="block" corresp="code_preserver-ses-donnees-de-recherche_6.txt"></code></pre>
<p>Au niveau du r&#233;pertoire \2014-01_Journal_Articles\ nous cr&#233;ons un dossier \analyse\ dans lequel on place :</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_7" type="block" corresp="code_preserver-ses-donnees-de-recherche_7.txt"></code></pre>
<p>Notez les diff&#233;rences de mois et de date ici. Celles-ci refl&#232;tent les dates auxquelles l'analyse des donn&#233;es a eu lieu, cette convention est d&#233;crite bri&#232;vement dans 2014-02-02_Journal_Articles_analyse_lisez-moi.txt.</p>
<p>Enfin, un r&#233;pertoire dans \donnees\ appel&#233; \donnees_derivees\ contient les donn&#233;es d&#233;riv&#233;es du fichier original 2014-01-31_Journal_Articles.tsv. Dans ce cas, chaque fichier .tsv d&#233;riv&#233; contient des lignes comprenant les mots-cl&#233;s "afrique", "am&#233;rique", "art", etc., et porte le nom correspondant.</p>
<pre><code xml:id="code_preserver-ses-donnees-de-recherche_8" type="block" corresp="code_preserver-ses-donnees-de-recherche_8.txt"></code></pre>
</div>
      <div n="1"><head>R&#233;capitulatif 2</head>
<p>Pour r&#233;capituler, les points cl&#233;s de la structuration des donn&#233;es de recherche sont les suivants :</p>
<ul>
<li>Les structures de donn&#233;es doivent &#234;tre coh&#233;rentes et intuitives.</li>
<li>Pensez &#224; utiliser des &#233;l&#233;ments parlants ou des identifiants de donn&#233;es pour structurer les r&#233;pertoires de donn&#233;es de recherche.</li>
<li>Ajustez et adaptez la structure des donn&#233;es &#224; votre recherche.</li>
<li>Appliquez des conventions de nommage aux r&#233;pertoires et aux noms de fichiers pour les identifier, cr&#233;er des associations entre des &#233;l&#233;ments de donn&#233;es et contribuer &#224; la lisibilit&#233; et &#224; la compr&#233;hension &#224; long terme de la structure de vos donn&#233;es.</li>
</ul>
</div>
      <div n="1"><head>R&#233;sum&#233;</head>
<p>Cette le&#231;on a sugg&#233;r&#233; des fa&#231;ons de documenter et de structurer les donn&#233;es de recherche afin de garantir leur conservation en capturant les connaissances tacites acquises au cours du processus de recherche et en facilitant ainsi l'utilisation future des informations. Elle a recommand&#233; l'utilisation de formats libres et lisibles par machine pour la documentation et les donn&#233;es de recherche. Elle a sugg&#233;r&#233; que les URL offrent un exemple pratique de structures de donn&#233;es bonnes et mauvaises pouvant &#234;tre r&#233;pliqu&#233;es aux fins des donn&#233;es de recherche des historiens et des historiennes.</p>
<p>Ces suggestions ne font qu'offrir quelques pistes que les chercheurs et les chercheuses devront adapter &#224; leurs objectifs. Ce faisant, il est recommand&#233; de garder &#224; l&#8217;esprit les strat&#233;gies de pr&#233;servation num&#233;rique et les bonnes pratiques de gestion de projet, tout en veillant &#224; ce que le temps consacr&#233; &#224; documenter et &#224; structurer la recherche ne devienne pas un fardeau. Apr&#232;s tout, le but de ce guide est de faciliter et non de rendre moins efficace les recherches historiques qui g&#233;n&#232;rent des donn&#233;es. Au final, c'est votre recherche &#224; vous.</p>
</div>
      <div n="1"><head>Lectures compl&#233;mentaires</head>
<p>Ashton, Neil, 'Seven deadly sins of data publication', School of Data
blog (17 octobre 2013)
<link target="http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/">http://schoolofdata.org/2013/10/17/seven-deadly-sins-of-data-publication/</link></p>
<p>Hitchcock, Tim, 'Judging a book by its URLs', Historyonics blog (3
janvier 2014)
<link target="http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html">http://historyonics.blogspot.co.uk/2014/01/judging-book-by-its-url.html</link></p>
<p>Howard, Sharon, 'Unclean, unclean! What historians can do about sharing
our messy research data', Early Modern Notes blog (18 mai 2013)
<link target="http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/">http://earlymodernnotes.wordpress.com/2013/05/18/unclean-unclean-what-historians-can-do-about-sharing-our-messy-research-data/</link></p>
<p>Noble, William Stafford, A Quick Guide to Organizing Computational
Biology Projects.PLoSComputBiol 5(7): e1000424 (2009)
<link target="https://doi.org/10.1371/journal.pcbi.1000424">https://doi.org/10.1371/journal.pcbi.1000424</link></p>
<p>Oxford University Computing Services, 'Sudamih Project. Research
Information Management: Organising Humanities Material' (2011)
<link target="https://zenodo.org/record/28329">https://zenodo.org/record/28329</link></p>
<p>Pennock, Maureen, 'The Twelve Principles of Digital Preservation (and a
cartridge in a repository&#8230;)', British Library Collection Care blog (3
septembre 2013)
<link target="http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html">http://britishlibrary.typepad.co.uk/collectioncare/2013/09/the-twelve-principles-of-digital-preservation.html</link></p>
<p>Pritchard, Adam, 'Markdown Cheatsheet' (2013)
<link target="https://github.com/adam-p/markdown-here">https://github.com/adam-p/markdown-here</link></p>
<p>Rosenzweig, Roy, 'Scarcity or Abundance? Preserving the Past in a
Digital Era', The American Historical Review 108:3 (2003), 735-762.</p>
<p>UK Data Archive, 'Documenting your Data'
<link target="http://data-archive.ac.uk/create-manage/document">http://data-archive.ac.uk/create-manage/document</link></p>
<p>[GitHub] : <link target="https://github.com/adam-p/markdown-here">https://github.com/adam-p/markdown-here</link>
[Notepad++] : <link target="http://notepad-plus-plus.org/fr/">http://notepad-plus-plus.org/fr/</link>
[Komodo Edit]: <link target="https://www.activestate.com/products/komodo-edit/">https://www.activestate.com/products/komodo-edit/</link>
[Text Wrangler]: <link target="https://www.barebones.com/support/textwrangler/updates.html">https://www.barebones.com/support/textwrangler/updates.html</link></p>
</div>
    </body>
  </text>
</TEI>
