<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introduccion-a-markdown">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introducci&#243;n a Markdown
</title>
  <author role="original_author">Sarah Simpkin</author><editor role="reviewers"><persName>John Fink</persName><persName>Nancy Lemay</persName></editor><author role="translators">V&#237;ctor Gayol</author><editor role="translation-reviewers"><persName>Juan Cobo</persName><persName>Maria Jos&#233; Afanador-Llach</persName></editor><editor role="editors">Ian Milligan</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0014</idno><date type="published">11/13/2015</date><date type="translated">07/31/2017</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#getting-started-with-markdown"/>.</p><p>There are other translations: <ref target="#debuter-avec-markdown #introducao-ao-markdown"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>En esta lecci&#243;n se ofrece una introducci&#243;n a Markdown, un lenguaje de marcado con sintaxis en texto plano para generar textos con formato. Descubrir&#225;s el porqu&#233; se utiliza, c&#243;mo dar formato a los archivos de Markdown y c&#243;mo obtener una vista previa en la web de los documentos formados con Markdown.</p></abstract><textClass><keywords><term xml:lang="en">data-management</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Introducci&#243;n a Markdown</head>
<div type="3"><head>Objetivos de la lecci&#243;n</head>
<p>En esta lecci&#243;n se ofrece una introducci&#243;n a Markdown, un lenguaje de marcado con sintaxis en texto plano para generar textos con formato. Descubrir&#225;s el porqu&#233; se utiliza, c&#243;mo dar formato a los archivos de Markdown y c&#243;mo obtener una vista previa en la web de los documentos formados con Markdown.</p>
<p>Dado que las lecciones de <emph>The Programming Historian en espa&#241;ol</emph> deben ser enviadas como archivos Markdown, hemos incluido ejemplos espec&#237;ficos de <emph>PH</emph> en la medida de lo posible. Espero que esta gu&#237;a sea &#250;til si est&#225;s considerando contribuir con una lecci&#243;n en este sitio.</p>
</div><div type="3"><head>&#191;Qu&#233; es Markdown?</head>
<p>Markdown fue desarrollado en 2004 por <ref target="http://daringfireball.net/projects/markdown/">John Gruber</ref>, y se refiere tanto a (1) una manera de formar archivos de texto, como a (2) una utilidad del lenguaje de programaci&#243;n Perl para convertir archivos Markdown en HTML. En esta lecci&#243;n nos centraremos en la primera acepci&#243;n y aprenderemos a escribir archivos utilizando la sintaxis de Markdown.</p>
<p>Los archivos de texto plano tienen muchas ventajas sobre otro tipo de formato. Por un lado, se pueden leer pr&#225;cticamente en todos los dispositivos. Tambi&#233;n han resistido la prueba del paso del tiempo mejor que otro tipo de archivos -si alguna vez has intentado abrir un documento guardado en un formato de <ref target="https://es.wikipedia.org/wiki/Sistema_heredado">procesador de textos heredado</ref>, estar&#225;s familiarizado con los problemas de compatibilidad que implican-.</p>
<p>Al utilizar la sintaxis de Markdown, ser&#225;s capaz de producir archivos que pueden ser legibles como texto plano y que a la vez est&#225;n listos para ser formados en otras plataformas. Muchos generadores de bit&#225;coras y de sitios est&#225;ticos, as&#237; como sitios como GitHub, tambi&#233;n aceptan Markdown y traducen estos archivos a HTML para su visualizaci&#243;n en la web. Adem&#225;s, herramientas como Pandoc pueden convertir archivos en o desde Markdown. Para m&#225;s informaci&#243;n sobre Pandoc puedes consultar la lecci&#243;n sobre <ref target="/es/lecciones/escritura-sostenible-usando-pandoc-y-markdown">Escritura sostenible utilizando Pandoc y Markdown</ref> de Dennise Tenen y Grant Wythoff.</p>
</div><div type="3"><head>Sintaxis en Markdown</head>
<p>Los archivos en Markdown se guardan con la extensi&#243;n <code rend="inline">.md</code> y se pueden abrir en un editor de texto como TextEdit, Notepad, Sublime Text o Vim. Muchos sitios web o plataformas de publicaci&#243;n tambi&#233;n ofrecen editores basados en la web y/o extensiones para introducir texto utilizando la sintaxis de Markdown.</p>
<p>En este tutorial vamos a practicar la sintaxis de Markdown en el navegador usando <ref target="https://stackedit.io/">StackEdit</ref>. Podr&#225;s introducir texto formado en Markdown a la izquierda e inmediatamente ver la versi&#243;n traducida junto a &#233;l a la derecha.</p>
<p>Dado que todas las lecciones de <emph>The Programming Historian</emph> est&#225;n escritas en Markdown, tambi&#233;n podemos examinar sus archivos en StackEdit. Copia el texto en formato markdown de la lecci&#243;n <ref target="/es/lecciones/introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos en Bash</ref> en el siguiente enlace: </p>
<ab><code xml:id="code_introduccion-a-markdown_0" corresp="code_introduccion-a-markdown_0.txt" rend="block"/></ab>
<p>Accede al <ref target="https://stackedit.io/">editor de StackEdit</ref> haciendo click en "start writing" (empezar a escribir) en la parte superior de la p&#225;gina y pega el texto de la lecci&#243;n.</p>
<p>Ver&#225;s que mientras que el panel de la derecha cuenta con una presentaci&#243;n m&#225;s elegante del texto, el archivo de Markdown a la izquierda es a&#250;n bastante legible.</p>
<p>Vamos a sumergirnos ahora en la lecci&#243;n escribiendo nuestra propia sintaxis de Markdown. Crea un nuevo documento en StackEdit haciendo click en el &#237;cono de la carpeta en la esquina superior derecha seleccionando "New document". Debes ponerle nombre al documento en la caja de texto en la parte superior de la p&#225;gina.</p>
<div type="4"><head>Encabezados</head>
<p>Markdown dispone de cuatro niveles de encabezados definidos por el n&#250;mero de <code rend="inline">#</code> antes del texto del encabezado. Pega los siguientes ejemplos en la caja de texto de la izquierda:</p>
<ab><code xml:id="code_introduccion-a-markdown_1" corresp="code_introduccion-a-markdown_1.txt" rend="block"/></ab>
<p>El primer y segundo nivel de encabezado tambi&#233;n se pueden escribir como sigue:</p>
<ab><code xml:id="code_introduccion-a-markdown_2" corresp="code_introduccion-a-markdown_2.txt" rend="block"/></ab>
<p>Estos se representar&#225;n como:</p>
<div type="1"><head>Primer nivel de encabezado</head>
<h2>Segundo nivel de encabezado</h2>
<h3>Tercer nivel de encabezado</h3>
<h4>Cuarto nivel de encabezado</h4>
</div><table>
<row>
<cell align="left" role="label">Alineado-izquierda</cell>
<cell align="center" role="label">Centrado</cell>
<cell align="right" role="label">Alineado-derecha</cell>
</row>
<row>
<cell align="left">Pl&#225;tanos</cell>
<cell align="center">amarillo</cell>
<cell align="right">75</cell>
</row>
<row>
<cell align="left">Manzanas</cell>
<cell align="center">rojo</cell>
<cell align="right">5000</cell>
</row>
</table><table>
<row>
<cell role="label">Encabezado 1</cell>
<cell role="label">Encabezado 2</cell>
<cell role="label">Encabezado 3</cell>
</row>
<row>
<cell>rengl&#243;n 3, columna 1</cell>
<cell>rengl&#243;n 3, columna 2</cell>
<cell>rengl&#243;n 3, columna 3</cell>
</row>
<row>
<cell>rengl&#243;n 2, columna 1</cell>
<cell>rengl&#243;n 2, columna 2</cell>
<cell>rengl&#243;n 2, columna 3</cell>
</row>
<row>
<cell>rengl&#243;n 1, columna 1</cell>
<cell>rengl&#243;n 1, columna 2</cell>
<cell>rengl&#243;n 1, columna 3</cell>
</row>
</table></div></div></div>
    </body>
  </text>
</TEI>
