<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introduccion-a-markdown">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introducci&#243;n a Markdown
</title>
  <author type="original_author">Sarah Simpkin</author><editor type="reviewers"><persName>John Fink</persName><persName>Nancy Lemay</persName></editor><author type="translators">V&#237;ctor Gayol</author><editor type="translation-reviewers"><persName>Juan Cobo</persName><persName>Maria Jos&#233; Afanador-Llach</persName></editor><editor type="editors">Ian Milligan</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phes0014</idno><date type="published">11/13/2015</date><date type="translated">07/31/2017</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#getting-started-with-markdown"/>.</p><p>There are other translations: <ref target="#debuter-avec-markdown #introducao-ao-markdown"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>En esta lecci&#243;n se ofrece una introducci&#243;n a Markdown, un lenguaje de marcado con sintaxis en texto plano para generar textos con formato. Descubrir&#225;s el porqu&#233; se utiliza, c&#243;mo dar formato a los archivos de Markdown y c&#243;mo obtener una vista previa en la web de los documentos formados con Markdown.</p></abstract><textClass><keyword xml:lang="en">data-management</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="es">
    <body>
      <div type="2"><head>Introducci&#243;n a Markdown</head>
<div type="3"><head>Objetivos de la lecci&#243;n</head>
<p>En esta lecci&#243;n se ofrece una introducci&#243;n a Markdown, un lenguaje de marcado con sintaxis en texto plano para generar textos con formato. Descubrir&#225;s el porqu&#233; se utiliza, c&#243;mo dar formato a los archivos de Markdown y c&#243;mo obtener una vista previa en la web de los documentos formados con Markdown.</p>
<p>Dado que las lecciones de <emph>The Programming Historian en espa&#241;ol</emph> deben ser enviadas como archivos Markdown, hemos incluido ejemplos espec&#237;ficos de <emph>PH</emph> en la medida de lo posible. Espero que esta gu&#237;a sea &#250;til si est&#225;s considerando contribuir con una lecci&#243;n en este sitio.</p>
</div><div type="3"><head>&#191;Qu&#233; es Markdown?</head>
<p>Markdown fue desarrollado en 2004 por <link target="http://daringfireball.net/projects/markdown/">John Gruber</link>, y se refiere tanto a (1) una manera de formar archivos de texto, como a (2) una utilidad del lenguaje de programaci&#243;n Perl para convertir archivos Markdown en HTML. En esta lecci&#243;n nos centraremos en la primera acepci&#243;n y aprenderemos a escribir archivos utilizando la sintaxis de Markdown.</p>
<p>Los archivos de texto plano tienen muchas ventajas sobre otro tipo de formato. Por un lado, se pueden leer pr&#225;cticamente en todos los dispositivos. Tambi&#233;n han resistido la prueba del paso del tiempo mejor que otro tipo de archivos -si alguna vez has intentado abrir un documento guardado en un formato de <link target="https://es.wikipedia.org/wiki/Sistema_heredado">procesador de textos heredado</link>, estar&#225;s familiarizado con los problemas de compatibilidad que implican-.</p>
<p>Al utilizar la sintaxis de Markdown, ser&#225;s capaz de producir archivos que pueden ser legibles como texto plano y que a la vez est&#225;n listos para ser formados en otras plataformas. Muchos generadores de bit&#225;coras y de sitios est&#225;ticos, as&#237; como sitios como GitHub, tambi&#233;n aceptan Markdown y traducen estos archivos a HTML para su visualizaci&#243;n en la web. Adem&#225;s, herramientas como Pandoc pueden convertir archivos en o desde Markdown. Para m&#225;s informaci&#243;n sobre Pandoc puedes consultar la lecci&#243;n sobre <link target="/es/lecciones/escritura-sostenible-usando-pandoc-y-markdown">Escritura sostenible utilizando Pandoc y Markdown</link> de Dennise Tenen y Grant Wythoff.</p>
</div><div type="3"><head>Sintaxis en Markdown</head>
<p>Los archivos en Markdown se guardan con la extensi&#243;n <code type="inline">.md</code> y se pueden abrir en un editor de texto como TextEdit, Notepad, Sublime Text o Vim. Muchos sitios web o plataformas de publicaci&#243;n tambi&#233;n ofrecen editores basados en la web y/o extensiones para introducir texto utilizando la sintaxis de Markdown.</p>
<p>En este tutorial vamos a practicar la sintaxis de Markdown en el navegador usando <link target="https://stackedit.io/">StackEdit</link>. Podr&#225;s introducir texto formado en Markdown a la izquierda e inmediatamente ver la versi&#243;n traducida junto a &#233;l a la derecha.</p>
<p>Dado que todas las lecciones de <emph>The Programming Historian</emph> est&#225;n escritas en Markdown, tambi&#233;n podemos examinar sus archivos en StackEdit. Copia el texto en formato markdown de la lecci&#243;n <link target="/es/lecciones/introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos en Bash</link> en el siguiente enlace: </p>
<pre><code xml:id="code_introduccion-a-markdown_0" type="block" corresp="code_introduccion-a-markdown_0.txt"/></pre>
<p>Accede al <link target="https://stackedit.io/">editor de StackEdit</link> haciendo click en "start writing" (empezar a escribir) en la parte superior de la p&#225;gina y pega el texto de la lecci&#243;n.</p>
<p>Ver&#225;s que mientras que el panel de la derecha cuenta con una presentaci&#243;n m&#225;s elegante del texto, el archivo de Markdown a la izquierda es a&#250;n bastante legible.</p>
<p>Vamos a sumergirnos ahora en la lecci&#243;n escribiendo nuestra propia sintaxis de Markdown. Crea un nuevo documento en StackEdit haciendo click en el &#237;cono de la carpeta en la esquina superior derecha seleccionando "New document". Debes ponerle nombre al documento en la caja de texto en la parte superior de la p&#225;gina.</p>
<div type="4"><head>Encabezados</head>
<p>Markdown dispone de cuatro niveles de encabezados definidos por el n&#250;mero de <code type="inline">#</code> antes del texto del encabezado. Pega los siguientes ejemplos en la caja de texto de la izquierda:</p>
<pre><code xml:id="code_introduccion-a-markdown_1" type="block" corresp="code_introduccion-a-markdown_1.txt"/></pre>
<p>El primer y segundo nivel de encabezado tambi&#233;n se pueden escribir como sigue:</p>
<pre><code xml:id="code_introduccion-a-markdown_2" type="block" corresp="code_introduccion-a-markdown_2.txt"/></pre>
<p>Estos se representar&#225;n como:</p>
<div type="1"><head>Primer nivel de encabezado</head>
<h2>Segundo nivel de encabezado</h2>
<h3>Tercer nivel de encabezado</h3>
<h4>Cuarto nivel de encabezado</h4>
</div><div type="1"><head>Primer nivel de encabezado</head>
<h2>Segundo nivel de encabeado</h2>
<p>Observa que la sintaxis de Markdown sigue siendo comprensible a&#250;n en la versi&#243;n de texto plano.</p>
<h4>P&#225;rrafos y saltos de l&#237;nea</h4>
<p>Escribe la siguiente frase en la caja de texto:</p>
<pre><code xml:id="code_introduccion-a-markdown_3" type="block" corresp="code_introduccion-a-markdown_3.txt"/></pre>
<p><hi rend="bold">Esto queda representado como:</hi></p>
<p>&#161;Bienvenidos a <emph>The Programming Historian en espa&#241;ol</emph>!</p>
<p>Hoy aprenderemos la sintaxis de Markdown.
&#201;sta frase esta separada de la anterior por un solo salto de l&#237;nea.</p>
<p>Los p&#225;rrafos deben estar separados por una l&#237;nea vac&#237;a. Deja una l&#237;nea entre la que contiene <code type="inline">Markdown.</code> y <code type="inline">&#201;sta</code> para que veas c&#243;mo trabaja. Los saltos de l&#237;nea sencillos deben indicarse con dos espacios en blanco en algunas implementaciones de Markdown. Esto no es necesario en la variente de <link target="https://help.github.com/articles/github-flavored-markdown/">GitHub Flavored Markdown</link>, que es la que utiliza por defecto StackEdit.</p>
<h4>A&#241;adir &#233;nfasis</h4>
<p>El texto se puede poner en cursivas encerr&#225;ndolo entre los s&#237;mbolos <code type="inline">*</code> o <code type="inline">-</code>. De la misma forma, el texto en negritas se escribe encerrando la palabra entre <code type="inline">**</code>o <code type="inline">__</code>.</p>
<p>A&#241;ade &#233;nfasis a una frase utilizando estos m&#233;todos:</p>
<pre><code xml:id="code_introduccion-a-markdown_4" type="block" corresp="code_introduccion-a-markdown_4.txt"/></pre>
<p>Lo cual queda representado as&#237;:</p>
<p>&#161;Estoy <hi rend="bold">muy</hi> entusiasmado con los tutoriales de <emph>The Programming Historian en espa&#241;ol</emph>!</p>
<h4>Listados</h4>
<p>Markdown soporta la creaci&#243;n de listas ordenadas y sin ordenar. Escribe la siguiente lista dentro de la caja de texto:</p>
<pre><code xml:id="code_introduccion-a-markdown_5" type="block" corresp="code_introduccion-a-markdown_5.txt"/></pre>
<p>Poner sangr&#237;a al <code type="inline">*</code> te permite crear listas anidadas.</p>
<p><hi rend="bold">Esto se depliega as&#237;:</hi></p>
<h2>Lista de compras</h2>
<ul>
<li>
Frutas<ul>
<li>Manzanas</li>
<li>Naranjas</li>
<li>Uvas</li>
</ul>
</li>
<li>
L&#225;cteos<ul>
<li>Leche</li>
<li>Queso</li>
</ul>
</li>
</ul>
<p>Las listas ordenadas se escriben numerando cada l&#237;nea. Una vez m&#225;s, el objetivo de Markdown es producir documentos que sean legibles como texto plano y que a la vez puedan traducirse a otros formatos.</p>
<pre><code xml:id="code_introduccion-a-markdown_6" type="block" corresp="code_introduccion-a-markdown_6.txt"/></pre>
<p>Lo cual se visualiza de la siguiente manera:</p>
<h2>Lista de pendientes</h2>
<ol>
<li>Terminar el tutorial de Markdown</li>
<li>Ir a la tienda de abarrotes</li>
<li>Preparar el almuerzo</li>
</ol>
<h4>Fragmentos de c&#243;digo (<emph>snippets</emph>)</h4>
<p>Representar fragmentos de c&#243;digo en forma distinta al resto del documento es una buena pr&#225;ctica que lo hace m&#225;s legible. La escritura de c&#243;digo se representa generalmente a espacio sencillo. Dado que Markdown no distingue las tipograf&#237;as involucradas, representamos los fragmentos de c&#243;digo encerrados entre dos signos de acento grave <code type="inline">`</code>. Por ejemplo: <code type="inline">`&lt;br/&gt;`</code>. Cuando queremos representar un bloque completo de c&#243;digo lo debemos encerrar entre dos l&#237;neas de tres acentos graves. En la ventana de vista previa de StackEdit esto se representar&#225; como una caja de texto sombreada y escrita a espacio seguido.</p>
<p>Escribe lo siguiente en la caja de texto:</p>
<pre><code xml:id="code_introduccion-a-markdown_7" type="block" corresp="code_introduccion-a-markdown_7.txt"/></pre>
<p><hi rend="bold">Y se representar&#225; as&#237;:</hi></p>
<pre><code xml:id="code_introduccion-a-markdown_8" type="block" corresp="code_introduccion-a-markdown_8.txt"/></pre>
<p>Observa c&#243;mo el bloque de c&#243;digo se representa a rengl&#243;n seguido.</p>
<h4>Bloque de citas</h4>
<p>Escribe el siguiente texto en la caja de texto:</p>
<pre><code xml:id="code_introduccion-a-markdown_9" type="block" corresp="code_introduccion-a-markdown_9.txt"/></pre>
<p>Lo cual se representar&#225;:</p>
<blockquote>
<p>Hola. &#201;ste es un p&#225;rrafo de texto incluido como un bloque de cita textual. F&#237;jate que tengo una sangr&#237;a con respecto al margen izquierdo.</p>
</blockquote>
<h4>Enlaces de Internet</h4>
<p>Los enlaces de Internet se pueden escribir de dos maneras.</p>
<p>El t&#237;tulo del enlace se encierra primero entre corchetes y despu&#233;s se incluye la direcci&#243;n completa del URL entre par&#233;ntesis.</p>
<p><code type="inline">Para m&#225;s tutoriales visita la p&#225;gina [The Programming Historian en espa&#241;ol](/es).</code></p>
<p><hi rend="bold">Lo cual se representa as&#237;:</hi></p>
<p>Para m&#225;s tutoriales visita la p&#225;gina <link target="/es">The Programming Historian en espa&#241;ol</link>.</p>
<p>Los enlaces tambi&#233;n se utilizan para crear notas a pie de p&#225;gina y son &#250;tiles porque, adem&#225;s, ayudan a mantener m&#225;s ordenado tu documento en texto plano. Las notas a pie se escriben con un par adicional de corchetes con el n&#250;mero de referencia para establecer el v&#237;nculo que identifique la etiqueta.</p>
<p><code type="inline">Un ejemplo es el sitio *[The Programming Historian en espa&#241;ol][1]*</code></p>
<p>Entonces puedes incluir el URL en otra parte del documento:</p>
<p><code type="inline">[1]: http://programminghistorian.org/</code></p>
<p>Lo cual se despliega de la siguiente manera:</p>
<p>Un ejemplo es el sitio <emph><link target="http://programminghistorian.org/">The Programming Historian en espa&#241;ol</link></emph></p>
<h4>Im&#225;genes</h4>
<p>Se pueden referir las im&#225;genes mediante el uso de <code type="inline">!</code>, seguido de un texto alternativo entre corchetes, seguido a su vez por el URL de la imagen y un t&#237;tulo opcional entre comillas. Esto no se representar&#225; como texto en tu documento pero te permitir&#225; incluir la imagen en la visualizaci&#243;n de una p&#225;gina en HTML.</p>
<p><code type="inline">![Logo de Wikipedia](https://upload.wikimedia.org/wikipedia/en/8/80/Wikipedia-logo-v2.svg "Wikipedia logo")</code></p>
<p><hi rend="bold">Esto aparece como:</hi></p>
<p><img src="https://upload.wikimedia.org/wikipedia/en/8/80/Wikipedia-logo-v2.svg" alt="Logo de Wikipedia" title="Wikipedia logo"/></p>
<h4>Reglas y l&#237;neas horizontales</h4>
<p>Puedes incluir l&#237;neas horizontales si escribes en una misma l&#237;nea cualquiera de los siguientes tres signos: <code type="inline">-</code>. <code type="inline">*</code> o <code type="inline">_</code>, sin importar los espacios que dejes entre ellos. Cualquiera de estas combinaciones generar&#225;n una l&#237;nea horizontal:</p>
<pre><code xml:id="code_introduccion-a-markdown_10" type="block" corresp="code_introduccion-a-markdown_10.txt"/></pre>
<p>Es decir:</p>
<h4>Tablas</h4>
<p>La versi&#243;n b&#225;sica de Markdown no incluye tablas; sin embargo, algunos sitios web y aplicaciones usan variantes de Markdown que pueden incluir tablas y otras caracter&#237;sticas especiales. <link target="https://help.github.com/articles/github-flavored-markdown/">GitHub Flavored Markdown</link> es una de estas variantes y es utilizado para visualizar archivos <code type="inline">.md</code> en el navegador del sitio de GitHub.</p>
<p>Para crear una tabla en GitHub, usa barras verticales <code type="inline">|</code>para separar columnas y guiones entre los encabezados y el resto del contenido de la tabla. Dado que las barras verticales son s&#243;lo estrictamente necesarias entre columnas, puedes usarlas en los extremos de la tabla para darle una vista m&#225;s acabada. Las celdas pueden tener contenido de cualquier extensi&#243;n, y no es necesario que las barras verticales est&#233;n alineadas verticalmente entre s&#237;.</p>
<pre><code xml:id="code_introduccion-a-markdown_11" type="block" corresp="code_introduccion-a-markdown_11.txt"/></pre>
<p><hi rend="bold">Esto se visualiza as&#237;:</hi></p>
<table>
<thead>
<tr>
<th>Encabezado 1</th>
<th>Encabezado 2</th>
<th>Encabezado 3</th>
</tr>
</thead>
<tbody>
<tr>
<td>rengl&#243;n 1, columna 1</td>
<td>rengl&#243;n 1, columna 2</td>
<td>rengl&#243;n 1, columna 3</td>
</tr>
<tr>
<td>rengl&#243;n 2, columna 1</td>
<td>rengl&#243;n 2, columna 2</td>
<td>rengl&#243;n 2, columna 3</td>
</tr>
<tr>
<td>rengl&#243;n 3, columna 1</td>
<td>rengl&#243;n 3, columna 2</td>
<td>rengl&#243;n 3, columna 3</td>
</tr>
</tbody></table><p>Para especificar la alineaci&#243;n del contenido de cada columna se pueden agregar dos puntos <code type="inline">:</code>al rengl&#243;n de los encabezados como sigue:</p>
<pre><code xml:id="code_introduccion-a-markdown_12" type="block" corresp="code_introduccion-a-markdown_12.txt"/></pre>
<p>Lo cual se representa de este modo:</p>
<table>
<thead>
<tr>
<th align="left">Alineado-izquierda</th>
<th align="center">Centrado</th>
<th align="right">Alineado-derecha</th>
</tr>
</thead>
<tbody>
<tr>
<td align="left">Manzanas</td>
<td align="center">rojo</td>
<td align="right">5000</td>
</tr>
<tr>
<td align="left">Pl&#225;tanos</td>
<td align="center">amarillo</td>
<td align="right">75</td>
</tr>
</tbody></table><h3>Limitaciones de Markdown</h3>
<p>Aunque Markdown se est&#225; haciendo cada vez m&#225;s popular, particularmente para los documentos con formato que se pueden ver en la web, muchas persones y editores siguen solicitando archivos tradicionales en Word, PDF y otros formatos. Esto puede arreglarse en parte utilizando herramientas de conversi&#243;n en l&#237;nea como <link target="http://johnmacfarlane.net/pandoc/">Pandoc</link>. No obstante, algunas caracter&#237;sticas de los procesadores de texto, como la de control de cambios, no tienen soporte a&#250;n. Por favor, visita la lecci&#243;n de Programming Historian en espa&#241;ol sobre <link target="/es/lecciones/escritura-sostenible-usando-pandoc-y-markdown">Escritura sostenible en texto plano usando Pandoc y Markdown</link> para mayor informaci&#243;n sobre Pandoc.</p>
<h3>Conclusiones</h3>
<p>Markdown es un t&#233;rmino medio muy &#250;til entre los archivos de texto plano sin estilo y los documentos de procesadores de texto heredados. Su sintaxis simple se aprende r&#225;pidamente y es altamente legible en el mismo documento y cuando se transforma en HTML u otro tipo de documentos. En conclusi&#243;n, escribir tus documentos en Markdown significa que ser&#225;n capaces de ser utilizados y le&#237;dos a largo plazo.</p>
</div></div></div></div>
    </body>
  </text>
</TEI>
