<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="introducao-omeka-net">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Introdu&#231;&#227;o ao Omeka.net</title>
  <author type="original_author">Miriam Posner</author><author type="translators">Gabriela Kucuruza</author><editor type="translation-reviewers"><persName>&#194;ngela Pit&#233;</persName><persName>R&#244;mulo Predes</persName></editor><editor type="editors">Adam Crymble</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0011</idno><date type="published">02/17/2016</date><date type="translated">06/07/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#up-and-running-with-omeka"/>.</p><p>There are other translations: <ref target="#poniendo-omeka-a-funcionar"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Com o Omeka.net &#233; f&#225;cil criar sites na web para mostrar cole&#231;&#245;es de itens.</p></abstract><textClass><keyword xml:lang="en">website</keyword></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body><p>O <link target="http://www.omeka.net">Omeka.net</link> facilita a cria&#231;&#227;o de websites para mostrar cole&#231;&#245;es de itens.  </p>
<div type="2"><head>Cadastre-se numa conta do Omeka</head>
<figure><desc>Cadastre-se na conta de teste</desc><graphic url="intro-omeka-net-1.png"/></figure>
<p>Entre em <link target="http://www.omeka.net">www.omeka.net</link> e clique em <hi rend="bold">Sign Up</hi> (Cadastre-se). Escolha o Plano de Teste. Preencha o formul&#225;rio de cadastro. Verifique o seu e-mail pelo link de ativa&#231;&#227;o da conta. </p>
</div><div type="2"><head>Crie um novo site do Omeka</head>
<figure><desc>P&#225;gina da conta do Omeka.net</desc><graphic url="intro-omeka-net-2.png"/></figure>
<p>Depois de clicar no link no seu e-mail, clique em <hi rend="bold">Add a Site</hi> (Adicionar um site). </p>
<p>Preencha a informa&#231;&#227;o sobre o URL do seu site, o t&#237;tulo que quer usar e a descri&#231;&#227;o que preferir. Clique em <hi rend="bold">Add Your New Site</hi> (Adicione o seu novo site). </p>
</div><div type="2"><head>Voc&#234; tem um novo site do Omeka!</head>
<figure><desc>Veja o seu site</desc><graphic url="intro-omeka-net-3.png"/></figure>
<p>Para ver o seu site, clique em <hi rend="bold">View Site</hi> (Ver Site).</p>
</div><div type="2"><head>Um site vazio no Omeka</head>
<figure><desc>Vista p&#250;blica do site</desc><graphic url="intro-omeka-net-4.png"/></figure>
<p>Esse &#233; o seu site vazio do Omeka esperando para ser preenchido. Para retornar ao painel de controle (<emph>dashboard</emph>) clique no bot&#227;o <hi rend="bold">Back</hi> (Retornar) ou escreva <code type="inline">http://www.omeka.net/dashboard</code>. Agora, clique em <hi rend="bold">Manage Site</hi> (Administre o site). </p>
</div><div type="2"><head>Instale alguns plugins</head>
<figure><desc>P&#225;gina dos Plugins</desc><graphic url="intro-omeka-net-5.png"/></figure>
<p>O seu site do Omeka vem com plugins que oferecem fun&#231;&#245;es adicionais. Precisamos ativ&#225;-los. Para fazer isso, clique no item <hi rend="bold">Plugins</hi> no menu, no canto superior direito. Na p&#225;gina seguinte, clique no bot&#227;o <hi rend="bold">Install</hi> (Instalar) em <hi rend="bold">Exhibit Builder</hi> (construtor de exposi&#231;&#245;es) (deixe as op&#231;&#245;es como est&#227;o na p&#225;gina seguinte) e em <hi rend="bold">Simple Pages</hi> (P&#225;ginas simples). </p>
</div><div type="2"><head>Configurar o seu site para  portugu&#234;s (nota da tradu&#231;&#227;o)</head>
<p>A configura&#231;&#227;o padr&#227;o do Omeka &#233; em ingl&#234;s. Por&#233;m, podemos mudar a l&#237;ngua do seu site para portugu&#234;s (pt-BR e pt-PT) atrav&#233;s de um Plugin. Para realizar essa configura&#231;&#227;o, siga os passos a seguir: </p>
<ol>
<li>
<p>Clique em <hi rend="bold">Manage Site</hi> (Administrar Site) no Menu Principal.  </p>
</li>
<li>
<p>Clique em Plugins no menu superior ou acesse os Plugins atrav&#233;s do link <code type="inline">https://nome_do_seu_site.omeka.net/admin/plugins</code>, sendo <code type="inline">nome_do_seu_site</code> o nome escolhido para o seu site. </p>
</li>
<li>
<p>Encontre o  Plugin <hi rend="bold">Locale</hi> e clique no bot&#227;o <hi rend="bold">Install</hi> (Instalar). Ao clicar, a sua tela ficar&#225; parecida com a imagem abaixo.</p>
</li>
<li>
<p>Ao clicar em instalar, aparecer&#225; uma p&#225;gina com as op&#231;&#245;es de tradu&#231;&#227;o. Escolha <hi rend="bold">Portugu&#234;s - Brasil (pt_BR)</hi> ou <hi rend="bold">Portugu&#234;s - Portugal (pt_PT)</hi>. </p>
</li>
<li>
<p>Clique em <hi rend="bold">Save Changes</hi> (Salvar Mudan&#231;as) </p>
</li>
</ol>
<figure><desc>A sua tela ficar&#225; parecida com a imagem acima. Nela, o Plugin Locale est&#225; indicado.</desc><graphic url="intro-omeka-net-6.png"/></figure>
<p>Agora, o seu site e o painel de controle estar&#227;o em portugu&#234;s.   </p>
</div><div type="2"><head>Trocar temas</head>
<figure><desc>P&#225;gina de Configura&#231;&#227;o dos Temas</desc><graphic url="intro-omeka-net-7.png"/></figure>
<p>O Omeka permite que a apar&#234;ncia do site p&#250;blico seja alterada por meio dos temas. Para fazer isso, clique em <hi rend="bold">Apar&#234;ncia</hi> (Appearence, &#224; direita do canto superior do seu painel de controle). Mude os temas selecionando uma das op&#231;&#245;es dispon&#237;veis na p&#225;gina. Clique o bot&#227;o verde <hi rend="bold">Utilizar este tema</hi>  (Use this theme) para atualizar o seu novo tema. Visite, ent&#227;o, o seu site p&#250;blico clicando no nome do seu site, no canto superior esquerdo da p&#225;gina. </p>
</div><div type="2"><head>Temos um novo tema!</head>
<figure><desc>Vista p&#250;blica com o novo tema</desc><graphic url="intro-omeka-net-8.png"/></figure>
<p>Confira o seu novo tema e volte para o seu painel de controle. &#201; poss&#237;vel retornar para o seu antigo tema, continuar com esse ou selecionar uma das outras op&#231;&#245;es. </p>
</div><div type="2"><head>Adicione um item</head>
<figure><desc>Adicione um item</desc><graphic url="intro-omeka-net-9.png"/></figure>
<p>Clique em <hi rend="bold">Itens</hi> no lado esquerdo do menu e depois (naturalmente!) <hi rend="bold">Adicione um item</hi> (Add an item). </p>
</div><div type="2"><head>Descreva o seu novo item</head>
<figure><desc>Torne o seu item p&#250;blico usando a caixa de sele&#231;&#227;o assinalada</desc><graphic url="intro-omeka-net-10.png"/></figure>
<p>Lembre, <hi rend="bold">Dublin Core</hi> refere-se &#224;s informa&#231;&#245;es descritivas (metadados) que voc&#234; insere sobre um item. Todas essas informa&#231;&#245;es s&#227;o opcionais e n&#227;o h&#225; como inseri-las incorretamente. Tente, por&#233;m, ser consistente. </p>
<p>N&#227;o se esque&#231;a de clicar na caixa de sele&#231;&#227;o <hi rend="bold">P&#250;blico</hi> (Public) para que o seu item fique vis&#237;vel para o p&#250;blico em geral. Se voc&#234; n&#227;o clicar nessa caixa, apenas pessoas cadastradas no seu site poder&#227;o ver o item. </p>
<p>Para adicionar m&#250;ltiplos campos - por exemplo, se voc&#234; quiser adicionar v&#225;rios assuntos ao seu item - use o bot&#227;o verde <hi rend="bold">Adicionar informa&#231;&#227;o</hi> (Add input) &#224; esquerda das caixas de texto.</p>
</div><div type="2"><head>Uma quest&#227;o complexa</head>
<figure><desc>O que &#233; isto?</desc><graphic url="intro-omeka-net-11.png"/></figure>
<p>Eu estou a criar um registo de item para o meu cachorro, Boris. Mas eu estou a descrever o Boris <emph>ele mesmo</emph> ou uma <emph>fotografia</emph> do Boris? No caso da primeira op&#231;&#227;o, o <hi rend="bold">Criador</hi> seria... bem, suponho que isso dependa das suas cren&#231;as religiosas. Se &#233; o segundo caso, o criador seria Brad Wallace, quem tirou a foto. </p>
<p>A decis&#227;o sobre descrever um objeto ou a representa&#231;&#227;o de um objeto &#233; sua. Uma vez que tenha decidido, seja consistente. </p>
</div><div type="2"><head>Anexe um ficheiro ao registo do seu item</head>
<figure><desc>Adicionando ficheiros a um item</desc><graphic url="intro-omeka-net-12.png"/></figure>
<p>Uma vez que terminamos de adicionar os metadados do Dublin Core, podemos anexar um ficheiro ao registo do seu item clicando em <hi rend="bold">Arquivos</hi> (Ficheiros em PT_PT / Files), no topo do formul&#225;rio de Dublin Core. (N&#227;o &#233; necess&#225;rio clicar em <hi rend="bold">Adicionar Item</hi> antes de fazer isso; o Omeka ir&#225; salvar automaticamente essa informa&#231;&#227;o). Podemos adicionar m&#250;ltiplos ficheiros, mas saiba que o plano B&#225;sico apenas vem com 500 MB de espa&#231;o de armazenamento. </p>
<p>Tendo adicionado o ficheiro ou os ficheiros, podemos adicionar <hi rend="bold">Tags</hi> (Etiquetas em PT_PT) clicando no bot&#227;o. Tamb&#233;m podemos clicar em <hi rend="bold">Metadados</hi> (Meta-dados do Tipo de Item em PT_PT / Item Type Metadata) para escolher a tipologia - pessoa, lugar, animal, vegetal, mineral - do seu item. Se n&#227;o encontrar um tipo de item apropriado para o seu item, n&#227;o se preocupe. N&#243;s podemos adicionar um novo tipo de item depois. </p>
<p>Quando tudo estiver pronto, clique no bot&#227;o verde <hi rend="bold">Adicionar item</hi>. </p>
</div><div type="2"><head>Voc&#234; tem um item!</head>
<figure><desc>Explorar itens, vista de administrador</desc><graphic url="intro-omeka-net-13.png"/></figure>
<p>Esta lista cont&#233;m todos os itens que foram adicionados. Se o item n&#227;o fosse p&#250;blico, estaria escrito <emph>Privado</emph> depois do t&#237;tulo. Para ver como a p&#225;gina do seu novo item se parece, clique no nome do item. </p>
</div><div type="2"><head>Esta n&#227;o &#233; a p&#225;gina p&#250;blica para o seu item</head>
<figure><desc>P&#225;gina de Item, vista de administrador</desc><graphic url="intro-omeka-net-14.png"/></figure>
<p>Pode parecer, mas essa p&#225;gina n&#227;o &#233; o que um usu&#225;rio n&#227;o-cadastrado ir&#225; ver quando navegar para a p&#225;gina do seu item. Para ver o que um usu&#225;rio veria, clique no bot&#227;o azul <hi rend="bold">Ver a P&#225;gina P&#250;blica</hi>, &#224; direita. (Ou voc&#234; pode editar o item clicando em <hi rend="bold">Editar</hi> na direita). </p>
</div><div type="2"><head>Esta &#233; a p&#225;gina p&#250;blica para o seu item</head>
<figure><desc>P&#225;gina do item, vista p&#250;blica</desc><graphic url="intro-omeka-net-15.png"/></figure>
<p>Isso &#233; o que o usu&#225;rio geral ver&#225; se ele navegar pela sua p&#225;gina. </p>
</div><div type="2"><head>Crie uma cole&#231;&#227;o</head>
<figure><desc>Criar uma cole&#231;&#227;o</desc><graphic url="intro-omeka-net-16.png"/></figure>
<p>&#201; poss&#237;vel come&#231;ar a ordenar a sua lista de itens agrupando-os em cole&#231;&#245;es. Para fazer isso, retorne para o painel de controle (Dashboard), clique na aba de <hi rend="bold">Cole&#231;&#245;es</hi> (Collections) e clique em <hi rend="bold">Adicionar uma cole&#231;&#227;o</hi>. </p>
</div><div type="2"><head>Insira informa&#231;&#245;es sobre a sua cole&#231;&#227;o</head>
<figure><desc>Adicionar metadados da cole&#231;&#227;o</desc><graphic url="intro-omeka-net-17.png"/></figure>
<p>No Omeka, os metadados s&#227;o fundamentais! Insira alguma informa&#231;&#227;o sobre a sua nova cole&#231;&#227;o e lembre-se de clicar no bot&#227;o <hi rend="bold">P&#250;blico</hi> perto do fim da p&#225;gina. Ent&#227;o salve a cole&#231;&#227;o.  </p>
</div><div type="2"><head>Adicione itens &#224; sua cole&#231;&#227;o</head>
<figure><desc>Clique na caixa sele&#231;&#227;o de cada item para editar</desc><graphic url="intro-omeka-net-18.png"/></figure>
<p>Para preencher a cole&#231;&#227;o que acabou de criar, clique na aba de <emph>Itens</emph>. Da sua lista <hi rend="bold">Ver Itens</hi> (Explorar Itens em PT_PT), clique nas caixas de verifica&#231;&#227;o dos itens que pertencem &#224; sua nova cole&#231;&#227;o. Ent&#227;o clique no bot&#227;o <hi rend="bold">Editar</hi>. </p>
</div><div type="2"><head>Escolha a cole&#231;&#227;o</head>
<figure><desc>Escolha uma cole&#231;&#227;o do menu suspenso</desc><graphic url="intro-omeka-net-19.png"/></figure>
<p>Na p&#225;gina Editar Itens (Editar Itens em Lote em PT_PT), selecione a Cole&#231;&#227;o &#224; qual gostaria de adicionar os seus itens. (Al&#233;m disso, tenha aten&#231;&#227;o a todas as outras coisas que podem ser feitas nessa p&#225;gina). </p>
</div><div type="2"><head>Veja a sua nova cole&#231;&#227;o</head>
<figure><desc>Ver cole&#231;&#227;o, vista p&#250;blica</desc><graphic url="intro-omeka-net-20.png"/></figure>
<p>Retorne para o seu site p&#250;blico. Se clicarmos na aba de <hi rend="bold">Ver Cole&#231;&#245;es</hi> (Explorar as Colec&#231;&#245;es em PT_PT) na face p&#250;blica do seu site, dever&#225;  haver agora uma nova cole&#231;&#227;o contendo os itens que foram identificados. </p>
<p>Agora que alguns itens foram adicionados e agrupados numa cole&#231;&#227;o, dedique algum tempo para editar ainda mais o seu site. Ele est&#225; a come&#231;ar a tomar forma agora que h&#225; tanto itens individuais como unidades tem&#225;ticas, mas o Omeka pode fazer ainda mais. Iremos falar sobre isso numa pr&#243;xima li&#231;&#227;o. </p>
</div><div type="2"><head>Recursos Adicionais</head>
<p>A equipe do Omeka compilou &#243;timos recursos nas <link target="http://info.omeka.net/">p&#225;ginas de ajuda</link>(em ingl&#234;s) do software. </p>
</div></body>
  </text>
</TEI>
