<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Introduction &#224; Heurist</title>
  <collection>lessons</collection>
  <layout>lesson</layout>
  <slug>introduction-a-heurist</slug>
  <date>2022-04-01</date>
  <authors>Vincent Paillusson</authors>
  <reviewers>Manon Durier,Morgane Pica,Viera Rebolledo-Dhuin</reviewers>
  <editors>Antoine Henry,Sofia Papastamkou</editors>
  <translator>None</translator>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/380</review-ticket>
  <difficulty>2</difficulty>
  <activity>transforming</activity>
  <topics>data-manipulation,mapping</topics>
  <abstract>Ce tutoriel pr&#233;sente l'utilisation d'Heurist, un logiciel de gestion de base de donn&#233;es d&#233;di&#233; aux sciences humaines et sociales. En s'appuyant sur un jeu de donn&#233;es de sites de fouilles arch&#233;ologiques, il illustre le fonctionnement d'Heurist et ses fonctionnalit&#233;s.</abstract>
  <avatar_alt>Planisphe&#768;res Ce&#769;lestes, Boreal et Austral, projete&#769;s sur le plan de l'E&#769;quateu</avatar_alt>
  <doi>10.46430/phfr0021</doi>
</metadata>
  <text xml:lang="fr">
    <body>
      <div type="2"><head>Objectifs du cours</head>
<p>Ce cours est une introduction &#224; l&#8217;utilisation d'<link target="https://perma.cc/5U92-NLF5">Heurist</link>, logiciel <emph>open source</emph> d&#233;velopp&#233; par l&#8217;universit&#233; de Sydney afin de permettre aux chercheurs et chercheuses en sciences humaines et sociales (SHS) de g&#233;rer leurs donn&#233;es acquises sur le terrain.</p>
</div>
      <div type="2"><head>Pr&#233;sentation de Heurist</head>
<p>Heurist est un syst&#232;me de gestion de base de donn&#233;es (<link target="https://perma.cc/66GX-YNHL">SGBD</link>). &#201;labor&#233; en 2005 par le professeur <link target="https://perma.cc/6MFS-557H">Ian Johnson</link><ref type="footnotemark" target="#Remerciements"/> en collaboration avec des dizaines de projets de recherche en sciences humaines, il vise &#224; redonner &#224; la communaut&#233; de recherche le contr&#244;le sur ses donn&#233;es plut&#244;t que de le d&#233;l&#233;guer aux personnes en charge des d&#233;veloppements informatiques<ref type="footnotemark" target="#5"/>. Si Heurist peut &#234;tre utilis&#233; pour g&#233;rer tous types de donn&#233;es, il a &#233;t&#233; pens&#233; pour r&#233;soudre des probl&#233;matiques li&#233;es aux recherches en SHS. Il int&#232;gre donc nativement la gestion et la visualisation de donn&#233;es spatiales et temporelles ainsi que des &#233;l&#233;ments permettant de d&#233;crire de fa&#231;on fine des lieux ou des personnes. Ses fonctionnalit&#233;s sont nombreuses, elles comprennent entre autres&#160;:</p>
<ol>
<li>La mod&#233;lisation</li>
<li>L'import</li>
<li>La visualisation</li>
<li>La publication</li>
<li>L'export dans un format ouvert</li>
<li>Le travail collaboratif</li>
<li>L'analyse</li>
</ol>
<figure><desc>Fig. 1. Cycle de recherche Heurist.</desc><graphic url="introduction-a-heurist-1.png"/></figure>
<p>En outre, Heurist offre un dispositif parfaitement compatible avec les objectifs de la science ouverte<ref type="footnotemark" target="#FAIR"/><ref type="footnotemark" target="#5StarOpenData"/>&#160;:</p>
<ul>
<li>En donnant la possibilit&#233; de d&#233;crire les donn&#233;es &#224; travers des ontologies et des standards (<link target="https://perma.cc/F5FK-K7BB">DCMI-TERMS</link>, <link target="https://perma.cc/TQG8-P2FJ">BIBO</link>, <link target="https://perma.cc/U23V-XJ9H">BIO</link>, <link target="https://perma.cc/C8F7-TQK8">FOAF</link>, <link target="https://perma.cc/X8R6-NR8P">DOAP</link>, <link target="https://perma.cc/FNV9-J8GJ">RDF</link>, <link target="https://perma.cc/B7DD-LXM4">SKOS</link>)</li>
<li>En exportant des donn&#233;es sous des formats ouverts (<link target="https://perma.cc/K6MA-CGKS">CSV</link>, <link target="https://perma.cc/5TF6-NJJW">XML</link>, <link target="https://perma.cc/XE3P-ESXJ">JSON</link>, <link target="https://perma.cc/4KFW-B2E7">GEOJSON</link>, <link target="https://perma.cc/8MCS-GMQV">KML</link>) et r&#233;exploitables par de nombreux autres logiciels et protocoles (<link target="https://perma.cc/M7GL-7AJH">GEPHI</link>, <link target="https://perma.cc/3VM9-L9EW">IIIF</link>, <link target="https://perma.cc/N756-2V2A">MySQL</link>)</li>
<li>En liant les vocabulaires sur Heurist &#224; des r&#233;f&#233;rentiels expos&#233;s sur le web &#224; l'aide d'identifiants <link target="https://perma.cc/DN39-B92S">URI</link></li>
<li>En rendant accessibles et interop&#233;rables les donn&#233;es sur le web via la publication d'un site web ou la g&#233;n&#233;ration de <emph>feeds</emph> ou <link target="https://perma.cc/5L75-B3P4">flux web</link></li>
<li>En permettant la r&#233;cup&#233;ration de donn&#233;es export&#233;es depuis d'autres syst&#232;mes de gestion de base de donn&#233;es (par exemple MySQL, FileMaker ou Access) en s'appuyant sur des formats ouverts (CSV, XML)</li>
</ul>
</div>
      <div type="2"><head>Quelques &#233;l&#233;ments techniques</head>
<p>Heurist est un logiciel <emph>open source</emph>, il se base sur une infrastructure serveur de type <link target="https://perma.cc/ET9N-K9E3">LAMP</link> tr&#232;s utilis&#233;e dans le d&#233;veloppement web. Les chercheurs et chercheuses peuvent y avoir acc&#232;s moyennant la cr&#233;ation d'un compte sur <link target="https://perma.cc/3EBM-AEHU">un serveur h&#233;bergeant Heurist</link>. Dans le cadre de cette le&#231;on, nous utiliserons une instance h&#233;berg&#233;e par la <link target="https://perma.cc/M6X8-5BPV">TGIR Huma-Num</link> qui <link target="https://heurist.huma-num.fr">met &#224; disposition Heurist</link> pour la communaut&#233; francophone de recherche en SHS.</p>
<p class="alert alert-info" style="alert alert-info">
  En France, l'utilisation d'un service mis en place ou h&#233;berg&#233; par une <link target="https://perma.cc/H4CZ-ZL6B">Tr&#232;s Grande Infrastructure de Recherche (TGIR)</link> sp&#233;cialis&#233;e dans le domaine des SHS, comme Huma-Num dans le cas pr&#233;sent, ou encore <link target="https://perma.cc/9G72-BZR7">Progedo</link>, est un gage de s&#233;curit&#233; pour le stockage et l'exposition des donn&#233;es de recherche dans le temps.
</p>
<p>Pour les personnes souhaitant tester le logiciel hors ligne, il est &#233;galement possible d'h&#233;berger Heurist localement sur un ordinateur. Les informations pour son installation sont disponibles en anglais <link target="https://heuristnetwork.org/installation/">sur le site officiel d'Heurist</link>.</p>
<p class="alert alert-info" style="alert alert-info">
  Cette installation demande des comp&#233;tences techniques minimales d'administration d'un serveur web pour pouvoir &#234;tre effectu&#233;e.
</p>
<p>Heurist s'appuie sur une conception <link target="https://perma.cc/5MJU-FV2G">relationnelle</link> des donn&#233;es, mais simplifie certains aspects de cette mod&#233;lisation afin de faciliter son utilisation. Nous abordons bri&#232;vement quelques concepts cl&#233;s du mod&#232;le relationnel dans la partie <link target="#modelisation">&#171;&#160;Mod&#233;lisation des donn&#233;es&#160;&#187;</link>.</p>
</div>
      <div type="2"><head>Organisation de la le&#231;on</head>
<p>Dans cette le&#231;on, nous partirons d'un jeu de donn&#233;es brut, discuterons sa mod&#233;lisation et r&#233;percuterons cette mod&#233;lisation dans Heurist afin d'importer les donn&#233;es pour enfin les publier en ligne.</p>
<p class="alert alert-warning" style="alert alert-warning">
   Cette le&#231;on et les captures d'&#233;cran qu'elle contient ont &#233;t&#233; r&#233;alis&#233;es en avril 2021 sur la version 6 d'Heurist (not&#233;e &#171;&#160;h6&#160;&#187;). Heurist &#233;voluant constamment, ses fonctionnalit&#233;s et son interface sont amen&#233;es &#224; se modifier au fil du temps &#224; travers de nombreuses sous-versions (par exemple &#171;&#160;h6.2.26&#160;&#187; en janvier 2022). Dans la plupart des cas, cela ne devrait pas g&#234;ner la compr&#233;hension des indications qui suivent, la logique fonctionnelle restant la m&#234;me au sein de la version 6 du logiciel. Pour toutes questions ou interrogations, il est possible de consulter la documentation en ligne (en anglais) sur le site officiel d'<link target="https://heuristnetwork.org/tutorials/">Heurist</link> dans la rubrique <i>Learn</i> ou encore de demander de l'aide aupr&#232;s d'autres usagers d'Heurist via la liste francophone <link target="https://perma.cc/K398-B6WT">d'utilisateurs et utilisatrices Heurist</link>.
</p>
</div>
      <div type="2"><head>Donn&#233;es utilis&#233;es pour le cours</head>
<p>Nous utiliserons tout au long du cours le jeu de donn&#233;es de <link target="https://www.data.gouv.fr/fr/datasets/localisation-des-sites-de-fouille-archeologiques-de-l-inrap-576210/">&#171;&#160;Localisation des sites de fouille arch&#233;ologiques de l'INRAP&#160;&#187;</link>, libre de droits et recensant 625 sites de fouilles en France.</p>
<p class="alert alert-info" style="alert alert-info">
  Nous exploitons ces donn&#233;es arch&#233;ologiques uniquement &#224; titre d'exemple, pour illustrer le pr&#233;sent tutoriel. Heurist ayant une approche plut&#244;t g&#233;n&#233;rique, il peut g&#233;rer des donn&#233;es arch&#233;ologiques, mais n'est pas un outil sp&#233;cialis&#233; &#224; cette fin. Pour aller plus loin sur la gestion des donn&#233;es arch&#233;ologiques, nous vous invitons &#224; consulter, entre autres, les travaux du <link target="https://perma.cc/W2VP-EZLL">Consortium MASA</link> ainsi que les outils que celui-ci met &#224; disposition de la communaut&#233; de recherche en arch&#233;ologie et dont certains peuvent &#233;galement servir pour d'autres disciplines en SHS.
</p>
<p>Comme son nom l'indique, ce jeu de donn&#233;es localise des sites de fouilles arch&#233;ologiques de l'<link target="https://perma.cc/DA3Q-HQ3J">Institut national de recherches arch&#233;ologiques pr&#233;ventives (INRAP)</link> et est enrichi d'informations de localisation pr&#233;cises comme&#160;:</p>
<ul>
<li>Les coordonn&#233;es g&#233;ographiques du site de fouilles</li>
<li>Un nom de site</li>
<li>
Des informations de localisation utilisant le d&#233;coupage administratif fran&#231;ais<ul>
<li>R&#233;gion</li>
<li>D&#233;partement</li>
<li>Commune</li>
</ul>
</li>
<li>Des donn&#233;es temporelles concernant l'intervention arch&#233;ologique</li>
<li>Des th&#232;mes et des p&#233;riodes historiques relatifs &#224; ce qui a &#233;t&#233; d&#233;couvert sur le site</li>
</ul>
<p>Il s'agit d'un tableau de donn&#233;es CSV (format ouvert) dont les colonnes sont s&#233;par&#233;es par des points-virgules. Il peut &#234;tre lu et &#233;dit&#233; avec un simple &#233;diteur de texte ou un tableur.</p>
<p>Ces donn&#233;es, bien que relativement limit&#233;es et peu complexes, nous permettront d'utiliser les fonctionnalit&#233;s de visualisation cartographique et chronologique de Heurist. Comme nous le verrons plus loin, Heurist porte bien son nom, car il permet, par la visualisation et une exploration diff&#233;rente de ses donn&#233;es (notamment via des fonctionnalit&#233;s de visualisation cartographiques et de graphes), de d&#233;couvrir et de corriger tr&#232;s rapidement des erreurs ou encore d'approfondir une analyse. Ces donn&#233;es peuvent par la suite &#234;tre export&#233;es vers d'autres logiciels sp&#233;cialis&#233;s comme par exemple <link target="https://perma.cc/H5MT-UW8S">QGIS</link><ref type="footnotemark" target="#QGIS"/> et Gephi. De surcro&#238;t, il facilite &#233;galement la recherche et la navigation dans les donn&#233;es &#224; travers de nombreux filtres configurables &#224; des fins de recherche individuelle, de travail collaboratif ou encore de diffusion &#224; destination d'un plus large public.</p>
<p>Pour les besoins de l'exercice et l'int&#233;gration correcte des donn&#233;es, certaines op&#233;rations de consolidation et de transformation ont &#233;t&#233; effectu&#233;es &#224; l'aide de l'outil <link target="/fr/lecons/nettoyer-ses-donnees-avec-openrefine">OpenRefine</link> pour&#160;:</p>
<ul>
<li>La cr&#233;ation de nouvelles colonnes <hi rend="bold">Coordonn&#233;es d&#233;cimales lat/long</hi> et la conversion des coordonn&#233;es g&#233;ospatiales, not&#233;es initialement en <link target="https://perma.cc/6K8T-T37G">Lambert 93</link>, en notation d&#233;cimale latitude/longitude afin de permettre leur int&#233;gration dans Heurist et de les r&#233;f&#233;rencer pr&#233;cis&#233;ment, ind&#233;pendamment de la p&#233;riode concern&#233;e ou des &#233;volutions toponymiques</li>
<li>L'ajout d&#8217;une colonne <hi rend="bold">Id</hi> pour identifier de fa&#231;on non ambigu&#235; une intervention arch&#233;ologique</li>
<li>Le renommage de la colonne <hi rend="bold">Nom de site</hi> en <hi rend="bold">Nom d&#8217;intervention</hi> apr&#232;s avoir observ&#233; que les informations qu'elle contenait pouvaient concerner des &#233;l&#233;ments autres que ceux du site proprement dit, comme par exemple la date de l'intervention</li>
<li>
La d&#233;sambigu&#239;sation des noms de site afin d&#8217;identifier un lieu d&#8217;intervention de fa&#231;on unique en proc&#233;dant &#224;&#160;:<ul>
<li>La cr&#233;ation d'une nouvelle colonne <hi rend="bold">Nom de site</hi> &#224; partir de la colonne <hi rend="bold">Nom d'intervention</hi></li>
<li>L'extraction d'informations, comme l'ann&#233;e d'intervention, relatives &#224; l'intervention plut&#244;t qu'au site</li>
<li>L'homog&#233;n&#233;isation orthographique des noms de lieux poss&#233;dant les m&#234;mes coordonn&#233;es g&#233;ographiques</li>
</ul>
</li>
</ul>
<p>L'ensemble des donn&#233;es que nous utiliserons pour cette le&#231;on sont &#224; t&#233;l&#233;charger <link target="https://github.com/vpaillusson/tuto-heurist/raw/master/donnees_inrap.zip">sur le r&#233;pertoire GitHub de l'auteur</link> ainsi que sur le <link target="https://github.com/programminghistorian/jekyll/tree/gh-pages/assets/introduction-a-heurist">d&#233;p&#244;t</link> du <emph>Programming Historian</emph>. Vous y trouverez quatre fichiers&#160;:</p>
<ul>
<li><code type="inline">donnees_inrap_ph.csv</code></li>
<li><code type="inline">periodes.csv</code></li>
<li><code type="inline">themes.csv</code></li>
<li><code type="inline">type_intervention.csv</code></li>
</ul>
<p>Ces fichiers CSV contiennent les informations descriptives d'une intervention incorporant les modifications n&#233;cessaires &#224; une int&#233;gration dans Heurist, ainsi que la liste des termes d&#233;crivant les p&#233;riodes, les th&#232;mes et les types d'intervention tels qu&#8217;ils ont &#233;t&#233; d&#233;finis dans le fichier source de l'INRAP.</p>
</div>
      <div type="2"><head>Mod&#233;lisation des donn&#233;es</head>
<p>Heurist s'appuie sur une conception relationnelle des donn&#233;es, il est ainsi important de rappeler certains &#233;l&#233;ments th&#233;oriques afin de comprendre son fonctionnement. Nous ne ferons pas un cours sur la mod&#233;lisation relationnelle des donn&#233;es<ref type="footnotemark" target="#coursMerise"/>, retenons n&#233;anmoins que celle-ci permet de garantir&#160;:</p>
<ul>
<li>
<p>L'unicit&#233; de chaque enregistrement&#160;: un site arch&#233;ologique ne sera renseign&#233; qu'une seule fois dans la base de donn&#233;es. La cr&#233;ation d'un doublon provoquera une erreur.</p>
</li>
<li>
<p>La non-redondance des donn&#233;es saisies&#160;: si un site fait l'objet de plusieurs interventions arch&#233;ologiques, il ne sera pas n&#233;cessaire de saisir &#224; chaque fois les donn&#233;es le concernant. De m&#234;me, en cas de correction concernant ce site, il suffira de la r&#233;aliser une seule fois pour la voir r&#233;percut&#233;e sur toute la base.</p>
</li>
</ul>
<figure><desc>Fig. 2. Mod&#233;lisation de l'unicit&#233;.</desc><graphic url="introduction-a-heurist-2.png"/></figure>
<ul>
<li>Une organisation structur&#233;e des connaissances&#160;: <a name="vocabulaires1"/>les &#233;l&#233;ments d'une base de donn&#233;es sont organis&#233;s entre eux &#224; travers des concepts descriptifs d&#233;finis qui peuvent prendre la forme de <link target="#vocabulaires2">vocabulaires contr&#244;l&#233;s</link> ou d'<link target="https://perma.cc/AJL5-H5MK">ontologies</link>. Cela permet une coh&#233;rence dans la mani&#232;re de d&#233;crire les objets au sein d'une m&#234;me base de donn&#233;es ou d'un collectif de travail.</li>
</ul>
<p class="alert alert-info" style="alert alert-info">
  La conception intellectuelle d'une base de donn&#233;es fait partie int&#233;grante de la r&#233;flexion scientifique. Elle doit &#234;tre effectu&#233;e en amont de la mod&#233;lisation dans Heurist et aura un impact significatif sur les r&#233;sultats et analyses qui r&#233;sulteront de son exploitation. Toutefois, Heurist apporte une aide non n&#233;gligeable pour d&#233;buter dans la conception d'une base de donn&#233;es, en mettant &#224; disposition un ensemble de types d'enregistrement qui peut servir de socle &#224; un nombre important de base de donn&#233;es en SHS (cf. Fig. 3). Par ailleurs, Heurist offre une grande souplesse dans la conception et l'alimentation des bases de donn&#233;es qu'il h&#233;berge, offrant ainsi une fonctionnalit&#233; de type &#171;&#8239;bac &#224; sable&#8239;&#187;, permettant de faire et d&#233;faire au gr&#233; de l'&#233;volution conceptuelle de la base de donn&#233;es.
</p>
<figure><desc>Fig. 3. Types d'enregistrement propos&#233;s par Heurist pour toutes nouvelles bases de donn&#233;es.</desc><graphic url="introduction-a-heurist-3.png"/></figure>
<div type="3"><head>Entit&#233;s et champs</head>
<p>Ouvrez le fichier <code type="inline">donnees_inrap_ph.csv</code> avec le tableur de votre choix (par exemple OpenOffice Calc ou MS Excel). Ce tableau reprend les noms de colonnes du fichier CSV source de l'INRAP avec quelques colonnes suppl&#233;mentaires n&#233;cessaires &#224; l'import dans Heurist.</p>
<p>Les colonnes de ce tableau peuvent &#234;tre regroup&#233;es en deux types d'objets distincts&#160;:</p>
<figure><desc>Fig. 4. Tableau INRAP</desc><graphic url="introduction-a-heurist-4.png"/></figure>
<ol>
<li>
<p>Localisation</p>
<ul>
<li>Nom du site</li>
<li>Coordonn&#233;es Lambert 93 X</li>
<li>Coordonn&#233;es Lambert 93 Y</li>
<li>Coordonn&#233;es d&#233;cimales longitude</li>
<li>Coordonn&#233;es d&#233;cimales latitude</li>
<li>R&#233;gion</li>
<li>D&#233;partement</li>
<li>Commune</li>
</ul>
</li>
<li>
<p>Intervention</p>
<ul>
<li>Id</li>
<li>Nom d'intervention</li>
<li>Date de d&#233;but</li>
<li>Date de fin</li>
<li>Type d&#8217;intervention</li>
<li>Th&#232;mes</li>
<li>P&#233;riodes</li>
</ul>
</li>
</ol>
<p>Nous appellerons ces objets des &#171;&#160;entit&#233;s&#160;&#187;. Dans Heurist, elles portent le nom de &#171;&#160;types d'enregistrement&#160;&#187; (<emph>record types</emph>). Les colonnes qui composent ces types d'enregistrement y sont appel&#233;es &#171;&#160;champs&#160;&#187; (<emph>fields</emph>).</p>
<figure><desc>Fig. 5. Mod&#233;lisation des entit&#233;s et de leurs champs descriptifs.</desc><graphic url="introduction-a-heurist-5.png"/></figure>
<p>Dans notre exemple, <hi rend="bold">Intervention</hi> serait donc un type d'enregistrement, soit une entit&#233;, tandis qu'une intervention pr&#233;cise, par exemple celle d'Id INRAP0002, sera une instance de cette entit&#233; et sera appel&#233;e un &#171;&#160;enregistrement&#160;&#187; (<emph>record</emph>) dans Heurist.</p>
<figure><desc>Fig. 6. Mod&#233;lisation des instances d'une entit&#233;.</desc><graphic url="introduction-a-heurist-6.png"/></figure>
<p>Parmi ses attributs, chaque entit&#233; dispose d'un identifiant unique permettant d'y faire r&#233;f&#233;rence de fa&#231;on non ambigu&#235;. Cet identifiant peut &#234;tre un simple nombre incr&#233;ment&#233; pour chaque occurrence de l'entit&#233; ou &#234;tre construit de fa&#231;on plus &#233;labor&#233;e en fonction des besoins et du volume d'occurrences.
Dans le cadre de nos donn&#233;es, l'attribut <hi rend="bold">Id</hi> identifie une intervention de fa&#231;on non ambigu&#235; et <hi rend="bold">Nom de site</hi> fait r&#233;f&#233;rence &#224; une et une seule localisation. En pratique, nous pouvons donc g&#233;n&#233;rer un identifiant de deux fa&#231;ons&#160;: soit en le construisant de fa&#231;on arbitraire pour la coh&#233;rence de notre mod&#232;le conceptuel (champ <hi rend="bold">Id</hi>) soit en s&#233;lectionnant un attribut qui porte d&#233;j&#224; ce r&#244;le dans notre base de donn&#233;es (champ <hi rend="bold">Nom de site</hi>). </p>
</div><div type="3"><head>Les relations</head>
<p>Les entit&#233;s ne sont pas des objets isol&#233;s dans notre base de donn&#233;es. Au contraire, elles sont reli&#233;es entre elles afin de d&#233;crire des &#233;v&#233;nements ou des objets complexes. Par exemple, &#233;tant donn&#233; que nous souhaitons conserver le lien entre un lieu et une op&#233;ration arch&#233;ologique sp&#233;cifique, une intervention arch&#233;ologique sera li&#233;e &#224; une localisation. Nous verrons plus loin comment Heurist g&#232;re ce type de relations en pratique.</p>
</div><div type="3"><head>Champs multivalu&#233;s et cardinalit&#233;</head>
<p>Les cellules des colonnes <hi rend="bold">Th&#232;mes</hi> et <hi rend="bold">P&#233;riodes</hi> de notre fichier <code type="inline">donnees_inrap_ph.csv</code>, peuvent comporter plusieurs th&#232;mes ou p&#233;riodes s&#233;par&#233;s par le symbole &#171;&#160;#&#160;&#187;. Pour permettre l'interrogation de celles-ci de fa&#231;on fine, nous devons les s&#233;parer tout en maintenant leur relation respective avec l'op&#233;ration arch&#233;ologique qu'elles d&#233;crivent. Cela veut donc dire que l'intervention d'Id INRAP0002 sera reli&#233;e aux th&#232;mes &#171;&#160;Antiquit&#233;&#160;&#187; et &#171;&#160;Protohistoire&#160;&#187; et non au th&#232;me &#171;&#160;#Antiquit&#233;#protohistoire&#160;&#187;.</p>
<figure><desc>Fig. 7. Mod&#233;lisation des champs multivalu&#233;s.</desc><graphic url="introduction-a-heurist-7.png"/></figure>
<p>Il faut indiquer quelque part dans notre mod&#232;le qu'une intervention peut avoir plusieurs th&#232;mes: c'est la <link target="https://perma.cc/M5RH-2B9U">cardinalit&#233;</link>, qui permet de pr&#233;ciser si l'entit&#233; d&#233;crite peut &#234;tre reli&#233;e &#224; d'autres entit&#233;s ou encore si des informations descriptives du m&#234;me type peuvent &#234;tre r&#233;p&#233;t&#233;es. En outre, elle d&#233;termine le caract&#232;re obligatoire ou optionnel de cette relation. Essentiellement, elle r&#233;pond aux questions du type&#160;:</p>
<ul>
<li>Une intervention est-elle obligatoirement li&#233;e &#224; un th&#232;me&#8239;? (information descriptive)</li>
<li>Une intervention est-elle li&#233;e &#224; plusieurs th&#232;mes&#8239;? (information descriptive)</li>
<li>Une intervention est-elle obligatoirement li&#233;e &#224; un site&#8239;? (relation &#224; une autre entit&#233;)</li>
<li>une intervention est-elle li&#233;e &#224; plusieurs sites&#8239;? (relation &#224; une autre entit&#233;)</li>
</ul>
<p>Nous ne d&#233;taillerons pas ici la formalisation de la notation de ces cardinalit&#233;s, mais en pratique dans Heurist cela sera d&#233;fini pour un champ donn&#233; par les param&#232;tres <emph>Repeatability</emph> et <emph>Requirement</emph> (fig. 8)&#160;:</p>
<figure><desc>Fig. 8. Champs multivalu&#233;s dans Heurist.</desc><graphic url="introduction-a-heurist-8.png"/></figure>
</div><div type="3"><head>Vocabulaires contr&#244;l&#233;s</head>
<p>Nous venons de rencontrer le cas des th&#232;mes ou p&#233;riodes qui pouvaient d&#233;crire une m&#234;me intervention. De m&#234;me, <hi rend="bold">Type d'intervention</hi> fait r&#233;f&#233;rence &#224; un vocabulaire, m&#234;me si celui-ci compte uniquement deux termes.</p>
<p><a name="vocabulaires2"/>Nous avons d&#233;j&#224; abord&#233; rapidement ce point dans la partie sur la <link target="#vocabulaires1">coh&#233;rence des donn&#233;es</link>.
Fonctionnellement, les <link target="https://perma.cc/4ESL-P4UZ">vocabulaires contr&#244;l&#233;s</link> s'opposent &#224; une saisie textuelle libre. Concr&#232;tement, il s'agit de lister, de cat&#233;goriser et de hi&#233;rarchiser des concepts, en nombre fini, afin d'&#233;viter certains biais courants lors des saisies textuelles libres tels que&#160;:</p>
<ul>
<li>L'incoh&#233;rence orthographique (M &#8800; m, Moyen-&#194;ge &#8800; Moyen &#194;ge)</li>
<li>La synonymie (habitats &#8776; &#233;difices &#8776; architecture)</li>
<li>L'inclusion (pratiques fun&#233;raires &#8838; cultes)</li>
</ul>
<p>L'utilisation de vocabulaires contr&#244;l&#233;s permet ainsi d'optimiser les requ&#234;tes et l'analyse sur des donn&#233;es&#160;: d'une part, elle r&#233;duit le nombre de termes descriptifs, en supprimant les synonymies et en corrigeant les incoh&#233;rences orthographiques, d'autre part, elle organise hi&#233;rarchiquement les concepts, une requ&#234;te pouvant par exemple se limiter &#224; une branche hi&#233;rarchique au sein d'un m&#234;me vocabulaire contr&#244;l&#233;.</p>
<p>C'est aussi une fa&#231;on de se mettre d'accord, au sein d'un collectif de travail, sur une certaine description du monde comme le font les <link target="https://perma.cc/5X7R-NLQ9">th&#233;saurus</link> ou les ontologies. Par ailleurs, dans une optique de science ouverte, utiliser des vocabulaires partag&#233;s par une communaut&#233; scientifique plus large, surtout lorsqu'ils sont normalis&#233;s, est &#233;galement un gage d'interop&#233;rabilit&#233; et de compr&#233;hension mutuelle.</p>
<p>Afin de g&#233;rer ces listes de termes, Heurist utilise des &#171;&#160;vocabulaires&#160;&#187; (<emph>vocabularies</emph>). Chaque vocabulaire (<emph>vocabulary</emph>) contient des &#171;&#160;termes&#160;&#187; (<emph>terms</emph>). Heurist int&#232;gre nativement un certain nombre de vocabulaires, dont certains sont issus de standards du web de donn&#233;es et pourront &#234;tre tr&#232;s utiles &#224; la communaut&#233; de recherche en SHS.</p>
<figure><desc>Fig. 9. Vocabulaires contr&#244;l&#233;s.</desc><graphic url="introduction-a-heurist-9.png"/></figure>
<p>Heurist propose &#233;galement un syst&#232;me de mod&#232;les pr&#233;&#233;tablis de types d'enregistrement via l'onglet <emph>Browse templates</emph> du mode <emph>Design</emph>, organis&#233;s th&#233;matiquement, et que n'importe qui peut utiliser dans sa propre base. C'est aussi une source d'inspiration tr&#232;s int&#233;ressante, car, en plus des mod&#232;les propos&#233;s par Heurist, il est possible de consulter et d'importer des mod&#232;les de bases de donn&#233;es d'autres personnes utilisant le logiciel.</p>
<p>En compl&#233;ment d'Heurist, des outils comme <link target="https://perma.cc/FUJ6-32UV">Opentheso</link>, soutenus notamment par le Consortium MASA, ou encore <link target="https://perma.cc/M9QB-QF9D">Loterre</link>, de l'<link target="https://perma.cc/696R-4NDW">Institut de l'information scientifique et technique du Centre national de la recherche scientifique (Inist CNRS)</link>, peuvent &#234;tre tr&#232;s utiles pour organiser ou consulter des th&#233;saurus scientifiques multilingues et multihi&#233;rarchiques compatibles conformes aux standards du web des donn&#233;es ouvertes.</p>
</div></div>
      <div type="2"><head>Cr&#233;er une base de donn&#233;es sur Heurist</head>
<p>Une fois ces quelques informations th&#233;oriques rappel&#233;es, nous pouvons passer &#224; leur mise en pratique dans Heurist.</p>
<div type="3"><head>Cr&#233;ation d'un compte utilisateur</head>
<p>Rendez-vous sur l'instance d'<link target="https://heurist.huma-num.fr/">Heurist h&#233;berg&#233;e sur Huma-Num</link> puis suivez les instructions pour cr&#233;er un compte ainsi qu'une base de donn&#233;es.</p>
<p>Une fois connect&#233;s &#224; cette nouvelle base, vous &#234;tes redirig&#233;s vers l'interface de Heurist.</p>
<figure><desc>Fig. 10. Page d'accueil de Heurist.</desc><graphic url="introduction-a-heurist-10.png"/></figure>
<p>La colonne de navigation &#224; gauche est organis&#233;e par groupes fonctionnels&#160;:</p>
<ul>
<li><emph>Explore</emph> donne acc&#232;s &#224; la navigation dans les donn&#233;es, c'est la fonction clef de l'exploitation d'une base Heurist</li>
<li><emph>Design</emph> permet la mod&#233;lisation des donn&#233;es</li>
<li><emph>Populate</emph> donne la possibilit&#233; d'ajouter de nouveaux enregistrements</li>
<li><emph>Publish</emph> permet de g&#233;rer la publication de vos donn&#233;es en ligne via un site web ou une page d&#233;di&#233;e</li>
<li><emph>Admin</emph> offre la possibilit&#233; de g&#233;rer vos bases de donn&#233;es ainsi que les utilisateurs et utilisatrices</li>
</ul>
<p>Une rubrique d'aide est accessible pour chaque mode via le &#171;&#160;?&#160;&#187; entour&#233; d'un cercle.</p>
</div><div type="3"><head>Cr&#233;ation de notre mod&#232;le de donn&#233;es</head>
<ol>
<li>Cliquez sur <emph>Design</emph></li>
<li>Puis sur <emph>Record types</emph></li>
<li>Par d&#233;faut, le premier groupe de types d'enregistrement est s&#233;lectionn&#233;</li>
<li>Chaque type d'enregistrement est r&#233;sum&#233; sur une ligne dans la fen&#234;tre de visualisation de droite</li>
</ol>
<figure><desc>Fig. 11. Record types.</desc><graphic url="introduction-a-heurist-11.png"/></figure>
<div type="4"><head>Cr&#233;ation de l'entit&#233; de localisation</head>
<p>Comme nous l'avons vu pr&#233;c&#233;demment, nous avons&#160;:</p>
<ul>
<li>
Deux entit&#233;s principales<ul>
<li>Localisation</li>
<li>Intervention</li>
</ul>
</li>
<li>
Trois vocabulaires<ul>
<li>Th&#232;mes</li>
<li>P&#233;riodes</li>
<li>Type d'intervention</li>
</ul>
</li>
</ul>
<p>Afin de mieux organiser les donn&#233;es, ajoutez un nouveau groupe de types d'enregistrement en cliquant sur <emph>Add</emph> et nommez-le &#171;&#160;INRAP&#160;&#187;.</p>
<p>Les champs dont nous avons besoin pour l'entit&#233; localisation sont les suivants&#160;:</p>
<ul>
<li>
Localisation<ul>
<li>Nom du site (champ texte)</li>
<li>Coordonn&#233;es Lambert 93 X (champ texte)</li>
<li>Coordonn&#233;es Lambert 93 Y (champ texte)</li>
<li>Coordonn&#233;es d&#233;cimales longitude (champ lat/long)</li>
<li>Coordonn&#233;es d&#233;cimales latitude (champ lat/long)</li>
<li>R&#233;gion (champ texte)</li>
<li>D&#233;partement (champ texte)</li>
<li>Commune (champ texte)</li>
</ul>
</li>
</ul>
<p class="alert alert-warning" style="alert alert-warning">
    M&#234;me si nous avons converti les coordonn&#233;es g&#233;ographiques en notation d&#233;cimale afin de les int&#233;grer dans Heurist, nous conservons les donn&#233;es Lambert 93 sous forme de champ texte afin de garder trace de ces donn&#233;es initiales.
</p>
<p>Ajoutez un type d'enregistrement pour d&#233;finir l'entit&#233; de localisation.</p>
<ol>
<li>Cliquez sur <emph>Add</emph></li>
<li>Dans la fen&#234;tre vous pr&#233;venant que vous pouvez importer des <emph>record types</emph> existants, cliquez sur <emph>Continue</emph></li>
</ol>
<figure><desc>Fig. 12. Ajout d'un *record type*.</desc><graphic url="introduction-a-heurist-12.png"/></figure>
<p>Remplissez les informations concernant le type d'enregistrement de localisation auquel vous donnerez le nom de <hi rend="bold">Site</hi>.</p>
<figure><desc>Fig. 13. Entit&#233; de localisation.</desc><graphic url="introduction-a-heurist-13.png"/></figure>
<p>Il vous est ensuite demand&#233; de choisir le champ par d&#233;faut de ce type d'enregistrement. Laissez le choix par d&#233;faut et continuez.</p>
<p>Dans Heurist, chaque champ est d&#233;crit &#224; l&#8217;aide des informations suivantes&#160;:</p>
<ul>
<li>Un nom</li>
<li>
Un type de donn&#233;es<ul>
<li>Texte libre</li>
<li>Liste de vocabulaires</li>
<li>Information g&#233;ospatiale</li>
<li>Zone de texte</li>
</ul>
</li>
<li>Une taille (<emph>field width</emph>), soit une limite dans le nombre de caract&#232;res du formulaire de saisie</li>
<li>
Un statut<ul>
<li>Cach&#233; (gris&#233;)</li>
<li>Optionnel</li>
<li>Obligatoire (g&#233;n&#232;re une erreur si l'information n'est pas remplie)</li>
<li>Recommand&#233;</li>
</ul>
</li>
<li>Une r&#233;p&#233;tabilit&#233;, une seule ou plusieurs occurrences de ce champ (par exemple il peut y avoir plusieurs th&#232;mes ou p&#233;riodes pour une m&#234;me intervention)</li>
</ul>
<p>Renommez le champ <hi rend="bold">Name/title</hi> par d&#233;faut en <hi rend="bold">Nom du site</hi>. Conservez les autres param&#232;tres avec leur nom par d&#233;faut (<emph>required</emph>, <emph>single</emph>, <emph>field width</emph>).</p>
<figure><desc>Fig. 14. Champ nom du site.</desc><graphic url="introduction-a-heurist-14.png"/></figure>
<p>Il y a cinq autres champs textuels dans notre type d'enregistrement.
Nous allons en cr&#233;er un ensemble et vous pourrez cr&#233;er les autres vous-m&#234;mes en suivant la m&#234;me proc&#233;dure.</p>
<p>Cliquez sur <emph>Insert field</emph>.</p>
<p>Remplissez les &#233;l&#233;ments obligatoires en rouge&#160;:</p>
<ul>
<li><emph>Field name</emph></li>
<li><emph>Help text</emph></li>
<li><emph>Data type</emph></li>
</ul>
<p>S&#233;lectionnez le <hi rend="bold">type de donn&#233;es</hi> (<emph>data type</emph>) suivant&#160;: <emph>Text (single line)</emph>, car dans notre cas il correspond aux champs textuels attendus.</p>
<figure><desc>Fig. 15. Champ Lambert 93 X.</desc><graphic url="introduction-a-heurist-15.png"/></figure>
<p>Gardez les autres valeurs par d&#233;faut et sauvegardez.</p>
<p>R&#233;p&#233;tez la m&#234;me op&#233;ration pour les champs&#160;:</p>
<ul>
<li>Coordonn&#233;es Lambert 93 Y</li>
<li>R&#233;gion</li>
<li>D&#233;partement</li>
<li>Commune</li>
</ul>
<p>Cela vous donne l'organisation suivante&#160;:</p>
<figure><desc>Fig. 16. Champ textuel.</desc><graphic url="introduction-a-heurist-16.png"/></figure>
<p>Il ne reste que les informations g&#233;or&#233;f&#233;renc&#233;es. La d&#233;marche sera la m&#234;me, seul le type de donn&#233;es sera diff&#233;rent. Le type g&#233;ospatial de Heurist prend des donn&#233;es en format lat/long, un seul champ permettra donc d'int&#233;grer les deux valeurs latitude et longitude de notre fichier CSV&#160;:</p>
<figure><desc>Fig. 17. Champ g&#233;or&#233;f&#233;renc&#233;.</desc><graphic url="introduction-a-heurist-17.png"/></figure>
<p>Ajoutez le champ suivant avec le type de donn&#233;es suivant&#160;: <hi rend="bold">Coordonn&#233;es d&#233;cimales</hi>.</p>
<p>La cr&#233;ation de l'ensemble des champs du type d'enregistrement <hi rend="bold">Site</hi> est ainsi termin&#233;e.</p>
<figure><desc>Fig. 18. Ensemble des champs du type d'enregistrement Site.</desc><graphic url="introduction-a-heurist-18.png"/></figure>
</div><div type="4"><head>Cr&#233;ation des vocabulaires</head>
<ol>
<li>Cliquez sur <emph>Vocabularies</emph></li>
<li>La deuxi&#232;me colonne en partant de la gauche liste les cat&#233;gories ou groupes de vocabulaires et se trouve par d&#233;faut sur la cat&#233;gorie <emph>User-defined</emph></li>
<li>
La colonne suivante liste les vocabulaires de ce groupe, ici deux vocabulaires<ul>
<li><emph>Country</emph></li>
<li><emph>Place type</emph></li>
</ul>
</li>
<li>Enfin, la partie la plus &#224; droite liste l'ensemble des termes de ce vocabulaire</li>
</ol>
<figure><desc>Fig. 19. Vocabulaires.</desc><graphic url="introduction-a-heurist-19.png"/></figure>
<p>Le groupe <emph>User-defined</emph> convient bien, vous allez donc cr&#233;er les trois vocabulaires dans celui-ci en cliquant sur <emph>Add</emph>.</p>
<figure><desc>Fig. 20. Ajouter un vocabulaire.</desc><graphic url="introduction-a-heurist-20.png"/></figure>
<ol>
<li>Renseignez le label <hi rend="bold">Th&#232;mes</hi> ainsi qu'une courte description</li>
<li>Il est &#233;galement possible d'ajouter une URI relative &#224; un terme de vocabulaire ou d'une ontologie, ce n'est pas n&#233;cessaire dans le cas pr&#233;sent</li>
<li>Sauvegardez</li>
</ol>
<p>Une fois le vocabulaire cr&#233;&#233;, plusieurs fonctionnalit&#233;s sont disponibles&#160;:</p>
<ol>
<li>Ajouter un terme de vocabulaire manuellement</li>
<li>Ajouter une liste de termes par r&#233;f&#233;rence &#224; un autre vocabulaire</li>
<li>Exporter les termes</li>
<li>Importer les termes</li>
</ol>
<figure><desc>Fig. 21. &#201;diter un vocabulaire.</desc><graphic url="introduction-a-heurist-21.png"/></figure>
<p>Pour ne pas avoir &#224; saisir manuellement les termes de vocabulaire, vous allez utiliser la fonctionnalit&#233; d'import propos&#233;e par Heurist afin d'int&#233;grer les contenus des fichiers <code type="inline">periodes.csv</code>, <code type="inline">themes.csv</code> et <code type="inline">type_intervention.csv</code> t&#233;l&#233;charg&#233;s en d&#233;but de le&#231;on.</p>
<p>Cliquez sur <emph>Import</emph>.</p>
<ol>
<li>Copiez et collez la liste des th&#232;mes du fichier <code type="inline">themes.csv</code> du dossier zip que vous venez de t&#233;l&#233;charger dans la fen&#234;tre pr&#233;vue &#224; cet effet en &#233;tape 1</li>
<li>Cochez la case <emph>Labels in line 1</emph> puis cliquez sur <emph>Analyse</emph></li>
<li>V&#233;rifiez que la liste import&#233;e ne pr&#233;sente pas d&#8217;erreur</li>
<li>V&#233;rifiez que <emph>Term (label)</emph> est bien rempli avec le nom du vocabulaire (ici <hi rend="bold">Th&#232;mes</hi>) et cliquez sur <emph>Import</emph></li>
</ol>
 <figure><desc>Fig. 22. Import des th&#232;mes INRAP dans Heurist.</desc><graphic url="introduction-a-heurist-22.png"/></figure>
<p>Suivez exactement la m&#234;me op&#233;ration que pr&#233;c&#233;demment avec le vocabulaire <hi rend="bold">P&#233;riodes</hi> en utilisant le fichier <code type="inline">periodes.csv</code>.</p>
<p>Pour <hi rend="bold">Type d'intervention</hi>, la liste ne contenant que deux termes (&#171;&#160;Diagnostic&#160;&#187; et &#171;&#160;Fouille&#160;&#187;), vous pouvez soit r&#233;it&#233;rer la m&#234;me op&#233;ration, soit les ins&#233;rer manuellement un par un en cliquant sur <emph>Add</emph> dans le vocabulaire <hi rend="bold">Type d'intervention</hi> que vous aurez cr&#233;&#233;.</p>
 <figure><desc>Fig. 23. Liste des vocabulaires.</desc><graphic url="introduction-a-heurist-23.png"/></figure>
</div><div type="4"><head>Cr&#233;ation de l'entit&#233; Intervention</head>
<ol>
<li>Retournez sur <emph>Record Type &gt; INRAP</emph></li>
<li>Pour ajouter un type d'enregistrement, cliquez sur <emph>Add</emph> comme pr&#233;c&#233;demment avec le type d'enregistrement <hi rend="bold">Site</hi></li>
</ol>
<p>S&#233;lectionnez les champs par d&#233;faut pour notre entit&#233;&#160;: <emph>Name/title</emph>, <emph>Start date</emph>, <emph>End date</emph>.</p>
 <figure><desc>Fig. 24. Cr&#233;ation de l'entit&#233; Intervention.</desc><graphic url="introduction-a-heurist-24.png"/></figure>
<p>Pour rappel, nous avons besoin des champs suivants&#160;:</p>
<ul>
<li>
Intervention<ul>
<li>Identifiant d'intervention</li>
<li>Nom d'intervention</li>
<li>Date de d&#233;but</li>
<li>Date de fin</li>
<li>Type d&#8217;intervention (se r&#233;f&#232;re au vocabulaire du m&#234;me nom)</li>
<li>Th&#232;mes (se r&#233;f&#232;re au vocabulaire du m&#234;me nom)</li>
<li>P&#233;riodes (se r&#233;f&#232;re au vocabulaire du m&#234;me nom)</li>
<li>Localisation (se r&#233;f&#232;re &#224; l'entit&#233; du m&#234;me nom)</li>
</ul>
</li>
</ul>
<p>Renommez les champs comme suit&#160;:</p>
<ul>
<li><emph>Name/title</emph> devient <hi rend="bold">Identifiant d'intervention</hi></li>
<li><emph>Start date</emph> devient <hi rend="bold">Date de d&#233;but</hi></li>
<li><emph>End date</emph> devient <hi rend="bold">Date de fin</hi></li>
</ul>
<p>Vous allez ajouter les trois champs de vocabulaires contr&#244;l&#233;s.</p>
<ol>
<li>Cliquez sur <emph>Insert</emph></li>
<li>Renseignez le label du champ ainsi que sa description et s&#233;lectionnez le type de champ</li>
<li>Par d&#233;faut, <emph>Dropdown (Terms)</emph> est s&#233;lectionn&#233;. Cliquez sur <emph>Use this field type</emph>.</li>
</ol>
 <figure><desc>Fig. 25. Ajout d'un champ de vocabulaire.</desc><graphic url="introduction-a-heurist-25.png"/></figure>
<p>Enfin, s&#233;lectionnez le vocabulaire <hi rend="bold">Th&#232;mes</hi>, rendez le r&#233;p&#233;table (<emph>repeatable</emph>) et sauvegardez.</p>
 <figure><desc>Fig. 26. Ajout du champ Th&#232;mes.</desc><graphic url="introduction-a-heurist-26.png"/></figure>
<p>Effectuez la m&#234;me op&#233;ration pour <hi rend="bold">P&#233;riodes</hi> et <hi rend="bold">Type d'intervention</hi> &#224; la seule diff&#233;rence que <hi rend="bold">Type d'intervention</hi> ne sera pas r&#233;p&#233;table.</p>
<p>Ajoutez maintenant la r&#233;f&#233;rence &#224; <hi rend="bold">Site</hi> en s&#233;lectionnant le <emph>data type</emph> suivant&#160;:  <emph>Record pointer</emph>.</p>
 <figure><desc>Fig. 27. Ajout du champ Site.</desc><graphic url="introduction-a-heurist-27.png"/></figure>
<p>Pour finaliser la cr&#233;ation de ce champ, s&#233;lectionnez le type d'enregistrement que nous souhaitons r&#233;f&#233;rencer, soit le type d'enregistrement <hi rend="bold">Site</hi> dans le groupe de types d'enregistrement <hi rend="bold">INRAP</hi>.</p>
 <figure><desc>Fig. 28. S&#233;lection de l'entit&#233; Site.</desc><graphic url="introduction-a-heurist-28.png"/></figure>
<p>Pour terminer, ajoutez le champ <hi rend="bold">Nom de l'intervention</hi> qui sera de type <emph>text single line</emph> en suivant la m&#234;me proc&#233;dure que pour les champs textuels du type d'enregistrement <hi rend="bold">Site</hi>.</p>
<p>Vous obtenez un type d'enregistrement <hi rend="bold">Intervention</hi> compos&#233;e des champs d&#233;finis plus haut ou pr&#233;c&#233;demment mentionn&#233;s.</p>
</div></div></div>
      <div type="2"><head>Importer des donn&#233;es dans Heurist</head>
<p>Le mod&#232;le Heurist est termin&#233;, vous allez pouvoir l'alimenter avec les donn&#233;es INRAP &#224; votre disposition.</p>
<div type="3"><head>Import des donn&#233;es de localisation</head>
<p>Pour ce faire, nous allons changer de mode, &#224; partir du menu principal en haut &#224; gauche de l'interface de notre base, et passer dans l'onglet <emph>Populate</emph>.</p>
<p>Comme son nom l'indique, ce mode regroupe les fonctionnalit&#233;s permettant d'alimenter le mod&#232;le que nous avons &#233;labor&#233; dans la partie <emph>Design</emph>.</p>
<p>&#192; partir de <emph>Populate</emph>, il est possible soit d'ajouter un enregistrement individuel, soit d'effectuer des imports de donn&#233;es en lots via des fichiers structur&#233;s au format CSV (ou encore HML qui correspond au format XML d'Heurist). La possibilit&#233; est &#233;galement offerte d'effectuer une synchronisation avec une collection <link target="https://perma.cc/E6YB-NEY6">Zotero</link> pour importer des donn&#233;es bibliographiques le cas &#233;ch&#233;ant.</p>
<p>Dans notre cas, le fichier source &#233;tant un fichier CSV, cliquez sur <emph>Delimited text/CSV</emph> puis sur <emph>Upload new file (CSV/TSV)</emph> et chargez le fichier <code type="inline">donnees_inrap_ph.csv</code> t&#233;l&#233;charg&#233; en d&#233;but de le&#231;on.</p>
<figure><desc>Fig. 29. Import CSV.</desc><graphic url="introduction-a-heurist-29.png"/></figure>
<p class="alert alert-info" style="alert alert-info">
    Le m&#234;me fichier source nous permet de cr&#233;er les enregistrements de type <hi rend="bold">Site</hi> et <hi rend="bold">Intervention</hi> en ne s&#233;lectionnant, pour chaque import, que les champs qui nous int&#233;ressent pour un type d'enregistrement donn&#233;.
</p>
<ol>
<li>
<p>Conservez les quatre premiers param&#232;tres par d&#233;faut et modifiez <emph>Multivalue separator</emph> en &#171;&#160;#&#160;&#187; via la liste d&#233;roulante afin de s&#233;parer les occurrences multiples de p&#233;riodes et de th&#232;mes tels qu'ils sont repr&#233;sent&#233;s dans notre fichier CSV</p>
</li>
<li>
<p>Cliquez sur <emph>Analyse data</emph> pour afficher une visualisation des donn&#233;es, v&#233;rifiez que ces donn&#233;es sont correctement interpr&#233;t&#233;es et cliquez sur <emph>Continue</emph> (cf. Fig. 30)</p>
</li>
<li>
<p>Dans <emph>Select record type</emph>, choisissez <hi rend="bold">Site</hi> et cliquez sur <emph>OK</emph>.</p>
</li>
</ol>
<figure><desc>Fig. 30. Analyse du fichier CSV.</desc><graphic url="introduction-a-heurist-30.png"/></figure>
<p>Une fois les donn&#233;es analys&#233;es et charg&#233;es dans Heurist, la premi&#232;re &#233;tape consiste &#224; v&#233;rifier si des enregistrements de type <hi rend="bold">Site</hi> existent d&#233;j&#224; dans le syst&#232;me. Heurist effectue une recherche via un ou des champs que vous pouvez s&#233;lectionner lors de la proc&#233;dure d'import (par exemple un champ de type identifiant n'amenant pas d'ambigu&#239;t&#233;). Si Heurist trouve des valeurs dans sa base correspondant &#224; celles pr&#233;sentes dans le fichier CSV, il les met &#224; jour si n&#233;cessaire ou bien les cr&#233;e s'il ne trouve rien.</p>
<p>Pour ce faire, &#224; partir de la bo&#238;te de dialogue qui appara&#238;t lorsque Heurist effectue cette op&#233;ration&#160;:</p>
<ol>
<li>Cochez la case <hi rend="bold">Nom du site</hi> dans la colonne de gauche correspondant aux donn&#233;es du fichier CSV et s&#233;lectionnez <hi rend="bold">Nom du site</hi> dans la colonne correspondant au type d'enregistrement <hi rend="bold">Site</hi> dans Heurist</li>
<li>Cliquez sur <emph>Match against existing records</emph></li>
</ol>
<figure><desc>Fig. 31. Correspondance avec des enregistrements existants.</desc><graphic url="introduction-a-heurist-31.png"/></figure>
<p>La deuxi&#232;me &#233;tape consiste &#224; indiquer &#224; Heurist quelle colonne du tableau va renseigner quel champ dans le type d'enregistrement <hi rend="bold">Site</hi>. Il suffit donc de cocher les cases des colonnes &#224; importer et de renseigner dans la colonne de droite les champs auxquels elles correspondent&#160;:</p>
<ol>
<li>Cochez les champs du fichier CSV &#224; importer et s&#233;lectionnez en face les champs qu'ils doivent alimenter</li>
<li>Vous pouvez visualiser et naviguer dans les enregistrements qui vont &#234;tre cr&#233;&#233;s dans la colonne de droite</li>
<li>Cliquez sur <emph>Prepare</emph> puis <emph>Start insert</emph></li>
</ol>
<figure><desc>Fig. 32. Insertion des donn&#233;es CSV.</desc><graphic url="introduction-a-heurist-32.png"/></figure>
<p>L'ensemble des entr&#233;es ont &#233;t&#233; cr&#233;&#233;es et une fen&#234;tre de r&#233;sum&#233; vous indique les op&#233;rations effectu&#233;es&#160;:</p>
<figure><desc>Fig. 33. R&#233;sum&#233; des op&#233;rations effectu&#233;es.</desc><graphic url="introduction-a-heurist-33.png"/></figure>
<p class="alert alert-info" style="alert alert-info">
    Nous voyons que le fichier contient 625 lignes, mais que seules 609 localisations seront cr&#233;&#233;es. S'agissant d'un tableau recensant les interventions, cela vient du fait que plusieurs interventions se sont d&#233;roul&#233;es dans le m&#234;me lieu. Il y a donc moins de lieux que d'interventions.
</p>
</div><div type="3"><head>Import des donn&#233;es relatives aux interventions sur site</head>
<p>Apr&#232;s avoir charg&#233; nos donn&#233;es de localisation, il nous reste &#224; importer les interventions. Pour ce faire, cliquez sur <emph>Back to start</emph> pour retourner au chargement du fichier CSV.</p>
<figure><desc>Fig. 34. Retour au chargement du fichier.</desc><graphic url="introduction-a-heurist-34.png"/></figure>
<p>Pour finir ce projet, nous devons charger le reste des donn&#233;es li&#233;es aux interventions. Nous allons effectuer les m&#234;mes op&#233;rations de chargement du fichier que pr&#233;c&#233;demment.</p>
<p>Arriv&#233;s &#224; <emph>Select record type</emph>, choisissez cette fois-ci <hi rend="bold">Intervention</hi>, cochez la case <hi rend="bold">Site</hi> pour g&#233;rer les d&#233;pendances entre les enregistrements puis validez.</p>
<figure><desc>Fig. 35. S&#233;lection de l'entit&#233; Intervention pour import.</desc><graphic url="introduction-a-heurist-35.png"/></figure>
<p>Comme &#224; chaque import, Heurist v&#233;rifie d'abord si des enregistrements existent d&#233;j&#224;. Sachant qu'une <hi rend="bold">Intervention</hi> est li&#233;e &#224; un <hi rend="bold">Site</hi>, Heurist v&#233;rifie en premier si les sites qui sont dans le fichier CSV sont d&#233;j&#224; pr&#233;sents dans la base de donn&#233;es. Il faut donc faire correspondre le champ <hi rend="bold">Nom du site</hi> du fichier CSV avec le champ <hi rend="bold">Nom du site</hi> du type d'enregistrement <hi rend="bold">Site</hi> dans Heurist.</p>
<figure><desc>Fig. 36. Correspondance avec des sites d&#233;j&#224; pr&#233;sents dans la base de donn&#233;es.</desc><graphic url="introduction-a-heurist-36.png"/></figure>
<p>Heurist v&#233;rifie les &#233;l&#233;ments et, chose relativement classique, le fichier source n'&#233;tant pas parfait, trouve des doublons dans les noms de site et propose de nous aider &#224; lever les ambigu&#239;t&#233;s. En l'occurrence, il s'agit de la m&#234;me cha&#238;ne de caract&#232;res, mais avec une majuscule &#224; l'initiale pour un site et sans majuscule pour l'autre. Cliquez sur <emph>Resolve ambiguous matches</emph> puis v&#233;rifiez les enregistrements d&#233;j&#224; int&#233;gr&#233;s dans la base de donn&#233;es pour enfin aligner les enregistrements avec les donn&#233;es trouv&#233;es dans le fichier CSV.</p>
<figure><desc>Fig. 37. R&#233;solution des ambigu&#239;t&#233;s.</desc><graphic url="introduction-a-heurist-37.png"/></figure>
<p>Une fois les doublons r&#233;solus, nous effectuons la m&#234;me op&#233;ration pour les donn&#233;es de l'entit&#233; <hi rend="bold">Intervention</hi>. Prenez soin de renseigner, comme nous venons de le faire pour l'import des donn&#233;es de localisation, les champs d&#8217;<hi rend="bold">Intervention</hi> que vous souhaitez remplir via votre fichier CSV, avant de valider la pr&#233;paration et de finir l&#8217;import. &#192; la fin de l'op&#233;ration, vous devez obtenir une fen&#234;tre vous indiquant l&#8217;insertion de 625 nouveaux enregistrements.</p>
<figure><desc>Fig. 38. Import des donn&#233;es d'Intervention.</desc><graphic url="introduction-a-heurist-38.png"/></figure>
</div></div>
      <div type="2"><head>Explorer et modifier les donn&#233;es</head>
<div type="3"><head>Explorer les donn&#233;es de localisation</head>
<p>Nous avons bien import&#233; nos donn&#233;es. Quittons &#224; pr&#233;sent <emph>Populate</emph> et revenons au menu principal pour nous rendre cette fois &#224; l'onglet <emph>Explore</emph> qui pr&#233;sente un panel de fonctionnalit&#233;s permettant d'explorer et de filtrer les donn&#233;es charg&#233;es dans la base Heurist.</p>
<p>Pour afficher les sites que vous venez d'importer, cliquez sur l'onglet <emph>Explore</emph> dans la colonne de gauche, placez votre curseur sur <emph>Entities</emph> puis s&#233;lectionnez <hi rend="bold">Site</hi>.</p>
<p>Les sites sont list&#233;s par leur identifiant Heurist (H-ID), ce qui donne un label du type <emph>Record 1250</emph>.
Nous allons voir comment modifier ce label peu intelligible plus loin dans la le&#231;on.</p>
<p>En cliquant sur un enregistrement, les donn&#233;es le concernant apparaissent dans le volet de visualisation de droite, y compris la relation avec une intervention arch&#233;ologique. Par d&#233;faut, le mode <emph>Record View</emph> est s&#233;lectionn&#233;. Il affiche l'ensemble des informations d'un enregistrement et donne acc&#232;s &#224; son &#233;dition.</p>
<figure><desc>Fig. 39. Afficher le d&#233;tail d'un enregistrement.</desc><graphic url="introduction-a-heurist-39.png"/></figure>
<p>D'autres options de visualisation sont disponibles&#160;:</p>
<ul>
<li>
<p><emph>Map-Timeline</emph> permet une visualisation spatiale et temporelle des donn&#233;es</p>
</li>
<li>
<p><emph>List view</emph> permet de lister les enregistrements sous forme de tableau et de les exporter sous forme de tableurs ou en format PDF</p>
</li>
<li>
<p><emph>Custom reports</emph> (pour utilisateurs et utilisatrices plus avanc&#233;s) permet de g&#233;rer la mise en page des r&#233;sultats d'une requ&#234;te &#224; l'aide de <link target="https://perma.cc/B84C-U5VL"><emph>templates</emph></link> g&#233;r&#233;s par le moteur <link target="https://perma.cc/V4Y6-ZV8P">PHP</link> <link target="https://perma.cc/NFN5-M949">Smarty</link><ref type="footnotemark" target="#Smarty"/>, la page ainsi g&#233;n&#233;r&#233;e peut ensuite &#234;tre mise en ligne</p>
</li>
<li>
<p><emph>Export</emph> permet l'export de l'ensemble des r&#233;sultats de la requ&#234;te en cours sous diff&#233;rents formats pouvant &#234;tre r&#233;utilis&#233;s par d'autres logiciels (CSV, GEPHI, XML, JSON, GEOJSON, KML, IIIF)</p>
</li>
</ul>
<figure><desc>Fig. 40. Formats d'export.</desc><graphic url="introduction-a-heurist-40.png"/></figure>
<ul>
<li>
<p><emph>Network diagram</emph> affiche un diagramme montrant les liens entre les enregistrements</p>
</li>
<li>
<p><emph>Crosstabs</emph> permet d'effectuer des requ&#234;tes crois&#233;es sur les donn&#233;es</p>
</li>
</ul>
</div><div type="3"><head>Modifier les donn&#233;es</head>
<p>Cliquez sur l&#8217;onglet <emph>Map-Timeline</emph> pour visualiser l&#8217;ensemble des sites g&#233;olocalis&#233;s sous forme de carte. Ce faisant, vous pouvez observer que certaines donn&#233;es semblent manifestement erron&#233;es. En effet, bien que tous les sites de notre jeu de donn&#233;es se situent en France, la visualisation en r&#233;v&#232;le un au Mali et deux autres pr&#232;s des c&#244;tes africaines. Le r&#244;le de la visualisation des donn&#233;es spatiales &#224; des fins correctives est ici &#233;vident. Voyons maintenant comment corriger ce type d'erreur. En cliquant sur le drapeau d'un site sur la carte, vous pouvez afficher, &#224; l'aide d'une fen&#234;tre secondaire (<emph>popup</emph>), l'ensemble des informations concernant cette enregistrement. Ici, cliquez sur le site situ&#233; au Mali. Le nom du site appara&#238;t dans une nouvelle fen&#234;tre et l'enregistrement correspondant est automatiquement s&#233;lectionn&#233;. Ainsi, vous pouvez voir que le site dont il est question est celui de Boulazac situ&#233; en Dordogne. Directement, depuis cette fen&#234;tre, passez en mode &#233;dition, en cliquant sur l&#8217;ic&#244;ne du crayon, pour corriger les informations li&#233;es &#224; cet enregistrement.</p>
<figure><desc>Fig. 41. &#201;dition des coordonn&#233;es du site de Boulazac.</desc><graphic url="introduction-a-heurist-41.png"/></figure>
<p>Pour modifier ou entrer une donn&#233;e GPS, Heurist propose deux solutions&#160;:</p>
<ol>
<li>Rechercher dans la base de donn&#233;es d'<link target="https://www.openstreetmap.fr/">OpenStreetMap</link> un nom de lieu et lui attribuer un marqueur de point permettant de d&#233;finir ses coordonn&#233;es</li>
<li>Ins&#233;rer les coordonn&#233;es, qui auront &#233;t&#233; r&#233;cup&#233;r&#233;es par le moyen de votre choix, directement</li>
</ol>
<p><hi rend="bold">Option 1</hi></p>
<ol>
<li>Cliquez sur le champ de saisie de <hi rend="bold">Coordonn&#233;es GPS</hi></li>
<li>Dans la fen&#234;tre qui s'ouvre, effectuez une recherche sur Boulazac dans la base d'OpenStreetMap (cf. Fig. 42)</li>
<li>Le site est trouv&#233; sur OpenStreetMap, il faut y adjoindre un marqueur pour enregistrer les coordonn&#233;es du point dans Heurist</li>
<li>Cliquez sur le marqueur et d&#233;placez-le jusque sur le pointeur du site trouv&#233; via le moteur de recherche, puis sauvegardez (cf. Fig. 43)</li>
</ol>
<figure><desc>Fig. 42. Recherche des coordonn&#233;es GPS de Boulazac.</desc><graphic url="introduction-a-heurist-42.png"/></figure>
<figure><desc>Fig. 43. Validation des coordonn&#233;es GPS &#224; l'aide du marqueur.</desc><graphic url="introduction-a-heurist-43.png"/></figure>
<p><hi rend="bold">Option 2</hi></p>
<ol>
<li>Cliquez sur le champ de saisie de <hi rend="bold">Coordonn&#233;es GPS</hi></li>
<li>Puis sur <emph>Add Geometry</emph> dans la colonne de droite de la carte</li>
<li>Ins&#233;rez les coordonn&#233;es dans le format indiqu&#233;, par exemple ici pour un simple point la syntaxe est 0.7679869062166365 45.178199165946225, puis sauvegardez les modifications</li>
</ol>
<figure><desc>Fig. 44. Renseigner les coordonn&#233;es manuellement.</desc><graphic url="introduction-a-heurist-44.png"/></figure>
<p>Afin de v&#233;rifier que les modifications des coordonn&#233;es GPS ont bien &#233;t&#233; prises en compte, nous allons utiliser l'assistant de filtre. Dans notre cas, nous utilisons le nom de la commune&#160;:</p>
<ol>
<li>Ajoutez un filtre</li>
<li>Dans la fen&#234;tre de param&#232;tres qui s&#8217;ouvre, saisissez les informations n&#233;cessaires pour trouver notre enregistrement</li>
<li>Filtrez</li>
</ol>
<figure><desc>Fig. 45. Rechercher un enregistrement en filtrant les donn&#233;es.</desc><graphic url="introduction-a-heurist-45.png"/></figure>
<p>Un seul &#233;l&#233;ment est trouv&#233; et vous pouvez observer que la modification du lieu a bien &#233;t&#233; effectu&#233;e.</p>
<figure><desc>Fig. 46. V&#233;rification de l&#8217;enregistrement de la modification cartographique.</desc><graphic url="introduction-a-heurist-46.png"/></figure>
<p class="alert alert-info" style="alert alert-info">
    Il peut &#234;tre utile de rafra&#238;chir la page web en cours de visualisation (<i>CTRL + R</i> ou <i>F5</i>) pour reg&#233;n&#233;rer compl&#232;tement la page en cours et ainsi visualiser certaines modifications.
</p>
</div><div type="3"><head>Modifier l'&#233;tiquette des enregistrements</head>
<p>Nous avons trouv&#233; Boulazac, mais son &#233;tiquette (<emph>title mask</emph>) dans la liste des enregistrements est peu intelligible. Nous pouvons l'&#233;diter depuis n'importe quel enregistrement. Dans la fen&#234;tre d'&#233;dition d'un site, cliquez sur <emph>Edit title mask</emph>.</p>
<figure><desc>Fig. 47. Modification de l'&#233;tiquette d'un type d'enregistrement.</desc><graphic url="introduction-a-heurist-47.png"/></figure>
<ol>
<li>S&#233;lectionnez le ou les champs que vous souhaitez afficher dans la colonne de gauche</li>
<li>Cliquez sur <emph>Insert field</emph> et agencez-les comme vous le souhaitez dans le champ texte</li>
<li>S&#233;lectionnez des enregistrements et testez l'&#233;tiquette ainsi g&#233;n&#233;r&#233;e</li>
<li>Sauvegardez les modifications</li>
</ol>
<figure><desc>Fig. 48. &#201;dition de l'&#233;tiquette.</desc><graphic url="introduction-a-heurist-48.png"/></figure>
<p>Rafra&#238;chissez de nouveau la page (<emph>CTRL+R</emph> ou <emph>F5</emph>) et visualisez les modifications apport&#233;es.</p>
<p>Vous savez donc maintenant comment consulter vos donn&#233;es, les modifier et visualiser &#224; la vol&#233;e les corrections ou ajouts effectu&#233;s.</p>
</div><div type="3"><head>Utilisation des filtres</head>
<p>Toujours en mode <emph>Explore</emph>, si le dernier filtre ins&#233;r&#233; est encore actif, utilisez le filtre par entit&#233; dans la colonne de gauche pour n'afficher que les entit&#233;s de type <hi rend="bold">Intervention</hi>.</p>
<figure><desc>Fig. 49. Lister les interventions.</desc><graphic url="introduction-a-heurist-49.png"/></figure>
<p>Comme avec les donn&#233;es de localisation, nous pouvons visualiser les informations de chaque intervention dans la fen&#234;tre de visualisation via l'onglet <emph>Record view</emph>. Nous observons que les valeurs des champs multivalu&#233;s comme <hi rend="bold">Th&#232;mes</hi> et <hi rend="bold">P&#233;riodes</hi> sont correctement s&#233;par&#233;es, le nom du site appara&#238;t bien comme un &#233;l&#233;ment li&#233; et, en cliquant dessus, une fen&#234;tre secondaire affiche les donn&#233;es le concernant.</p>
<figure><desc>Fig. 50. Visualiser le d&#233;tail d'une intervention.</desc><graphic url="introduction-a-heurist-50.png"/></figure>
<p>En revanche, si vous tentez de visualiser les informations g&#233;ographiques li&#233;es &#224; une intervention via le mode <emph>Map-Timeline</emph>, cela ne fonctionne pas. Seules les informations temporelles de chaque intervention apparaissent. En effet, actuellement la requ&#234;te de filtre demande uniquement d'afficher les interventions et de r&#233;cup&#233;rer les donn&#233;es qui y sont directement attach&#233;es. En revanche, il n'a pas encore &#233;t&#233; demand&#233; &#224; Heurist de r&#233;cup&#233;rer le d&#233;tail des informations g&#233;ographiques li&#233;es &#224; chaque intervention. Pour enrichir notre requ&#234;te, nous allons cr&#233;er un filtre sp&#233;cifique&#160;:</p>
<ol>
<li>Cliquez sur <emph>Save filter</emph></li>
<li>Renseignez le nom et le type d'enregistrement filtr&#233; par d&#233;faut (cf. Fig. 51)</li>
<li>&#201;ditez la r&#232;gle qui permet de remonter les informations de localisation via la relation de <emph>Record pointer</emph> entre <hi rend="bold">Intervention</hi> et <hi rend="bold">Site</hi>, puis sauvegardez la r&#232;gle et le filtre.</li>
</ol>
<p class="alert alert-info" style="alert alert-info">
    Si vous avez d&#233;j&#224; effectu&#233; un filtre, par exemple pour visualiser des interventions, alors la requ&#234;te textuelle sera d&#233;j&#224; pr&#233;remplie ici. Dans l'exemple qui nous concerne, &#171;&#160;t:55&#160;&#187; se lit comme &#171;&#160;affiche moi l'ensemble des enregistrements pour le type d'enregistrement qui a pour identifiant Heurist (H-ID) 55&#160;&#187;.
</p>
<figure><desc>Fig. 51. Cr&#233;ation d'un filtre avanc&#233;.</desc><graphic url="introduction-a-heurist-51.png"/></figure>
<figure><desc>Fig. 52. Afficher les informations du *record pointer* Site.</desc><graphic url="introduction-a-heurist-52.png"/></figure>
<p>Lorsque vous s&#233;lectionnez le filtre que vous venez de cr&#233;er dans la rubrique <emph>Saved filters &gt; My filters</emph>, vous pouvez maintenant visualiser directement les donn&#233;es spatiales attach&#233;es aux interventions.</p>
<figure><desc>Fig. 53. Visualisation des informations spatiales.</desc><graphic url="introduction-a-heurist-53.png"/></figure>
</div></div>
      <div type="2"><head>Mettre en ligne les donn&#233;es g&#233;r&#233;es dans Heurist</head>
<p>Les op&#233;rations de mod&#233;lisation, de visualisation et de modification offrent les outils pour g&#233;rer ses donn&#233;es de recherche. Elles &#339;uvrent &#233;galement &#224; pr&#233;parer le partage des donn&#233;es dans le cadre de travaux collaboratifs ou encore &#224; les publier aupr&#232;s d&#8217;un public plus large.</p>
<p>Heurist propose plusieurs fonctionnalit&#233;s de mise en ligne&#160;:</p>
<ul>
<li>L'int&#233;gration d'un filtre de visualisation &#224; facettes dans une page web h&#233;berg&#233;e sur un autre site comme Wordpress, Drupal, etc. (option qui est pr&#233;sent&#233;e dans cette le&#231;on)</li>
<li>La cr&#233;ation d'une page web directement dans Heurist</li>
<li>La g&#233;n&#233;ration d'un site web complet avec gestion du contenu des pages et personnalisation de l'affichage</li>
</ul>
<p>Ces solutions s'appuient sur la cr&#233;ation pr&#233;alable d'un filtre, que nous venons de d&#233;couvrir, ou d'une recherche &#224; facettes.</p>
<p class="alert alert-info" style="alert alert-info">
  Les filtres ainsi que les recherches &#224; facettes peuvent &#234;tre sauvegard&#233;s dans d'autres <i>workgroups</i> que <i>My filters</i> les rendant ainsi accessibles &#224; d'autres membres de ces groupes de travail.
</p>
<div type="3"><head>Cr&#233;ation d'un filtre de recherche &#224; facettes</head>
<p>Un filtre de recherche &#224; facettes est une interface permettant d'afficher les r&#233;sultats d'une premi&#232;re recherche ou requ&#234;te, et de les filtrer, en temps r&#233;el, &#224; l'aide de filtres qui peuvent prendre la forme de champs textuels, de listes de s&#233;lection ou encore de cases &#224; cocher.</p>
<ol>
<li>S&#233;lectionnez l'&#233;diteur de filtre &#224; facettes dans les fonctionnalit&#233;s du mode <emph>Explore</emph></li>
<li>Dans la fen&#234;tre de param&#232;tres du filtre, remplissez les champs pour indiquer que le filtre porte sur l'entit&#233; <hi rend="bold">Intervention</hi> et que l&#8217;affichage des champs doit se faire sous forme de ligne (cf. Fig. 54)</li>
<li>Comme pour le filtre de recherche, &#233;ditez la r&#232;gle qui permet de remonter aux informations de localisation via la relation de <emph>record pointer</emph> entre <hi rend="bold">Intervention</hi> et <hi rend="bold">Site</hi>, puis sauvegardez la r&#232;gle et validez</li>
<li>S&#233;lectionnez les champs sur lesquels vous souhaitez pouvoir effectuer des requ&#234;tes. Nous pouvons ici s&#233;lectionner les attributs de l&#8217;entit&#233; <hi rend="bold">Intervention</hi>, mais &#233;galement ceux de l&#8217;entit&#233; <hi rend="bold">Site</hi>, du fait des donn&#233;es li&#233;es (cf. Fig. 55).</li>
</ol>
<figure><desc>Fig. 54. Cr&#233;ation d&#8217;un filtre de recherche &#224; facettes.</desc><graphic url="introduction-a-heurist-54.png"/></figure>
<figure><desc>Fig. 55. Construction du filtre de recherche &#224; facettes.</desc><graphic url="introduction-a-heurist-55.png"/></figure>
<p>Une fois les crit&#232;res de filtre valid&#233;s, une nouvelle fen&#234;tre permet de personnaliser la mani&#232;re de pr&#233;senter les champs de recherche &#224; facettes. Plusieurs possibilit&#233;s sont offertes selon l&#8217;utilisation souhait&#233;e, et ce, pour chaque champ/crit&#232;re retenu&#160;:</p>
<ul>
<li><emph>List</emph> pr&#233;sente une liste de l'ensemble des valeurs possibles d'un champ avec leur nombre d'occurrences</li>
<li><emph>Wrapped</emph> pr&#233;sente l'ensemble des valeurs d'un champ sous une forme plus concise</li>
<li><emph>Search</emph> permet la recherche par simple saisie textuelle</li>
<li><emph>Slider</emph> permet la navigation temporelle &#224; l'aide de curseurs</li>
<li><emph>Dropdown</emph> propose une liste sous forme de liste d&#233;roulante</li>
</ul>
<p>Par d&#233;faut, tous les champs textuels proposent une recherche par saisie textuelle. Lorsque le nombre de termes le permet, il est possible de proposer une liste ou une pr&#233;sentation plus concise. Modifiez les &#233;tiquettes pour les champs li&#233;s aux sites, conservez l'affichage par d&#233;faut pour chaque champ et validez.</p>
<figure><desc>Fig. 56. Modes d'affichage des filtres de champs.</desc><graphic url="introduction-a-heurist-56.png"/></figure>
<p>Pour visualiser le r&#233;sultat de notre filtre&#160;:</p>
<ol>
<li>Rendez-vous sur les filtres sauvegard&#233;s (<emph>saved filters</emph>) dans <emph>Explore</emph> ou bien dans <emph>Saved filters</emph> au bout de la barre de filtre</li>
<li>Puis s&#233;lectionnez le filtre &#224; facettes que nous venons de cr&#233;er</li>
</ol>
<figure><desc>Fig. 57. S&#233;lection du filtre &#224; facettes pr&#233;c&#233;demment cr&#233;&#233;.</desc><graphic url="introduction-a-heurist-57.png"/></figure>
<figure><desc>Fig. 58. Visualisation de la recherche &#224; facettes.</desc><graphic url="introduction-a-heurist-58.png"/></figure>
<p>Cette recherche &#224; facettes peut &#234;tre int&#233;gr&#233;e sur une page dans un autre site web. Cela se fait par des &#233;l&#233;ments HTML appel&#233;s <emph>iframe</emph>. Pour int&#233;grer notre page web dans une page d'un autre site, tel qu'un article de blog Wordpress, il suffit de copier le code qui est affich&#233; en cliquant sur <emph>Embed</emph> dans la liste des options du filtre de recherche &#224; facettes, et de le coller dans l'&#233;diteur de texte du site web.</p>
<figure><desc>Fig. 59. Int&#233;gration du filtre &#224; facettes dans une page web.</desc><graphic url="introduction-a-heurist-59.png"/></figure>
<p class="alert alert-warning" style="alert alert-warning">
  Pour des questions de s&#233;curit&#233;, certains syst&#232;mes de gestion de contenu (CMS) ou administrateurs de sites web bloquent la possibilit&#233; d'int&#233;grer ces balises <i>iframe</i> ou restreignent leur utilisation. Rapprochez-vous de la personne administrant le site (webmestre) pour avoir plus d'informations.
</p>
</div><div type="3"><head>G&#233;rer les droits d'acc&#232;s &#224; vos ressources Heurist</head>
<p>Par d&#233;faut, les donn&#233;es d'un enregistrement ne peuvent &#234;tre modifi&#233;es que par le ou la propri&#233;taire de la base et ne sont visibles que par les personnes connect&#233;es &#224; Heurist.</p>
<p>Pour modifier ces droits et rendre vos donn&#233;es accessibles publiquement, repassez en mode <emph>Explore</emph> et, dans la barre d&#8217;options figurant au-dessus de la liste des enregistrements, s&#233;lectionnez <emph>Ownership/Visibility</emph> dans le menu de gestion de partage.</p>
<p>D&#233;finissez le p&#233;rim&#232;tre de votre choix (ici, nous s&#233;lectionnons l'ensemble des enregistrements pr&#233;sents), les utilisateurs et utilisatrices ou les groupes ayant l'autorisation de modifier les donn&#233;es, et enfin, les personnes pouvant visualiser les donn&#233;es. Validez pour appliquer les modifications.</p>
<p>Vous pouvez voir que les modifications ont bien &#233;t&#233; pris en compte en observant le changement de couleur du chiffre &#224; gauche de chaque enregistrement.</p>
<p>En d&#233;pla&#231;ant le curseur de la souris sur le chiffre ou sur le symbole barr&#233; juste &#224; c&#244;t&#233;, vous obtenez des informations sur la visibilit&#233; et les droits d'&#233;dition de chaque enregistrement.</p>
</div></div>
      <div type="2"><head>Conclusion</head>
<p>Heurist est un outil en constante &#233;volution depuis 2005, fonctionnellement tr&#232;s riche &#224; destination de la communaut&#233; de recherche. Si son acc&#232;s n'est pas r&#233;serv&#233; aux sp&#233;cialistes en informatique, cette richesse fonctionnelle peut rendre son utilisation d&#233;licate pour des novices. Nous esp&#233;rons que ce tutoriel permettra &#224; un plus grand nombre d'utiliser ce logiciel pour r&#233;pondre &#224; leurs besoins.</p>
<p>L'utilisation avanc&#233;e de certaines fonctionnalit&#233;s peut toutefois n&#233;cessiter de l'aide ext&#233;rieure. La rubrique <emph>Help</emph> est d&#233;di&#233;e &#224; cet usage.</p>
<p>Le site web <link target="https://perma.cc/XVM4-Z7H2">heuristnetwork</link> dispose &#233;galement d'une page <link target="https://perma.cc/E86L-ZGYU"><emph>Contact</emph></link> et d'une rubrique <link target="https://heuristnetwork.org/tutorials/"><emph>Learn</emph></link> permettant de compl&#233;ter le contenu du pr&#233;sent cours.</p>
</div>
      <div type="2"><head>Ressources utiles</head>
<div type="3"><head>Sur l'utilisation d'Heurist</head>
<ul>
<li>Heurist, &#171;&#160;Help System&#160;&#187;, consult&#233; le 1er avril 2022, <link target="https://heuristplus.sydney.edu.au/heurist/?db=Heurist_Help_System&amp;website&amp;id=39&amp;pageid=622">https://heuristplus.sydney.edu.au/heurist/?db=Heurist_Help_System&amp;website&amp;id=39&amp;pageid=622</link>. Cette ressource (en anglais) est r&#233;guli&#232;rement augment&#233;e et &#224; consulter sans mod&#233;ration.</li>
<li>Ian Johnson, &#171;&#160;Concevoir et collaborer sur des bases de donn&#233;es sans r&#233;inventer la roue&#160;&#187;, 22 janvier 2021, Universit&#233; de Haute-Alsace (plateforme vid&#233;os), consult&#233; le 1er avril 2022 <link target="https://perma.cc/8YDX-NUED">https://e-diffusion.uha.fr/video/3668-j1-ian-johnson-conference-inaugurale/</link>.</li>
<li>Universalistes par RENATER, &#171;&#160;Heurist Utilisateurs&#160;&#187;, liste de diffusion, page consult&#233;e le 1er avril 2022, <link target="https://perma.cc/K398-B6WT">https://groupes.renater.fr/sympa/info/heurist-utilisateurs</link>.</li>
<li>Un autre tutoriel sur Heurist r&#233;dig&#233; par R&#233;gis Witz, ing&#233;nieur d'&#233;tudes &#224; la <link target="https://perma.cc/4Q7E-KMQY">Maison Interuniverstaire des Sciences de l&#8217;Homme &#8211; Alsace (MISHA)</link>&#160;: R&#233;gis Witz, &#171;&#160;Cr&#233;er sa base de donn&#233;es avec Heurist&#160;&#187;, (2021), <link target="https://doi.org/10.5281/zenodo.6243955">https://doi.org/10.5281/zenodo.6243955</link>.</li>
</ul>
</div><div type="3"><head>Sur la gestion des donn&#233;es de la recherche</head>
<ul>
<li>James Baker, <link target="/fr/lecons/preserver-ses-donnees-de-recherche">&#171;&#160;Pr&#233;server ses donn&#233;es de recherche&#160;&#187;</link>, traduction par Anne-Sophie Bessero-Lagarde, <emph>Programming Historian en fran&#231;ais 2</emph> (2020) <link target="https://doi.org/10.46430/phfr0009">https://doi.org/10.46430/phfr0009</link>.</li>
<li>Urfist M&#233;diterran&#233;e, &#171;&#160;Format Ouvert ou Ferm&#233;&#160;&#187;, <emph>DoRANum</emph>, 21 f&#233;vrier 2017 (mis &#225; jour le 9 octobre 2020), consult&#233; le 1er avril 2022, <link target="https://perma.cc/AGP7-HC2R">https://doranum.fr/stockage-archivage/quiz-format-ouvert-ou-ferme/</link>.</li>
<li>Centre Informatique National de l&#8217;Enseignement Sup&#233;rieur (CINES), &#171;&#160;FACILE - Service de validation de formats&#160;&#187;, consult&#233; le 1er avril 2022, <link target="https://perma.cc/U29L-FV6H">https://facile.cines.fr/</link>.</li>
</ul>
</div></div>
      <div type="2"><head>Notes</head>
<p><note id="Remerciements"> Que je remercie tout particuli&#232;rement pour la relecture, les conseils et les corrections apport&#233;s &#224; la pr&#233;sente le&#231;on.</note>
<note id="5"> &#192; ce sujet, lire l'article&#160;: Paris Time Machine, &#171;&#160;Heurist, une base de donn&#233;es g&#233;n&#233;raliste pour les sciences humaines et sociales&#160;&#187;, sans date, consult&#233; le 1 avril 2022, <link target="https://perma.cc/M57X-CQZ2">https://paris-timemachine.huma-num.fr/heurist-une-base-de-donnees-generique-pour-les-sciences-humaines-et-sociales/</link>.</note>
<note id="coursMerise"> Pour en savoir plus&#160;: Idris Neumann, &#171;&#160;Initiation &#224; la conception de bases de donn&#233;es relationnelles avec MERISE&#160;&#187;, 28 f&#233;vrier 2012 (mis &#225; jour le 15 juin 2019), consult&#233; le 1er avril 2022, <link target="https://perma.cc/8YGP-L2GV">https://ineumann.developpez.com/tutoriels/merise/initiation-merise/</link>.</note>
<note id="QGIS"> Pour aller plus loin avec QGIS, voir la le&#231;on qui lui est d&#233;di&#233;e sur <emph>Programming Historian</emph> en anglais&#160;: Justin Colson, <link target="/en/lessons/geocoding-qgis">&#171;&#160;Geocoding Historical Data using QGIS&#160;&#187;</link>, <emph>Programming Historian 6</emph> (2017), <link target="https://doi.org/10.46430/phen0066">https://doi.org/10.46430/phen0066</link>.</note>
<note id="FAIR"> Voir les principes des donn&#233;es FAIR&#160;: &#171;&#160;Fair data&#160;&#187;, Wikip&#233;dia, mis &#225; jour le 19 septembre 2021, consult&#233; le 1er avril 2022, <link target="https://perma.cc/6HBY-PUXB">https://fr.wikipedia.org/wiki/Fair_data</link>.</note>
<note id="5StarOpenData"> Pour en savoir plus&#160;: World Wide Web Consortium (W3C), &#171;&#160;5 Star Linked Data&#160;&#187;, mis &#225; jour le 15 mars 2013, consult&#233; le 1er avril 2022, <link target="https://perma.cc/Q9LV-H7Q6">https://www.w3.org/2011/gld/wiki/5_Star_Linked_Data</link>.</note>
<note id="Smarty"> Pour aller plus loin, voir&#160;: &#201;ric Pommereau, &#171;&#160;Initiation aux templates en PHP avec Smarty&#160;&#187;, 2008, consult&#233; le 1er avril 2022, <link target="https://perma.cc/MZ6W-ZDEV">https://eric-pommereau.developpez.com/tutoriels/initiation-smarty/?page=introduction</link>.</note></p>
</div>
    </body>
  </text>
</TEI>
