<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Instala&#231;&#227;o de M&#243;dulos Python com pip</title>
  <slug>instalacao-modulos-python-pip</slug>
  <layout>lesson</layout>
  <date>2013-05-06</date>
  <translation_date>2021-12-18</translation_date>
  <authors>Fred Gibbs</authors>
  <reviewers>Ben Hurwitz,Amanda Morton</reviewers>
  <translator>Felipe Lamarca</translator>
  <translation-editor>Jimmy Medeiros</translation-editor>
  <translation-reviewer>Ian Araujo,Daniel Bonatto Seco</translation-reviewer>
  <exclude_from_check>editors</exclude_from_check>
  <difficulty>1</difficulty>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/441</review-ticket>
  <activity>acquiring</activity>
  <topics>python,get-ready</topics>
  <abstract>H&#225; muitas formas de se instalar bibliotecas externas de Python; esta li&#231;&#227;o explica um dos m&#233;todos mais comuns usando pip.</abstract>
  <redirect_from>/lessons/installing-python-modules-pip</redirect_from>
  <python_warning>False</python_warning>
  <original>installing-python-modules-pip</original>
  <avatar_alt>Um ramo com peras</avatar_alt>
  <doi>10.46430/phpt0018</doi>
</metadata>
  <text xml:lang="pt">
    <body>
      <div type="2"><head>Objetivos da Li&#231;&#227;o</head>
<p>Esta li&#231;&#227;o mostra como fazer o download e instalar m&#243;dulos Python. H&#225; muitas formas de se instalar m&#243;dulos externos, mas, para os prop&#243;sitos dessa li&#231;&#227;o, utilizaremos um programa chamado pip, facilmente instal&#225;vel em <link target="https://pip.pypa.io/en/stable/">Mac/Linux</link> e <link target="https://sites.google.com/site/pydatalog/python/pip-for-windows">Windows</link>. No caso de vers&#245;es mais recentes do Python (a partir das vers&#245;es 2.7.9 para Python 2 ou 3.4 para Python 3), pip &#233; instalado por padr&#227;o. Esse tutorial ser&#225; &#250;til para qualquer pessoa que use vers&#245;es anteriores de Python (que ainda s&#227;o bastante comuns).</p>
</div>
      <div type="2"><head>Introduzindo M&#243;dulos</head>
<p>Uma das melhores coisas sobre o uso de Python &#233; o n&#250;mero de bibliotecas de c&#243;digo fant&#225;sticas, ampla e facilmente dispon&#237;veis, que podem economizar muitas linhas de c&#243;digo ou simplesmente executar uma tarefa espec&#237;fica (como criar um ficheiro CSV ou raspar uma p&#225;gina web) de modo muito mais simples. Ao buscar solu&#231;&#245;es para problemas no Google, voc&#234; frequentemente ir&#225; encontrar exemplos de c&#243;digo que utilizam bibliotecas sobre as quais voc&#234; nunca ouviu falar antes. N&#227;o deixe que isso o assuste! Uma vez que essas bibliotecas estejam instaladas no seu computador, voc&#234; pode utiliz&#225;-las importando-as no in&#237;cio do seu c&#243;digo. Voc&#234; pode importar quantas bibliotecas quiser, por exemplo:</p>
<pre><code class="language-python" xml:id="code_instalacao-modulos-python-pip_0" type="block" corresp="code_instalacao-modulos-python-pip_0.txt"></code></pre>
<p>Para novos usu&#225;rios de Python, pode ser um pouco intimidador fazer o download e instalar m&#243;dulos externos pela primeira vez. H&#225; muitas formas de fazer isso, aumentando assim a confus&#227;o. Essa li&#231;&#227;o introduz uma das formas mais simples e comuns de instalar m&#243;dulos Python.</p>
<p>O objetivo aqui &#233; instalar um software no seu computador que pode fazer download e instalar m&#243;dulos Python automaticamente para n&#243;s. Utilizaremos um programa chamado <link target="https://pt.wikipedia.org/wiki/Pip_(gerenciador_de_pacotes)">pip</link>.</p>
</div>
      <div type="2"><head>Instru&#231;&#245;es para Mac e Linux</head>
<p>De acordo com a documenta&#231;&#227;o do pip, podemos fazer o download de um script python para instalar o pip para n&#243;s. Ao utilizar um Mac ou Linux, podemos instalar o pip atrav&#233;s da linha de comando usando o <link target="https://www.thegeekstuff.com/2012/04/curl-examples/">comando curl</link>, que faz o download do script <link target="https://www.perl.org/">Perl</link> da instala&#231;&#227;o do pip.</p>
<pre><code class="language-bash" xml:id="code_instalacao-modulos-python-pip_1" type="block" corresp="code_instalacao-modulos-python-pip_1.txt"></code></pre>
<p>Uma vez que voc&#234; tenha feito o download do ficheiro <code type="inline">get-pip.py</code>, voc&#234; precisar&#225; execut&#225;-lo com um <link target="https://docs.python.org/pt-br/3/tutorial/interpreter.html">interpretador Python</link>. No entanto, caso voc&#234; tente executar o script python dessa forma:</p>
<pre><code class="language-bash" xml:id="code_instalacao-modulos-python-pip_2" type="block" corresp="code_instalacao-modulos-python-pip_2.txt"></code></pre>
<p>O script provavelmente falhar&#225; porque ele n&#227;o ter&#225; permiss&#227;o para atualizar certos diret&#243;rios no seu sistema de ficheiros, que s&#227;o configurados por padr&#227;o para que scripts aleat&#243;rios n&#227;o consigam alterar ficheiros importantes e fornecer v&#237;rus. Neste caso - e em todos os casos em que voc&#234; precise dar permiss&#227;o a um script de sua confian&#231;a para gravar nas pastas do seu sistema - voc&#234; pode utilizar o comando <hi rend="bold">sudo</hi> ("Super User DO") precedendo o comando python, por exemplo:</p>
<pre><code class="language-bash" xml:id="code_instalacao-modulos-python-pip_3" type="block" corresp="code_instalacao-modulos-python-pip_3.txt"></code></pre>
</div>
      <div type="2"><head>Instru&#231;&#245;es para Windows</head>
<p>Assim como nas plataformas acima, a forma mais simples de se instalar o pip &#233; atrav&#233;s do uso de um programa python chamado <code type="inline">get-pip.py</code>, cujo download pode ser feito <link target="https://bootstrap.pypa.io/get-pip.py">aqui</link>. Quando voc&#234; abrir esse link, pode se assustar com a enorme confus&#227;o de c&#243;digo que espera por voc&#234;. Por favor, n&#227;o se assuste. Simplesmente utilize o seu navegador para armazenar a p&#225;gina com o nome padr&#227;o, que &#233; <code type="inline">get-pip.py</code>. Pode ser uma boa ideia armazenar o ficheiro no seu diret&#243;rio python, de modo que voc&#234; saiba onde encontr&#225;-lo. </p>
<p>Uma vez que tenha armazenado o ficheiro, precisar&#225; execut&#225;-lo, o que pode ser feito de duas maneiras. Caso prefira utilizar o seu interpretador python, simplesmente clique com o bot&#227;o direito no ficheiro <code type="inline">get-pip.py</code>, clique em "Abrir com" e escolha o interpretador python que deseja utilizar.</p>
<p>Caso prefira instalar o pip usando o <link target="https://pt.wikipedia.org/wiki/Cmd.exe">Prompt de Comando</link> do Windows, navegue at&#233; o diret&#243;rio no qual armazenou o python e o <code type="inline">get-pip.py</code>. Para esse exemplo, assumiremos que esse diret&#243;rio &#233; python27, e portanto utilizaremos o comando <code type="inline">C:\\\&gt;cd python27</code>. Uma vez que esteja neste diret&#243;rio, execute o comando a seguir para instalar o pip:</p>
<pre><code class="language-bash" xml:id="code_instalacao-modulos-python-pip_4" type="block" corresp="code_instalacao-modulos-python-pip_4.txt"></code></pre>
<p>Caso queira mais informa&#231;&#245;es ou aux&#237;lio com alguma mensagem de erro estranha, verifique a <link target="https://stackoverflow.com/questions/4750806/how-can-i-install-pip-on-windows">p&#225;gina do StackOverflow</link>, que parece estar regularmente atualizada.</p>
</div>
      <div type="2"><head>Instalando M&#243;dulos Python</head>
<p>Agora que voc&#234; tem o pip, &#233; f&#225;cil instalar m&#243;dulos python, j&#225; que ele faz todo o trabalho para voc&#234;. Quando encontrar um m&#243;dulo que deseja utilizar, geralmente a documenta&#231;&#227;o ou instru&#231;&#245;es de instala&#231;&#227;o incluir&#227;o o comando pip necess&#225;rio, por exemplo:</p>
<pre><code class="language-bash" xml:id="code_instalacao-modulos-python-pip_5" type="block" corresp="code_instalacao-modulos-python-pip_5.txt"></code></pre>
<p>Lembre-se: pela mesma raz&#227;o explicada acima (para sistemas Mac e Linux, mas n&#227;o Windows), voc&#234; pode ter que executar o pip com sudo, como:</p>
<pre><code class="language-bash" xml:id="code_instalacao-modulos-python-pip_6" type="block" corresp="code_instalacao-modulos-python-pip_6.txt"></code></pre>
<p>&#192;s vezes, especialmente no Windows, pode ser &#250;til usar a <link target="https://pt.wikipedia.org/wiki/Flag">flag</link> -m (para ajudar o python a encontrar o m&#243;dulo pip), como:</p>
<pre><code class="language-bash" xml:id="code_instalacao-modulos-python-pip_7" type="block" corresp="code_instalacao-modulos-python-pip_7.txt"></code></pre>
<p>Boa instala&#231;&#227;o!</p>
</div>
    </body>
  </text>
</TEI>
