<TEI xmlns="https://tei-c.org/ns/1-0/">
  <metadata>
  <title>Contabilizar y minar datos de investigaci&#243;n con Unix</title>
  <layout>lesson</layout>
  <date>2014-09-20</date>
  <authors>James Baker,Ian Milligan</authors>
  <reviewers>Melodee Beals,Allison Hegel</reviewers>
  <editors>Adam Crymble</editors>
  <difficulty>2</difficulty>
  <translation_date>2017-10-14</translation_date>
  <translator>V&#237;ctor Gayol</translator>
  <translation-editor>Maria Jos&#233; Afanador-Llach</translation-editor>
  <translation-reviewer>Juan Camilo Murcia,Maria Jos&#233; Afanador-Llach</translation-reviewer>
  <collection>lessons</collection>
  <original>research-data-with-unix</original>
  <activity>transforming</activity>
  <topics>data-manipulation</topics>
  <review-ticket>https://github.com/programminghistorian/ph-submissions/issues/138</review-ticket>
  <abstract>En esta lecci&#243;n aprender&#225;s c&#243;mo los datos de tu investigaci&#243;n pueden ser contados y extra&#237;dos mediante el shell Unix, cuando est&#225;n organizados de manera clara y predecible.</abstract>
  <previous>introduccion-a-bash</previous>
  <avatar_alt>Grabado en blanco y negro de un minero trabajando sobre una plataforma adentro de una mina.</avatar_alt>
  <doi>10.46430/phes0004</doi>
</metadata>
  <text xml:lang="es">
    <body>
      <div type="1"><head>Contabilizar y <emph>minar</emph> datos de investigaci&#243;n con Unix</head>
<div type="2"><head>Introducci&#243;n</head>
<p>Cuando tus datos de investigaci&#243;n est&#225;n organizados de manera clara y predecible, pueden ser contabilizados y puedes extraer informaci&#243;n utilizando el int&#233;rprete de comandos (<emph>shell</emph>) de Unix. Esta lecci&#243;n se apoya en las lecciones "<link target="/es/lecciones/preservar-datos-de-investigacion">Preservar tus datos de investigaci&#243;n</link>" e "<link target="/es/lecciones/introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos de Bash</link>". Dependiendo de la seguridad que hayas adquirido en el uso del int&#233;rprete de Unix, tambi&#233;n puede ser &#250;til como lecci&#243;n o actualizaci&#243;n independiente.</p>
<p>Cuando se acumulan datos de investigaci&#243;n para un proyecto, un historiador puede hacerse preguntas diferentes al volver a revisar los datos en un proyecto posterior. Si los datos se distribuyen en diversos archivos, como una serie de datos tabulados, un conjunto de textos transcritos o una colecci&#243;n de im&#225;genes, se pueden manipular utilizando sencillos comandos de Unix.</p>
<p>El int&#233;rprete de Unix te brinda acceso a un abanico de potentes comandos que pueden transformar la manera en que contabilizas y extraes informaci&#243;n de tus datos. Esta lecci&#243;n te introduce a una serie de comandos para el recuento y la extracci&#243;n de datos tabulados, aunque de manera superficial respecto de lo que puede hacer el int&#233;rprete de Unix. Al aprender algunos comandos podr&#225;s realizar tareas que son imposibles en LibreOffice Calc, Microsoft Excel u otros programas de hoja de c&#225;lculo similares. Estas &#243;rdenes se pueden aplicar f&#225;cilmente a datos no tabulados.</p>
<p>Tus posibilidades para manipular, contar y extraer datos depender&#225;n, generalmente, de la cantidad de metadatos -o texto descriptivo- contenidos en los nombres de los archivos que est&#225;s utilizando, as&#237; como del rango de comandos de Unix que hayas aprendido a usar. Por lo tanto, incluso si no te parece necesario trabajar con el int&#233;rprete de Unix, ser&#225; bueno que dediques un tiempo en estructurar mejor tus archivos de datos y tus convenciones para nombrarlos, de manera consistente y predecible. Ser&#225; un paso significativo para obtener el m&#225;ximo rendimiento de los comandos de Unix y poder contabilizar y extraer informaci&#243;n de tus datos. Dada la importancia de que tus datos sean consistentes y predecibles, m&#225;s all&#225; del tema de su preservaci&#243;n, consulta: "<link target="/es/lecciones/preservar-datos-de-investigacion">Preservar tus datos de investigaci&#243;n</link>"</p>
</div><div type="2"><head><emph>Software</emph> y configuraci&#243;n</head>
<p>Los usuarios de Windows deben instalar Git Bash. Lo pueden hacer descargando el m&#225;s reciente instalador de la <link target="http://msysgit.github.io/">p&#225;gina web de Git para Windos</link>. Las instrucciones para su instalaci&#243;n est&#225;n disponibles en <link target="https://web.archive.org/web/20190114082523/https://openhatch.org/missions/windows-setup/install-git-bash">Open Hatch</link> (en ingl&#233;s).</p>
<p>Los usuarios de OS X y Linux necesitar&#225;n utilizar la Terminal, o int&#233;rprete de l&#237;nea de comandos, como se explica en la "<link target="/es/lecciones/introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos de Bash</link>."</p>
<p>Esta lecci&#243;n se escribi&#243; utilizando Git Bash 1.9.0 en sistema operativo Windows 7. Se han incluido, cuando ha sido posible, rutas de archivo equivalentes para OS X/Linux. Sin embargo, como los comandos y variables pueden cambiar ligeramente entre sistemas operativos, los usuarios de OS X/Linux pueden consultar Deborah S. Ray y Eric J. Ray, <link target="https://www.worldcat.org/title/unix-and-linux/oclc/308171076&amp;referer=brief_results"><emph>Unix and Linux: Visual Quickstart Guide</emph></link>, 4a ed. (2009), que cubre la interoperabilidad con gran detalle. (<hi rend="bold">N. del T.</hi>: en espa&#241;ol se puede consultar <link target="https://www.worldcat.org/title/unix-y-linux-gua-prctica/oclc/970524006&amp;referer=brief_results"><emph>Unix y linux : Gu&#237;a pr&#225;ctica</emph></link></p>
<p>Los archivos utilizados en esta lecci&#243;n est&#225;n disponibles en "<link target="https://doi.org/10.6084/m9.figshare.1172094">Figshare</link>". Estos contienen metadatos de art&#237;culos acad&#233;micos catalogados en el rubro 'Historia' en la base de datos ESTAR de la Biblioteca Brit&#225;nica. Los datos son distribuidos bajo una renuncia de derechos de autor CC0.</p>
<p>Descarga los datos requeridos en tu ordenador y descomprime el archivo zip. Si no cuentas con un software adecuado para descomprimir archivos .zip, te recomendamos <link target="http://www.7-zip.org/">7-zip</link>. En Windows, te aconsejamos descomprimir la carpeta en tu disco C: para que los archivos queden en tu directorio <code type="inline">c:\proghist\</code>. No obstante, cualquier locaci&#243;n trabajar&#225; bien, pero entonces es posible que tengas que ajustar tus comandos conforme vayas siguiendo la lecci&#243;n. En OS X o Linux, tambi&#233;n te aconsejamos descomprimir en tu directorio de usuario para que aparezcan en <code type="inline">/user/NOMBREDEUSUARIO/proghist/</code>. En ambos casos, esto significa que cuando abras una nueva ventana de tu terminal, con solamente teclear <code type="inline">cd proghist</code> te podr&#225;s mover al directorio correcto.</p>
</div><div type="2"><head>Contando archivos</head>
<p>Comenzaremos esta lecci&#243;n contando el contenido de los archivos utilizando el int&#233;rprete de Unix. &#201;ste puede ser utilizado para realizar conteos r&#225;pidos en varios archivos, algo que dif&#237;cilmente lograr&#225;s a trav&#233;s de la interfaz gr&#225;fica de usuario (GUI por sus siglas en ingl&#233;s) de las suites ofim&#225;ticas comunes.</p>
<p>En Unix, el comando <code type="inline">wc</code> se utiliza para contabilizar los contenidos de un archivo o una serie de ellos.</p>
<p>Abre el int&#233;rprete de Unix y entra al directorio que contiene nuestros datos, el subdirectorio <code type="inline">data</code> del directorio <code type="inline">proghist</code>. Recuerda que, si en alg&#250;n momento no sabes en qu&#233; lugar est&#225;s dentro de la estructura de tu directorio, escribe <code type="inline">pwd</code> y usa el comando <code type="inline">cd</code> para moverte a donde lo necesites. La estructura de directorios es ligeramente diferente entre OS X/Linux y Windows: en el primero, el directorio tiene el siguiente formato <code type="inline">~/users/NOMBREDEUSUARIO/proghist/data</code> mientras que en Windows su formato es <code type="inline">c:\proghist\data</code>.</p>
<p>Escribe <code type="inline">ls</code> y oprime Enter. Esto imprime o muestra una lista que incluye dos archivos y un subdirectorio.</p>
<p>Los archivos en este directorio son: el conjunto de datos <code type="inline">2014-01_JA.csv</code> que contiene los metadatos de los art&#237;culos acad&#233;micos y un archivo con documentaci&#243;n acerca de <code type="inline">2014-01_JA.csv</code>, llamado <code type="inline">2014-01_JA.txt</code>.</p>
<p>El subdirectorio se llama <code type="inline">derived_data</code>. Contiene cuatro archivos <link target="http://en.wikipedia.org/wiki/Tab-separated_values">.tsv</link> derivados del archivo <code type="inline">2014-01_JA.csv</code>. Cada uno de estos incluye los datos en los que aparece una palabra clave como <code type="inline">africa</code> o <code type="inline">america</code> en el campo 'Title' de <code type="inline">2014-01_JA.csv</code>. El directorio <code type="inline">derived_data</code> tambi&#233;n incluye un subdirectorio llamado <code type="inline">results</code>.</p>
<p><emph>Nota: Los archivos <link target="http://en.wikipedia.org/wiki/Comma-separated_values">CSV</link> son aquellos en los que las unidades de datos, o celdas de una tabla, est&#225;n separados por comas (valores separados por comas) y los archivos TSV son aquellos en los que est&#225;n separados por tabuladores. Ambos se pueden leer en cualquier editor de texto o en programas de hoja de c&#225;lculo como Libre Office Calc o Microsoft Excel.</emph></p>
<p>Antes de que comiences a trabajar con estos archivos debes moverte al directorio en el que est&#225;n almacenados. Navega a <code type="inline">c:\proghist\data\derived_data</code> en Windows o a <code type="inline">~/users/NOMBREDEUSUARIO/proghist/data/derived_data</code> en OS X.</p>
<p>Ya que est&#233;s ah&#237; puedes contabilizar el contenido de los archivos.</p>
<p>El comando Unix para conteo es <code type="inline">wc</code>. Escribe <code type="inline">wc -w 2014-01-31_JA_africa.tsv</code> y presiona Enter. La variable <code type="inline">-w</code> combinada con la orden <code type="inline">wc</code> instruye a tu computadora para imprimir en la ventana del int&#233;rprete un conteo de palabras y mostrar el nombre del archivo que ha sido contabilizado.</p>
<p>Como vimos en "<link target="/es/lecciones/introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos de Bash</link>", las variables como <code type="inline">-w</code> son importantes para obtener el m&#225;ximo rendimiento del int&#233;rprete de Unix ya que nos permiten un mejor control de los comandos.</p>
<p>Si tu investigaci&#243;n est&#225; m&#225;s enfocada al n&#250;mero de entradas (o l&#237;neas) que al n&#250;mero de palabras, puedes usar la variable de conteo de l&#237;neas. Escribe <code type="inline">wc -l 2014-01-31_JA_africa.tsv</code> y presiona Enter. La variable <code type="inline">-l</code> combinada con la orden <code type="inline">wc</code> imprime el conteo de l&#237;neas y el nombre del archivo que ha sido contabilizado.</p>
<p>Ahora escribe: <code type="inline">wc -c 2014-01-31_JA_africa.tsv</code> y oprime Enter. Aqu&#237; utilizamos la variable <code type="inline">-c</code> en combinaci&#243;n con la orden <code type="inline">wc</code> para imprimir el conteo de caracteres del archivo <code type="inline">2014-01-31_JA_africa.tsv</code>.</p>
<p><emph>Nota: los usuarios de OS X y Linux pueden utilizar tambi&#233;n <code type="inline">-m</code> en vez de <code type="inline">-c</code>.</emph></p>
<p>Con estas tres variables, lo m&#225;s obvio que pueden hacer los historiadores es una comparaci&#243;n r&#225;pida del perfil de sus fuentes en formato digital. Por ejemplo, un conteo de palabras por p&#225;gina de un libro, la distribuci&#243;n de caracteres por p&#225;gina a trav&#233;s de una colecci&#243;n de peri&#243;dicos, el promedio de longitud de l&#237;neas utilizadas por los poetas. Puedes utilizar <code type="inline">wc</code> en combinaci&#243;n con comodines y variables para construir consultas m&#225;s complejas. Escribe <code type="inline">wc -l 2014-01-31_JA_a*.tsv</code> y presiona Enter. Ver&#225;s el conteo de l&#237;neas de los archivos <code type="inline">2014-01-31_JA_africa.tsv</code> y <code type="inline">2014-01-31_JA_america.tsv</code>, lo que ofrece una manera simple de comparar los dos conjuntos de datos. Por supuesto, puede ser m&#225;s r&#225;pido comparar la cantidad de l&#237;neas en los dos documentos con Libre Office Calc, Microsoft Excel o alg&#250;n programa de hoja de c&#225;lculo similar. Pero cuando quieres comparar la cantidad de l&#237;neas para decenas, cientos o miles de documentos, el int&#233;rprete de Unix tiene una clara ventaja en cuanto a velocidad.</p>
<p>Adem&#225;s, a medida que nuestros conjuntos de datos aumentan en tama&#241;o, puedes usar el int&#233;rprete de Unix para hacer cosas m&#225;s interesantes que copiar tus recuentos de l&#237;neas manualmente mediante la impresi&#243;n en pantalla o copiar y pegar. Con el operador de redireccionamiento <code type="inline">&gt;</code> puedes exportar los resultados de la consulta a un nuevo archivo. Escribe <code type="inline">wc -l 2014-01-31_JA_a*.tsv&gt; results / 2014-01-31_JA_a_wc.txt</code> y presiona Enter. Lo anterior ejecuta la misma consulta pero, en lugar de imprimir los resultados en la ventan del int&#233;rprete de Unix, guarda los resultados como <code type="inline">2014-01-31_JA_a_wc.txt</code>. Al indicar <code type="inline">results /</code>, se genera el archivo .txt en el subdirectorio <code type="inline">results</code>. Para comprobar esto, navega al subdirectorio <code type="inline">results</code>, presiona Enter, escribe <code type="inline">ls</code>, y presiona Enter nuevamente para ver que este archivo est&#225; enlistado dentro <code type="inline">c:\proghist\data\derived_data\results</code> en Windows, o <code type="inline">/users/USERNAME/proghist/data/derived_data/results</code> en OS X / Linux.</p>
</div><div type="2"><head>Extracci&#243;n de informaci&#243;n o <emph>miner&#237;a</emph> de archivos</head>
<p>El int&#233;rprete de Unix puede hacer mucho m&#225;s que contar palaras, caracteres y l&#237;neas dentro de un archivo. La orden <code type="inline">grep</code> (que significa 'impresi&#243;n de una expresi&#243;n regular global') se utiliza para buscar cadenas de caracteres espec&#237;ficas a lo largo de diversos archivos. Es capaz de hacerlo mucho m&#225;s r&#225;pido que la interfaz de b&#250;squeda gr&#225;fica ofrecida por la mayor&#237;a de los sistemas operativos o las suites de ofim&#225;tica. Combinado con el operador <code type="inline">&gt;</code>, el comando <code type="inline">grep</code> se convierte en una poderosa herramienta de b&#250;squeda. Puedes utilizarla para <emph>minar</emph> o extraer informaci&#243;n acerca de las caracter&#237;sticas o agrupaciones de palabras que aparecen en varios de los archivos y luego exportar los resultados a un nuevo archivo. Las &#250;nicas limitaciones aqu&#237; son: tu imaginaci&#243;n, la forma en la que est&#225;n organizados tus datos y, cuando trabajas con miles o millones de archivos, el poder de procesamiento del que dispongas.</p>
<p>Para comenzar a utilizar el comando <code type="inline">grep</code>, navega primero al directorio <code type="inline">derived_data</code> (<code type="inline">cd ..</code>). Ah&#237;, escribe <code type="inline">grep 1999 *.tsv</code> y oprime Enter. Esta b&#250;squeda rastrea todos los archivos <code type="inline">.tsv</code> en el directorio que concuerden con el criterio dado: que contengan la cadena de caracteres '1999' e imprime las cadenas resultantes en la ventana del int&#233;rprete.</p>
<p><emph>Nota: es una gran cantidad de datos para imprimir, as&#237; que, si te aburre esperar, oprime <code type="inline">ctrl+c</code> para cancelar la aci&#243;n. Ctrl+c se utiliza para abortar cualquier proceso en el int&#233;rprete de Unix.</emph></p>
<p>Presiona la flecha hacia arriba una vez para volver a la orden m&#225;s reciente. Modifica <code type="inline">grep 1999 *.tsv</code> por <code type="inline">grep -c 1999 *.tsv</code> y presiona Enter. El int&#233;rprete imprime ahora el n&#250;mero de veces que aparece la secuencia 1999 en cada archivo .tsv. Regresa otra vez a la l&#237;nea anterior y modifica esto as&#237;: <code type="inline">grep -c 1999 2014-01-31_JA_*.Tsv &gt; results/2014-01-31_JA_1999.txt</code> y presiona enter. Esta consulta busca la cadena '1999' en todos los documentos y guarda los resultados en el archivo <code type="inline">2014-01-31_JA_1999.txt</code> dentro del subdirectorio <code type="inline">results</code>.</p>
<p>La cadena de caracteres puede contener letras: <code type="inline">grep -c revolution 2014-01-31_JA_america.tsv 2014-02-02_JA_britain.tsv</code>, por ejemplo, contabiliza las veces que aparece la cadena 'revolution' en los archivos definidos e imprime los resultados en el int&#233;rprete. Ejecuta esto y luego modif&#237;calo a <code type="inline">grep -ci revolution 2014-01-31_JA_america.tsv 2014-02-02_JA_britain.tsv</code>. Lo anterior repite la b&#250;squeda y la imprime pero sin diferenciar may&#250;sculas y min&#250;sculas, as&#237; que incluye <code type="inline">revolution</code> y <code type="inline">Revolution</code>. Observa que el conteo se ha incrementado casi 30 veces por los t&#237;tulos de art&#237;culos de revistas que contienen la palabra clave 'revolution'. De nuevo, si vuelves a la orden anterior y a&#241;ades <code type="inline">&gt; results/</code>, seguido del nombre de un archivo -idealmente en formato .txt, se guardar&#225;n los resultados en un archivo.</p>
<p>Tambi&#233;n puedes utilizar <code type="inline">grep</code> para crear subconjuntos de datos tabulados. Escribe <code type="inline">grep -i revolution 2014-01-31_JA_america.tsv 2014-02-02_JA_britain.tsv &gt; A&#209;O-MES-DIA_JA_america_britain_i_revolution.tsv</code> (donde <code type="inline">A&#209;O-MES-DIA</code> ser&#225; la fecha en la que est&#233;s completando esta lecci&#243;n) y oprime Enter. Este comando busca en ambos archivos definidos y exporta cualquier l&#237;nea que contenga <code type="inline">revolution</code> (sin importar may&#250;sculas) al archivo .tsv especificado.</p>
<p>Los datos no se guardaron en el directorio <code type="inline">results</code> porque nos son estrictamente resultados sino datos derivados. Dependiendo de tu proyecto de investigaci&#243;n ser&#225; preferible guardar estos en otro subdirectorio. Por ahora mira dentro de este archivo para verificar su contenido y, una vez hecho,  b&#243;rralo utilizando el comando <code type="inline">rm</code>. <emph>Nota: el comando <code type="inline">rm</code> es muy potente y debe ser usado con cautela. Consulta, por favor, "<link target="/es/lecciones/introduccion-a-bash">Introducci&#243;n a la l&#237;nea de comandos de Bash</link>" para mayor informaci&#243;n de c&#243;mo utilizarlo correctamente.</emph></p>
<p>Finalmente, puedes insertar otra variable, <code type="inline">-v</code>, para excluir elementos de los datos cuando uses el comando <code type="inline">grep</code>. Escribe <code type="inline">grep -iv revolution 2014*_JA_a*.tsv &gt; 2014_JA_iv_revolution.csv</code> y oprime Enter. Esta b&#250;squeda rastrea todas las l&#237;neas que no contienen <code type="inline">revolution</code> o <code type="inline">Revolution</code> en los tres archivos definidos y las exporta al archivo <code type="inline">c:\proghist\data\derived_data\2014_JA_iv_revolution.csv</code>.</p>
<p>F&#237;jate que has transformado los datos de un formato de archivo a otro, de .tsv a .csv. A menudo se produce una p&#233;rdida en la estructura de datos cuando realizas estas transformaciones. Conf&#237;rmalo por tu cuenta ejecutando <code type="inline">grep -iv revolution 2014*_JA_a*.tsv &gt; 2014_JA_iv_revolution.tsv</code> y abre ambos archivos, .csv y .tsv, en Libre Office Calc, Microsoft Excel, o cualquier programa de hoja de c&#225;lculo similar. Observa las diferencias en la delimitaci&#243;n de columnas entre los dos archivos.</p>
<p><emph>Resumen</emph></p>
<p>Con el int&#233;rprete de Unix ahora puedes:</p>
<ul>
<li>usar el comando <code type="inline">wc</code> con las variables <code type="inline">-w</code> y <code type="inline">-l</code> para contar palabras y l&#237;neas en un archivo o en una serie de ellos.</li>
<li>usar la redirecci&#243;n y la estructura de archivos <code type="inline">&gt; subdirectorio/nombredearchivo</code> para guardar el archivo resultante en un subdirectorio.</li>
<li>usar el comando <code type="inline">grep</code> para buscar ocurrencias en una cadena de caracteres.</li>
<li>usar la variable <code type="inline">-c</code> con <code type="inline">grep</code>para contar las ocasiones en las que aparece una cadena de caracteres. La variable <code type="inline">-i</code> arrojar&#225; una b&#250;squeda de cadenas sin diferenciar may&#250;sculas, la variable <code type="inline">-v</code> excluir&#225; la cadena de los resultados.</li>
<li>combina estos comandos y variables para construir b&#250;squedas m&#225;s complejas de una manera que se adapte a la posibilidad de contar y extraer informaci&#243;n de tus datos en tu proyecto de investigaci&#243;n.</li>
</ul>
<h4>Conclusi&#243;n</h4>
<p>En esta lecci&#243;n has aprtendido a realizar recuentos b&#225;sicos en archivos, buscar entre tus datos cadenas de caracteres comunes y guardar resultados y datos derivados. Aunque esta lecci&#243;n se restringe a contar y extraer informaci&#243;n de datos tabulados, el procedimiento se puede extender f&#225;cilmente a archivos de texto plano. Para ello te recomandamos dos gu&#237;as escritas por William Turkel:</p>
<ul>
<li>William Turkel, '<link target="http://williamjturkel.net/2013/06/15/basic-text-analysis-with-command-line-tools-in-linux/">Basic Text Analysis with Command Line Tools in Linux</link>' (15 de junio, 2013)</li>
<li>William Turkel, '<link target="http://williamjturkel.net/2013/06/20/pattern-matching-and-permuted-term-indexing-with-command-line-tools-in-linux/">Pattern Matching and Permuted Term Indexing with Command Line Tools in Linux</link>' (20 de junio, 2013)</li>
</ul>
<p>Como sugieren estas recomendaciones, en esta lecci&#243;n solo revisamos superficialmente lo que es capaz de hacer el int&#233;rprete de Unix. Sin embargo, esperamos haberte proporcionado una prueba suficiente para impulsar una mayor investigaci&#243;n de su uso.</p>
<p>Para muchos historiadores, el verdadero potencial de estas herramientas solo es visible al aplicarlas en un proyecto de investigaci&#243;n real. Una vez que tu investigaci&#243;n crezca y, con ella, los datos de investigaci&#243;n, ser&#225; extremadamente &#250;til poder manipular, contar y extraer informaci&#243;n de miles de archivos. Si decides continuar con el tema de esta lecci&#243;n e investigar m&#225;s sobre el int&#233;rprete de Unix, descubrir&#225;s que incluso una gran colecci&#243;n de archivos cuyos datos no contienen elementos alfanum&#233;ricos, como archivos de im&#225;genes, pueden tambi&#233;n clasificarse, seleccionarse y consultarse f&#225;cilmente.</p>
</div></div>
    </body>
  </text>
</TEI>
