<TEI xmlns="http://www.tei-c.org/ns/1.0" xml:id="contagem-mineracao-dados-investigacao-unix">
  <teiHeader>
 <fileDesc>
  <titleStmt>
   <title>Contagem e minera&#231;&#227;o de dados de investiga&#231;&#227;o com Unix</title>
  <author role="original_author"><persName>James Baker</persName><persName>Ian Milligan</persName></author><editor role="reviewers"><persName>M. H. Beals</persName><persName>Allison Hegel</persName></editor><author role="translators">Felipe Lamarca</author><editor role="translation-reviewers"><persName>Daniel Bonatto Seco</persName><persName>Ian Araujo</persName></editor><editor role="editors">Adam Crymble</editor></titleStmt>
  <publicationStmt>
   <idno type="doi">10.46430/phpt0019</idno><date type="published">09/20/2014</date><date type="translated">12/17/2021</date><p>Lesson reviewed and published in Programming Historian.</p>
  </publicationStmt>
  <sourceDesc>
  <p>Born digital, in a markdown format. Original file: <ref type="original_file" target="#research-data-with-unix"/>.</p><p>There are other translations: <ref target="#datos-de-investigacion-con-unix"/></p></sourceDesc>
 </fileDesc>
 <profileDesc><abstract><p>Esta li&#231;&#227;o examinar&#225; como dados de investiga&#231;&#227;o, quando organizados de maneira clara e previs&#237;vel, podem ser contabilizados e minerados utilizando o shell do Unix.</p></abstract><textClass><keywords><term xml:lang="en">data-manipulation</term></keywords></textClass></profileDesc>
</teiHeader>
  <text xml:lang="pt">
    <body>
      <div type="1"><head>Contagem e minera&#231;&#227;o de dados de investiga&#231;&#227;o com Unix</head>
<div type="2"><head>Introdu&#231;&#227;o</head>
<p>Esta li&#231;&#227;o examinar&#225; como dados de investiga&#231;&#227;o, quando organizados de maneira clara e previs&#237;vel, podem ser contabilizados e minerados utilizando o shell do Unix. Esta li&#231;&#227;o se baseia nas li&#231;&#245;es "<ref target="/pt/licoes/preservar-os-seus-dados-de-investigacao">Preservar seus dados de investiga&#231;&#227;o</ref>" e "<ref target="/en/lessons/intro-to-bash">Introduction to the Bash Command Line</ref>" (em ingl&#234;s). Dependendo do qu&#227;o confiante estiver no uso do shell do Unix, ela tamb&#233;m pode ser usada como uma li&#231;&#227;o independente ou uma revis&#227;o.</p>
<p>Uma vez acumulados dados de investiga&#231;&#227;o para um projeto, um historiador pode fazer diferentes perguntas aos mesmos dados durante um projeto subsequente. Caso estes dados estejam espalhados em v&#225;rios ficheiros - uma s&#233;rie de dados tabulares, um conjunto de textos transcritos, uma cole&#231;&#227;o de imagens - eles podem ser contabilizados e minerados utilizando comandos Unix simples.</p>
<p>O shell do Unix oferece acesso a uma ampla gama de comandos que podem transformar o modo como voc&#234; contabiliza e minera dados de investiga&#231;&#227;o. Essa li&#231;&#227;o ir&#225; apresent&#225;-lo a uma s&#233;rie de comandos que usam contagem e minera&#231;&#227;o de dados tabulares, embora eles apenas arranhem a superf&#237;cie do que o shell do Unix pode fazer. Ao aprender apenas alguns comandos simples, ser&#225; capaz de realizar tarefas que s&#227;o imposs&#237;veis no Libre Office Calc, Microsoft Excel ou outros programas de estat&#237;stica similares. Esses comandos podem facilmente ter o seu uso estendido para dados n&#227;o-estruturados.</p>
<p>Essa li&#231;&#227;o tamb&#233;m ir&#225; demonstrar que as op&#231;&#245;es dispon&#237;veis para manipula&#231;&#227;o, contagem e minera&#231;&#227;o de dados geralmente dependem da quantidade de metadados, ou texto descritivo, contidos nos nomes dos ficheiros dos dados que estiver utilizando, tanto quanto da gama de comandos Unix que aprendeu a utilizar. Portanto, ainda que n&#227;o seja um pr&#233;-requisito do trabalho com o shell do Unix, reservar um momento para estruturar os seus dados de investiga&#231;&#227;o e conven&#231;&#245;es de nomes de ficheiros de uma maneira consistente e previs&#237;vel &#233; certamente um passo significativo para aproveitar ao m&#225;ximo os comandos Unix e ser capaz de contar e minerar os seus dados de investiga&#231;&#227;o. Para entender a import&#226;ncia de dedicar um tempo a tornar os seus dados consistentes e previs&#237;veis, al&#233;m de quest&#245;es de preserva&#231;&#227;o, consulte:  "<ref target="/pt/licoes/preservar-os-seus-dados-de-investigacao">Preservar seus dados de investiga&#231;&#227;o</ref>".</p>
</div><div type="2"><head>Software e configura&#231;&#227;o</head>
<p>Usu&#225;rios de Windows precisar&#227;o instalar o Git Bash. Ele pode ser instalado fazendo o download do instalador mais recente na <ref target="https://gitforwindows.org/">p&#225;gina web do git for windows</ref> (em ingl&#234;s). Instru&#231;&#245;es de instala&#231;&#227;o est&#227;o dispon&#237;veis na <ref target="https://github.com/git-for-windows/git/wiki/Technical-overview">documenta&#231;&#227;o do Git for Windows</ref> (em ingl&#234;s).</p>
<p>Usu&#225;rios de OS X e Linux dever&#227;o utilizar os pr&#243;prios terminais para seguir esta li&#231;&#227;o, como foi discutido em "<ref target="/en/lessons/intro-to-bash">Introduction to the Bash Command Line</ref>" (em ingl&#234;s).</p>
<p>Esta li&#231;&#227;o foi revista utilizando o Git Bash 2.34.1 e o sistema operacional Windows 10. Caminhos de ficheiro equivalentes para OS X/Linux foram inclu&#237;dos sempre que poss&#237;vel. No entanto, como os comandos e flags podem mudar ligeiramente entre os sistemas operacionais OS X/Linux, sugere-se que os usu&#225;rios verifiquem Deborah S. Ray e Eric J. Ray, "<ref target="https://www.worldcat.org/title/unix-and-linux/oclc/308171076&amp;referer=brief_results"><emph>Unix and Linux: Visual Quickstart Guide</emph></ref>", 4&#170; edi&#231;&#227;o, que cobre a interoperabilidade em maiores detalhes.</p>
<p>Os ficheiros utilizados nesta li&#231;&#227;o est&#227;o dispon&#237;veis em "<ref target="https://doi.org/10.6084/m9.figshare.1172094">Figshare</ref>" (em ingl&#234;s). Os dados cont&#234;m os metadados para artigos de peri&#243;dicos categorizados em 'History' no banco de dados ESTAR da British Library. Os dados s&#227;o compartilhados sob isen&#231;&#227;o dos direitos autorais CC0.</p>
<p>Fa&#231;a o download dos ficheiros necess&#225;rios, salve-os no seu computador e descompacte-os. Caso n&#227;o tenha um software padr&#227;o para lidar com ficheiros .zip, recomendamos <ref target="http://www.7-zip.org/">7-zip</ref> (em ingl&#234;s) para este prop&#243;sito. No Windows, recomendamos descompactar a pasta em sua unidade C: para que os ficheiros estejam em <code rend="inline">c:\proghist\</code>. No entanto, qualquer localiza&#231;&#227;o servir&#225;, mas precisar&#225; ajustar os seus comandos &#224; medida que for avan&#231;ando na li&#231;&#227;o caso use uma localiza&#231;&#227;o diferente. No caso de OS X ou Linux, recomendamos de modo similar que descompacte os ficheiros no seu diret&#243;rio de usu&#225;rio, de modo que eles apare&#231;am em <code rend="inline">/usuario/NOME-DE-USUARIO/proghist/</code>. Em ambos os casos, isso significa que, ao abrir uma nova janela de terminal, pode simplesmente digitar <code rend="inline">cd proghist</code> para mover para o diret&#243;rio correto (no Windows, se o comando referido n&#227;o resultar, poder&#225; ter de digitar <code rend="inline">cd C:\proghist</code> para acessar o diret&#243;rio).</p>
</div><div type="2"><head>Contabilizando ficheiros</head>
<p>Voc&#234; come&#231;ar&#225; esta li&#231;&#227;o contabilizando os conte&#250;dos dos ficheiros utilizando o shell do Unix. O shell do Unix pode ser usado para rapidamente gerar contagens de ficheiros, algo dif&#237;cil de se conseguir usando interfaces gr&#225;ficas de usu&#225;rio (do ingl&#234;s, <emph>Graphical User Interfaces</emph> - GUI) de su&#237;tes padr&#227;o de escrit&#243;rio, como o pacote Office, por exemplo.</p>
<p>Abra o shell do Unix e navegue at&#233; o diret&#243;rio que cont&#233;m os nossos dados, o subdiret&#243;rio <code rend="inline">data</code> do diret&#243;rio <code rend="inline">proghist</code>. Lembre-se: caso n&#227;o tenha certeza de onde est&#225; na sua estrutura de diret&#243;rios, digite <code rend="inline">pwd</code> e use o comando <code rend="inline">cd</code> para mover para onde precisa estar. A estrutura de diret&#243;rios &#233; um pouco diferente entre OS X/Linux e Windows: no primeiro caso, o diret&#243;rio est&#225; em um formato como <code rend="inline">~/usuario/NOME-DE-USUARIO/proghist/data</code>, e no Windows o formato &#233; do tipo <code rend="inline">c:\proghist\data</code>.</p>
<p>Digite <code rend="inline">ls</code> e pressione a tecla Enter. Isso exibe uma lista que inclui dois ficheiros e um subdiret&#243;rio.</p>
<p>Os ficheiros nesse diret&#243;rio s&#227;o a base de dados <code rend="inline">2014-01_JA.csv</code>, que cont&#233;m os metadados dos artigos de peri&#243;dico, e um ficheiro contendo a documenta&#231;&#227;o a respeito do <code rend="inline">2014-01_JA.csv</code> chamado <code rend="inline">2014-01_JA.txt</code>.</p>
<p>O subdiret&#243;rio &#233; nomeado como <code rend="inline">derived_data</code>. Ele cont&#233;m quatro ficheiros <ref target="http://en.wikipedia.org/wiki/Tab-separated_values">.tsv</ref> derivados do <code rend="inline">2014-01_JA.csv</code>. Cada um deles inclui todos os dados em que uma palavra-chave como <code rend="inline">africa</code> ou <code rend="inline">america</code> aparece no campo <code rend="inline">Title</code> do <code rend="inline">2014-01_JA.csv</code>. O diret&#243;rio <code rend="inline">derived_data</code> tamb&#233;m inclui um subdiret&#243;rio chamado <code rend="inline">results</code>.</p>
<p><emph>Nota: Ficheiros <ref target="https://pt.wikipedia.org/wiki/Comma-separated_values">CSV</ref> s&#227;o aqueles nos quais as unidades de dados (ou c&#233;lulas) s&#227;o separadas por v&#237;rgula (comma-separated-values) e ficheiros TSV s&#227;o aqueles nos quais as unidades s&#227;o separadas por tabula&#231;&#227;o. Ambos podem ser lidos em editores de texto simples ou em programas de estat&#237;stica como Libre Office Calc ou Microsoft Excel.</emph></p>
<p>Antes de come&#231;ar a trabalhar com esses ficheiros, deve mover-se para dentro do diret&#243;rio no qual eles est&#227;o armazenados. Navegue at&#233; <code rend="inline">c:\proghist\data\derived_data</code> no Windows ou <code rend="inline">~/usuario/NOME-DE-USUARIO/proghist/data/derived_data</code> no OS X/Linux.</p>
<p>Agora que j&#225; est&#225; aqui, pode contabilizar o conte&#250;do dos ficheiros.</p>
<p>No Unix, o comando <code rend="inline">wc</code> &#233; usado para contar os conte&#250;dos de um ficheiro ou de uma s&#233;rie de ficheiros. Digite <code rend="inline">wc -w 2014-01-31_JA_africa.tsv</code> e pressione a tecla Enter. A flag <code rend="inline">-w</code> combinado com <code rend="inline">wc</code> instrui o computador a exibir no shell uma contagem de palavras e o nome do ficheiro que foi contabilizado.</p>
<p>Como foi visto no "<ref target="/en/lessons/intro-to-bash">Introduction to the Bash Command Line</ref>", flags como <code rend="inline">-w</code> s&#227;o parte essencial para aproveitar ao m&#225;ximo o shell do Unix, uma vez que eles oferecem melhor controle sobre os comandos.</p>
<p>Se a sua investiga&#231;&#227;o est&#225; mais interessada no n&#250;mero de entradas (ou linhas) do que no n&#250;mero de palavras, pode utilizar a flag de contagem de linhas. Digite <code rend="inline">wc -l 2014-01-31_JA_africa.tsv</code> e pressione Enter. Combinado com o <code rend="inline">wc</code>, a flag <code rend="inline">-l</code> exibe uma contagem de linhas e o nome do ficheiro que foi contabilizado.</p>
<p>Finalmente, digite <code rend="inline">wc -c 2014-01-31_JA_africa.tsv</code> e pressione Enter. Isso usa a flag <code rend="inline">-c</code> combinado com o comando <code rend="inline">wc</code> para exibir uma contagem de caracteres do <code rend="inline">2014-01-31_JA_africa.tsv</code>.</p>
<p><emph>Nota: Usu&#225;rios de OS X e Linux devem substituir a flag <code rend="inline">-c</code> por <code rend="inline">-m</code>.</emph></p>
<p>Com essas tr&#234;s flags, o uso mais simples que um historiador pode fazer do comando <code rend="inline">wc</code> &#233; comparar o formato das fontes no formato digital - por exemplo, a contagem do n&#250;mero de palavras por p&#225;gina de um livro, a distribui&#231;&#227;o de caracteres por p&#225;gina ao longo de uma cole&#231;&#227;o de jornais, o comprimento m&#233;dio das linhas usadas pelos poetas. Tamb&#233;m pode utilizar <code rend="inline">wc</code> com uma combina&#231;&#227;o de curingas / caracteres vari&#225;veis (<emph>wildcards</emph>) e flags para construir <emph>queries</emph> mais complexas. Digite <code rend="inline">wc -l 2014-01-31_JA_a*.tsv</code> e pressione Enter. Isso exibe a contagem de linhas para <code rend="inline">2014-01-31_JA_africa.tsv</code> e <code rend="inline">2014-01-31_JA_america.tsv</code>, al&#233;m da soma das linhas destes ficheiros, oferecendo uma maneira simples de comparar esses dois conjuntos de dados de investiga&#231;&#227;o. Claro, pode ser mais r&#225;pido comparar a contagem de linhas desses dois documentos no Libre Office Calc, Microsoft Excel ou outro programa similar. Mas quando desejar comparar a contagem de linhas de dezenas, centenas ou milhares de documentos, o shell do Unix tem uma clara vantagem em velocidade.</p>
<p>Al&#233;m disso, &#224; medida que os nossos conjuntos de dados aumentam de tamanho, pode utilizar o shell do Unix para fazer mais do que copiar essas contagens de linha manualmente, com capturas de tela ou com m&#233;todos de copiar e colar. Ao utilizar o operador de redirecionamento <code rend="inline">&gt;</code> pode exportar os resultados da sua <emph>query</emph> em um novo ficheiro. Digite <code rend="inline">wc -l 2014-01-31_JA_a*.tsv &gt; results/2014-01-31_JA_a_wc.txt</code> e pressione Enter. Isso executa a mesma <emph>query</emph> anterior, mas, ao inv&#233;s de exibir os resultados no shell do Unix, ele salva os resultados como <code rend="inline">2014-01-31_JA_a_wc.txt</code>. Ao preceder com <code rend="inline">results/</code>, ele move o ficheiro .txt para o subdiret&#243;rio <code rend="inline">results</code>. Para verificar isso, navegue at&#233; ao subdiret&#243;rio <code rend="inline">results</code>, pressione Enter, digite <code rend="inline">ls</code> e pressione Enter mais uma vez para ver este ficheiro listado em <code rend="inline">c:\proghist\data\derived_data\results</code> no Windows ou <code rend="inline">/usuario/NOME-DE-USUARIO/proghist/data/derived_data/results</code> no OS X/Linux.</p>
</div><div type="2"><head>Minerando ficheiros</head>
<p>O shell do Unix pode fazer muito mais do que contar palavras, caracteres e linhas de um ficheiro. O comando <code rend="inline">grep</code> (que significa '<emph>global regular expression print</emph>') &#233; usado para buscar <emph>strings</emph> (cadeias de caracteres) espec&#237;ficas ao longo de m&#250;ltiplos ficheiros. Ele &#233; capaz de fazer isso muito mais rapidamente do que interfaces gr&#225;ficas de busca oferecidas pela maioria dos sistemas operacionais ou su&#237;tes de escrit&#243;rio. Combinado com o operador <code rend="inline">&gt;</code>, o comando <code rend="inline">grep</code> se torna uma ferramenta de investiga&#231;&#227;o poderosa, que pode ser usada para minerar os seus dados em busca de caracter&#237;sticas ou grupos de palavras que aparecem ao longo de m&#250;ltiplos ficheiros e ent&#227;o exportar esses dados para um novo ficheiro. As &#250;nicas limita&#231;&#245;es aqui s&#227;o a sua imagina&#231;&#227;o, o formato dos seus dados e - quando trabalhando com milhares ou milh&#245;es de ficheiros - o poder de processamento ao seu dispor.</p>
<p>Para come&#231;ar a utilizar o <code rend="inline">grep</code>, primeiro navegue at&#233; o diret&#243;rio <code rend="inline">derived_data</code> (<code rend="inline">cd ..</code>). Aqui digite <code rend="inline">grep 1999 *.tsv</code> e pressione Enter. Essa <emph>query</emph> busca em todos os ficheiros no diret&#243;rio que se enquadram nos crit&#233;rios fornecidos (os ficheiros .tsv) por inst&#226;ncias da <emph>string</emph>, ou cluster de caracteres, '1999'. Em seguida, exibe no shell. </p>
<p style="alert alert-warning">
H&#225; uma grande quantidade de dados a serem exibidos. Ent&#227;o, caso fique entediado, pressione `ctrl+c` para cancelar a a&#231;&#227;o. Ctrl+c &#233; utilizado para cancelar qualquer processo no shell do Unix.
</p>
<p>Pressione a seta para cima uma vez para voltar &#224; a&#231;&#227;o mais recente. Altere <code rend="inline">grep 1999 *.tsv</code> para <code rend="inline">grep -c 1999 *.tsv</code> e pressione Enter. O shell ir&#225; agora exibir o n&#250;mero de vezes que a <emph>string</emph> '1999' apareceu em cada um dos ficheiros .tsv. Volte &#224; linha anterior novamente, altere para <code rend="inline">grep -c 1999 2014-01-31_JA_*.tsv &gt; results/2014-01-31_JA_1999.txt</code> e pressione Enter. Essa <emph>query</emph> procura inst&#226;ncias da <emph>string</emph> '1999' em todos os documentos que se adequam aos crit&#233;rios e as salva em <code rend="inline">2014-01-31_JA_1999.txt</code> no subdiret&#243;rio <code rend="inline">results</code>.</p>
<p><emph>Strings</emph> n&#227;o precisam ser n&#250;meros. <code rend="inline">grep -c revolution 2014-01-31_JA_america.tsv 2014-02-02_JA_britain.tsv</code>, por exemplo, conta todas as inst&#226;ncias da <emph>string</emph> <code rend="inline">revolution</code> dentro dos ficheiros definidos e exibe essas contagens no shell. Execute esse comando e o altere para <code rend="inline">grep -ci revolution 2014-01-31_JA_america.tsv 2014-02-02_JA_britain.tsv</code>. Isso repete a <emph>query</emph>, mas imprime um resultado que n&#227;o diferencia mai&#250;sculas de min&#250;sculas, combinando a flag -i com -c, (incluindo inst&#226;ncias <code rend="inline">revolution</code> e <code rend="inline">Revolution</code>). Note que a contagem aumentou quase 30 vezes para os t&#237;tulos de artigos de per&#237;odicos que cont&#234;m a palavra-chave <code rend="inline">revolution</code>. Como antes, voltar ao comando anterior e adicionar <code rend="inline">&gt; results/</code>, seguido do nome do ficheiro (idealmente no formato .txt), armazenar&#225; os resultados em um ficheiro.</p>
<p>Tamb&#233;m pode utilizar o <code rend="inline">grep</code> para criar subconjuntos de dados tabulares. Digite <code rend="inline">grep -i revolution 2014-01-31_JA_america.tsv 2014-02-02_JA_britain.tsv &gt; ANO-MES-DIA_JA_america_britain_i_revolution.tsv</code> (onde <code rend="inline">ANO-MES-DIA</code> &#233; a data em que voc&#234; est&#225; completando esta li&#231;&#227;o) e pressione Enter. Este comando verifica ambos os ficheiros definidos e exporta todas as linhas contendo <code rend="inline">revolution</code> (sem diferenciar mai&#250;sculas de min&#250;sculas) para o ficheiro .tsv especificado.</p>
<p>O dado n&#227;o foi salvo ao diret&#243;rio <code rend="inline">results</code> porque ele n&#227;o &#233; estritamente um resultado; &#233; um dado derivado. Dependendo do seu projeto de investiga&#231;&#227;o, pode ser mais f&#225;cil armazenar isso em outro subdiret&#243;rio. Por enquanto, d&#234; uma olhada neste ficheiro para verificar o seu conte&#250;do e, quando estiver satisfeito, delete-o usando o comando <code rend="inline">rm</code>. </p>
<p><emph>Nota: O comando <code rend="inline">rm</code> &#233; muito poderoso e deve ser usado com cautela. Por favor, verifique "<ref target="/en/lessons/intro-to-bash">Introduction to the Bash Command Line</ref>" (em ingl&#234;s) para instru&#231;&#245;es de como utilizar esse comando corretamente.</emph></p>
<p>Finalmente, pode usar outra flag, <code rend="inline">-v</code>, para excluir elementos ao usar o comando <code rend="inline">grep</code>. Digite <code rend="inline">grep -iv revolution 2014*_JA_a*.tsv &gt; 2014_JA_iv_revolution.csv</code> e pressione Enter. Essa <emph>query</emph> busca nos ficheiros definidos (tr&#234;s no total) e exporta todas as linhas que n&#227;o cont&#234;m <code rend="inline">revolution</code> ou <code rend="inline">Revolution</code> ao <code rend="inline">c:\proghist\data\derived_data\2014_JA_iv_revolution.csv</code>.</p>
<p>Note que transformou os dados de um formato para outro - de .tsv para .csv. Frequentemente h&#225; uma perda de estrutura dos dados ao realizar essas transforma&#231;&#245;es. Para observar isso, execute <code rend="inline">grep -iv revolution 2014*_JA_a*.tsv &gt; 2014_JA_iv_revolution.tsv</code> e abra os ficheiros .csv e .tsv no Libre Office Calc, Microsoft Excel, ou outro programa similar. Observe as diferen&#231;as no delineamento da coluna entre os dois ficheiros. </p>
<p><emph>Resumo</emph></p>
<p>Agora no shell do Unix voc&#234; pode:</p>
<list type="unordered">
<item>usar o comando <code rend="inline">wc</code> com as flags <code rend="inline">-w</code> e <code rend="inline">-l</code> para contar as palavras e linhas de um ficheiro ou uma s&#233;rie de ficheiros.</item>
<item>usar o redirecionador ou estrutura <code rend="inline">subdiret&#243;rio/nome-do-ficheiro</code> para armazenar os resultados em um subdiret&#243;rio.</item>
<item>usar o comando <code rend="inline">grep</code> para buscar por inst&#226;ncias de uma <emph>string</emph>.</item>
<item>usar <code rend="inline">grep</code> com a flag <code rend="inline">-c</code> para contar inst&#226;ncias de uma <emph>string</emph>, a flag <code rend="inline">-i</code> para retornar buscas por <emph>strings</emph> ignorando diferen&#231;as entre mai&#250;sculas e min&#250;sculas, e a flag <code rend="inline">-v</code> para excluir uma <emph>string</emph> dos resultados.</item>
<item>combinar esses comandos e flags para construir <emph>queries</emph> complexas de uma forma que sugere o potencial de uso do shell do Unix para contabilizar e minerar os seus dados de investiga&#231;&#227;o e projetos de investiga&#231;&#227;o.</item>
</list>
<h4>Conclus&#227;o</h4>
<p>Nessa li&#231;&#227;o aprendeu a executar contagens b&#225;sicas em ficheiros, realizar <emph>queries</emph> em dados de investiga&#231;&#227;o em busca de <emph>strings</emph> comuns e armazenar resultados e dados derivados. Ainda que essa li&#231;&#227;o seja restrita ao uso do shell do Unix para contabilizar e minerar dados tabulares, os processos podem facilmente ser estendidos a textos livres. Para isso, recomendamos dois guias escritos por William Turkel:</p>
<list type="unordered">
<item>William Turkel, '<ref target="http://williamjturkel.net/2013/06/15/basic-text-analysis-with-command-line-tools-in-linux/">Basic Text Analysis with Command Line Tools in Linux</ref>' (15 de junho de 2013)</item>
<item>William Turkel, '<ref target="http://williamjturkel.net/2013/06/20/pattern-matching-and-permuted-term-indexing-with-command-line-tools-in-linux/">Pattern Matching and Permuted Term Indexing with Command Line Tools in Linux</ref>' (20 de junho de 2013)</item>
</list>
<p>Como essas recomenda&#231;&#245;es sugerem, a presente li&#231;&#227;o apenas aborda superficialmente o que o ambiente do shell do Unix &#233; capaz de fazer. Espera-se, no entanto, que tenha oferecido uma prova suficiente para estimular uma investiga&#231;&#227;o mais aprofundada e uma pr&#225;tica produtiva.</p>
<p>Para muitos historiadores, o potencial total dessas ferramentas deve surgir somente ao incorporar essas habilidades em um projeto de investiga&#231;&#227;o real. Uma vez que a sua investiga&#231;&#227;o cresce e, com isso, os seus dados de investiga&#231;&#227;o, ser capaz de manipular, contabilizar e minerar milhares de ficheiros ser&#225; extremamente &#250;til. Caso opte por trabalhar nesta li&#231;&#227;o e investigar o shell do Unix mais a fundo, descobrir&#225; que mesmo uma grande cole&#231;&#227;o de ficheiros que n&#227;o cont&#234;m quaisquer elementos de dados alfanum&#233;ricos, como ficheiros de imagem, podem ser facilmente classificados, selecionados e consultados em um shell do Unix.</p>
</div></div>
    </body>
  </text>
</TEI>
